{
  "student_name": "Isaac Buche",
  "org_defined_id": "036112318",
  "username": "buchei",
  "email": "",
  "transcript": "Hello. This is Isaac Buche, and this is my session 10 assignment. So starting off by like defining our parameters here, so we'll go over the site. Assignment, overview, evaluate. Starbucks is proposed flag flagship grocery that requires a 12 million upfront outlay, and it's expected to operate for 10 years. We're going to use the firm's 8.5% wa CC as a hurdle rate to determine whether the project creates value and to recommend and accept such reject the decision supported by the driver documentation. So going into some project parameters here, the initial investment is going to be $12 million and it'll depreciate in a straight just do a straight line depreciation method over 10 years. Our working capital is going to be 500,000 and deployed at launch and recovered in year 10. Our revenues is 8 million in year 111, and two and 11 million in years two through five, and then 9 million in years six through 10, our operating costs, our cost of goods sold, will be 40% of revenue, labor, two and a half million, rent and utilities at 800,000 point 8 million. Marketing will be at 300,000 so point 3 million or in year one, and then point 1 million thereafter, taxes, we're gonna be in the 25% range, terminal value of 3 million at the end of year 10. So jumping in, that's just our little that's defining what we were doing here. So jumping into like our calculations here, because as we're going into our assignment, I we want to build a zero to 10, your incremental cash flow schedule that includes revenue, operating cost, depreciation, tax shields taxes, working capital changes and terminal value. And we want to calculate our NPV, our IR and the discounted payback period, simple payback period and profitability index using the Starbucks WACC. Then we're going to run a sensitivity analysis using these numbers there, and then we're going to end up providing my recommendation at the end of this video. So jumping into our initial code here, starting off, we can run this code. Oops, we can run the code here, so then that obviously spits out our our requirements, so we jump into our MPV, our base calculation response, our NPV is 2,000,400 or 2,000,006 90 and 690,800.79 our IRR here is 12.8 point 12.84% Our payback period of 5.28 years, then our profitability index. So then this shows our cash flow schedule. So it starts as we're down here in the negative 12 million within our investment, and then our increments as we go up based upon our our profit from those years. So in our working capital, we will start the year off in the negatives in year, in year zero, and then positive, and we get back to the positives with our working capital by the year by the year 10. So does that logic makes sense there. And then we are and then, so then our IRR is greater than our 8.5% hurdle rate, which is good. So then we can pay back quickly. And then jumping into the second part of this, which was run the sensitivity analysis I ended up adding to this code here. So this is a new tab here, but in Scenario A when our revenue drops, we're looking at an NPV of negative three point around negative three, negative $3.084 million in loss, and then in Scenario B, when our WACC is six and a half percent, we we actually jumped to 4.23 6 million. And then our wa CC at 10.5% we at 1.35 so if revenue drops 20% our NPV turns negative, and the IRR drops to 5.7% so this indicates the project is highly sensitive to major performance, and then our WACC risk, which was Scenario B and C, if WACC rises 10 and a half percent. The NPV remains still positive at 1.1 so this project is very it's very fragile regarding volume of sales. So it's just interesting on how that can, like drastically change or impact the the overall sales through the project. But going into my final recommendation, my final recommendation is to accept the project. The flagship grocery generates an NPV of 2.4 3 million in the IRR of 12, of around 12% there. So I can come I can comfortably exceeding that 8.5% hurdle rate, so the profit, the profitability index is positive, indicating efficient capital usage. So just overall, the project should be successful with the numbers that we originally are at the it is could be optimally risky with the 20% drop in revenue. However, as a flagship project, the strategic value extends beyond immediate cash flows. It serves as a marketing vehicle for the broader Starbucks brand. So proceed with the investment, but I would implement a strict cost control with the initial investment of 12 million to build a little bit more safety into it for you. But that's it. And thank you for listening, and goodbye. Thank You.",
  "video_url": "https://youtu.be/tN_Xfn5v8Rk"
}