{
  "student_name": "Daran Ebadi",
  "org_defined_id": "036201910",
  "username": "debadi",
  "video_url": "https://youtu.be/KaWdy5GkIOg",
  "transcript": "Um so today I'm going to be valuing Panera Bread for a potential um KKR uh take private using driver on this using driver which is going to be on the screen here and I'm going to build a multi-senario DCF. I'm going to run trading comps and president transactions and then I'm going to compare financial buyer discipline to strategic buyer synergies and then triangulate everything into kind of a bid range and a walkway price. And so first in this define section over here um the goal is\n\nan executive ready bid recommendation. So outputs are enterprise value an EV to equity bridge a final bid range and a walkway price. So the buyer lens is KKR as a financial sponsor versus strategic biders who you know may pay more with different synergies here. So in this assumptions and evidence log here um so for the discover section I'm going to log the given facts first you know 6 billion revenue growing 8% 900 million earnings before interest taxes depreciation and amortization at a 15%\n\nmargin uh 2100 stores uh digital at 50% um weighted average cost capital around 9%. Um the industry P and E is going to be P over E is going to be 22X and precedent earnings for interest tax depreciation amortization multiplies 12 to 15X and I'm also going to document a deal context. Management wants 10% rollover and strategic uh strategics are circling. So then I'm going to parameterize the main drivers so they're easier to change live. You know, the taxes, the uh the depreciation and\n\nmonetization, capex, working capital, and the growth levers, um 500 new stores, digital mix to 70%, um dinner/catering, and early international expansion. And so down in represent over here um I'm going to structure three scenarios downside base and upside and each is going to be changing growth margin expansion weighted average cost capital and terminal assumptions. So the operating model projects revenue earnings for interest taxes uh depreciation and amortization and unlevered free cash flow for uh 5 years\n\nand digital mix ramps up to 70% and can can contribute to growth. So, EVITA earnings for interest, taxes, depreciation, amortization, margins, ramp by scenario and then FCF is NOAT plus DNA minus capex and changes in the working capital and that's going to be our represent section. Um, and so for implement this is going to be our scenario run loop over here in DCF summary. So, I'm just going to run the 5-year projections and value Panera using two terminal methods, Gordon growth and an exit, earnings before\n\ninterest, taxes, depreciation, amortization multiple, and I'm going to put EV under both methods across all scenarios. um plus the equity bridge and I'm also going to show the base case projection table as a checkpoint just so you guys can see uh revenue um earnings before interest taxes depreciation amortization FCF and so the digital mix and um the digital mix trend uh driving the the valuation and so here in validate so here in validate these are going to be I'm going to com I'm going to have\n\nsome sanity checks and cross method triangul triangulation So I'm going to compare DCF results to uh market methods. And so for multiples I'm going to use the provided 12 to 15 times uh IBIDA uh band to generate an EV EV range. And I also compute an equity reference using the industry 22XP over on net income. And then I'm going to synthesize everything in a football field chart so you can see where methods overlap. Um and then finally I'm going to run sensitivity uh on weighted average cost capital and terminal growth\n\nbecause those are typically the biggest valuation swing factors. And I'm going to surface the EV graded um visually just so uh it'll be quick for an executive review. And then down over here in evolve um our build our bid strategy our bid our recommend bid function here our synergy block and our rollover output here. And so in Evolve we're just going to translate the valuation into a bid strategy. So, I'm gonna I anchor on the base DCF midpoint across terminal methods and blend it with the market\n\nmidpoint. And then I'm going to apply a transparent um you know control premium range to produce a bid range and a walkway EV. And essentially that walkway is capped um by an intrinsic ceiling from the upside DCF. So we don't bid beyond what we can justify. And so financial versus strategic, that's kind of what we're thinking here. SKR we don't pay for synergies we can't control. So for strategic biders the model can add synergy value as a present value of capture earnings before\n\ninterest taxes depreciation and amortization synergies with the ramp in an optional risk haircut. So strategic synergies are real. They can rationally outbid otherwise you just be overpaying. Um and so finally I'm just going to quantify the 10% management rollover and I'm just going to show how it reduces cash required and going to inline incentives post close. Um, and so these are our bid numbers on the screen here. So our opening bid sits inside the blended range, but we're going to hold\n\nthe walkway price firm because valuation is uh very sensitive to weighted average or weighted average weighted average cost capital and terminal assumptions and because you know growth requires reinvestment um you know capex and working capital. If strategics push above our walk away, we're going to have to step back unless we can underwrite you know additional sponsored value creation um with with very high confidence. And so in reflect over here um the biggest drivers are weighted average cost capital and terminal\n\nassumptions and then that is going to be followed by capex intensity and margin expansion. So if comps and DCF diverge the fix is just going to be revisiting those drivers. And so with more data I'd separate um same story sales from unit growth and tapex directly to store openings rather than um just finding a flat percent of revenue. So basically to conclude here, the football field triangulation supports discipline KKR bid range with a clear walkway price. Um and strategics may pay more only if\n\nsynergies outweigh integration risk which um this model is going to quantify transparently. Thank you."
}