{
  "student_name": "Alex Kurtz",
  "org_defined_id": "036915352",
  "username": "ajkurtz",
  "email": "",
  "transcript": "Hi, my name is Alex Kurtz, and this is my section eight assignment. Okay, so kind of what we're diving in here today is we're asking, did the GameStop of 2020 to 2021, did that short squeeze show that markets are inefficient, or can the chaos still be explained inside an EMH-style framework? So, that's a lot right there. We're going to break it down step -by-step using driver. So we're defining and we're discovering our information. So we've got to verify our key facts. So our price level in the start of this was August 2020. GameStop closed between $1.20 and $1.80 during August of 2020, ending the month around $1.67 per share, not four cents. So it was stated that it kind of maybe ended around four cents in August 2020. It's false. It's off by 40%. so short squeeze on january 28th of 2021 gamestop hit an inter inter trading high 483 dollars so that is about 140 cent more than no so during the spike it was considered a meme trade like a coin like redditors were talking about it um so robin hood and e-trade and other brokers restricted buying at GameStop on January 25th of 2021, GameStop traded about 175 million shares versus the previous 30-day average of about $29 to $30 million a share. So breaking the timeline, August 2020, GameStop is distressed, sub $2 a share, but not collapsing at $0 .04 a share. But September 2020, this is the first big turnaround in 2021. There's call options, meme coin. That's when it squeezes to about $500. And then after that, it kind of collapses back down to like about $2 a share. So it's eating the GameStop's historical date for the assignment. GameStop mentions trading at $0.04 in August 2020. It really closed about $1.67 a share. I'd flag that in case you want to tweak the example. So we're using data. All right, so moving to R. So now that we have our facts, our questions clear, we're going to play out what we're doing. So using our GameStop prices, we're computing our daily simple returns, our abnormal returns, and our cumulative abnormal returns around the squeeze. So we're going to use a pre-event baseline and then our high-volume trading in mid-January of 2021. So EMH forms, there are three types of EMH forms. Weak form, so that's past prices, looking at past prices to determine current prices. Semi-strong prices reflect all publicly available information. So like a Wall Street Journal article to influence prices, stuff like that. Strong form is all information like public and private. This is when you kind of start getting into insider trading territories. It's like if somebody's on the House Service Committee and they're going to invest in GameStop because they think GameStop is going to prop up the U.S. economy, and a senator buys shares of that before, that's strong form. That's kind of insider trading. So we're going to January 28th of 2021. That was peak. That is our core event data. So that's kind of our lens we're looking at this through. That's our event window. um so now we're looking at our behavioral finance our biases are hurting our fear of missing like a foam out our overconfidence the gambler's fallacy stuff like that um that shows us you know short sale constraints margin trading stuff like that and then our rational investor probability so stylized strategies so like some brokers have strategy where hey we're buying it on august 15th we're selling it february 30th that's a rash that's a stylized strategy and then uh our slippage halt restrictions our realized returns risk stuff like that so now we're going into um our implement data we have a lot of imports and stuff like that our this is just our ticker data our start date our end date stuff like that um this is just downloading all of our price and information data so here's our fact check so it's shows august 2020 and prints uh prints the daily open and high lows close for gamestop it summarizes our minimum close our maximum close our last close which was august 31st so this is just august 2020 to august 2020 um we have gamestops around one to two dollars not four cents near bankruptcy levels is kind of fair but it's not just pennies it's not super highly distressed as i mentioned earlier so moving on to section four we show august 2020 to uh we show its distress september 2020 is kind of when the turnaround narrative starts and then january 2021 that is our melting up to 483 dollars a share so um we're looking for our low flat flat prices pre so August 2020 September we're looking for gradual grind up if we see we have some graphs here that show our gradual grind ups and then just spikes as we see so August 2020 spikes and then so yeah our low flat our slight turnaround and then spikes stuff like that so now we look at sections 5 and 6 of our code and we're computing our GameStop and market value returns using using average risk or abnormal return so we look at our daily abnormal returns and we use car to see cumulative surprise relative to the market if our abnormal returns are huge and statistically significant we've got strong abnormal performance which is not explained by the broad market which is exactly what our emh cares about so take that consideration um then in section seven we have our volume analysis so it just shows us um that in like our baseline from october 2020 to january 2021 um like our volume over our baseline average volume so we can see our increase in shares being traded and then in section eight we have our rational investor scenarios so um if scenario one we have like our like set schedule buy august 31st sell january 2027 that's insane like a multi -hundred percent return that's for our structured our cyclical um investment strategy and then but if we're just buying like market hype january 28th south february 5th huge downtrend some investors did earn massive profits but ex-ante strategy was extremely risky and subject to halts which matters for emh so moving into our uh v of our driver um we have that our implementation and our numbers are legit work we cross-check with external sources we have our graphs um as we see down here so this is our closing prices in 2020 our closing prices starting the turn around and then this shows a full view from in January so as we see January 18th absolutely spiked so so all the way from January first sorry May to January. Our statistical structure, we say that abnormal return distribution outside of the event window should mostly look noisy around zero. Within the event window, abnormal returns are large, and our t-test p-value should be very small for extreme returns. Now we evaluate which forms of our image look violated. So our weak form might argue that our extreme short interest and low prices create a predictable short squeeze candidate, but many other highly short stocks never squeeze timing exact squeeze was hard so weak form is not clearly shown um we can't show that reliably in semi-strong form so we have our public info like our wall street boards our short interest our co-and-stake um so semi-strong looks challenged because the extreme ars and car around squeeze tell you prices weren't just updating new cash flow, they were overshooting, so prices did not reflect public info in a rational, fundamental way. They showed it in a rational way, like if you're considering everything with the Reddit meme stock and stuff like that. And strong form is not plausible here. They did not have writer positioning, like there's no insider information to buy this. So GameStop, so seeing if rational investors could consistently profit GameStop, so's a big ex-profit opportunity, but no clean replicable low -risk strategy that a rational investor could use to systematically beat the market in regards to GameStop. So now we're reflecting. We have our behavioral finance expectations, like our hurting and social proof, like WallStreetBets, TikTok, and Twitter. We have foam-out overconfidence. People saw others posting huge gains they thought could only go up, ignored the sheer risk of the trade and then there was a narrative like stink it to wall street david versus coliath people just did it to be part of the movement not due to rational investing so emh doesn't fully hold in a clean frictionless way but once we add real world frictions like our reddit and our wall street bets and behavioral stuff you can still describe that the episode inside a broader efficient but fragile market framework so looking this what we could do is um we could talk about in depth which more each emh frameworks are violated and why we could turn our driver analysis into an like a pilot like this like an essay and like talk about the dangers and just talk about what a trade like that looks like like a meme spike or just a sheer spike all right that was my secondary assignment thank you",
  "video_url": "https://youtu.be/UO2m_rPVpnk"
}