{
  "student_name": "Alex Lenig",
  "org_defined_id": "035836182",
  "username": "alenig",
  "email": "",
  "transcript": "Hi. All right. So, today we're looking at Starbucks. Um, they're proposing a new roaster that requires 12 million upfront and is expected to operate for 10 years. So, uh, we're looking at whether this is going to be a good a project that adds value to our brand and whether we should accept or accept or reject this uh, decision for this roaster. So we're given that we have a 8.5 whack uh which means we need 8.5 return uh% return to get uh positive value off of that based on the company. Um and then we have some project parameters. So the initial investment of 12 billion or 12 million not billion. Um which include just building equipment training all those expenses that are listed there. Um we have working capital of 500,000 that's depo deployed at launch and recovered in 10 years revenues of 8 million in the first year 11 million years 2 through 5 and 9 million years 6 through 10. Then we have operating costs cost of goods sold 40% labor rent utilities all those there you can read. Um and then taxes 25% corporate rate and then terminal value of 3 million at the end of the year. So what are we looking for? um using the driver framework, we'll look at the first D part uh and look at what are we looking for. So the key things we're going to look for here are uh these these five things. Net present value, internal rate of return, discount payback period, simple payback period, and profitability index. So what are these? Uh net present value is basically the present value of all your CA cash flows in the future. So, it's bringing your expenses, your revenue, everything back to the current time or at least what's expected and seeing what it looks like. So, when you're looking at net present value uh for a certain project, you're looking at it on a zero scale. So, you want to know if it's negative, that means it's not uh based on your projections, it's not profitable. That means you're going to lose money. Uh your expenses are going to be higher than your profits or higher expenses are higher than your revenue. Um then if it's positive that that's good. That means your revenue is higher than your expenses. So when you that's a big thing for looking on investing. You want your net present value to hopefully be positive so that you're making money. Um internal rate of return. This is the um the interest rate you need to be able to get your net present value to zero. So basically, if you want uh to make sure your uh company at least makes profit or makes your revenue and expenses are all equal, uh that's the rate of return you need for that to happen. Uh discount payback period uh is basically the I guess it's easier to start with simple payback period. uh simple per payback period is the time needed to get that revenue back or meet that net present value or like that base of getting your pay uh all your money back um just based on like the cash flows in the year they're in. And then discount payback period is the same thing except it accounts for the time value of money. Um so bringing those payments back to the time we're at now. uh which ends up making usually the discount payback period a bit longer than the simple payback period because it accounts for money uh growing. Uh and then finally profitability index. Um this is just a financial metric that assesses the attractiveness of a project. Uh it use does this by comparing the present values uh of your cash flows or the future cash flows to your uh initial investment that you're making. Um, and for this you're looking for it's on a scale of one. So higher than one that means uh it's going to it by your projections it should be pretty profitable. Uh lower than one not so good. Uh it's not as profitable. So let's get into the R which is calculating net present value and IRR. Um so how do we how do we actually calculate these? Um, now I didn't do all the calculations myself because that would take a long time, but we can go through the formulas for them. So, net present value is basically taking the sum of all your cash flows. Um, so you have your cash flows here and then this V is going to be your interest rate. So, V is a variable for 1 over 1 plus I to the N. Um, so that basically is what brings your cash flow to the present value uh to where you're at in this time. So you sum all those up, bring them back to time, uh, the time you're at now, and then subtract it by your initial investment, and that's what gets you whether uh, you have a what your net present value is. So then IRR, uh, internal rate of return is basically it's the net present value formula except you're setting this net present value equal to zero and then calculating I. So the I is included in the V here. Um, so it's a long long formula if you're actually trying to calculate it like by hand, but there's a lot of calculators out there that can get it for you. But you're basically looking for the uh interest rate you need to at least break even or get uh net present value of zero. Um, your uh discount pay payback period. Can think of the D for a second. Um, this is the formula for it. It's a little complicated. Um the Y is basically that first year that um your cash flow is uh the accumulated cash flow is negative. Um or last year wait yeah how do I say that? Yeah last year your accumulated cash flow is negative. Um so when accumulation goes from negative to finally hitting positive uh when you accumulate your cash flows uh the ABSN is just a formula. Um this is the initial investment that still needs to be recovered by the start of the next period uh based on that Y and then P is the uh discount you have following immediately immediately following your Y. So just that single one not the accumulated one that Y is based on. Uh simple is a lot more simple as it sounds like. Uh it's just your initial initial investment divided by the average of your cash flows. Um so again it's it's a lot easier to calculate but the uh discount one gives you a lot better uh lot more realistic uh time frame. Uh and then profitability index is just your present value divided by the uh initial investment. So that's the present value of uh your revenues you're making. You bring it back to the time you're at and then divide it by your initial investment. So those are the basic calculations we're looking at. Um let's get into the code. Um so the code here we have we go uh we have here gives us a nice easy spot to lay out our parameters. So this is everything we were given in the problem. Uh initial investment of 12 million lifespan of 10 tax rate of 0.25 all all that good stuff. Um, so there's an easy way to input all that. Then it goes through and does a bunch of different calculations to get the values we need uh for all those calculations we were looking at earlier. And then uh gets a straight line deprecation. Uh all these things we'll need for our uh cash flow uh what is it called? uh like our timeline of our cash flows and then capital budgeting metrics, simple payback period, discount payback period. So you can see here when I was talking about earlier uh simple payback periods a little easier to look at and calculate uh I mean obviously looks a little complicated with Python but uh but your discounted one is going to be a lot more involved in the uh values you need. um probability index. So that gets all those values. Uh and then we'll also be looking at uh for this analysis uh some different sensitivity scenarios. Uh so we got our base one which is what we're looking at right now. Uh but then we'll look at when revenue is reduced by 20% uh when our whack is plus or two or minus 2%. Um and just kind of compare what happens when those things change. Uh then those to present the results. Vplot. Okay, so we get through all those calculations and then this is our output. So what does this all mean? Um first off, it gives us this uh time frame of our just general cash flows. Um this is for the base scenario we're looking at. So what we were looking at in general anyway. Uh so you can see here we have a row uh in millions for our net cash flows and then it discounts them. So our discounts are going to be a little less than our our less less I guess I should say just less than our uh cash flows. Um again these are in millions. So you can see the first year it's good to note out that uh we have negative -2.5 million. Um and usually with every sort of cash flow your first year is going to be a big uh investment. It's going to be negative because you have to invest money into the project. Uh so that's what our 12 million of our investment and then our 500,000 of uh working capital. Yeah. So we have that and then we finally start to give get our revenues. Um and we'll get this one in a second, but where how it's broken down um but it maps those out and kind of just goes through year by year. Uh and then also what's helpful here is our accumulated discount uh cash flows. So just basically accumulating everything, taking our first rows and then adding back our other one and then just it keeps going. So you can see here uh like the first year we're down 12.5 million but then once we start getting some revenue in we're down only 11.35 39 million and then slowly starts to increase and then finally in that year eight well after that year eight we start to see some profit. Um, that doesn't mean we've completely like gotten everything back, but that means we're finally getting money back. I guess that's a little counterintuitive to say, but um, so this, excuse me, how does it happen every time we get police outside my house? Anyway, um, what was I saying? Oh, yeah. So this is our breakdown basically of these cash flows. Um so you can see here we have our same 10-year time frame. Uh we have our revenue, our operation costs, um deprec deprecation tax shield, uh tax, uh can't remember what that is. Let me look here. Or capital changes. Yeah. uh capital changes, our terminal uh cash flows, and then our net cash flows. So, so these get listed out here, and you can see uh based on how everything adds up, that's what we end up getting up here. Um I believe, yeah, it's this row. So, this last row is what we have here. Um and everything just gets added up across the line, and that's what gets us our actual cash flows. So, you can see here cap. All right. I guess I should have known that was working capital, but we have a working capital of negative five uh or negative.5 and then I guess it doesn't list the initial investment, but then our initial investment of -12 million or of 12 million. Uh so that's our first cash flow. Then when we start to make some revenue, we get our revenue in there. Um it adds in our operation costs, then our deprecation tax shield, uh then anything else. So, so that's how our net our cash flows are actually calculated um by taking up all our revenues, our expenses, all those things and putting them into one one single spot. So, let me take a sip real quick. Okay, so what are results here? Um we'll get just the base one for a second uh for for or for now, I should say. So we have our given whack of 8.5%. So that's basically uh what we're trying to make or the interest we're trying to make. We need a 8.5 return. Um and we can see we get an IRRa of 13.25%. So that's really good. That means where to get a uh positive net value uh we need 13.25% but our company's only saying we need 8.5%. So based on our IR, it looks like uh we should be doing pretty good. Uh and it should be a positive project. Our uh uh shoot why can I not think of the name. Um discounted payback, sorry about that. Uh discounted payback period is 22.69. So this would be an issue uh or could possibly be an issue. That's 12 years longer than almost 13 years longer than our um what we're the years we're uh projected to um be going. What is it actually called? Operate. I don't know why I can think of that word. Uh so it goes longer than the years we're actually expect to operate uh this uh project. So, there may be an issue with actually being able to get all the money we need back, but um it's not impossible. It's just something to think of. We're not getting all that money in the time frame we're actually looking at in that 10 years at least. Uh simple payback period, as I said earlier, uh it's always going to or typically, I should say, um I guess not typically, but it's going to be the same throughout. Um but it's shorter. uh but it's also still above uh our 10 years. So even based on that, it's going to take longer than that 10 years to get our money. And then our profitability index is 1.24. As we said earlier, uh anything above a one is usually pretty good. Uh that means we're actually making money or we're actually getting a good profit out of it. And then our net present value is 3.02 million. So that means in total we're expected to make 3.02 million from this project. So based on this uh info for our base case, it looks pretty positive uh this project. Um like I said, we have a very good IR IR um based on our whack. Uh we're making a lot more back from it. And then our uh we have a positive net present value which is really good. that means we should be making money off of it. The only issue would be um with that getting that money back, it could take some time. Um and you know with that time there's always risks involved. You never know if something could happen that's going to then end up decreasing your IR net present value. So there's always risks and rewards, but based on what we're looking at here, it looks like it would be a good uh good thing to invest in. But we'll talk more about the actual uh result or what we'd say in the end. Um so um I guess I guess we can mention it now. So basically our uh decision would be to tell our uh officials would be to accept this uh project because like we said it makes it looks like it's going to make good money. Um has a way higher IR than our whack is. So the only risks will be getting that money back with those years. But uh we can tell them that's that's the risk involved. But based on what we've calculated, it looks like a pretty profitable project. Um so how does this compare to other scenarios? So like I said, we did some sensitivity analysis. Uh we looked at revenue minus 20% and then changes in whack. So when we look at these uh I didn't make a or put in a thing for it to calculate the actual cash flows but should be calculated as well. Um okay yeah uh so for when we decrease our revenue 20%. Uh you can see our whack doesn't change but our IR changes drastically has a 3.19%. So, that means uh that we're it's going to take a lot to get that money back. Um and way less than what our whack is. Uh our um am I ever going to remember the name? Discounted payback value. Um I don't know why it didn't give us a value for that, but based on our simple payback period, we can kind of tell it's still going to be the same as before when we're looking at more years to get that money back. Uh but it is worth noting that it is less than our base case. Um this one has a profitability index of 75%. So this is actually below one. So that means it's going to be probably a lot less uh attractive of a project and then net present value of negative 3.16 million. So I'm sure you can tell that is not ideal. That means we'd be losing money uh on a pro on the project. So, a good thing to note with this um is just telling us how important revenue is. That tells us even just a I mean even just a drop in 20% 20% uh is a lot but um that drastically decreases our results uh or the profitability of the project. So uh changes in revenue as you said what we have is just pro projections but that tells us how sensitive projects are to their revenue. Um so whether that's that's good to note whether you're looking at um like projections for your revenue. it might be a good idea to go on the more conservative side because as we saw if we're if we're way overcalulating our revenue and then it ends up being like negative 20%. We we're going to probably lose a lot of money. So it's a good thing to note with your projections what your revenue is because it can make a big change in your results. Um so looking at the other two uh when we increase our whack and or decrease our whack by 2% uh we'll look at increasing it first. Uh that would give us a whack at 10.5%. Uh it doesn't change our IR. Our IR is still way higher. Uh which is a really good sign. Um our payback period actually decreases by quite a bit. Our our uh uh discounted payback period uh which is a lot better. That gives us less time to worry about uh how much time we're getting our money back. But it is still above that 10 years. Our simple payback period stays the same because like I said, it's calculated a little differently. It doesn't actually involve our whack. Uh our profitability index here is 1.13%. So still higher than 1% but it does drop off a little bit more than our base case. And then we're looking at our net present value of 1.63 million which is a decrease um in from our 3.02. So based on this, uh, if we increased our whack by 10.5%. We'd say we'd be thinking we're probably getting less money. Um, so it might not be as worth it. But if time uh the time frame we're looking at is a big issue, might be worth it to uh because of that decrease in our payback period. So again, something to look at. Um, but overall a slight change in it doesn't really doesn't make it unprofitable. Um, or doesn't really change the fact that we would probably want to still be looking to accept it because we're still we still are making money off of it. Um, and then looking at the case for negative -2, uh, which changes our whack to 6.5%. We get an IR of still 13.25%. So it's way higher, even more higher than our whack was in our base case. Our payback period is 18.77. So, a little drop off from our top one, which is good. Uh, simple payback period stays the same. And a much higher profitability index um with a lot higher of a or about yeah, a lot I guess a lot higher. 1.5 million is quite a bit uh but 4.65 in net present value. So, that tells us if we decrease our whack um then we actually can probably expect to make more money. So looking at those since we looked at those results uh even this tells us our conclusion is to probably accept this project based on four kind core financials. Um we look at our E. So what are some of the risks involved with our decision? So we said yes uh we said told the company go ahead with this. We think it's going to be uh something good or we think it's going to be good. Um but again what are their risks with that? uh the one and one I guess we really talked about already is uh revenue volatility uh we saw that with our when we changed it 2% or 20% uh decreased our revenue. So like we said we don't know uh already what our revenue is going to be. So, if it's a lot lower than what we're actually projecting, it's going to be an issue where uh obviously our numbers won't be right, but it could seriously hurt uh what we end up making. Um I guess the opposite is also true. If it increases, it's much higher than we got. Uh it's that's really good, but that's a big risk uh to think about and really critical in your decision- making. Um there's also some things with like uh execution risks. Um it can that's like just things like destru destruction delays in construction uh cost overruns things like that. Uh basically just extra cost that can end up decreasing your net present value. Um that's always a concern and is pretty typical with projects. So if you're not building it into your model as like we didn't uh build it into here, we could expect uh those net present values to probably be lower than what they're actually projected. Um, and then there's things like location risks, um, where our plants are built, uh, where we're selling, um, if it's just one one location, then we only have a certain amount of customers that we're probably going to be, uh, using or that's going to be coming to our buying our product or maybe only a specific amount of workers who are going to be able to work at our plant or something like that. Uh, and those that can also cause issues. Um obviously with certain things like your uh costs and costs and things like that. Um so what are some I guess I should say what are some uh what are they called mitigation risk or ways to mitigate this risk? What are how can we make it better? So revenue um it'd be good to very early in the project if we do say accept and then we run the project make sure we're monitor monitoring monitoring that revenue early uh we want to be looking at that data and saying making sure it's sticking as close to as what we we're projecting and if it's not why is it not um we need to make sure uh with that we're making sure our clients or clients are I guess clients or customers are happy. Um, make sure they're enjoying our product and make sure we're marketing it so that people know it's out there. Uh, and that is always some way to just help boost your revenue. Um, make sure that people are actually buying buying your product. Um, with execution risk, uh, it's basically just trying to plan as best as you can for the project. Um, like I said, most likely you're going to have issues with it, but making sure you have plans in place. And then uh trying to make sure all your those kind of costs that are possible are in like a specific range, maybe like a 10 to 15% range. Um just helps you narrow down what you're actually uh narrow down this decision making. Uh and then location, uh basically just make sure you're in a good location. That's kind of the best you can do. So um finally we'll look at use or I guess we'll discuss the usefulness of this uh kind of model we're looking at. Um as always it is a pretty good it's a pretty good way to indicate whether a project's profitable or not. Um when you're looking at future cash flows uh you want to obviously project them and then bring them back to where you're at. So it's a good thing to do but as always there's risk with it. Um, you can't predict the future. So, you never know if something's going to change. Uh, you never know. Yeah, things are going to change. Um, customers may change, your clients may change, your investments may change. Um, there's a lot that can happen. But uh when you have things that are given um or with what you're given, you can try to make the best educated decision you can, which is all you can do and then decide whether to object accept or reject a decision um or a project. So yeah, so in this case, uh I recommend Starbucks uh does accept this project because gives a good IR and gives good net present value. So, thank you for listening.",
  "video_url": "https://youtu.be/PbQNK0W6B5E?si=1n9RxqjmkI-6ZEP6"
}