{
  "student_name": "Mya Dodson",
  "org_defined_id": "034223308",
  "username": "dodson22",
  "email": "",
  "transcript": "Alright, good afternoon guys. So, my analysis determines the appropriate discount rate, the weighted average cost of capital, um, for Netflix as it considers a five billion dollar content investment for this assignment, and I'm going to move sequentially through the driver framework, um, while integrating financial theory with the calculations. So, obviously first we have define and discover. The core problem is to calculate Netflix's WACC, what I just said, the weighted average cost of capital, and assess the impact of the three dollar, the three billion dollar debt, and compare its cost of capital to peers like Disney. So I have the parameters and data right here in my Python code. so the provided data shown here in our parameters establishes the foundation so we have a 200 billion dollar market capitalization a relatively high equity beta of 1.3 which reflects high systematic risk a stable pre -tax cost of debt of 5.8 percent for the BBB plus rating, and then we have the required market inputs, a 4.5% risk-free rate, and a 5 .5% market risk premium, and then, which we can see right here, and then we have our financial concepts for this are going to be cost of equity via CAPM, and the after-tax cost of debt both feeding into the, um, I'm just going to call it WAC formula. So now we are going to validate our assumptions and core financial concepts. So we're going to scroll down to this function. The WAC is what I'm going to call it function. So we have market versus book values. So we can use 13 billion, which is the market value for debt as the WAC must reflect the current market costs. And then the tax shield effect. So we have the 21% corporate tax rate, which is critical. It creates the tax shield, ensuring our after-tax cost of debt is correctly lower than the pre-tax cost. And then the final whack is the minimum return that Netflix must earn an average risk project to satisfy both debt and equity holders. It's basically whack as a hurdle rate. And then our current capital structure is highly equity-based, 93.9% equity and only 6.1% debt. So this hints at a high cost of capital. And then we move to the implementation stage. So to calculate current WAC, first we have the cost of equity using CAPM, so we do the 4.5% plus 1.3 times the 5.5%, which gets us 11.65%. You can see right here, and then this is the required return for Netflix shareholders, and then we have the after-tax cost of debt which is the 4 .58% which is right here and weighting these two costs gives us the current Netflix whack of 11.21% or 0.22 roughly So, Netflix, after their $3 billion debt issuance, we can talk about right here, so issuing $3 billion in new debt increases our debt weight to 7 .4%, which is right here. We calculate the new equity risk using the beta method. So the small increase in financial leverage does push our equity to 1.314 and our cost of equity to 11.73%, which we can see right here and right here. and then the resulting whack after that is 11.2% which is right here. So the net effect is minimal. The benefit of slightly cheaper debt is almost entirely offset by the increased risk of equity. So the 11.21% is only for average risk projects. For the $5 billion content investment, we must use project-specific rates. So, U.S. content, which is lower risk, requires a rate below 11.21%, for example, like 10.21%, and then the international content is higher risk, so that requires a rate above 11.21%, so for example, 13.21%, and it's important to note that using the wrong rate is going to lead to accepting bad projects or rejecting good ones. And then on to evaluate. So in the evaluate stage, we can compare Netflix against its peers. So we can see that Netflix's 11.21% whack is far higher than Disney's 8.2% and Amazon's 9 .5%. The primary drivers are visible on this sensitivity plot, which I have right here. So obviously risk, Netflix's high beta gives it a high cost of equity, which was the 11 .65%. And then cost, Disney uses significantly more cheap debt, which is about 30% of the weight, maximizing the tax shield benefit and pulling its overall whack down toward the optimal trade -off point. netflix is operating far to the left reliant on expensive equity this high whack is a competitive disadvantage netflix must find higher returning content projects than its rivals just to satisfy as investors and then for the last part of the driver framework to reflect I can kind of recommend a more optimal capital structure strategy which would be to increase debt leverage strategically the three billion dollar debt issuance was a small step, but I would recommend targeting a debt weight of 15 to 20 percent, which will significantly substitute expensive equity, which was the 11.65, with cheap after-tax debt of 4.58 percent, driving the whack down toward the competitive peer range, and this is where that finance theory meets like a corporate strategy so we reduce the hurdle rate and that is the key to successfully financing the five billion dollar content investment and creating long -term show shareholder value so that is the netflix case through the driver framework And all of this information above. That is all I have.",
  "video_url": "https://youtu.be/Z7q0FWeCZ4s"
}