{
  "student_name": "Gavin Hannon",
  "org_defined_id": "035642219",
  "username": "ghannon",
  "email": "",
  "transcript": "Hello, I'm Gavin Hannon and today we're doing the session 10 assignment which is over capital budgeting and investment decisions. So our assignment is that we need to evaluate Starbucks proposed flagship uh roaster that requires a 12 million upfront outlay and expected to operate for 10 years. We're going to use the firm's 8.5% WACC as a hurdle rate to determine whether the project creates value and then we're going to recommend if we want to accept or reject based on our analysis. So our project parameters are that we have the initial investment of $12 million that is depreciated a straight line over 10 years. We have a working capital of 500,000 and that is deployed at launch and recovered in year 10. We have revenues of $8 million in year 1, $11 million in year 2 through 5, and 9 million in 6 through 10. Our operating costs are the cost of goods sold is 40% of revenue. Labor is 2.5 million. Rent and utilities is8 million. Marketing is.3 million in year 1, then.1 million thereafter. Taxes is 25% corporate tax, terminal value $3 million at end of year 10. So to start off the def in the define and discover stage, our main objective is to determine if the pro project's projected cash flows when discounted at the 8.5% WACC if that will result in positive MVP NPV which indicates that the project is expected to create value for Starbucks. So our key constraints is that we have a we have these fixed values that must be used in the model. the $12 million initial investment, WACC, the fural rate of 8.5% and so on from all the uh parameters I listed um earlier. Our data inventory, we must cover zero through year 10. the NPV, the IRR, discounted payback and simple payback must be calculated using the 8.5% that we were given of for the WACC. Then we must test for sensitivity analysis like if the revenue decreases by 20%. Or if the WACC increases or decreases by 2%. And then finally give a recommendation based on the analysis. So, our success will be measured by passing the sensitivity test. Um, make sure the project aligns with Starbucks long-term strategy and identify key project risks. Our benchmark plan is to establish initial cash flows, calculate core capital budgeting metrics, perform sensitive metrics, and finally prepare a recommendation. So, next we have a represent stage, which is going to show the year 0 through 10. the cash flow schedule that includes revenue, operating cost, depreciate depreciation, tax shields, taxes, working capital changes, and the terminal value. I have a cash flow schedule right here. But to better show, I went into Collab where I had it uh develop this cash flow model for me and it used uh multiple of the uh calculations to calculate each of those uh things that we wanted in our schedule. So for the cash flow components, we got the working working capital and the terminal value right here for their calculations. The cash flow combinations which is with the taxes and operating cost and future cash flow with their uh calculations right there. And so when we run the uh code, we scroll down. We can see here that I first had it do the define and discover stage and it stated our objective. And finally here in represent stage it give us our 10-year cash flow schedule that shows the revenue the opportunity cost depreciation our taxes our operating cash flow or net or change in net uh WC our future cash flow and then the present value of future cash flow which we use to calculate the MPV. So now that we have our schedule, we can go to the implement stage which is to calculate MPV, IR, discounted payback period, simple payback period and profitability index using the 8.5% uh Starbucks WACC. And in our code that is shown here with the calcul uh the calculations for the present value of each cash flows right there. This calculation use the IR calculation right here and the profitability index calculation right here. As long as the as al also with the simple payback period and the discount pay payment payback period. So as shown here in the step three implement stage we have obviously the WACC hurdle rate of 8.5%. They calculate a net present value of 3.02 million the internal rate of return of 13.25%. We get a simple payback period of 5.28 years and a discounted payback period of 8.21 years with a profitability index of 1.24. 242 and so using these numbers we can state say that the project is expected to create value. Therefore we accept the project. Now to help validate this I used a net present value calculator to see if our code was actually uh outputting the right numbers and I so in this calculator I was able to put 12.5 million for the initial investment the 8.5 discount rate and all cash flows uh the future cash flow is right here 1.2 2 all the way to 5.3 for all 10 years. And when I calculate that, I get a net present value of 3 million and $222,514, which is what I got in the code, which is 3.02 million. So now that we validated our code, we can move on to the evolve stage which in this stage we are going through different scenarios to see if uh our project is sensitive to different uh cases. So for a base case for the base case which is just the normal case we had 3.02 MVV the IRR 13.25% 25% when we accept and that was because we had a positive MPV and our IRR was greater than the 8.5 uh hurdle rate. So we accepted. Next we're going to do test is if revenue drops by 20%. Now the code calculated that the MPV would be negative 3.16 and have an IRR percentage of 3.19. Since the MPV is negative and the IR is less than 8.5, we would reject. Now we go on to if the what if the WACC had a increase or decrease of two 2%. So if I had a decrease at 2% at 6.5% the MPV would be 4.64 million and I IR 13.25 since it's a positive MPV we accept. And then for the increase of 2% we'd also have a positive value of 1.63 and same IR 13.25%. Therefore we accept. So I can show that I explain this a little bit better. Since the MPV for the revenue reduced by 20% since the MPV dropped significantly from 3.02 to negative 3.16 million and the internal rate of return is less than 8.5 uh% we would reject the project and it shows that the project does not do enough to absorb this uh shock. Now for the WACC when it decreases to 6.5%. Uh the MVP changes to 5.37 million and the IR rem the IR remain unchanged. So therefore we accept the project even if the WACC was lower and also for if the WACC was higher it's same thing we should accept the project. Here I had uh collab demonstrate this through a visualization showing that when uh the different scenarios. So obviously with the base case we had a positive MPV and for the WACC changes we had a positive MPV but al but a negative um MPV when it was when the revenue was decreased by 20%. Same with the IRRa the internal rate of return um for the base case and the WACCC changes we had a higher than 8.5% as shown with this line and with the revenue reduced it did not so finally to reflect as I stated our final recommendation would be to accept the project um cuz we had the obviously the MPV was greater was positive and the internal rate of return was greater greater than 8.5%. And lastly the discounted payback period was 8.21 years which is within our 10-year life. So we would get our money back within that 10-year period. So the project satisfies the core capital budgeting rules as I stated above. That next is considered the risk and sensitivity analysis. Now if our revenue was to decrease by 20%. We would want to make sure we want to kind of foresee this. If this h if this we think this was going to happen then we we would want to reject the project. However, if if there's a change in WACC, uh no matter what if it's an increase or decrease, the project will remain uh positive, therefore creating more value for the company. So even if this happens, it doesn't we should no matter what accept the project. Lastly, what I learned I learned from the assignment is how to make a smart datadriven decision about whether a business idea is worth pursuing. So I learned the financial language to judge whether we should whether a big expensive idea should should be accepted or rejected.",
  "video_url": "https://youtu.be/v05x2acQ7DA"
}