{
  "student_name": "Daran Ebadi",
  "org_defined_id": "036201910",
  "username": "debadi",
  "video_url": "https://youtu.be/0ZL2kSPSiaM",
  "transcript": "Hello. And this is going to be my driverbased analysis of Apple's proposed $90 billion share repurchase. And I'm going to act as independent analyst. And my goal is just going to be um whether the buyback actually creates value compared to other capital allocation options like maybe a special dividend, an AI or maybe a VR acquisition, debt reduction, or incremental uh R&D. And so in the define step, I'm just going to frame the core decision problem. They're considering a 90 billion buyback, which\n\nis roughly 10% of its market cap. And the key question is, does this buyback create value for long-term shareholders and other stakeholders, or does it mostly transfer value between exiting and remaining investors? Um, and so the concepts I use are the ones given in the assignment. They're going to have $165 billion of cash in investments, 100 billion of annual free cash flow, and a share price of 185 in a P& of 30. and 15.5 billion shares outstanding. And on the capital structure side, Apple's going to have\n\nApple's going to have 110 billion of debt and Birkshshire owns about 6% of the equity. CEO holds 30 3 million shares. Retail investors own small lots like 100 shares and employees are holding options with $170 strike price. Um, and so the decision space I'm comparing is a 90 billion buyback, $6 special dividend, strategic AR, uh, or VR, AI or VR acquisition. Um, you know, paying down debt and incremental R&D. So, the recommendation has to account for value creation versus value transfer, you know, agency government's\n\nissues, signaling, and long-term capital allocation. And so in this cell here, I'm going to be computing Apple's EPS, their net income, equity value, and leverage ratio before any transaction. So given a price of 185 and a P and a PE of 30, EPS is about $6.17 with 15.5 billion shares. That implies around 95 to 96 billion of net income with a market cap close to 2.9 trillion. And with 110 billion of debt, the leverage ratio, which is just going to be our debt over debt plus equity, ends up being very,\n\nvery low, only a few percent. And that's super important because it means bond holders are pretty well protected. And Apple has a lot of flexibility in its capital structure. And so this baseline just going to give me the starting point to track, you know, EPS changes, leverage shifts, and you know, different stakeholder outcomes under each capital allocation scenario. And now this block here um with scenario buyback scenario special living in scenario debt reduction and our scenario reinvestment.\n\nUm and so for the buyback here function is going to take a dollar side the function is going to take a dollar size uh the share price and an optional debt financing ratio and it's just going to calculate how many shares Apple repurchases you know the new share account the new PS using the same net income and the updated leverage ratio and ownership stakes for key stakeholders like Birkshshire and the CEO and this is just going to let me you know quantify classic agency and ownership concentrated questions you\n\nknow insiders and large institutional holders don't sell into the buyback, their percentage of ownership uh rises. So for the special dividend here, um this function is just going to hold the share count and earnings constant. It's going to reduce cash and calculate how much retail uh how much a retail holder with 100 shares would receive in dividend income. And this is going to be a more direct value transfer, you know, cash is going to leave the firm and it's going to go straight to shareholders\n\ninstead of charging um capital structure. And so for debt reduction here, uh, this function is going to focus on bond holders and leverage. It's going to reduce debt by 90 billion, lower cash by, um, that same amount. And then it's going to recomputee that leverage ratio. And this is just going to help us evaluate whether um, reducing agency costs of debt and risks is going to be more valuable than just repurchasing those shares. And so for this scenario investment function, it's going to be pretty pretty generic model\n\nwith an AI um or VR acquisition and incremental R&D. So I'm going to put some parameters on our return our ROIC um return on invested capital and uh just going to use it to estimate that incremental net income. And so that's going to feed into a new EPS. And let me compare high ROIC growth investments to, you know, the mechanical EPS accretion from a buyback. And and so in implement here, we're going to um build different scenarios and a scenario comparison. So here we're going\n\nto pass a 90 million in So here I'm going to run a 90 billion B 90 billion buyback, $6 special dividend, and 90 billion debt payown and 90 billion allocations to AI um or VR acquisition and R&D with ROIC assumptions of 15% for the acquisition and 20% for R&D. And so this data frame is just going to give us uh the key metrics, the EPS, EPS percentage change and the new leverage ratio for each scenario. The buyback also increases EPS by a little over 3% because the share count falls by roughly 10% while earnings are\n\ngoing to stay the same. And that's just pretty classic um you know financial engineering you know your EPS accretion without changing the underlying cash flows. And so the acquisition and R&D scenarios and so under my ROIC assumptions um actually increase EPS more than the buyback just because those raise net income instead of just shrinking the denominator. debt reduction and the special dividend don't boost EPS, but they do change the risk and the payoff profile. And that's something to keep notice of.\n\nUm, and so now I'm just going to kind of confirm um the buyback EPS higher than the baseline that reinvestment scenarios with ROIC above the implied cost of equity produce even stronger EPS growth. And that's just going to match what we'd expect from capital budgeting. If ROIC is above the cost of capital, reinvesting should create value. And then this stakeholder summary table is going to uh look at value creation versus value transfer. So for a retail investor with 100 shares, the buyback\n\ndoesn't really change how many shares they hold. So their wealth only changes if the share price moves. And so if Apple is fairly valued at a PE of 30, a buyback and market price mostly just reshuffles ownership. You know, value transfer from sellers to stairs rather than creating new value. Um, and so Birkshshire and the CEO if they don't tender, they can see their ownership percentages rise after the buyback. That's good if you believe they are highquality, long-term stewards of capital, but it also raises, you know,\n\nthese different agency questions. Big buybacks can disproportionately benefit large and concentrate holders and management with equity based pay. So for employees with $170 strike options, the intrinsic value per option doesn't change in this model. Um, unless we're assuming a signaling effect that pushes the share price higher. And if so, bond holders are going to care about the leverage ratio. And so this model is just going to show that a pure buyback doesn't really help them while debt reduction does um\n\nbecause it's going to lower leverage and reduce our risk. And so these two bar charts here are going to help you visualize. So the first is just going to compare EPS across capital allocation scenarios. You can see that buyback does boost EPS versus the baseline, but high ROIC R&D and the AR and AI and VR acquisitions generate even more EPS accretion in my assumptions. So this is just going to support the idea that value value creation comes from positive um net present value projects, not just shrinking the share account.\n\nAnd so the second chart's going to show the leverage um the leverage ratio across scenarios. So debt reduction is the only option that materially lowers the leverage which is generally good um for bond holders and for overall financial resilience. And so the buyback funded from existing cash barely moves leverage just because Apple starts from such a low debt level. But if management leaned into debt finance buybacks, you know, that bond holder risk is going to increase. And so in the evolve stage here, we're\n\njust going to add a little bit of sensitivity analysis. Um, and so this function just lets me change the buyback size and the ROIC assumptions for acquisitions and R&Ds. You know, for example, I can rerun this model with a smaller 50 billion buyback or a lower ROIC if I'm worried about, you know, Apple overestimating AR AI/VR returns. So when that ROC drops closer to the cost of capital, the EPS advantage of reinvestment goes away and then the buyback looks relatively better. And so an ROIC is safely above the cost of\n\ncapital and reinvestment clearly wins. Um so from a pure EPS perspective the 90 billion buyback works. It gives about 3% EPS boost with limited impact on leverage because Apple is so underlevered. It may also create a positive signaling effect. Management telling the market they view the stock as attractive and they are disciplined about returning you know excess free cash flow. But if the stock is fairly valued, most of that benefit is just going to end up being value transfer, not value creation,\n\num exiting shareholders are going to get liquidity at 185 and the remaining shareholders are going to get a slightly larger slice of the same earnings pie. You know, large concentrated owners like Birkshshire and the CEO become even more influential, which can be good or bad depending on how you feel about governance and agency risk, but that's a different uh it's a different story. So the special dividend is the most transparent value transfer. It's going to push the cash directly to\n\nshareholders. Retail investors might like the immediate payout, but this really doesn't improve EPS or long run ROIC. It's usually the less tax efficient. But debt reduction clearly helps bond holders by lowering leverage and risk. But given Apple's already conservative capital structure, that marginal b that marginal benefit to total firm value is super limited. So the reinvestment options um AI in VR acquisitions and R&D are really where the true value creation can happen. So in my model assuming RYC is at the 15 to\n\n20% um zone. These options deliver more EPS growth than the buyback clause because they grow the numerator of the EPS not just shrink the denominator. That's where the math comes into play. They also support Apple's strategic positioning in AI, VR, and ecosystem innovation, which matters for long-term competitiveness and market um and market perception."
}