{
  "student_name": "Luisa Kramer",
  "org_defined_id": "035882855",
  "username": "krame144",
  "video_url": "https://youtu.be/pL5HAca8JNk",
  "transcript": "Okay, we are into session 11, and the core objective to determine if the proposed $90 billion share repurchase for Apple is the optimal use of capital compared to our four alternatives. A special dividend, a strategic acquisition, debt reduction, and incremental R&D. The evaluation must balance value creation, stakeholder impact, agency cost, and signaling.\n\nSo that's what we're trying to solve here. And so this first big chart that I have here are key assumptions and inputs. Some of this stuff is given to us.\n\nThere is just the context to each thing. Like, for example, we know we have $110 billion in debt, which are just existing long-term liabilities. So more important information for me to visualize that and remember and have it written here.\n\nSo, again, I've just written out our core questions to answer. How does each option affect the EPS, the P divided by E, the share count, and the leverage? Does the option generate positive net present value, or NPV, or merely just transfer wealth? Who wins and who loses? Retail, institutional management, employees, bondholders, people like that. And lastly, what are the governance implications and market perceptions? So our second step in the driver framework is to represent.\n\nSo we're going to plan out and model a financial model that will be built to calculate the immediate and near-term impacts of all five options. So how we do this is with a base case, that current capital structure and financials. Then we'll go into the scenario analysis.\n\nSo five capital allocation options, which is that buyback, dividend, acquisition, debt reduction, and R&D, or research and development. And then our key outputs that we're going to get are shares of a purchase divided by, or the share count reduction, the new debt level, and the interest expense change. The EPS, the return on invested capital, debt to equity ratio, and the cash rollback.\n\nSo a lot of information that we're going to get out of this. And how to do that, I have listed here some of the information that we were given and that we're going to find, the formulas for each calculation. So the buyback is shares repurchased.\n\nSo we know that $90 billion is what we're given, and we divide that by $185 because that's per share. So our new EPS that we're getting is a net income divide on new shares outstanding. We know that the shares outstanding is unchanged because the total payout is $6 per share times that $5.5 billion.\n\nDebt reduction is going to be that new debt, so $110 billion minus $90 billion. The interest savings is $90 billion times K, which we don't know about yet. And then the acquisition or research and development is an incremental net income.\n\nAnd then a very important formula here is the ROIC, which is net operating profit after tax divided by invested capital. So now we are going to implement these formulas and solve them. So for the base case financials, we know that the net income, to solve the net income, we need the EPS, which is $30, and then P divided by P. So share price divided by P slash E is $185, which we know right here, $185 per share, divided by 30, which is our EPS.\n\nSo to solve net income, it is $6.17. And to keep going for net income, we know that it's $6.17 per share times that $15.5 billion shares that we were already given. So we find that our net income is $95.6 billion. So it's already larger than that $90 billion share we purchased for Apple.\n\nThere's something to note there. And then again, I'm doing something similar here, just like with a chart, so that I can visualize what we found, what we're calculating, what we're given, stuff like that. So we have our buyback, our dividends, our acquisition, debt reduction, and then that incremental research and development.\n\nAnd I organized each by the cash use, shares we purchased, new shares outstanding, the net income change, the new net income change, our new EPS, our debt-to-equity ratio exchange, and our ROIC change. So that one would either be negative, applicable, positive, stuff like that, pretty simple. Okay, and then to do some more calculations, I want to know what the buyback is.\n\nAnd so again, that was the shares we purchased, which would be $90 billion, divided by that $1.85 per share, which is $0.486 billion. EPS is just $95.6 billion, which is what we found, divided by that $15.014 billion, or $6.37, which again, we already found that. Or actually, no, we didn't. \n\nI'm sorry. I think we just did. And then to find our debt reduction, that is our interest savings after tax, so $90 billion times 3.5 times 1 minus 0.15, which gives us $2.68 billion.\n\nSo our new net income is just going to be to add that $2.68 billion to that $95.6 billion that we found earlier. And so now we get $98.28 billion. Our acquisition is, we're just assuming 15% ROIC on the $90 billion investment.\n\nSo our incremental net income is that $90 billion times 0.15 times that 1 minus 0.15, which is $11.47 billion. Our next step in the driver framework is to validate. So I'm going to do an internal consistency check.\n\nSo the buyback and debt reduction result in the same short-term EPS lift, about 3.2%, because the interest savings from debt reduction effectively match the mechanical EPS lift from the share reduction. This confirms the model's accuracy on the two common finance tools. The acquisition and the research and development scenarios deliver the highest EPS, confirming that direct value creation, that positive NPV, through investments will always outperform value transfer, or buyback and dividend, in simple EPS terms, provided the ROIC hurdle is met.\n\nNext, I'm going to dive into the stakeholder and the incentive check. So to go into those different options of what else we could do, management or employees, which are some option holders, they have the most favorable buyback. They mechanically boost the EPS and share price, increasing the value of their options, which would be $170.\n\nAnd an increased share concentration also grants management more relative control. So they are a high agency risk, something very important to know. And their acquisition slash R&D is also favorable, is successful, but it does carry an execution risk.\n\nBerkshire, which is 6% institutional holders, their buyback is favorable. Their ownership stake increases from 6 to, do a little calculation here, would be that 6% times $15.5 billion divided by the $15.014 billion to get 6.19%. So it just increases a little bit, but it's still, in the grand scheme of things, it's a lot of money, 0.19%. And they would benefit from the EPS accretion. Lastly, our bond holders, there's a debt reduction.\n\nSo they're most favorable with debt reduction because they reduce the credit risk and improves leverage profile. However, their buyback is the least favorable because it increases the DAE ratio and signals a capital allocation strategy, prioritizing equity holders over debt holders, potentially leading to a higher future borrowing cost. So they would have a negative signaling.\n\nOur fifth step in the Zara framework is to evolve. So the initial model assumed an immediate one-time cash deployment. A key refinement is to model a blended approach, leveraging Apple's $100 billion in annual FCA.\n\nSo my evolved recommendation for a balanced capital structure would be a pure $90 billion buyback uses up too much capital that could be used for growth. So the optimal strategy is going to go into the $45 billion, which is just half of the $90 billion for research and development, plus the other half, $45 billion for targeted buyback. So we're kind of doing a 50-50 split here because the $45 billion into research and development would maintain growth option and long-term value creation.\n\nAgain, like the ROIC of 10%. And the other half that goes into the buyback would provide immediate EPS lift and manage dilution from employee stock options. The remaining $75 billion for the SCF would be retained for flexibility or acquisition or for research and development.\n\nThis hybrid approach mitigates agency risk by committing to organic growth while satisfying the market's demand for capital returns and managing employee compensation dilution. Now, the last step is reflect and also a little recommendation. So my conclusions are that the buyback and dividend transfer are forms of a value transfer from the corporate treasurer to shareholders.\n\nThey create value only if the firm is substantially undervalued or it has not exhausted all positive NPV growth opportunities, which is pretty unlikely for Apple. The primary driver is a mechanical EPS boost, which is not true economic value creation. Going into that creation, like acquisition and research and development are forms of value creation because they generate a return ROIC above the firm's cost of capital.\n\nAcquisition or 15% ROIC provides the highest EPS lift, but it also carries the highest execution risk. So, again, what I recommend is that the proposed $90 billion share repurchase is not recommended as a standalone action. I recommend a blended capital allocation strategy combining targeted investment and return.\n\nAs you can see, I have it visualized here, but I already talked about it a little bit. Why I really suggest this strategy is because it manages agency risk, balances the need for both organic growth and financial engineering, and maintains a strong cash position for future opportunities. The blended approach provides $90 billion of capital use, delivering a superior long strategy for all stakeholders compared to the pure buyback.\n\nTo prove this even further, in Google Colab, I have imported the code here, and I have a section titled the capital allocator, the base case, the share purchase. It's kind of going through everything that we talked about before, calculating the special dividends, the strategic acquisition, which is that value creation, the debt reduction, the incremental research and development, and the model execution, which has a bunch of given information and a bunch of information that I found in pre-calculations. And we are given the capital allocation scenarios analysis.\nSo, we can see in a chart, visualize the new shares, the net income, the new debt, the EPS, the EPS change, the debt to equity ratio, and the value dynamic is all calculated right here. So, if I needed to, I could have just done this to find the calculations, but of course, I have to implement and make sure that I'm doing it right myself. So, that is the code this time."
}