{
  "student_name": "Luisa Kramer",
  "org_defined_id": "035882855",
  "username": "krame144",
  "email": "",
  "transcript": "Okay, so we are in session 9, and this time around, we are doing an analysis that calculates Netflix's weighted average cost of capital for a hypothetical $5 billion content investment using the Gov framework. I feel really confident on this question, especially since last week we worked with the WACC, and I think in session 7 too as well, but I know April Shirley did. So just to recap, we have the formula here on this first page. I am first going to define everything. So RE is the cost of equity, RD is the pre-tax cost of debt, or the bond yield, TC is the corporate tax rate, E is the market value of equity, or the market cap, D is the market value of debt, and V is the total market value of capital, which would be E plus D, or market value of equity plus the market value of debt. So, the weighted average cost of capital formula would then be the market cap divided by the total market value of capital times the cost of equity, plus the market value of debt divided by, again, the total market value of capital, times the pre-tax cost of debt, times 1 minus the corporate tax rate. Okay, and then here is just a chart so that we can visually see what we are given. So we have all of the different parameters, such as the equity of beta, the corporate tax rate, the market value of debt, a lot of things that we defined in the WACC formula, and then we are given all of the values that we see in our textbook already given to us, or it's calculations that we found out through the formula, like the total market value of capital. Okay, the next step of our driver framework is to implement, so we are going to implement the calculations. So we are first going to calculate Netflix's current WACC. So we are going to start by defining the cost of equity, or the RE that we defined. So using the capital asset pricing model, or CAPM, we know that the cost of equity is RF plus beta times our MRP. In this case, that would be 4.5% plus 1.3 times 5.5% right there, that market risk premium, and that in total would give us 11.65%. Now we need to find the after-tax cost of debt, or the RE times 1 minus WACC, the last little part of the WACC formula. So after-tax rate, or cost of debt, sorry, would be 5.8% times 1 minus 0.21, or 5.8% times 0.79, let's subtract that, and that gives us 4.582%, or 4.58. Now we're going to find the capital structure weights. So the equity weight is these fractions here, the E over V and the D over V, that's what we're looking for now. That would be 200 billion divided by 213 billion, or 93.9%, and then 13 billion divided by 213 billion, or 6.10%. And all of these formulas and calculations that we found, all the numbers that we used are just already given to us in this chart. We're just defining them and putting them in the proper place within the formula. So that being said, if we were to recalculate the current WACC, putting everything together, would be 11.21%. Keep that in mind because that will come up later. Now we want to determine the WACC after the 3 billion debt issuance. So the new investment is financed entirely with an additional 3 billion dollars in new debt at the same cost of debt, which is at 5.8%. So with our new capital structure weights, we are doing something very similar to what we did, but we just have to add in this little apostrophe here just to mark it as something new, but still within the same framework that we're doing. So to find the new market value of debt, or DX, that would be 13 billion dollars plus that 3 billion dollars of new debt. So we get 16 billion. The new total value of capital would be 200 billion plus that now 16 billion that we found. So 216 billion in total. And then again with those fractions, we need to find our new equity weight. So that is going to be that 200 billion divided by the 216 billion, or 92.59%. And then lastly, we're finding the new debt weight. So 16 billion that we found divided by our 216 billion gives us 7.41%. So with that 3 billion dollars implemented, we now need to find our new WACC. Remember before it was 11.21%, and so now putting in all of the different percentages that we just found, we would get 11.13%. So this is telling us that the WACC after the 3 billion debt issue would be 11.13%, which is a slight decrease from the current WACC due to the increased use of cheaper tax deductible debt. So that is why there is a difference there. Next, we're going to validate project-specific versus firm-wide WACC. So using that firm-wide WACC, the 11.21% that we found originally, or the 11.13% with the 3 billion dollars implemented, for the 5 billion dollar content investment is generally inappropriate because different content projects have varying levels of risk. A firm-wide WACC is a rate that reflects the average risk of the company's existing blend of businesses. And a project-specific WACC is a preferred discount rate tailored to the systematic risk, or the beta, of the specific project's cash flows. So to do our project risk assessment, we want to look into U.S. content, which is a high budget and a proven market. This content often carries a lower systematic risk, so a lower beta, which I remember we talked about in session 6 or 7, I'm not sure. But cash flows are more predictable in a mature market. A lower project-specific WACC, around 9-10%, should be used. For an international content, which would be new or emerging markets, this content often carries a higher systematic risk, or a higher beta, due to currency risk, political instability, and market uncertainty. So a higher project-specific WACC, it would be like 14% for example, should be used as a preferable rate. Something to note is that a company that uses a single firm wide WACC will tend to reject low-risk value-creating projects because it's too high of a hurdle rate, and they would rather accept a high-risk value-destroying project, which is too low of a hurdle rate. The next step is to evolve. We are going to look into peer comparisons and capital structure. So for example, what I'm going to use is Netflix vs. Disney and other industry peers. So, we find that Netflix's, as of right now, the capital structure and ADD ratio is 93.9% to 6.1%. We already found their WACC, which is 11.21%, and we find their equity beta of 1.3. Disney is 70 by 30, their WACC is equal to 2%, and they have a lower beta. And then other industry, if I wanted to look into another business, could. And so it just kind of varies on which company you want to go to, but for time's sake, we're just going to look at Disney. So to explain these differences in beta, differences in the WACC and the capital structure ratio, Netflix's WACC, again, 11.21%, is significantly higher than Disney's 8.2%, and above the general media industry range. This is because they have a higher business risk, so a higher beta, which was of 1.3, and it reflects a higher volatility and reliance on a long-term capital investment for content, which is perceived as riskier by equity investors compared to Disney's more diversified, established media conglomerate model. And Disney's implied beta is lower, leading to a lower cost of equity. In a conservative capital structure for a lower debt, Netflix currently has a low debt rate, which is at 6.1%, making its capital structure predominantly equity-funded. Equity is inherently more expensive than debt due to the tax shield and seniority of debt. Disney's 30% debt rate allows it to leverage the cheaper cost of debt, driving its WACC lower. What I can recommend is that they do an optimal capital structure strategy. Netflix's strategy should focus on cautiously increasing its utilization of debt financing to move towards a more optimal capital structure, closer to its peers. What they have going on right now is that current 94% equity, 6% debt, which suggests that Netflix is likely under-leveraged, foregoing the value-creating benefits of the debt tax rate. What they could do is aim to gradually increase its debt proportion towards the 20-30% range, potentially closer to Disney's 30% or the marker average, until the cost of financial distress outweighs the benefits of the tax shield. That $3 billion debt issuance impact that we looked at before increases the debt rate to 7.41% and slightly lowers the WACC to 11.13%. It's a small yet positive step in this direction. However, to significantly lower your WACC and realize greater value, Netflix should target a more substantial increase in its debt-to-capital ratio. In conclusion, the optimal capital structure would maximize firm value by minimizing WACC. For Netflix, this suggests issuing more debt, potentially targeting a structure of approximately 75% equity, 25% debt, and to move its WACC closer to that lower 8-10% target range of its peers without incurring its financial distress risk. So in summary, my last step of the drama framework is to reflect. Here's a quick summary of my findings. We found the current Netflix WACC, which is 11.13%. We found it after that $3 billion of debt, which is 11.13%. We compared to Disney and to other peers and gave a good optimal capital strategy. I almost forgot again to include the Python code for our WACC calculation. So that's what it's doing here. It is defining a function to calculate the WACC and then apply it to Netflix's current structure and the post $3 billion debt issuance scenario. So that is what this is doing here. What it's giving us is the literal and current WACC without the $3 billion or $2 billion. It gives us all of the values that we found in the formula when we first started. It gives us the new values in the formula and ultimately is just calculating the WACC for me.",
  "video_url": "https://youtu.be/SDYuuHIm4iU"
}