{
  "student_name": "None None",
  "org_defined_id": "037019479",
  "username": "tblanton",
  "video_url": "",
  "transcript": "Okay, so this is my mini project 2. I\ncreated an expense tracker.\nSpecifically, it would solve the problem\nof having to go into an Excel like for a\nbudget and input them all there, which\nis\nquite time consuming. And I just I\ncreated this AI agent that would I would\ngive it my expenses in real time as I\nincur them and it would automatically\nupload it to the Excel budget so that\nwhen I went back into the Excel, I could\nsee all my expenses listed out and then\nI could use that information from there.\nSo\nhere is the agent.\nYou have all of the chat model, the\nmemory and the tool which is add entry\nentry.\nSo\nhere is my Google sheet that it is\nconnected to. You can see there's a\ndate, column, amount, description, and\ncategory. And it will automatically\ncategorize where they are going.\nSo\nhere we are is my workflow. So let me\njust show you.\nSo if I just incurred an expense at the\ngrocery store. So, I would\njust bought\ngroceries\nfor $120\nat Aldi.\nAnd so then I would send it\nand then we're going to wait for it to\nadd it.Okay. So, it said, \"Got it. Adding anexpense for Aldi, $120 under groceries.\"\nAnd so, then I can go back into it. And\nthere it is. You can see that it's\ntoday's date, the correct date, the\namount, Aldi, and groceries.\nI this took me a few times to get the\num system message correct because it\nwould\njust initially it kept on adding the\nsame like no matter what different\ncategory I gave it, it did all one\ncategory like it only did dining out for\neverything. So then I had to tweak the\nsystem message to actually categorize\nthings on its own.\nUm, there are definitely multiple\napplications for this in personal\nfinance, especially because I know a lot\nof people don't like to budget using an\napp just because it's not as\ncustomizable, but then Excel is kind of\ntimeconuming because you have to open it\non your computer all the time and this\ncould evolve into like more of a mobile\nlike appbased\napplication so that it's still connected\nto that Excel or that Google sheet, but\nit has more of a mobile application so\nthat you wouldn't have to\num go into your Google sheet every time\nyou make an a purchase just to add it.\nSo this is my mini project two."
}