{
  "student_name": "Andrew Kuper",
  "org_defined_id": "036275825",
  "username": "kuper",
  "email": "",
  "transcript": "Hello guys, I'm Andrew Cooper, and I'm going to be talking about the GameStop market efficiency investigation. So, my goal is to investigate market efficiency using the GameStop short-stop. Squeeze event of 2020 to 2021 as a case study. I need to verify the accuracy of state of facts, analyze price behavior relative to efficiency market hypothesis predictions, and evaluate whether market anomalies constitute against market efficiency or can be explained within existing frameworks. So, my event timeline is that GameStop is near bankruptcy levels in August 2020. In September 2020, Ryan Cohen, the Chewy Founder, acquires 13% stake. In January 2021, there was a Reddit that there was a price surge to $483. In February 2020, February of 2021, Congressional hearings on market manipulation. In the present, there will be post-event price stabilization. So some key data points that I needed to know to do this. The short interest peaked at 140% of the float. Retail trading volume increased tenfold during squeeze. Trading restrictions implemented at peak, for example, Robinhood, has increased from $2.00 to $4 Analysts' fundamental values estimated from around $10.00 to $40.00. per share. So, using the driver framework, I will start by defining, er, go, start by So, my goal is to pretty much test which of the statements are accurate. First of all, the first crucial, crucial step is I need to verify if the game is correct. So, I need to if the game is correct. So, I need to verify the game using Yahoo Finance. So, how am I going to implement this in the code? I'm going to implement this. I'm going to implement the price, the volume, and the code. I'm going to implement the S&P 500 for, like, the interest and the market model, like, model the market, like, how it's going to go up and down. I'm going to implement the short interest numbers for the data, so how high it goes up, like, fast, and how, like, how much interest there is in the short term. I'm going to implement the specific dates and times of certain events, so, say, from August 2020, or August 13, 2020, to, like, August 30, 2020, for example. And I implemented this in Google Collab, so I'll run it in Google Collab. And, pretty much, this is my code. I create, it will create two graphs, and it will show me the average volume of the graphs, right up here. So, from January to February 2021. Or, I guess I should do this one. This one first. From August 2020, there is the float and the GameStop. No. And this is what the graph looks like. Pretty much, it is very, very slow, very, very slow, very, very slow. Once you get to 2021 February, it's, Or, I guess, end of January, beginning of February, it spikes up, and then, right as February hits, I guess, it goes straight back down, and then it goes towards March, and then it goes all up a little bit more. And then, that's for the GameStop price. This one is daily abnormal returns versus the SPY or the S&P 500. So, pretty much, as it goes, it goes. It's pretty steady towards the middle, sort of, and then it just spikes up, spikes down, goes back towards the middle, spikes up, spikes down, spikes up. It's very fluctuating a lot for this app. And then, how I am going to data, this is the confirmed GameStop prices in August 2020 are between $1 and $2, verified by this data. around $1 to $2. It doesn't really show on here, but it is verified. Because August is around right here. Yeah, you can't really see it, but, It is verified through, like, Ryan Cohen and other sources, so it is not by comparing the equations, which are accurate. So, the equation I used for the daily returns, are the equations, like, the exact equations you need for this. pretty much. It's pretty much just, like, verifying that I used the right equation. The graphs both show that there is a volume spike, correct? That there is a big spike in both of them around the same time, kind of, it, pretty much both kind of around the same time. I would say. Oh, wait, wait, I can't scroll down. Yeah, they're around the same time, pretty much the exact same time. And then, this data is credible, Bedale is credible, I mean, the code shows that all the findings are accurate. So, how I'm going to evaluate this is pretty much the weak form efficient market hypothesis is not violated because of the short interest mechanics. And normal price patterns, the semi-strong form has a temporary breakdown around the squeeze. The price did not adjust very smoothly and stayed pretty low for many, many months. The strong forms were very, very, very unrealistic and do not hold at all. So the GameStop short squeeze is strong evidence of short-term semi-strong inefficiency, but doesn't provide long-term results. Objection. How I'm going to reflect this is, pretty much, I think that the driver framework helped a lot with this task. But Python code helped me understand the efficient market hypothesis. This process showed me that the game statistics that GameStop can be structured into a driver framework. Pretty much, the GameStop market efficiency investigation can be, uh, structured into just a driver framework explaining each step as you go, making me understand it a lot better. So I think this has helped me understand market efficiency a lot more. And, uh, that is all. Thank you.",
  "video_url": "https://youtu.be/8h9m28vQC6U"
}