{
  "student_name": "Daniel Verachtert",
  "org_defined_id": "037038927",
  "username": "dveracht",
  "email": "",
  "transcript": "Hi, my name is Daniel Verachtert and this is my session nine Netflix whack assignment. Okay, so to start the CAPM the cost of equity for uh Netflix the expected return is 11.65%. Uh since the beta is 1.3 which is relatively high it means Netflix is 30% more volatile in the market. For this reason, investors require almost a 12% return to hold Netflix stock. Uh the cost of debt after tax that found to be 4.58%. Uh the Netflix bond carries a BBB plus credit rating with a yield of 5.8%. Once again, after taxes, this drops to 4.58%. Debt is much cheaper for Netflix than equity. So in their case, it's 4.6% versus 11.6%. Uh this creates an opportunity using reasonable amounts of debt lowers Netflix's overall whack. Current capital structure weight. Uh I found that the almost 94% of Netflix's financing comes from shareholders. Only 6% comes from debt. Because Netflix uses so little debt, its whack is dominated by high cost of equity. Uh so the current whack is 11.21%. This is uh this is a high cost of capital or that this is because of the high cost of capital. It's driven by heavy equity dependence and the minimum return Netflix must make to satisi satisfy shareholders and lenders is 11.21%. uh the whack after the new $3 billion debt issuance would uh come out to be 11.13% which is just like looks minimal but has a substantial effect. Um add adding debt increases Netflix's debt weight from or increases Netflix's debt weight from 6% to 7.4% 4% instead is much cheaper than equity. Adding more of it pulls whack downwards. This shows that Netflix was under uh underlevered before. Um there's room to safely take on more debt to lower whack further. Uh the project specific whack. So uh as for the US content, I got that the US whack would be 10.2%. 2% uh US content should use a lower hurdle. This is due to the US having lower risk. Uh the reasons for this lower risk and lower back is because of strong brand presence in the US, predictable subscriber behavior, more reliable data models, and more stable cash flows. Um, as for international content, I found that the whack was 12.3%. Uh, international projects require higher hurdle rates. This is due to the international content having higher risk. Uh, reasons for this higher risk are political risk, currency volatility, local content, uncertainties, and different licensing and censorship rules. So now moving on to the Netflix versus Disney comparison. So Netflix their whack is 11.21 and Disney is 8.2. The main reason for Netflix is higher uh whack is they have lower risk and use more debt. Therefore they have cheaper capital. Uh if we take a look at this chart that's down here uh these are different factors. So leverage Netflix is very low while Disney is higher with 30% debt. Uh their business models are different. So it's like Netflix is a single line. It's just streaming whereas Disney is diversified. So it's park studios, ESPN. They have different fields. Uh the beta once again Netflix is at 1.3 which is relatively high and risky or not that risky but somewhat more than Disney which is at 1.1. Uh competitive mode the Netflix has a much narrower competitive mode while Disney has a stronger IP and legacy assets. And then the credit quality Netflix is a BBB plus while Disney is A minus uh range historically. So the optimal capital structure strategy would be gradually increase leverage to 15 to 20% debt which is now currently 6%. This would lower whack by 50 to 120 bps, still maintain investment grade rate while still maintaining the same investment grade rating. Uh then match funding types to project risk. So use lower whack for US content and use higher whack for international content. Uh three, use fixed rate debt to hedge interest rates during volatile markets. And then four, do not target Amazon level flexibility. Netflix lacks Amazon's diversified cash flows, but it should emulate Disney's balance financing. In conclusion, Netflix should use moderate leverage and apply project specific hurdle rates, reducing its overall cost of capital while maintaining financial flexibility. Uh now I'll show you my uh code that I used. This is the codes code that I used for the Netflix current whack calculation. And run it and we get down here 11.65% 65% for the CAPM after tax cost of debt is 4.58. The weight of equity is 93 uh 93.9. The weight of debt is 6.1. So Netflix's current whack is 11.22%. And that's all I've got. Thank you.",
  "video_url": "https://youtu.be/7fLVlNV7NfQ"
}