{
  "student_name": "Juan Moreno Morales",
  "org_defined_id": "035730816",
  "username": "jmorenom",
  "video_url": "https://youtu.be/a3_dS6bOQ00",
  "transcript": "hey video hey professor\nin this video i'm going to analyze apple's\nhypothetical 90 billion share repurchases using\nthe driver framework i'll walk through how\nwe define the problem build a sample model\nin google lab compare the buyback to others\nother uses of cash evaluate the impact on\ndifferent stakeholders like retail investors\ninstitutional investors management employee\nand bondholders i will start with the finding\ndiscovery stage the decision analyzing is\nwhether apple should execute a 90 billion\nshare repurchase over one year or whether\nthat cash would create more value if it were\nused as an alternative like a six dollar special\ndividend a strategical ai slash VR acquisition\npaying down debt or incremental R&D\ninvestment the data case gives me 165 billion\nin cash and investments about a hundred billion\nin annual free cash flow a share price of\n185 15.5 billion shares outstanding 110 and\n10 billion of debt and a large concentrated\nin shareholders like Berkshire with a 6%,\nthe CEO with 3 million shares. My core\nquestion is just, is not just, is it a\nbuyback, good or bad? Instead, I'm framing\nit as, does the payback create a long-term\nvalue for the framework as well, or a manually\ntransfer value between different shareholder\ngroups given Apple's capital, structural,\nand opportunity set? For stakeholders, I'm\nexplicitly tracking retail stakeholders\nwith a small position around 100 shares.\nInstitutional shareholders like Berkshire Management,\nwhose completion is tied to stock price\nand EPDs. Employees with stock options\nstrike price 170 in the case, and employees\nwith stock options. Fundholders\nwho care about leverage, credit\nrisk, and cash protection. In\nthe discovery, I remind myself of\nthe key theories. Capital structural\ntrade-off theory, tax shield\nversus de-stress and fixability,\nagency theory, management, and\nstakeholders. There's a signing\ntheory, a big payback in signal management's\nconfidence about under -violation or limited\ngrowth opportunities. My goal in the assignment\nis to use those theories plus a simple\nmodel to see who wins and who loses and\nwhether a decision is a value-creating or\njust a value-shifting. Now, I'll move into the\npresenting stage and explain how it's\nstructured to analyze say my client network um\nconstantly i'm building a scenario model with\nfive cases that use roughly the same 90\nbillion of cash baseline no action just for\ncomparison payback 90 billion repurchase\nspecial dividend about six per share dividend\nreduction 90 billion used to pay down for 100\nbillion of debt aibr accusation and extra\nrnd where i could plug and assume whether it\nturns and investment free scenario i plan\nto track share count on eps ownership conservation\nfor large holders like berkshire and for\nsmart retail investors a simple leverage\nmetric such as debt inequity and a qualitative\nstrategic fit and agency comfortable\nscore at a high level my representation is input\nsale initial shares price cash debt and then\nincome free cash flow scenario and talks\npayback versus dividends versus reduction versus\ninvestment calculations new shares count\nups simple leverage and ownership percentage\njust a chart comparing ups and leverage\nacross scenarios of the visual support for my\nnarrative employment now i walk through the\nemployment stage where i actually build and\nrun the model and google collab first so\ninputs here define the strategy case number\nshares 15.5 billion price 185 market cap shares\nprice cash equals 165 billion deb 110\nbillion net income 100 billion as a rough\nassumption consists with 100 billion of free cash\nflow and the baseline is eps net income\ndivided by shares that's roughly 6.4 per share\nwith the 15.5 billion shares outstanding second\nsell payback scenario I assume Apple sends 90\nbillion to repurchase shares at 185 shares\nrepresent 90 billion divided 185 new share\ncount 15.5 minus your purchase shares\nthen are your compute EPS payback net income\ndivided by new shares my numbers EPA races\nfrom about 6.45 to 6.66 which is roughly at\nthree percent eps boost purely from reducing\nthe share count uh i have also updated cash\nthe new cash equals 165 billion minus 90\nbillion this is 110 billion so leverage is\nslightly worse than dev reduction scenario\nfor stakeholders i use a share count to than\nany ownership percentage for example breaking\nsure six percent turns into a slightly\nlarger percent after the payback because\nthey own the same number of shares but so the\ntotal shares decrease a retail investor with\n100 shares also owns a slightly larger\nfraction of the company but didn't get too many\ncash in the scenario there's third so special\ndividend scenario Here, I model a 6-per\n-cash dividend roughly matching the same\norder of magnitude of cash. Dividend costs\nequal 6 times 15.5 billion shares. Cash\nincreased by the amount. Shares stay the\nsame. EPS doesn't automatically improve\nfrom fewer shares. Economically, the\nexisting shares get unlimited cash for\nthe pocket. But the stock price should drop\nroughly by dividing amount of an existing\ndivided date. The total wealth is\nsimilar, but former value is different.\nCash versus now. For so. Here I assume Apple\nuses $90 billion to pay down. It's\n$110 of debt. New debt is $110 billion\nminus $90 billion. So, leverage and EFOR\nrisk get dropped a lot, which clearly\nbenefits bondholders and improves Apple's credit\nprofile. Equity holders in this scenario doesn't\nseem to intimidate EPS bonds from fewer\nshares, but they benefit from a least\nrisky capital structure and a low interest\nexpense in the long run. uh finally i\ngenerate a simple chart comparing\neps across scenarios in an\noptional bar to eps eps the visual helps\nme tell the story clearly pay back higher\neps and similar leverages so to violate in\nthe validation set i check both the numbers\nand the logic of my analyze on the\nquantitative side i confirm the total cash use in\neach scenario is close to 90 billion On the\nconsumption side, I violate the model\nagainst finance theory. The payback rises EPS\nmanually through a mechanical shares count\nreduction, not because the underlying\nbusiness only improves. This lineups with the\nidea that payback can create value per share\nonly if the stock is repurchased or below\nthe intrinsic value. I also sent a check\nthat bondholders preferred the debt\nreduction scenario. This step gives me\nthe confidence that the model is\nconsistent with the capital structure,\nagency, and signal theories from the\ncourts. so that evolve in the evolve\nstage uh the model suggests that the\n90 billion payback models that\nincrease eps and slightly increase\nownership consideration for\nexisting stakeholders a creative value for\nif apple believes the stockholder is limited\nor below and sexy value if good investment\nopportunities are limited Combining these\ninvolving you with a balance policy might\nbe an optional. The key is discipline,\nbut the payback in stock is justified\nby a violation, not just to manage\nthe EPS and keep enough flexibility\nfor future moves. And then Reflect\nis finally in the Reflect stage.\nI summarize my recommendations and\nwhat I've learned. My recommendation is\nto manage management beliefs that shares\nare responsible in value for\nundervalue related to interactive value.\nThe company still keeps enough cash\nand debt capacity to fund high RIS\nand IIBR investment. The company structure\nremains conservative enough to justify\nbondholders and protect Apple's long-term flexibility."
}