{
  "student_name": "Adisyn Nichols",
  "org_defined_id": "037075344",
  "username": "nicho307",
  "email": "",
  "transcript": "Hi, I'm Madison Nichols. This is my session N assignment. So, the goal of this assignment is to calculate the weighted average cost of capital for Netflix in this hypothetical scenario, evaluate the impact of additional debt financing, assess different discount rates, and compare their cost of capital to similar companies. So, starting out with define and discover, we're going to go over the parameters that were given. So, for Netflix, market capitalization is 200 billion. They have 14 billion in debt. um which is their book value. Their debt with the market value is 13 billion. They have an equity beta of 1.3% which measures their volatility in relation to the market. They have bond rating of BBB plus with a 5.8% yield corporate tax rate of 21% and the current stock price of 450. So in these market conditions we're looking at the risk free rate is 4.5% the market risk premium is 5.5% media industry weighted average cost capital range is 8 to 10%. And then strategically um looking at other companies similar Disney capital structure has 70% equity 30% debt with an 8.2% 2% weighted average cost to capital. Amazon Prime uses the Amazon corporate with the 9.5%. And then Netflix is also considering 3 billion additional debt issuance for content investment, which is also what we're going to analyze with that decision. Um, so moving on to the represent part, there are a couple things the assignment says that we want to be able to understand. So first, the weighted average cost of capital. The formula for that is going to be the the market value of equity divided by the total value of the market value of equity and the market value of the debt times the cost of equity plus market value of the debt divided by the same thing times the pre-tax cost of debt times 1 minus the corporate tax rate. So what this does, it measures the average rate of return a company is expected to pay its equity shareholders and the debt lenders to finance its assets. Then moving on, cost of equity, which is also the CAPM formula for this is risk-free rate plus beta times the market risk premium. So what this does is it calculates the return required to compensate for the risk of holding stock in um someone who's buying the stock's eyes. So it determines how expensive Netflix's equity is which goes into the weighted average capital cost. Um and cost of debt is the effective rate a company pays on its current debt. So we also want to understand capital structure analysis. So companies can have a mix of debt and equity financing and we need to consider the trade-off between the two. So for debt um you have the benefit of the tax shield but you also risk defaulting on your loans. Whereas for um equity financing you don't have as much of the risk of defaulting on the loans um and you don't necessarily owe this kind of debt but you do have to pay things like dividends and stuff. Um so there's some trade-offs between the two. The tax shield effect is that interest payments are often taxdeductible. So on the debt and then that in turn reduces the amount of taxable income for the company. And then the weighted average cost of capital as the hurdle rate. The hurdle rate is the minimum rate of return a project needs to be deemed acceptable. Um sometimes we look for break even. Sometimes we want a profit. So we do want the return to be greater than the weighted average cost of capital in order to get that profit instead of just breaking even or even losing money on the project. Um, so moving into the implement portion, I have this Python code here. So our first part is going to be calculating the current cost of equity, which is the risk-free rate plus the beta times market risk premium. Um, we end up getting 11.65% for the current one for Netflix. Current cost of debt, um, that ends up being for the after tax cost of debt, bond yield times 1 minus the corporate tax rate. Um so then for Netflix we get 4.58%. And then we're also going to determine the current capital structure. Um so that's going to do this in the code using the different um things we've already calculated in some of the parameters laid out. So again we were given the market value of equity and debt and the market value of capital which ends up being the equity plus debt. Um so we get 213 billion for that. And then the weight ends up being 93.9% equity and 6.1% debt. So calculating the current weighted average cost of capital um we use that formula we went over and this output gives us 11.22%. And then one thing that we wanted to explore that was laid out in the discover portion was this hypothetical 3 mill 3 billion debt issuance. So we want to see what the weighted average cost of capital ends up being after that because that's going to be an important factor in the decision. Um so this will calculate the same thing as before and just give us a different output. So now we have a new market value of debt. Um so then our total capital ends up being 216 billion. We end up increasing our weight of debt to 7.41% and in turn the new weight of equity goes down a little bit. Um and then our weighted average cost of capital after that is 11.13%. So compared to the 11.22% to 2% we see a lower weighted average cost of capital and we'll go over what that means for the decision once we get a little further through. Um so the next part of this code compare the weighted average cost of capital to industry peers. We are given those for the other industries. Um and what we see is that Netflix has a higher weighted average cost of capital than Disney and Amazon Prime videos. So, one of the things for this um is that Disney has physical holdings and so does Amazon cuz it says we're using the Amazon corporate. So, um we see that Netflix is investing in content. They don't have these physical holdings. So, that impacts their debt to equity ratio and how they determine to finance. Um and so that's could be a reason for the weighted average cost capital and why they have different blends. Um so then we wanted to visualize the weighted average cost capital sensitivity to leverage. Um so this will create a plot and so as we increase our percent of debt compared to equity we see a lower weighted average cost capital. So that means that we need a lower rate of return to go over that. That is our hurdle rate. So we would need a lower rate of return to go over the hurdle rate. Um so in turn it's like easier to make a profit. Um but with this we also do have to consider what is optimal for Netflix. So a couple things I want to go over before that is um with the two different decisions. So for the 3 billion debt issuance, that would be optimal to take on because it lowers that weighted average cost of capital, which means our hurdle rate has to be lower than it did before um to make that profit. So recommending an optimal capital structure. Again, like I said earlier, Netflix is pretty much purely media. So when we look at these things, we have to take in cons into into consideration the fact that they don't have physical holdings. So if they default on their debt, they um don't have those physical things to go back to. Like Disney has theme parks and Amazon uses their Amazon corporation weighted average cost. So they have, you know, all their stock and everything they have. Um so that's something we need to consider when looking at this. So with this the 3 billion debt issuance does decrease the weighted average cost of capital and we didn't see a drastic change in the debt um the different weights. So we go from 92.59% as the new one um from the previous of 93.9. So we don't see a drastic change in that which is why I also believe this debt issuance would be okay. Um and it would also decrease our weighted average cost capital. Um but when we do look at these peer comparisons, we do have to consider how they differ as companies. So um with Netflix, they could um consider increasing their debt ratio compared to their equity because again we see in this graph the weighted average cost to capital sensitivity to leverage. The more debt to capital ratio we have, the lower the weighted average cost of capital is, which again means a lower hurdle rate, which means we need less return to um make a profit. Um but again, we need to consider their business structure. So it's definitely not optimal as it is now, but that doesn't mean going to 50% debt. Um it still needs to monitor how it impacts the company and how they perform. So that would be kind of subsequential analysis as they move towards it. It's not really a decision you can make right now with an exact percent. It just depends on how that kind of works out for them, especially since media is more of a volatile industry and we don't know what they're going to release. They could release something that totally flops um or they could release something that does super well. So the goals from this portion were to calculate Netflix's current weighted average cost capital which was 11.22%. And then the weighted average cost of capital after the debt issuance which is 11.13%. And then another goal was to evaluate project specific weighted average cost of capital which is the US content versus international content. Um while we weren't given any specific parameters for international content um we have to consider that international projects will have a different weighted average cost capital. Netflix is again a media companies. Um other countries have they might have censorship laws. They have different corporate tax rates regulations. So, you know, when they form when they film physical media, it could depend on like how they have to pay the actors and things like that based on that country's kind of tax rates and their regulations for working with. Um, and these will all affect the weighted average cost of capital formula. So, we do need to consider when things are domestic versus versus international for this company. Moving on to the validate portion, I decided to search what their actual weighted average cost of capital is. Um, and then looking at this, it doesn't compare as similarly. So, according to this, um, the cost of equity would be 6.5 to 9.4%. The cost of debt would be 4.5 to 4.7% and then the way to average cost capital would be 6.4 to 9.3%. Um looking at what we calculated in here with so the cost of equity and then the after tax cost of debt. We do see a similar after tax cost of debt to this that does fall within the range. The cost of equity is above this range and so is um our current weighted average cost of capital. Um, but then again, this website also says that their current price is $110, while in this assignment, we are given that the current stock price is $450. So that could explain some of the differences. Um, and again, ours is purely hypothetical, so it's a little harder to validate it against what's actually happening in the market, but we do see pretty similar. And again, we see a very different beta than we're given. we're given one of I believe 1.3 and these ones don't exceed one. Um so that's just something to consider. Um it doesn't appear to closely reflect reality and then recommending the optimal capital structure strategy. That is what we did in um the implement portion. So again, looking at increasing that debt financing because it will give us a lower weighted average cost of capital, but not doing that too since again we don't have these physical things. Netflix is a media company, so it's hard to leverage that debt um if you were to default on it. For the Evolve portion, I considered that how we compare it to Disney. So again, one of the main things was to look at Disney's um capital structure versus Netflix's. So our current capital structure for Netflix is 8.2%. Oh, sorry, that's the way average cost capital. Um n or 93.9% equity and 6.1% debt. Um which is vastly different than Disney's. They're 70% equity and 30% debt. But again, they can do this because they have these things like theme parks. They have a lot of physical holdings that um they can secure the debt against. Netflix doesn't. They are mostly media. So that is why it's different and why Disney's capital structure wouldn't necessarily work for Netflix's. While Netflix does need to look at taking on more debt financing, it should be nowhere near 30%. Um considering the reflect portion, I thought this was an interesting assignment. I didn't really consider how having a media company would affect your capital structure because um through doing this I realized that again with just the media it's hard to leverage that debt against physical holdings and like secure it. Um, so I did think that was an interesting part of this assignment. But again, just to reiterate, our goal was to calculate the weighted average cost of capital for Netflix and also make a decision on that debt issuance. And so what we did decide was that it would be beneficial to take on that debt issuance and then also looking forward to investigate taking on more debt and seeing how that affects the company. Thank you.",
  "video_url": "https://youtu.be/Ql0FIHo37mE"
}