{
  "student_name": "Jacob Youngworth",
  "org_defined_id": "035845246",
  "username": "jyoungwo",
  "video_url": "https://youtu.be/NbUVbQ3ooOs",
  "transcript": "Hi everybody, my name is Jacob and today we're going to be walking through my session 11 assignment which covers corporate decision-making um in Apple's share repurchase. So we're going to work through using the driver framework to analyze the optimal use of Apple's proposed $90 billion capital allocation. We're going to structure this evaluation using the driver framework, ensuring that we're following through of all of the steps and making a transparent decision-making process. So here's just a little bit of an overview of the assignment, but let's jump straight into the actual project. Starting with the define and discover stage, our core problem statement and objective, what are we trying to do throughout this problem? Is to evaluate Apple's proposed $90 billion share repurchase over the one year. Our primary decision is to simply determine whether a buyback, a stock buyback creates more sustainable shareholder value relative to four specific alternatives or not. That'd be a $6 special dividend, strategic AI and VR acquisitions, a debt reduction, and then incremental research and development. So, let's look a little bit specifically into the information that we are given throughout this problem. We're given that cash and investments are liquidity throughout this problem is $165 billion of cash. So, that's the amount of money that Apple has in cash or cash equivalents that they can use. And it generates hundred billion in annual free cash flow, which is important to look at. The market context includes a $185 share price and a 30 time a 30x P * E ratio on 15.5 billion 15.5 billion initial shares that are outstanding at the outset of this problem. And then also important the balance sheet includes $110 billion of outstanding debt which has to be considered against the 90 $90 billion buyback that we're looking at. Lastly in this stage we want to look a little bit at the decision criteria. What are we actually going to look at to figure out if this situation and if the buyback makes sense? First is going to be value maximization. We're going to test if the alternatives achieve a superior net present value, which requires prioritizing options where the ROIC exceeds the cost of capital. We're going to look at shareholder benefit. We're going to maximize earnings per share and ROIC. We're also going to look at financial health. We want to maintain strong metrics with solveny and also manage risk at the same time. And then government governance. We want to seek to minimize conflict between management and the stakeholders and also ensure that everybody's interests are at heart. Now, getting a lot of the basis out of the way, we're going to move into the represent stage where we're going to look at everything and kind of build out our analytical blueprint for what we're going to be solving throughout this problem. First is a flowchart that I built out to kind of showcase what we're going to be doing. We already went through the define and the discover gauge, which is just defining our key metrics and our questions. Now, we're in the representation. We're going to look at the financial formulas and kind of break down our analysis journey. Then we're going to go into the implementation and the validation stages. We're going to build our model and calculate our values all using Google Collab. Then get into some sensitivity analysis. Finally comparing all our results and then finally assess it and then review the overall process and give our specific recommendations in the represent stage as well. I wanted to break down some key inputs for this situation. The first one right over here is our baseline net income of $95.58 billion. This isn't a direct given value, but it's actually derived directly from the assignments given market data. We multiply the $185 share price by the 15.5 billion shares that are outstanding to get market capitalization and then divide that by that 30x PE ratio. That's our necessary starting point for helping to calculate our earnings per share baseline. The next is going to be shares repurchase. This is also important. That's another one that we calculated to be 4.86 or 486 billion. It's simply the $90 billion proposed buyback divided by the $185 share price. This figure kind of informs the denominator of our earnings per share formula for the buyback scenario. And then the last few things, a corporate tax rate and the cost of debt. We're going to define a corporate tax rate of about 15% and a cost of debt of 3%. These are just important to help accurately model after tax interest savings and us to not overestimate the benefit of debt reductions. Finally, before we move into our implementation side of things, I want to look specifically at three financial formulas that are important for this analysis and for this model. The first one is the calculation model for new earnings per share. If we look right on the screen right over here, the numerator is our baseline net income plus any changes in income resulting from the scenario such as interest savings or an R&D expense. And then on the bottom, the denominator is the initial shares outstanding minus any shares that are repurchased. It's the primary driver um of the agency conflict narrative as management compensation is often tied to earnings per share growth. It's important to look at that. The next one is our after tax interest savings ratio. This calculates the precise price ice incremental net income gain realized by reducing debt which factors in the loss tax shield which is always important. Delta D the first one over there is going to be that change in debt. RD is going to be our assumed 3% cost of debt. And then that term 1 minus t is a key component where t is that 15% tax rate. It adjusts the gross interest savings um recognizing the tax shield that Apple forfeits by paying down on their debt. So it's always important to look at that. Then the last one is the new debt ebita ratio. It's the key solveny metric for our bond holders. The numerator is net debt. Initial debt minus debt paid down minus the new cash balance. Then finally the denominator is the assumed earnings before in earnings before interest taxes depreciation and amortization. It directly drives the financial health and the bond holders preference as low or negative ratio signifies lower financial risk. That pretty much gets all of our representation and define and discover stage out of the way. Now let's jump straight into our actual code. We're going to be solving this problem out and actually coming to an answer of what is the best scenario for Apple to participate in. So let's go all the way right up to the top. The biggest thing with the model is I wanted it to be simple. So the first thing is we wanted to pull all of the key inputs and assumptions, all the parameters into the model itself and build in some data analysis software. So we have our financial formulas right here as well which put everything in. It's commented which makes it super easy. So in the implement stage here, it's going to be simply calculating and using the financial formulas building out in each of the six scenarios that we're having, which is a status quo, which is doing nothing, the buyback, um, and then our four alternatives that we were supposed to and that we are going to work through throughout this problem. And then it's consolidated it, built it out into a nice chart for everybody to look at super easily. So this is really our implementation stage right over here. We're going to execute the model in the blueprint and generate the quantifiable results throughout these six scenarios. Our goal in this stage is really to look at initial analysis, figure out the immediate trade-offs that are hidden within all of these numbers, and use that for a more advanced stages that we can go to in a little bit into the future. Before we jump right into the full table down at the bottom, we want to look right over here at the precision check for the debt reduction alternative. We must account for the loss tax shield. Our calculations right here show that we save $2.7 billion in gross interest expense annually, but we're going to forfeit about $44 billion in tax benefits. So that net incremental net income gain is therefore $2.3 billion annually. It's a key proof point in our model's accuracy and it makes sure that everything throughout this problem is a solution and helps to prove everything right over there. Now let's look at the baseline of the buyback versus everything else. We're going to look right over here at the new earnings per share metric right in the middle. The immediate profitability margins are clear right over there. Our baseline earnings per share, as in if we do absolutely nothing, don't do the buyback or don't consider any of the other options. Our earnings per share is $6.17 per share. The share buyback yields the maximum immediate immediate accession at 6.37 right over here, which is a point which is a 3.24% 24% increase from before. It's achieved simply by reducing the share count denominator, the number of shares that are available. The debt reduction alternative, if you look at it right over here, is also pretty close into it, yielding $6.31, which is a 2.27% increase, which that's achieved by raising the overall net income throughout the situation. The earnings per share boost directly translates into ownership accretion. The buyback is the only scenario in this situation that increases the proportional stake for non-tendering shareholders like Berkshire Hathaway which yields a point a 3.24% increase in their effective ownership percentage. It validates the buyback is actually a clear mechanism for value transfer to loyal shareholders. So it shows that Apple actually cares about their shareholders. Their shares in internally are going to actually be worth just a little bit more money. They're going to earn a little bit more even though there's less shares out in the market overall. an individual share is going to be worth and going to be earning just a little bit more which is interesting to look at. Now let's look a little bit into leverage. The earnings per share comparison actually hides the critical financial health trade-off which is why we have to look at the net debt over earnings before income tax in or interest taxes depreciation amortization ratio which is going to be right over here. It's a number between 1 and -1. The status quo starts off with a ratio of.423. That simply means that Apple holds more cash than debt and that is the true case which we saw in the beginning. They had a very liquid asset base where as opposed to very minimal debt and you can see that from that number. The share buyback option consumes $90 billion of cash almost half of what Apple has without actually reducing any of the debt which pushes Apple's ratio up to.269 on the positive side changing their status to net debt. It rages the financial risk profile as you always want to have more cash than debt in a sense because cash is something that you can use. Debt is something that you're owing to different individuals. And as well, it's actually interesting to look at the debt reduction ratio. It maintains that lowrisk net position at.423, which maximizes the financial stability and satisfies the needs of bond holders and shareholders. And then finally, the last thing we're going to look at is R&D acquisition through strategic initiatives. Right over here, based our assumption of a year 1 $10 billion expense for research and development or an acquisition, both scenarios result in an earnings per share of just $5.52,\nwhich represents a severe 10.5% dilution. It validates the high cost of committing to long-term value creation. And while these are only options to fundamentally improve the business, the execution carries a high risk and high short-term penalty to profitability. So it's always important to think about that when you are looking into specific situations and when you are choosing alternatives. That's all we have for the implementation side of things. Now let's jump right into the validation side of things. In the validation stage, we're going to look at the numerical data and kind of interpret it from the implementation side of things and score it against the decision criteria that we established in the beginning. I set it up in a chart to make it very very easy to understand. It validates the model's output overall and sets the foundations for our final recommendations that we're going to start with. We're going to look first with the financial trade-off. Our analysis assigns a score between 1 and -1 for each of the options. The first one is value maximization, which is very, very important. The share buyback scores the maximum in this situation because it's 3.24% 24% earnings per share increase is the highest short-term return for any of the scenarios. Debt reduction also scores a.5 in the situation because it has net income growth which helps to produce value. Over here we're going to look at financial health also known as leverage. This is where we're going to come into a little bit of conflict with the situation. Debt reduction is actually the only one that's going to score the maximum points. Going to score one because it preserves the net cash position position that.423 ratio. The buyback, if you look at it at the top, actually scores a negative one because it shifts the company to a risky position of more debt than more cash. So that's always important to look at when we're building this final analysis out. We're going to use that in our answer, which directly validates the central conflict. The buyback is the best option for profitability, but it's the worst for solveny and risk management. This forces a strategic choice. We have to look at them short-term and long-term to figure out which one is actually the best. Now, we're going to look at our other different scores over here. We also scored it based on agency theory um through governance and strategic commitment really to look at a higher score and a lower score to figure out which one really is best. The buyback for governance scores a negative one because it's earnings per share maximize structure directly benefits executives through the compensation and also provides a 3.24% ownership accretion to large investors. It increases agency risk because it's not going to be a great situation for shareholders and everybody else because the executives are going to benefit the most through this. The debt reduction and strategic scenarios actually score higher because they prioritize balance sheet strength and long-term growth which minimizes the overall conflict. And then finally, we scored based on the highest potential for value creation. The R&D investment as well as acquisition scenarios score the highest because they represent the only path to drive higher future growth earnings and a strategic commitment to future growth and they justify the company's premium stock multiplier. The buyback and the debt reduction as well score about a negative.5 because they're focused on more value transfer rather than value creation in the long run which is always important to look at. Um and then finally we're going to look at it all together. We see right here that the buyback has a score of -1.5, which is actually the lowest. The debt reduction option is the most balanced choice, achieving the highest score of 2.0. And the strategic alternatives score a zero right over there. Pretty much they're going to be breaking even the R&D investment as well as the acquisition. Now, this validation stage really confirms that the buyback is not the best immediate scenario. In the short run, it actually does a good job because it's going to be financially winning in the short run, but in the long run, it's going to have negative impacts on the financial health of the company as well as the relationships between the shareholders and the executives. So, it's important to find that balance right in the middle. And that's exactly where the evolved stage comes in. We're going to slide down right over here to where we built out everything within this evolve stage. Having already value validated that debt reduction is the highest scoring pure option. This stage is critical for just kind of understanding that and looking a little bit more into sensitivity analysis and everything right over there. The R&D and acquisition options are currently unacceptable because they incur that dilution of -10.51%. We can actually use sensitivity analysis to quantify the minimum performance required to overcome that cost. Our ROIC hurdle rate. We calculated that the $90 billion strategic investment has to generate $7.77 billion in additional net income annually just to break even on earnings per share. So it's really hard to do that which translates to a minimum required after tax ROIC hurdle rate of 8.63%. So pretty much what does that mean in a short term in a overarching standpoint? If an R&D project can't credibly forecast an annual ROIC above 8.63% 63% then we shouldn't fund it because the buyback or the debt reduction scenarios provide a guaranteed superior return with less risk overall. Now through our overall scenario through our validation it's shown that the optimal strategy actually is to balance financial stability debt reduction as well as future growth. So I proposed a blended scenario of that $90 billion with half to debt reduction and half to research and development. This blended approach actually yields the highly favorable results. In regards to net income, the accretion from $45 billion debt reduction almost perfectly offsets the dilution from research and development. Our new earnings per share is $6. It's a small manageable dilution of -2.75%. But that's a major improvement from that -10% hit of the pure R&D scenario. And then leverage is always important. The debt reduction component preserves financial health. um a low net debt ratio and it's always important to look at that as well. Now, we're going to look at the bottom right over here. We built everything out in a chart to make it very very easy to look at. The pure buyback delivers a 3.244% earnings per share gain, but it pushes the company into a risk heavy scenario with more debt at 269%. That blended scenario right over here is going to incur a negative 2.75% earnings per share cost. Yet, it eliminates the leverage risk, leaving us at a 0.054 near cash position. The trade-off is clear. Simply put, we're going to sacrifice about a 6% swing in earnings per share performance in exchange for funding $45 billion of future growth and maintaining a balance sheet that looks good for shareholders as well as specific executives. Now, this isn't a specific scenario and it's not a specific recommendation, but it overall helps to look at everything overall and build that recommendation out in a final summary that ties everything back together in an easy to read and easy to understand format. So, now we're in the last stage of the driver framework, which is to reflect. We're going to look at everything one more time, kind of talk about the scenario and everything that came out from it. So we based on the qualitative and quantitative analysis from this thing and also through our scoring metrics we recommend the adoption of a blended scenario 50% allocated to debt reduction and 50% towards research and development under one specific condition. The strategic $45 billion research and development portion is conditional. It has to clear that after tax ROIC hurdle rate in order for it to be senseworthy. Now, we're going to look a little bit into the justification. Why does this make sense? Our analysis overall proves that this is the optimal path because it balances trade-offs, which is always important to look at. We choose discipline over short-term gain. Our earnings per share impact. We talked about that earlier. It has a negative 2.75% dilution, an earnings per share of $6. We're sacrificing that minimal gain of the pure buyback, but the cost is acceptable. Leverage is really where it shines. we're going to be at a near net cash health and avoid that severe net debt position of the buyback because we're balancing it out with that research and development as well. This decision is fundamentally focused on value creation. The pure buyback is an exercise in value transfer. You're just moving the value around shifting the capital structure without actually generating income direct generating long-term earnings. We're funding research and development. We're actually affirming our commitment towards value creation, justifying the premium market multiplier through future growth that's going to come out through a pass. It also mitigates agency conflict by failing to minimize the short-term earnings per share metric. We signal that executive compensation is not the primary driver within this scenario. The high governance score as well confirms that we prioritize stability for bond holders as well as executives and a discipline strategy for institutional stakeholder stakeholders in this situation. And then finally, last but not least, we address the market perception. Implementing that 8.63% ROIC hurdle sends the strong signal of we need to make sure that we are investing in growth capital more for the growth opportunities and not just out of the desperation of it. We're only going to invest in projects that are mathematically proven to deliver superior returns which are higher than any other scenario. Overall, this blended scenario throughout this problem really ties in everything together. It's the most financially responsible formula and it also has a strategically sound path forward. It's the only option which delivers that growth without compromising financial integrity overall. That's all I have for this problem. That's all I have for this situation. Thank you again."
}