{
  "student_name": "Harry White",
  "org_defined_id": "037593398",
  "username": "white977",
  "email": "",
  "transcript": "Hello, I'm Harry White and today I will be going over my session 8 assignment. Uh for our session 8 assignment, we're to investigate Marsh market efficiency using the GameStop uh the short squeeze of 2020 and 2021. uh we had to verify the accuracy of the data stated facts we got all the different things and analyze price behavior relative to EMH which is the efficient market hypothesis predictions and evaluate whether market anomy uh sorry market anomalies constitute evidence against market efficiency. So basically for our critical first step and for the define and discover of this was to first identify and verify the facts that we were provided. So, we're provided with a statement GameStop traded at 4 cents in August 2020. This is not correct. So, if you come over here, I have the data pulled up from August 2020. Uh, you can see it right here. This is the open, close, and the high and low, all the adjusted closing, all the things you need to know. And it was never at 4 cents per share in the month of August in 2020. floated around a dollar in between a dollar and$2 dollars for the whole month and never reached under a dollar let alone four cents. So we realize that statement is false and if it is incorrect they wanted us to document the accurate figures which we saw here which is floated around 120 150ish around there um and determine the appropriate communication approach for correcting the professor. So my communication to the presser would be while the data provided is incorrect, it can be noted that G uh GameStop or GME was near bankruptcy level in August 2020. That is a true fact. Um not only did the pandemic harm them, but from 2013 to 2019. Their stock dropped very very low. um and they were seen as a failing business in the eyes of many which did cause the short squeeze because of how many investors sold short on the stock because of its failing nature. So going back into the communications to the professor beta must be corrected because the difference between 4 cents and the actual price floating around a$1 and2 is a huge difference. Um but no one can understand how this mistake was made. So, while it was a failing business and a stock shared at 4 cents is likely not a do a business doing the best, um, I would communicate to the professor that this is something we need to fix and it's something that must be known because a stock like GameStop that peaked at $483 in 2021, uh, saying that it was originally shared at 4 cents in the month of August 2020 can lead many astray. So, our goal basically, which I went over before, is measure the market efficiency using GameStop short squeeze. Uh, short squeeze. The definition is when a stock shoots up in price and investors who sold short have to buy the stock in order to limit their financial loss. When an investor uh sells or uh sells a stock short, basically what that means is they're betting on the stock to price to drop. They buy it at five bucks. Basically, what they're doing is they're taking the stock from whoever the company itself and then they will give it back once it reaches a a different price. So, if you invest $10,000 and the stock goes down, you know, 5%, you're making a profit off that because you're buying it at five bucks and then you're selling it back to them. Sorry, you're buying the stock um and betting on its failure. So that is a big thing that happened with GameStop but we will go into that for my represent um we were given all the timeline and key data points and we found that all of these are true by doing research. I used an article and did my research over Yahoo Finance. Um they were near bankruptcy level in August 2020. Uh Ryan Cohen did invest and take a 10 uh eventually it ended at I believe a 12.9% stake in the company. That is true. He did promise a company turnaround. He saw company that could be successful with uh better leadership. Uh in January 2021, Reddit uh r/wall street bets drive the price search to $483. That is true. You can see that right over here. Um if I can find it. Uh well, yep, right here. So, you can see that. And then you come back over here and uh yeah, February 2021 congressional hearings on market manipulation is true. They wanted to make sure that no laws were broken and no illegal insider trading was happening. So all information provided is true excluding the fact that the stock was being traded at 4 cents. I utilized uh Yahoo Finance along with other research and articles to confirm the information we have provided for my implement. I wanted to just quickly go over the three kinds of EMH in the market efficiency testing. So weak form violation. Uh in this situation it is being violated. Uh the short interest at 140% of float is public information. Um sorry I don't know why I clicked that. Um and one who was aware this would have to would be able to predict the stock boom. It follows patterns of previous events and the large quantity investors selling short points in the direction of an an inevitable short squeeze. So yes, the weak form was violated in this situation for semi- strong violation. This was also violated. The peak stock price of $483 does not reflect public information in the company itself, but rather the circumstances it was in. What I mean by that is the company was not evaluated. It was not worth $483 a share, but rather people saw their opportunity and they pumped money into it because they knew they could make money out of it. Strong form violation. I did not see a strong form violation present in the scenario because uh it did not include illegal insider trading. All the info that the people on Reddit got was public information. While communication over Reddit led to the stocks boom, illegal knowledge was not utilized. and we can go on to my Python analysis. So basically I wanted to see the financial health of GME and ask the code to analyze it for me in 2020 leading up to 2021 and its eventual boom. So as you can see this is the data from 2019 2020 and 2021. I was very interested in 2019 to 2020 and also 2020 to 2021 because the pandemic had such a large effect on most companies, GameStop included, uh especially an in in-person company that sells things in person were bound to fail during the pandemic due to the increase in online platforms like Amazon. So, as you can see, it has their net sales, net income, the e e uh sorry, e-commerce sales, the total cash equivalents at the end of the year, and the long-term debts they had. You can see how in 2020 they were not doing well at all. Um, you can see the analysis of their financial health revenue dropped significantly in 2020 um to $59 million, but rebounded in 2021. um the net income it was deeply uh unprofitable in both years. Even though the company boomed and their profit increased um they were not seen as a valuable company um and the net loss widened in 2021. So the balance sheet strength um the primary change was a massive increase in cash from 2020 to 2021 due to the increase in investments um and yeah and source of cash and debt. It brought me this chart. The conclusion it came to was from a fundamental perspective, GameStop's financial health was poor in 2020 and remained poor in 2021, which shows that this stock was highly invested in not due to company strength and people seeing a chance for this company to turn around and make money in the future. It was only because so many people uh sold it short and they saw that they could make a short squeeze out of it. So yeah, this is shows their net sales which was down in 2020 and then their total cash and equivalence at the end of the year. Um so yeah for that is what I had for implement for validate I wanted to verify the information that my Google collab code gave me. So I used GME uh this I used market watch to go over their data from 2021 and I wanted to see if it lined up which it did. I did this before and you can see their net income before Extraordinaries was very low. They were losing $215 million shows the company was not in a great spot. As you can see all this red and everything they have, they were not looking good, which proves my point further that the investment in GameStop was not due to company strength for Evolve. Um, kind of just going over what I've already said, GME's boom in 2021 was not due to promising results from the company, but rather due to the fact of large amounts of short selling. Uh, another factor was the increase of apps like Robin Hood, investment apps that you can use on your phone, lowered barriers of barriers to entry of investments, and it allowed everybody to pretty easily invest in this. um millions could easily invest in the stock which was another crucial factor in GameStop exploding. Uh another big thing as we talked Reddit was a huge platform used to promote this and one of their main goals was not making money but it was rather harming hedge funds and taking down Wall Street. So a lot of people had animosity. It was co it was the pandemic where you know people affluent people were making a lot of money still and people were not regular people weren't. So a lot of people wanted to take them down. That was a big factor in this occurring too. GameStop is a company that sells video games and anything consoles things relating to online platforms in person. While they do have an online website they were based on fact on in-person stores. And as you can see, even over the last couple years, while we are not in a pandemic anymore, uh, Amazon becoming one of the biggest companies in the world due to the fact that anybody can order something online. So, GameStop's company model was outdated and was unable to compete with new companies like Amazon. Um, and yeah, so they were basically set up for eventual failure. they were unable to compete with online sales, especially during the pandemic. Um, that's all it for my evolve. For my reflection, um, I knew about the GameStop boom in 2021. It was everywhere, all over the news. Um, I even read articles like this where I use this to go over my implementation, my verification, and also my evolve. I wanted to see people's takes on it now that we're four years removed. And this article comes from someone more upset with the GameStop boom and the attack on Wall Street, as you can see, refers to him as a bunch of Reddit geeks. But um it just goes into depth. that talks about apps like Robin Hood making people making it easier for people to invest and talking about how tech companies were not most popular to these people and campaigns against hate speech or misinformation become throttling much wider forms and can challenge authority like people on Wall Street. So, I knew about the boom in 2021, but I never really dived deep into it more. or I didn't really start investing myself until 2023 to 2024. This told me told me how to follow market trends and find market efficiencies and see how they apply. This GameStop event is not a one-off, but it is not go in line with market patterns and it's not, you know, it's not a trademark or a benchmark that you can use for other investments like this. Uh while market inefficiency will always be present as well as insider trading, one can avoid losing money by doing proper research. That's what I learned with this. This made me go deeper into insider trading and illegal knowledge being spread around. I see this often with politicians and while they're only making six figures a year salary-wise, they can have, you know, hundreds of million dollars in their bank accounts. And this showed me and I was very interested. And while I do disagree with politicians making that much money due to their insider trading knowledge and them breaking the law, um I can also see the other side and see how, you know, an attack on Wall Street is not the best thing for our economy. Um but yeah, this taught me a lot. Stock market can make a lot of people money. You can lose people a lot of money. But if you do your research, you are more likely to make money if you are smart with it. So investments are not always about believing in a company or thinking that they will have success, but rather it can involve personal conflict in one's personal beliefs and them spending their own money to take down systematic issues that they believe against. So yeah, I learned a lot from this lesson. Thank you very much.",
  "video_url": "https://youtu.be/-s9jJIZvSvE"
}