{
  "student_name": "Christine Shong",
  "org_defined_id": "036250202",
  "username": "shongc",
  "email": "",
  "transcript": "Hello, my name is Christine Xiong and this is my session 9 assignment. We'll begin with the define and discover. So our project mission is to calculate the weighted average cost of capital walk, WACC, for Netflix to evaluate a hypothetical $5 billion content investment and analyze the impact of different financing strategies. Some of our core analytical questions are these five. Number one being was Netflix's current walk? 2. What will Netflix's walk be after issuing an additional $3 billion in debt? 3. Should Netflix use a single-firm -wide walk or project -specific walk for different types of content, for example, U.S. versus international? 4. How does Netflix's walk compare to its competitor, like Disney? What drives their differences? And last but not least, 5. What is the recommended optimal capital structure and financing strategy for the new investment? So now that we have these core questions, these are the given data to us. First, we have Netflix, which is the NFLX market capitalization, or in parentheses E, $200 billion, a total debt market value, which is D, $13 million, equity beta, 1.3, with a pre-tax cost of debt, RD, of 5 .8%. and corporate tax rate of T21%. And the market conditions are risk-free rate of 4.5% or market risk premium MRP of 5.5%. And then we have a peer slash industry data. The media industry walk ranges from 8% to 10%. And Disney DIS is 70% market capitalization with 30% total debt market value. And the walk of 8.2 % for Disney. Amazon uses corporate walk of 9.5%. Our scenarios consist of new investment of $5 billion and potential new debt of $3 billion. Now, moving on to the represent stage, now that we have our foundation of the discover and driver of the data that we have, for the framework, our analysis will be built on the foundational formulas of corporate finance. And so, I came up with three different scenarios with three different codes. So, the first one being the current Netflix walk calculation, and then it will be the scenarios of the logs in the implement stage, and then our finalized model of the dynamic model, which we'll get to in a bit. um so um we have three scenarios of current walk calculation a scenario to walk after three billion dollar debt issuance and then our last scenario is the other analysis plan of project specific walk and evolve and peer comparison and validate and sensitivity analysis and implement and then we'll give a final recommendation and reflect um For the CARA -WALK calculation, we can see here, these are the given data from the textbook, as we see, the given data, the beta, market value, 13 billion, and all that, and the risk-free rate, a 4.5% 10-year treasury, 4.5% gives you all that data. And then stage 2 is to calculate walk components from the represent stage. Follow the formulas that are laid out in our plan formula we have RE plus the risk free free rate plus beta times the MRP market risk premium market risk premium is already RM minus the risk free rate um and then you see that all the calculations and then we move on to the calculate after tax of debt which gives you the equation as well the cost of debt um rd times one minus tax rate t um and then prints the formula here as well and then we move on to calculate the capital structure weights and we so that we must use market values not the book value so number one we find a total firm value of v and then find the weights of e and d um e and d which is like what e plus e e plus d is the market value of firm v um e being the market capitalization and then d being the total debt market value and then we see the weights the weights of equity is just e divided by v and then the market cap the market capitalization divided by the total value and then the market value of total debt d divided by the total value of v and then so on so forth and then we these are the given data from the textbook and then from the calculations we've got the cost of equity of RE, CAPM formula, it gives you the formula and the calculations of how they did it. We have the 4.5% in decimal form plus the 1.3% of equity beta times the 5 .5% of the MRP, of the market risk premium. And then from that cost of equity, from that calculation, we get 0.1165 or about 12%, or to be accurate without rounding up, it will be 11.65%. And then calculating after task cost of debt, we have the formula, RD times 1 minus T calculations are 5.8% times, in parentheses, 1 minus 21%, um which gives us in decimal form as well and then it is comes down to 0 .0458 or 0.05 percent rounded but if it's not rounded it would be um 4.58 percent um and then last but not least we have the calculated capital structure weights and the total market value v equals e plus d which is $213 billion. The weight of equity, we see that it's 0.9390 or 94%, 0.94% rounded. And then weight of debt, which is 0.0610 or basically 6%. Check. We add those two together and we get one. Of 94% plus 6%. In our final walk current calculations, we see that equity component of the calculation we just got for the weight of equity times the cost of equity would equal 0.1094. and the depth component of weight of depth times the RD after tax is 0 .0028 and the final result of the current walk is walk equals 0.1094 plus 0.0028 by adding those two together we get 0.1122 or 11% but in this case we'll just say it's 11.22% um yes now moving on we have um the implement stage um implementing um for so we have three different logs so this is log this will cover logs one and two and then this will complete log three um in logs one and two we wrote the initial python script um netflix underscore walk dot py um and then it's essentially all within the same script but updated so i kept it separate um to calculate netflix's current walk 11.21 which we just did i guess is this and then we have log to action added we added um a stage four scenario analysis to model the $3 billion debt issuance, and for that, once we really run the code, after we've calculated that first current Netflix raw calculation, which stands at 11.22%, the next step is to analyze the impact of the proposed $3 billion debt issuance. to do this we've added a new scenario analysis section to our python script this code first adds the 3 billion to the current market value to the current market value of depth giving us a new total depth of like 16 billion dollars um this this in turn increases the total firm value to 216 billion dollars um 216 billion dollars if it then recalculates the capital structure weights you can see the new weights of equity is um see the new total market value is 216 billion and then you can see the new weights of equity is 92.59 percent and the new debt weight uh weight of debt is um 7.41 percent yeah uh but it's in decimal form so 92.59 and then the weight of depth is um 7.41 in decimal form and these are just rounded um for the financial analysis what the results show is that using these new weights um for the new stage of the after three billion dollar depth um the script calculates a new walk our model shows the new walk is 11.12 percent or 13 we see this is essentially a decrease of about 0 .09 percent from the current walk this change is driven by a core principle of finance we are increasing our use of a cheaper source of capital specifically we are replacing a small portion of our expensive equity financing which we calculated has a cost of 11 .65% with more of our cheaper tax advantage debt financing which has an after-tax cost of only 4.5%. This is the tax shield benefit of debt in action. It's lowering our overall hurdle rate and number three is that the events part assumptions and the next steps. Now that this calculation comes with like a critical simplifying assumption which we've documented in our represent stage for this first pass we assume that adding three billion dollars in debt does not change to a company's risk profile we've held the beta 1.3 and the pre-tax of pre-tax of um debt 5.8 constant in reality more debt means more risk this would likely increase our beta making equity riskier and our cost of debt as our bond rating might fall a more advanced analysis which we'll explore in the evolve stage would involve re-levering the beta to find a new um higher equity of um higher equity of uh find a new higher cost of equity this would create an offsetting force and a true walk might be higher than this 11 .12 percent estimate or um 11.13 um but for now we have successfully isolated the impact of the capital structure weight change. And now when we move on, this is basically our implement. At this final stage almost into my implementation, I successfully calculated the current walk and the scenario walk. However, the script is static. To meet the assignment's requirement for like the dynamic capital structure modeling and automation of calculations, I needed to refactor my code, and my solution was to transform the procedural script into a dynamic model by creating a central Python function called CalculateWalk, which we see with the ABC plan that I've listed before, calculating the capital structure weights, and then blah blah blah, and then we see the CalculateFinalWalk. walk and then current walk and the scenario walk and then calculate walk if I oh yes equals calculate walk right here we see that and here you can see the new structure this function calculated walk acts as like a reusable engine. It takes all the key financial inputs like market cap, beta, and cost of depth as parameters. It then performs the entire walk calculation inside and returns the final number. You'll see that in the main part of my script, I now calculate the current walk and the 3 million depth scenario walk by calling this single function. This is cleaner, more professional, and it proves the function is working correctly as it returns the same 11.22 % and 11.12% or 13% we saw earlier from the first two scenarios, calculation of the current and the scenarios one. And the sensitivity analysis, like the payoff. But here is the real payoff. by building this function i can now perform the um i can now perform the required sensitivity analysis with just a few lines of code here in stage five um the sensitivity to equity right here we see um stage five we see in this part um created two simple lists one with a range of betas to test and one with the range of market risk premiums mrp using a for loop the script net automatically calls the calculate underscore walk function repeatedly for each different input the result is this clear automated table we can immediately see the impact one for every 0.1 increase in beta our walk increases by approximately 0.51 for every 0.5 or 50 basis point increase in the market risk premium. Our walk increases by approximately 0.61%. This data or function in general demonstrates a key concept that Netflix's walk is highly sensitive to its systematic risk beta and overall market expectations, the MRP. This directly addresses the integration of finance and technology that is worth 20 points and technical implementation of 10 points grading criteria that was listed in the section 9 assignment textbook. And we see the data right here, final, and then this is basically our final implementation. And now to validate my work and everything, now that my Python model has been implemented, I move to the next step of the driver method, which is validate the V part. The goal here is to cross-check my findings against the real world. My model calculated Netflix's current walk at 11.22%. First, I compare this to the industry benchmark. The assignment gave a media industry walk range of 8% to 10%. My 11.22% is higher than this, which is a logical finding. Logical finding. Netflix's high beta of 1.3, Reflex is volatile, high growth, pure play streaming model, which is riskier than the more diversified stable companies in the industry average. Second, I compare Netflix to its peer, Disney. My calculated walk of 11.21% or 22% is significantly higher than Disney's 8.2%, the key driver for this capital structure. My model shows Netflix is only about 6 % in-depth, while Disney is 30% in-depth. Disney is using its cheaper tax shielded depth to its full advantage, which is dramatically lowering its walk. Netflix is not. And this validation gives me confidence that my data of 11.22 % calculators are not only technically correct, but more importantly, financially logical compared to other industries. and um last but not least we move on to the evolve stage is where i address the limitations on my model and propose more advanced analysis um first i must address the project specific walk it would be a major mistake for netflix to use its single 11.22 walk for every investment um every investment a safe domestic sequel has a very different risk profile than launching a new unproven series in an emerging international market therefore my recommendation is that netflix uses this 11.22 percent as like a baseline um but apply a project specific risk adjustment adjustment adding a premium of like two to three percent for high risk projects and applying a discount for low risk predictable cash flow projects second my three billion depth scenario which i lowered the walk to 11.12 13 made a key simplifying assumption it assumed the beta stayed at 1.3 a more evolved model would relever the beta adding that make equity riskier which will increase the beta the correct next step would be to unlever netflix's beta to find its asset beta and then relever it with the new depth to equity ratio this would find a true walk which would be slightly higher than my 11.12, 13 % estimate and would be the correct way to find the true optimal capital structure. And our last step to the driver method is the R, which is reflect. Finally, at the reflect stage, which is my final strategic recommendation, we have my entire analysis from the Python model to the pure comparison tells one clear story that Netflix's 11.22% walk is too high and it is self-inflicted. The company is dramatically under leveraged financing like 94% of its business with expensive equity when it has the stable recurring revenue of a mature company. My scenario model proved that adding debt lowers the walk. This means netflix is on the wrong side of the optimal capital structure curve therefore my final recommendations are clear and these would be my top two recommendations one for the five billion content investment the proposal to finance three billion with depth is the correct strategic move and to looking long term netflix's management should have a clear strategy to increase its debt to capital ratio to be more in line with peers like disney this will systematically lower its walk, reduce its hurdle rate for new projects, and fulfill the ultimate goal of maximizing shareholder values. Thank you. That's all.",
  "video_url": "https://youtu.be/_mbX5lKUYUk"
}