{
  "student_name": "Jackson Montgomery",
  "org_defined_id": "035961927",
  "username": "montg126",
  "email": "",
  "transcript": "Um this is Jax Montgomery and I'm going to be covering um session 9 section six assignment which is cost of capital analysis. So our assignment overview is basically to calculate the weighted average cost of capital U for Netflix in connection with a hypothetical $5 billion $5 billion content investment decision. Our analysis must determine current WACCC, evaluate the impact of additional debt financing, and assess project project specific versus firmwide discount rates. Um, and compare Netflix's cost of capital to industry peers. So, we have Netflix's financial parameters or market conditions, strategic context, and required analysis. Um, so basically the market capitalization is 200 billion. Total debt for book value is 14 billion versus just market value is 13 billion. Our equity beta is 1.3. Our bond rating yield is 5.8%. Corporate tax rate of 21% and current stock price of 450. Um our market conditions uh risk-f free rate of 4.5% market risk premium 5.5% and media industry WACCC range of 8 to 10%. Um then our strategic context is that Disney capital structure 70% equity 30% dent WACC of 8.2%. Amazon Prime Video uses Amazon corporate which is WACCC of 9.5%. And Netflix considering $3 billion additional debt insurance for content investment. Um so I'm going to be using driver framework uh to cover this assignment and basically that just means the first part of this is to define and discover. Um we want to define the goal that is set which is just to calculate WCC to evaluate a $5 billion content investment decision. Um we need to discover necessary inputs um and prepare prepare them and gather them here. So starting off we have our parameters. Um we have our market value. We have market capitalization as well as total debt market value. We have our risk and cost inputs um previously mentioned. Um and then we have our core WACC calculation functions which will be ran later. So we define them now and run them later. Um calculate cost of equity. Um this is calculates the CIPM. Um we also have calculate after tax cost of debt and this just basically calculates our debt. Um this calculates the after after cost after tax cost of debt um reflecting the tax shield benefit. So our financial concept is cost of debt divided by tax shield effect. And then for cost of equity is cost of equity divided by CAPM. And then we also have our WACC which is um calculates the WACC and capital structure weights. Uh market values versus book values or certain debts. capital structure analysis calculating weights um WACCC formula and this components are both right here. So all three of these um we're using right here we're calculating our cost of equity our cost of debt and then our market values for our market values versus book values. Um and yeah moving on we have a verify. This is basically where we plug everything in all of our numbers all our parameters and we kind of find our solutions to these issues. Um so we implement u we calculate cost components. So scenario one the current WACC we find the current WACC results. Scenario two um WACC after $3 billion debt insurance. We implement that we find new new WACC results. We also calculate WACC change for reporting. Um then we move. So that was implement and moving on to verify. We have the verify stage check. Um this ensures the weights sum to one. This check ensures the structural integrity of WACC calculation. It just rec it just recalculates everything. Make sure it's all correct. Um and then we have our um explain and reflect stage. So our output generation function explain recommend um our form percentage right here generate report one financial input to component component cost we explain that current WACCC calculation we explain that um this is all being printed out down here so I'll cover that right now um yeah So, so some of the calculations we ran were so our cost of equity is 11.65% our act after tax cost of debt is 4.58% our current WACC is 11.22% and our new WACC after the $3 billion debt is at 1 11.13%. Um so having our Netflix cost of capital an analysis um we're going to evaluate hypothetical $5 billion content investment. So our financial inputs and component costs um I mentioned these earlier but the risk-free rate is 4.5%. Market risk premium is 5.5% equity beta 1.3 um our cost of equity which is ice cream over there. Pre-tax cost of debt corporate tax rate and then after tax cost of debt I mentioned that earlier. So for scenario one is the current WACCC calculation. Our market value of equity is 200 billion. Market value of debt 13 billion. Total firm value 213 billion. Equity weight 93.9% and debt weight of 6.1 10%. So Netflix current WACC hurdle rate 11.22%. Um imagine of weighted average cost of capital WACC formula with components and weights. Our scenario two, WACC after three billion debt ins issuance. Um we have our new market value of debt which is 16 billion. Our new total firm value which is 216 million. Um new debt weight of 7.41% and new equity weight of 92.59%. So this is slightly down from the first scenario. And then our new debt weight is steadily up. So our Netflix new WACC is 1.3%. Our walk change is 0.09% which is a reduction. So the modest debt increase reduces WACC slightly. Um demonstrating the tax shield benefit of debt which means it actually works. Um so our strategic analysis recommendations. So we explain everything. This is what we recommend. So project project specific WACCC and firm YWACC the firm YWACCC should only be used for investment with average risk um for a diversified $5 billion content investment risk adjusted rates are required. Low risk projects uh for example US content projects that are less risky than the firm average will be incorrectly rejected if their true cost of capital is below 11.2% 1% but above the project's true hurdle rate. Um high-risisk projects such as international content. Um these projects that are riskier than the firm average will be incorrectly accepted at their hurdle or if their true cost of capital is above 11.2% but below the firm's average WACC. So recommendation is that Netflix must use project specific WACC's dried from comparable public companies um to set approachable hurdle rates. So depending on what Netflix wants to do, they should um compare the WACC that they should use. Um comparison industry peers Netflix WACC is above the media industry rate uh 8 to 10% and significantly higher than Disney and Amazon. Uh the primary difference in Netflix capital structure and risk is that one it's a risk profile. Our high beta of 1.3 results in a high cost of equity and our leverage Netflix's debt weight is extremely low compared to Disney. Um ours is 6.1% theirs 30%. So our debts um tax shield is underutilized keeping the overall WACC high. So we need to use it more. And our optimal capital structure recommendation is that Netflix's current structure is suboptimal uh for minimizing WACC to lower its hurdle rate and increase value. It should increase leverage. Um our recommendation is that strategically target a debt to value weight closer to 23% similar to Disney. Um this maximizes the shield weight without jeopardizing its BPB plus credit rate. Um and this financial concept is just target weights. Our implementation of this, a lower WACCC would enable Netflix to undertake a more value um value as rating content investments that currently fall high with a high 11.2 rate. So basically using our driver framework and kind of cover everything we've explained everything and our final recommendations are that um Netflix Netflix must use project specific WACC's and that we just need to that our comparison of Netflix to Disney and Amazon um we just underutilize our debt tax shield. Um So after I've I've covered everything, thank you guys for watching. And this was this was section 9 section six assignment cost of capital analysis.",
  "video_url": "https://youtu.be/oEZa2wd91nA"
}