{
  "student_name": "Vincent Craw",
  "org_defined_id": "035627160",
  "username": "vcraw",
  "video_url": "https://youtu.be/OdAsxgn7czc",
  "transcript": "All right. Hello, I'm Vincent Crawl. Um,\nthis is my\ncapstone project. Uh, final project for\nmanagement 310. So, pretty much what I\nmade through Replet. I made an app. Um,\nit's like a\ndebt solver. So, you can put um\nyou can put debts in. And so if you had\nlike a student loan, put the original\namount. Then you put your current\nbalance, uh interest rate and then like\nwhatever you want your monthly payment\nto be and then your due date. Um and\nthen you can also do like savings goals.\nSo then you can add like uh if you\nwanted like $500 emergency fund, you put\ntarget amount 500. Um and then you\nselect the date you want it by\nand it'll track your savings. And then\nthere's that there. Here, this is like a\none I put in earlier. So, 16 days left\nto get 200 bucks.\nUm, and then you can also budget. So,\nyou can put in whatever money you're\nmaking through your job and then add\nexpenses as well.\nUm, and that's about it. Uh\nit's also I have it on my phone\nso can look at the same thing here.\nLet's I'm going to add\na debt and see if it works on my phone.\nSo\nsay student loan\nwe have 2\n500 original amount\ncurrent balance is what? 2750\ninterest rate is like 6%.\nMonthly payment 100\nwe'll just do\nJanuary 1st is the due date. So now or\nJune 2028.\nSo now as you can see you can see the\ntotal debt\num basically what you want to pay\nmonthly payment when you'll be debt free\num and then it has like your total saved\nto pay off your loans and then it has\nlike the debt progress\nand then if you click on it gives you\nstrategies on like how you could be able\nto pay uh your debt best off uh in the\nleast amount of time. But that is pretty\nmuch all I made. um this would help\npeople cuz a lot of well how I figured\nout what I wanted to do is a lot of\npeople now are taking out uh their\nfinancing uh car payments loans um a lot\nof student loans and people are just I\nthink they're getting overwhelmed with\ndebt. So this would be something that\ncould kind of keep them a little bit\nmore calm. Um at least give them a plan\non what they want to do. Um give them\nsolutions how they want to do it. Yeah,\nthat's pretty much all I have. Uh, so\nthank you for watching. That was my\ncapstone project. Um, thank you for a\ngood year."
}