{
  "student_name": "Vladimir Cruz",
  "org_defined_id": "025515744",
  "username": "cruz22",
  "video_url": "https://www.youtube.com/watch?v=x8cTx4x-vuY&feature=youtu.be",
  "transcript": "0:01\nGood evening, professor. So, this is my\n0:04\ncapstone project\n0:06\nuh for your financial management class.\n0:09\nI um of course looked over the\n0:15\nsession to\n0:18\nsee what kind of templates, you know,\n0:19\njust to kind of build off of some of the\n0:21\nideas. And something that really uh\n0:25\nspoke to me and called out to me was the\n0:29\nuh real estate and mortgages session\n0:32\nback in\n0:35\nsession five. Um, something that I\n0:38\nreally like about that is,\n0:41\num, my brother works for JP Morgan Chase\n0:45\nin Chicago and he recently,\n0:49\nuh, we, him and I recently spoke about\n0:52\nthe possibility of flipping houses. He\n0:54\nwould basically be the money and that\n0:56\nwould be the brains because\n1:00\nof my experience in the construction\n1:02\nindustry, the background, just the\n1:04\noverall experience and skill set, mostly\n1:07\nlike soft skills that you really need to\n1:09\nbe able to interact with the different\n1:11\nconstruction workers. So,\n1:14\nexcuse me. What I did for my project was\n1:18\nto build a tool\n1:20\num that takes essentially\n1:24\nuh the property address with your\n1:27\ninitial investment which here would be\n1:31\nuh $340,000.\n1:36\nhow much the expected monthly rent would\n1:39\nbe that a potential renter would be um\n1:43\nrenting this property for. It takes into\n1:45\nconsideration the annual property taxes,\n1:48\nthe annual insurance, any HOA fees that\n1:51\nmight be uh there and it gives you\n1:58\nuh a total annual cash flow. Now, of\n2:01\ncourse, this model is based\n2:04\non the principle that there would be no\n2:09\nmortgage taken to rent out the property.\n2:12\nIt would basically be an asset purchased\n2:15\ncompletely with cash. Um, which\n2:21\nis kind of exemplified here with my cap\n2:24\nrate and my cash on cash return. uh\n2:27\nwhich yes 5.5% it is a little low. Um\n2:33\nbut kind of how we talked about in not\n2:36\nonly risk and return but uh the weighted\n2:40\ncost of capital in those two sessions\n2:43\nspecifically.\n2:44\nUm if you take out a loan the initial\n2:48\nand personal investment is $0 because\n2:51\nI'm not spending any money. you know,\n2:54\nuh, on the contrary, we will be spending\n2:56\nmoney to avoid having to place a down\n2:59\npayment, pay um, pay interest over the\n3:03\nlife of a loan as well. Now, like I\n3:05\nsaid, this would be all be based on the\n3:08\nfact that we would pay cash for\n3:10\nproperties, fix them up, and resell them\n3:14\nat a higher market value. And yes, we we\n3:18\ndo understand that, you know, this um\n3:23\nmonthly rent cost of $1,800 for this\n3:26\nspecific property, they might change\n3:28\nbased on the market, whether there's\n3:31\nhigh demand for properties like this,\n3:33\nthe location, of course, um\n3:39\nand\n3:43\num again based on the market just to see\n3:47\nif if $1,800 will be worth it for\n3:51\ndifferent renters. Um, we're also going\n3:55\nto have to take into consideration\n3:57\ndifferent different aspects of a house,\n4:00\nwhether or not uh it's worth that much\n4:04\nto rent. Now uh something that I did\n4:07\nparticularly like that I added myself\n4:10\nwas the break even amount in an annual\n4:13\nuh and the break even amount in months.\n4:16\nSo earlier I did this 218 months is\n4:21\nuh is 18 years and yes that would be\n4:25\nover a long period of time but the idea\n4:28\nis to be able to analyze the cash flow\n4:31\nwhich be right here the net operating\n4:33\nincome or your cash flow uh your monthly\n4:36\ncash flow what you're expected to make\n4:39\nafter you've paid taxes and insurance on\n4:42\nthe property. And going back to the cash\n4:45\non cash, what I like about this\n4:47\nspecifically is it kind of gives you an\n4:49\nidea of what your return is going to be\n4:52\nor or in essence how hard your cash is\n4:55\nworking for you. And yes, it is a little\n4:58\nlow, but going back to you know risk and\n5:02\nreturn,\n5:05\nit is a low, but it's something that's\n5:08\nconstant. It's more secure.\n5:11\nThere is a lower return but it's lower\n5:14\nrisk as well. What we aim is for a happy\n5:17\nmedium you know so somewhere to where we\n5:20\ncan analyze this number and say if it's\n5:24\nover this would be a personal choice\n5:26\nafter a lot of different analyticals\n5:29\nwe would say if it's over 10 or 12%. we\n5:33\ndon't want to do it because\n5:37\nthen uh you know it it could be a it\n5:41\ncould be a property that we should pass\n5:43\non instead. So going to my nad workflow\n5:49\num with the help of field and beta I was\n5:52\nable to generate\n5:54\na workflow to\n5:57\nkind of get me to analyze a lot of\n5:59\ndifferent properties at a much quicker\n6:01\nrate. So to start off\n6:04\nwhat basically we do. So I was able to\n6:07\npull this one up which is 6 651\n6:11\nBule Lane here in Indianapolis compared\n6:13\nto the one on Winth Avenue that I looked\n6:15\nup earlier just to test which is right\n6:18\nhere.\n6:20\nUh so with this property\n6:23\nbasically you would take the address\n6:31\nposted into your into your form.\n6:36\nThe listing address is 275,000.\n6:41\nEstimated renovation cost. Now this\n6:43\nagain is going to depend on the market,\n6:44\nthe availability of dinner contractors\n6:46\nand subcontractors,\n6:48\nvendor costs, commodities as well to see\n6:52\nwhat all the what all the cost is going\n6:55\nto be. Now let's just say for example\n6:58\nbecause this would be after a lot of\n7:00\ndifferent analytical steps and obviously\n7:02\nsteps to kind of determine each and\n7:06\nevery one of those costs. Let's say just\n7:08\nfor the sake of the presentation, it's\n7:11\n$25,000.\n7:13\nMeaning our initial investment is going\n7:15\nto be $300,000. If we're expecting to be\n7:17\nable to rent this house for right around\n7:20\nhere, 16,700,\n7:26\nthe annual property tax for this\n7:27\nproperty on B Lane was about $4,000 in\n7:32\n2024.\n7:33\nAnnual insurance, I am a homeowner\n7:36\nmyself. I pay about $1,700.\n7:39\nSo, for a house like this, we're going\n7:40\nto go ahead and just cap it at $2,000\n7:43\nwith no HOA fees. Actually, I want to\n7:47\ntry something else because the previous\n7:49\nproperty I put zero. So, for maintenance\n7:52\ncosts, we're going to go ahead and put\n7:54\n$150.\n7:57\nSubmit. And what it does is it generates\n8:01\ngoes through each one of my workflow.\n8:03\nNow, I was able to debug this as well.\n8:05\nprofessor because before it was one long\n8:09\nnode\n8:11\nand what had happened you can even see\n8:13\nhere two out of 20. It took me this is\n8:16\nmy 18th time\n8:19\nand it took me a lot of different steps\n8:22\ndebugging going back with beta to help\n8:25\nme change some of the things so that I\n8:28\ncould successfully create uh this final\n8:31\nstep. But basically what was happening\n8:34\nis that it was just one long process to\n8:37\nhere to my AI um response and then after\n8:41\nhere this node was connected here. The\n8:45\nproblem is that it was not printing\n8:48\nuh results that I liked. It was actually\n8:51\nprinting just a big garbled mess. So\n8:56\nhere\n8:58\nwe come to my second row. 6051\n9:03\nlisting price, renovation cost, monthly\n9:06\ncost, property tax, insurance,\n9:09\nmaintenance,\n9:16\nmonthly expense, cash flow. This\n9:19\nproperty will generate a little bit of\n9:21\nless cash flow with a total annual\n9:25\ncash flow of $13,200.\n9:29\nCash on cash return the cap rate are a\n9:31\nlittle bit lower because of those\n9:33\nmaintenance costs that I've actually\n9:34\nincluded there. And the break even term\n9:37\nin months would be 272 months. So that\n9:40\nwould be let's see 18\n9:44\n230\n9:47\n230.\n9:52\nLet's just calculate here on the\n9:55\ncalculator.\n9:57\n22 months. So, or excuse me, 22 years.\n10:00\nNow, this of course is going to depend\n10:03\non whether or not\n10:05\num the price can be lowered. For\n10:08\nexample, this down payment of 275,000.\n10:11\nIt's going to depend if we have an\n10:13\nactual loan amount or mortgage amount.\n10:15\nIt's going to depend of course on how\n10:17\nmuch taxes we can get back, what other\n10:20\ncosts we can pass on to the consumer or\n10:23\nthe renter. So again, this tool for\n10:27\nsomebody like myself and my brother,\n10:30\nthis is something that we would really\n10:31\nbe interested in to be able to sort of\n10:33\nanalyze the cash flows at an instant\n10:36\nwithout having to uh do a lot of\n10:39\nguessing and calculating. And like we\n10:42\nlearned in your class, professor,\n10:44\nputting everything on a spreadsheet, um,\n10:46\ntitling all of the columns helps us keep\n10:49\nthis in an organized form, which is\n10:52\nsomething that we hope to accomplish in\n10:53\nthe future. And this professor is my\n10:56\ncapstone, and I hope you like it. And\n10:59\nthank you again very much for this whole\n11:01\nsemester. I thought it was really fun.\n11:03\nAnd this is something that I wish to\n11:05\ntake away because n is a very powerful\n11:08\ntool. And um I I hope to keep using this\n11:13\nnot only for the real estate but for\n11:16bonds as well."
}