{
  "student_name": "Brock Oros",
  "org_defined_id": "036147335",
  "username": "oros0",
  "email": "",
  "transcript": "Hello, I'm Brock and today we are going to going over the session 8 market efficiency investigation. So today we're going to be talking about the we're going to investigate the market efficiency using the GameStop short squeeze events of 2020 2021 as a case study and that's when the stock actually went all the way down to about 1.04. 04. We have to verify the accuracy of the stated facts, analyze price behavior relative to efficient market hypothesis predictions, and evaluate whether market anomalies constitute evidence against market efficiency or can be explained within existing frameworks. So the critical first step is we're going to verify the statement GameStop traded at uh 0.04 in August of 2020 against actual historical data. If incorrect document the accurate figures and determine appropriate communication approach. So I first I asked uh chatgd to create me a python code using the kiss method while defining each part of the code. So we have the investigation which is what I just said. We have the critical first step and then we have the event line which is August 2020. The GM GME near bankruptcy levels. September 2020, the Ryan Gohan Chewy founder acquires 13% stake of GameStop. January 2021, Reddit, the Wall Street Bets driven the price surge up to around $400 or around $500 actually. And then we got the February 2021 congressional hearings on the market manipulation. And the present is the postevent price stabiliz stabilization that they've been going for. And the key data points we're going to be using are a short interest peaked around 140 of float. The real deal trading volume increased to 10fold during squeeze. Trading restrictions implemented that peak. The hedge fund Melvin Capital sustained 53% loss requiring a bailout and then analysis fundamental value estimated $10 to $40 per share. So the required analysis is to verify all stated historical price data and document corrections. test which form of the market efficiency, weak, semi- strong or strong, was violated and then um evaluate whether rational investors could have profited systematically. Compare efficient market hypothesis predictions to observed behavior and then assess behavioral finance explanations for observed anomalies anomalies and then create a driver analysis for each part of the code and implement a useful graph show the stock drop rapidly over 2020 to 2021. Then I said make sure it's in simple and all stage of the driver format and some requirements is your analysis must include market efficiency testing classification of the weak semi- strong and strong analysis of information into prices of normal returns during the event assessment of predictability patterns behavioral finance analysis identification of behavioral biases and yep just all the ones that were in down here. Here we go. All these. So, it created me a code and I will pull up that code right now. All right. So, this is going to be our code. And so, for our discover and design. So, what is the context of this? We're going to be studying the GameStop short squeeze. Want to connect to this market efficiency. What's the given assumed from your assignment? the timeline for our financial objectives for this code is all these and then the driver goal for this video. So, let me scroll down to here. This is our fact checked. So, there was 21 trading days in August of 2020. The minimum adjusted close, which is actually going to be 1.04 instead of 0.04. So, they just had a $1 difference. So, they probably um weren't accounting for the $1. And then the max adjusted close is 1.67. So, this shows you that August 2020 was definitely not a good year for GameStop. And then the month in close was obviously the highest at this. So, they kind of bounced back a little bit, I guess. So, did the GME ever hit 0.04 in August of 2020? And no, that is not true. And data does not support the 1.04 claim. price is around $1, $1 to $2. The average daily return in 2020 was around 0.0070, so 70%. And the standard deviation of the daily returns was around 7.46%. So now that we got that critical out of the way, we're going to go back up here to our R for driver. And this is an analytical approach. So the variables we're going to use are price t is the adjusted closing price. Return is the adjusted closing price minus this. And then that's going to get the return from the price. And then the volume is the trading volume. How many people traded on that certain day? And we are going to implement now. So here's where you build the code and um each function is going to explain what it is. So we got to get the data. We're going to get our data from the Y finance. It's going to put it into columns. And I think this is our data down here. Yeah, this is all of our data. So it's from 2020 to 2021. This is the first 15 abnormal days. And this shows all of the prices. So it looks like they had a ter obviously a terrible return and close and it builds back up and then it falls slightly. So this graph is actually going to show us from 2021. This is the price US dollars. So, there's actually a big spike and this spike is actually from the um I think it was r/wall street bets and they they decided that they were all going to put money into it one day and completely blow the stock out of the water and it went up to around $480. So this is where I have the here. I actually made a driver. We can just go to this. This is probably easier to get with. So we got the represent. So, one of our goals was to show if it was a weak form, semi- strong form or a strong form. So, the EFH is that it states the stock prices reflect all available information. So, a weak form of the EMH is going to be prices reflect past market data with no technical advantage. Semi-rong form is prices reflect all public information, no news advantage. and the strong form as prices reflect all public and private information. So, we're going to compare the GME actual price data to the EMH expectations. And if the EMH held, GME prices would have reflected the fundamentals and adjusted smoothly to the new information. But instead, the GME experienced rapid irrational price increases from the Wall Street bets. So the relationships of this so high high short interest is increased the potential for a squeeze. They had social media coordination which is the amplified demand of the wall streets trading restrictions which was the Robin Hood that changed the liquidity patterns and then we got the investor sentiment was an overpowered fundamentals temporarily. So for the visual representation the timeline summary August of 2020 the price ranged from a dollar to $2 but it hit um $4 to $5. that was at the end of it and then we already talked about this stuff. So the price for the implement we got the price verification it was around4 that was at the very end of it. So it was actually around $1 to $2 and the price surge the rise from 483 in January was disconnected from the fundamentals. The trading behavior was retail volume increased 10 times as short interest exceeded 140 and the major brokers limited the trades on it. And then um the project the code tested whether the GME violated the EMH by comparing real price data with the theoretical predictions. And the analysis evolved to include both behavioral finance protective and market structure explanations, the short squeezes and liquidity constraints. And then um the final refinements was it recognizes that the sorry reflect here sorry the so the key insights is that market prices can now um move irrationally in the short term due to the emotion hype herd of behavior as for the Wall Street bets is they all kind of herded and flocked toward towards the one stock to see how high they could uh move it. And that shows that the market prices aren't always going to be stable and they can sometimes be irrational. And the EMA holds better over the long term, but it fails to explain the short-term bubbles like the GME going all the way up to $480. And you always want to get the verified data is essential because 0.04 04 4 cents for a share is actually they would have gone 100 they would have 100% gone bankrupt. So for the Jimmyi case illustrates how information psychology and trading mechanics can interact to create a short-term efficiencies that later self-correct over time. And this framework can be applied to other market anomalies such as the AMC one or the Bed Bath and Beyond or even like cryptocurrency like the meme coins or any of those using the CAPM. And then uh this strengthened the data checking the analysis of certain information and the communication skills of individuals and these are all essential for uh finance professionals in the end. So, thank you so much",
  "video_url": "https://youtu.be/zn2whCdG1Y4\n\nhttps://youtu.be/Zwan7f9G8X4 facecam"
}