{
  "student_name": "Dylan Scheel",
  "org_defined_id": "037036066",
  "username": "dscheel",
  "email": "",
  "transcript": "Hello, this is uh Dylan Shield and this is my session nine um assignment. So this week we are looking at cost of capital analysis. So uh we our goal is to calculate the weighted average cost of capital for Netflix in connection with a five with a hypothetical 5 billion dollar content investment decision. Uh so do you use walk the current walk and then with the addition that financing and use interest discount rates all that stuff then we have our parameters our market conditions strategic context so first was I my pro just explain who I am I said hi I'm an accountant at Netflix just easiest to explain that to trying to help the company make a decision on hypothetical 5 billion content investment decision. My goal is to do analysis of the current black average and then evaluate with the impact of additional debt financing and assess project specific versus firmwide discards. I said to do this I want you to act as a leading financial accounting researcher and teach with a knowledge of accounting as well as project investment decision making. said, \"I want you to code new models easily adjustable and be exploitical audience.\" I said, \"Please create a Python code uses the given hypothetical Netflix and conditions to first find the current Netflix walk uh which I know can be found uh weighing the amount of debt and equity that a company put it. Um I I said I am aware that the equity costs the equity costs more than debt due to the ability to tax deduct interest payments on debt. So I wanted to see how this would be useful. So I said I will use this data to compare um uh compare to to if Netflix issued $3 billion in debt. So I asked it to create a sensitivity table to compare the initial walk with the walk after the $3 billion debt issuance. And I said please use the following formula. The block is the equity the total value times the cost of equity plus the debt total firm value times pre-cast tax debt times one tax rate and also just said they'll need to use the capm which we've previously learned. So if we go over to our um our uh code over here. So um as you can see it pulled the uh API model and um so this basically just runs the code and as you can see in here it's just doing the um total value is the market cap uh capital value debt and weights it weights the equity weights the debt and then um it also ran me scenario B which is the issue in the 3 million three billion in debt which changes our debt value. I have the sensitivity table on here. So on the left we have um sorry on the left here we have without the three billion in debt. On the right we have with the 3 million in debt. So you can see um on the left our walk is 11.22 which is pretty high. That's a hurdle to pass and have to u make sure we get investments on this. And also um uh when we take the 3 million in debt or 3 billion in debt, the walk goes down a slight amount pretty significantly when we're looking at the scope of a company like Netflix. And uh oh, I forgot to mention the cost of equity to calculate all this was we found to be 11.65%. And the after tax cost of debt was 4.58%. And so this is a pretty high wall. But when we look at information given, one of the things we look at is a high equity beta, which means that um the beta is the company is more volatile, 30% more volatile than the rest of the market. So it's there's a lot of shifting possibilities with that. And um so yeah as we can see um the lock goes down whenever we take take debt and that's because those payments of that are taxdeductible which means that um our debt is going to cost us more or cost us less than equity which is very important. So um uh what did we look at here? Oh um and then so one of the things that we talked about was like the project specific walk and um in the way of US content versus international content is important to think about what type of project is being made what audience it'll be reaching so like I said if there's a movie telling about the civil war in the US it'll probably make much more sense for to put that project together for the US audience instead of internationally the reasoning for a project and how it can benefit or hurt the company in my opinion and I feel like a lot of people opinion should be just supported if It simply meets the rate with Y. And then um I the continuing on the um I I know the kind of walk Netflix understand. I want to look at the difference between capital structure and Netflix's Got it. Okay. There.",
  "video_url": "https://youtu.be/vyhhmmwak7I"
}