{
  "student_name": "Riley Gross",
  "org_defined_id": "037145708",
  "username": "gross132",
  "email": "",
  "transcript": "Hello, my name is Riley Gross and today I'll be teaching you about capital budgeting in investment decisions. I will also be utilizing Gemini to write us a Python script and give us an output for our calculations. So to start off, we will be using this um problem here in our textbook and going right into it. What is capital budgeting? Well, capital budgeting is basically a way that companies make decisions around whether they should make an investment in something. Now, this would be um maybe building a new building um equipment or training for its employees. Now, an important thing to remember in capital budgeting is the time value of money. We will get into that later, but basically using a DCF model to determine if this decision is the right one to make. Um, this will be especially important when we evaluate this problem. So, going into the define stage, define and discover stage of our driver framework, we'll start by going over what the actual problem is. So, we will be evaluating Starbucks. They have a proposed roastery that will basically um roast all their coffee beans that they source and then dispense them out to all of their locations in that specific um country, which typically in this case would probably be the United States. But this is a this investment requires $12 million upfront and is expected to operate for 10 years. Now its whack or what is also known as the hurdle rate is going to be 8.5% which is also the weighted average cost of capital. We learned about this in our last section that we we had last week. So what we want to do with this problem is determine if we should accept or reject this decision based on our driver framework as well as the calculations we get from our Python script. Just going over some quick parameters we have here. The initial investment, like I said, $12 million and going to be operating for 10 years. The working capital is 500,000 deployed at launch and is going to be recovered in year 10. Revenues 8 million in year 1, 11 million in years 2 through 5, and 9 million in years 6 through 10. The operating costs um are cost of goods sold, which is 40% of the revenue. Labor is 2.5 million. Rent and utilities is 800,000. Marketing is 300,000 in year 1. And then 100,000 um thereafter, so years 2 through 10. And then our taxes, we have 25% corporate tax rate. And our terminal value is 3 million at the end of year 10. So, going into our Gemini and what we put in there to get our Python script, we have I'm a finance student studying capital budgeting and investment decisions and I'm looking to further showcase my ability to explain financial concepts. I'm going to make a video over this. And some important things that I told it to keep in mind when developing this Python script that I told it to create are net present value, internal rate of return, payback period, profitability index and the hurdle rate andor the weighted average cost of capital and then I also made sure to comment on the calculations which I will also show in the textbook. Um, and making sure that we understand what the meaning of all of these metrics that we are used to calculating are. And then I just gave it the problem and um some of the metrics to look for when we are trying to solve this within our Python script. So going to our Python script and actually we're going to go to the um repres we kind of went through the define stage. We went through the represent stage as well by evaluating what the problem was and the parameters of that. And we are now going to be moving on to the implement stage which is going to be utilizing our Python code. So here's our Python code. We're using pandas, numpy and mapplot lib. And first we have our metrics here. Our whack is uh 8.5%. Tax rate is 25%. The initial investment 12 million. Uh the working capital was 500,000. The scrap value was 3 million and the years was 10. So our depreciation is just the investment divided by the years. And here's just printing in our output these calculations. And then our revenue stream. So it's for year zero it's going to be $0. Um and then after that it's 8 million and then 11 million time 4 for each year and then 9 million for the last five years. And then COGS is just the revenue times 40% because it's 40% of of our revenue and then our labor 2.5 million rent 800,000. And then our operations cost is all of basically those expenses combined. So our COGS, our labor, our rent um and our depreciation and our marketing as well. And then our EBIT or what is also the earnings before um interest tax and sometimes immorti amortization is just the revenue minus the operations cost. Our tax is the EBIT times the tax rate. And then our um NOAT which is also known as the net operating profit after tax is just the EBIT minus that tax that we just calculated. And then our cash flow is just the notepad plus the depreciation. And then here we just are calculating all our cash flows and then finding these um calculating the MPV. So adding up all of these and then also in here we will determine the discounted cash flows. Like I mentioned earlier the time value of money is important. We need to make sure we discount these cash flows so that we have an accurate calculation to help us determine whether we should make this costly financial decision. So I'm going to now run our Python script. And here we are. So right here just the initial parameters. I'm not going to go through them again. I've mentioned them multiple times. But basically what we have year zero we have our initial investment of 12.5 million and then the discount factor is just the just one because of that um being the year zero essentially and then so our present value for that year is just going to be negative 12.5 million because we spent that. Now the next year the free cash flow basically what we're doing is taking the cash flows and then subtracting the um costs of them. So we get 12.5 million and then our discount factor for that year is 9217. Now, what we're going to do is multiply that by our free cash flow or the cash flow that we have remaining after all those costs. And then we're going to put that into present value. And we're just going to repeat this process and add all once we summate all of those, we're going to get our net present value, which is $2,690,1. Now, why we calculate this in um or discount these is because if you just took the cash flows that you get from the revenue minus those costs, you're going to get a number that's not exactly accurate because it's not accounting for how money changes over time. Remember from our earlier sessions, money today is worth more than money tomorrow. So looking at our results, we have a net present value of 2.69 million, an irr of 12.84%, profitability index of 1.22, and a estimated discounted payback period of 8.21 years. So just kind of the initial recommendation that we have here is that we should accept this because the MPV is higher than zero as well as the irr is higher than the weighted average cost of capital. Now we would to kind of help understand further why we would accept based on these metrics. The MPV is the cash flows that we would get on top of breaking even from this. So if you have a negative MPV, you don't want to accept because you would ultimately be losing money on this investment. In this case, they're going to be making money. And then as for the IRRa being greater than the whack, that basically means the return that we're getting from the investment is going to be greater than the cost of financing that investment. So that is why we would ultimately accept this decision. But kind of looking further into this, we're first going to take a look of the cumulative discounted cash flows or the J curve. So this is showing basically where that break even point is and where we are going to start making money. So you can see uh we have the 12.5 million down here all the way at year zero when we started and then it's consistently goes up in our margin of um debt essentially that we are in. goes continues to go uh down and down until we eventually break even at around 8.2 years. And you can see those margins start increasing and we start making money after 8.2 years and then we stop at 10 years because they're only operating for 10 years and then we would be left with almost $2.7 million in profit. So that is why we would accept it. Next is the MPV profile showing the sensitivity of this investment with different discount rates and showing the MPV based on the rates. So as we can see here we have the whack right here on the red line and the IRR on the green line. Now this is good. This having the IRRa higher means we're going to get more money for than we would spend financing it. And this area right here between the IRR and the whack is considered our margin of safety. And as we can see here, the discount rate and NPV or project value have an inverse relationship. So as the cost of money goes up, the project value decreases. But because we have such a good margin of safety uh being shown here there there's a lot of cushion making this a good and robust investment for Starbucks. So now that we have kind of seen these different steps, we went through the validate step which was the Jcurve or the cumulative discounted cash flows and then we even did the evolve which was testing the sensitivity. So looking at the um project value in terms of different discount rates over times just to account for how the market is constantly moving. We will now move to the reflect stage and the final stage of the driver framework. So going back to the the basics, capital budgeting is when a company uses metrics such as MPV, IRR, and the whack to determine if an investment is a good or bad decision. In this case, we used Starbucks in a fake situation. And because they had a positive net present value or NPV, we determined that they should accept the this investment decision because it's going to make them money in the long run. And we also considered the the break even point and how the project value can change with interest rates as well as when we accounted for the cash flows we discounted them to um account for time value of money. So all of these things like our IRR significantly exceeding the hurdle rate and having uh MP a positive MPV lets us know that we should accept this project and hopefully you can utilize this for any other capital budgeting scenarios you come across in the future as well as making sure you're instilled with basic financial concepts such as whack or uh time value of money. Thank you for listening.",
  "video_url": "https://www.youtube.com/watch?v=AokuKXV5SiA"
}