{
  "student_name": "Elisah Korinne Liban",
  "org_defined_id": "038014499",
  "username": "eliban",
  "email": "",
  "transcript": "Hello everyone. Today we are doing another assignment for session nine. This time and it is a cost of capital analysis. For this assignment, we're tackling a critical question for Netflix. How do we evaluate a massive $5 billion content investment? And the answer lies in understanding their cost of capital, specifically their weighted average cost of capital or WACC. This isn't just a number. It's the minimum return Netflix needs to satisfy all its investors. So, our goal is to calculate Netflix's current WACC, see how adding more debt changes it, and compare their facing their financing strategy to competitors like Disney. So, of course, we will be using the driver framework as we do. And our first step is to define as you can see in our book we already see the different um parameters conditions and context that we need to be aware of like market capitalization as $200 billion total depth as $14 billion debt equity beta bond rating corporate tax rate and current stock price. We also have the required analysis that we need to do um as we proceed with our next stage which is the refine stage. So with the refined stage we have our visualization here um that shows us the key formulas for WACC the cost of equity or CAPM and cost of debt and for here we have to follow this structured approach before we do anything else. So as I mentioned, we'll first use the CAPM um or the capital asset pricing model for the cost of equity and focus on market values for both debt and equity. A key assumption is the tax shield in debt that interest payments are tax deductible reducing the effective cost of borrowing. So these are our formulas and our WACC will be the weighted average of the cost of equity and the after tax cost of debt. Now uh we will be calculating Netflix's current WACC. So again let's go back to our first stage where we defined everything. So you have a cost of equity with a risk-free rate um of 4.5%. market risk premium as 5.5% the beta as 1.3 and the K is going to be 4.5% plus 1.3 * 5.5% equals 11.65%. And later on I'll also be showing you how we got these values in terms of automation which is through our Python script. Next is the after tax cost of debt. So the bond yield is 5.8%. 8% and the tax rate is 21% and we got the KD and again later I'll be showing you how we got that through a more comprehensive Python script and of course we need the capital weights and the current WACC. So we're putting the numbers to work essentially and the first thing we did is our cost of equity calculated using CAPM and this reflects the return shareholders expect for investing in Netflix's volatile stock. Aside from that, uh we also look at the after tax cost of debt that is a much lower value due to the tax deductibility of interest. When we combine these with Netflix's current capital structure, heavily weighted towards equity at almost 94%, we arrive at a current WACC of 11.22%. So now let's actually put this into action. So let me show you our Python script and run it. So again, these are the parameters that we were given with and the uh equations that I walked you through just now. And you can see how um these will be shown later with our formulas being applied into the Python script with just um integrating certain variables so that we can purely automate this. And uh we will also be inputting a plot code so that we'll be able to show the WACC on the y-axis and then the depth to capital ratio on the xaxis. And this will allow us to truly understand the impact of the leverage through really visualizing it. So this graph will be able to show us how Netflix's WACC responds as we increase its debt. And we'll see a certain trend uh in a bit as I run it. And again over here we're addressing the proposed $3 billion additional debt in issuance and this shifts Netflix's capital structure slightly increasing the debt weight to 7.4%. And we when we recalculate we see that the WACC will decrease to 11.13. So now I'm running the um I'm running the code and here you go. You can see that pure visual you can see our current Netflix position and where we land after that $3 billion debt and it's moving towards a more optimized capital structure. So remember that I mentioned a certain trend that we'll be seeing and the trend right now in this plot is downwards. So, it's a downward trend. And it's important to note that in a more complex model, this curve would eventually turn upwards. Too much debt increases financial risk, which would drive up both the cost of equity and the cost of debt, creating a U-shaped WACC curve. However, at Netflix's current low leverage, we're in the declining portion of that curve. Now, we'll be looking at Netflix's wax WACC in context at 11.22%. It's higher than the general media industry range of 8 to 10% and significantly higher than Disney's 8.2%. This trade-off theory will be able to show you a better visual of our concept that we will be talking about. So, why is there such a big difference, right? So Disney leverages its stable cash flows with a higher debt allocation about 30% debt to 70% equity. Netflix historically more equityheavy pays a premium for that financial flexibility. So it's a trade-off. They're funding growth with more expensive equity. Regarding project specific WACC, we can't use a single rate for everything. A5 billion dollar investment in the US content might be evaluated with our firmwide WACC. But a risky international expansion or a highly speculative new venture would demand a higher project specific WACC to account for additional risk factors like currency fluctuations or political instability. So based on our analysis, Netflix is currently underleveraged. Their current debt only makes up about 6% of their capital structure. The $3 billion debt issuance would increase this to 7.4% still far below industry peers. So my recommendation is that Netflix should proceed with the $3 billion debt issuance. It prudently lowers their WACC, making it cheaper to fund valuable content. This move shifts them closer to an optional capital structure, allowing them to fund growth more efficiently without significantly increasing financial risk given their strong bond rating. This is a step towards reducing their overall cost of capital and enhancing share shareholder value. So we've already gone up to the drive part of the driver framework. We've done our define, our represent, our implement, and our evolve. Now for our reflect. WACC isn't just a calculation. It's a strategic tool. We've seen how Netflix's high equity reliance drives how Netflix high equity reliance drives a higher cost of capital compared to more leveraged competitors. By strategically utilizing debt, Netflix can reduce its WACC, effectively lowering the hurdle rate for future profitable investments like their $5 billion content push. Understanding and managing this cost is fundamental to corporate finance and creating long-term value. That's it for our session nine assignment. Thank you very much for sticking until the end and I hope that this was helpful and useful in terms of the cost of capital um and understanding WACC as a whole.",
  "video_url": "https://youtu.be/8HPa5EYXu4Q"
}