{
  "student_name": "Sandy Skinner",
  "org_defined_id": "037337729",
  "username": "skinne36",
  "email": "",
  "transcript": "Hi, I'm Sandy Skinner. This is my Session 9 assignment. Let's hop right into it. So, the task here is to calculate the WAC of Netflix and in this, analyze the $5 billion investment decision where we need an extra additional $3 billion debt issuance. So, to start out, what is the WAC of Netflix? Calculate all these important data points that matter, such as cost of equity, after-tax cost of debt, etc. So I put in all these parameters, risk-free rate, market risk premium, Netflix beta, cost of debt, market value of equity, market value of debt, corporate tax rate, and current stock price. And we can see that the cost of equity of Netflix is currently 11.65%, which is the return that the Netflix's equity investors expect to earn on their investment based on the risk -free rate, Netflix's beta, and the overall market risk premium. uh the after tax cost of debt uh this is the effective cost of borrowing for netflix after accounting for the tax deductibility of interest payments uh since interest payments reduce taxable income the true cost of debt is lower than the stated interest rate the market value the after tax cost of debt is 4.58 percent uh the market value weight of equity is 99.35 percent which represents the proportion of netflix's total capital structure that is financed by equity based on current market values. It indicates the relative importance of equity financing for the company. The market value weight of debt is only 0.65%. We can see just the other side of that, 100% of how they cost or how they finance everything. It's only 0.65%, so very low. And this represents the proportion of Netflix's total capital structure that is financed by debt based on current market values. And it indicates the relative importance of debt financing for the companies so we can see not very important in terms of financing and then the big number the weighted average cost of capital 11.6 percent slightly less than the cost of equity um which makes sense because if the weighted average cost capital was greater than the cost of equity then investors would not be making any money on um the netflix would not be make any money on their investments. So this represents the average rate of return Netflix expects to pay all of its security holders to finance its assets. It's the minimum return a project must generate to create value for investors. A higher WAC implies a higher cost of capital, making it more expensive to finance new investments. So 11.6 is actually very high uh, comparative to these, uh, other, um, media companies at, at, at an average of, um, eight, I believe it was eight to 10%. So we know, yeah, media industry, uh, weight of average cost of capital average is eight to 10%. Netflix is 11.6, so much higher. So their investments do cost a lot more money. It's good to know. Moving on to the impact of additional debt on Netflix. So we know that the original market value of the debt was $13 billion, and the new market value of debt is $16 billion, goes up $3 billion, which increases the total market value from $2013 billion to $2,016 billion. The weight of equity now changes from 99.35% to 99.21%, and the new weight of debt changes from 0.65% to 0.79%. So the weight of debt goes up, the weight of equity goes down, and this beta will actually stay the same at 1.3. And the new cost of equity using this new levered beta would be 11.66%. So 0.6% higher. If they do this, their cost of equity will go up even more to that very high 11.6 % that it already was. The new cost of debt rate would be 5.8%, and the new after-tax cost of debt would be 4.58%. So the same. Their new, yeah, so we've already seen this, the change in weighted average cost of capital, very negligible, but still goes up 0.06%. This additional $3 billion in debt creates some financial leverage as the tax yield benefit. For example, the tax yield benefit, the after -tax cost of debt, 4 .58%, is lower than the cost of equity due to the tax deductibility of interest payments, which increases the proportion of debt in the capital structure, increasing the tax yield which tends to lower the weighted average cost of capital. However, this also causes increased financial risk. Higher debt levels increase the company's financial risk, which increases this increased risk is reflected by a new higher level levered beta and consequently a higher cost of equity. This additional debt slightly decreased the weighted average cost of capital. This suggests that based on the calculation, this move might be towards an optimal capital structure as the benefit of the tax yield outweighs the increased cost of equity at this level of debt and important considerations for the optimal capital structure this analysis assumes the cost of debt remains cost constant in reality adding more debt would likely increase the cost of future debt issuances the hamada equation assumes that the only effect of leverage is financial risk and that the tax rate is constant it does not account for potential bankruptcy costs or any other costs of financial distress that increase at higher debt levels and an optimal capital structure is the mix of debt and equity that minimizes the weighted average cost of capital, thereby maximizing the company's value, which is often an iterative process of evaluating weighted average cost of capital at various debt levels. Now, moving on to analyzing risk differences and project-specific risk. The risk faced by investors holding Netflix's debt versus equity is fundamentally different, reflecting their respective claims on the company's assets and earnings. For debt holders, they generally face lower risk. They have a senior claim on the company's cash flows and assets. They receive fixed interest payments and the return of principal at maturity, providing a more predictable income stream. Their primary risk is the risk of default, where Netflix might be unable to meet its interest or principal obligations, which is reflected in the calculated after-tax cost of debt of 4.58%, which is lower than the cost of equity, which means much less risk. Now, equity holders face higher risk. They are residual claimants, meaning they only receive returns after all debt obligations and other expenses have been paid. Their returns are directly tied to Netflix's profitability and growth, which are more volatile and less certain than debt payments. This higher risk is reflected in the calculated cost of equity, which is 11.66%, which is significantly higher than the cost of debt, as investors demand a higher expected return for bearing this greater uncertainty. Now, project-specific risk, and it's on using company-wide WAC. The company-wide WAC of 11.6% represents the average cost of financing for Netflix's typical investments. However, using this average rate to evaluate all projects, regardless of their individual risk profiles, can lead to suboptimal investment decisions. When considering the $5 billion content investment decision, if this content investment is significantly riskier than Netflix's average content production, for example investing in highly experimental formats entering new volatile markets using the company wide whack would underestimate the true required return for this project this could lead to accepting a project that is expected to generate returns below its risk adjusted cost of capital ultimately destroying shareholder value uh conversely if the content investment is significantly less risky than netflix's average uh uh using the company's wide whack uh this would overestimate the true required return this could lead to rejecting a project that is expected to generate returns above its actual risk-adjusted cost of capital, thereby missing a value -creating opportunity. The recommendation for the discount rate for the $5 billion content investment. Netflix should carefully assess the project's specific risk profile, and if its risk profile differs significantly from Netflix's average business risk, the company-wide WAC would have to be adjusted to reflect this difference and some methods for adjusting the discount rate first project specific risk include using a project specific beta if comparable public companies exist whose primary business aligns closely with the risk of the content investment their betas could be used to estimate a project specific cost of equity or you could add or subtract a risk premium based on a qualitative assessment of the project's risk relatively to the company's average, a price premium could be added to this company-wide WAC for higher-risk project or subtracted for lower-risk projects. Therefore, before using this calculated WAC of 11.6, Netflix should determine if the $5 billion content investment is an average-risk project. If not, this risk-adjusted discount rate should be determined to ensure a more accurate valuation and investment decision. Now, moving on to comparing Netflix's versus Disney's. We know Netflix's WAC is 11.6%, and after the $3 billion debt issuance is 11 .66%, while Disney's is only 8.2%. This is reflected because Netflix is primarily a streaming-based company. Its cash flows are largely dependent on subscriber growth and retention, which can be more volatile and sensitive to competition and economic conditions than some of Disney's businesses. People are less likely to purchase a netflix subscription if it goes up because netflix needs to make more money or if the economy starts going down meaning consumers have less money um where as disney is a diversified media and entertainment conglomerate with multiple business segments including theme parks and resorts media networks like espn and abc studio entertainment and streaming as well this diversification leads to more stable and predictable overall cash flows which can lower perceived risk. Diversification is key when it comes to lowering risk. And this higher perceived volatility and dependency on a single core business for Netflix might contribute to this higher perceived risk profile. In terms of capital structure, the proportion of debt and equity in each company's capital structure impacts their weighted average cost of capital. Netflix's weight of equity is 99.35 % and their weight of debt is 0.65%, whereas Disney is 30% versus 70%. their higher proportion of lower cost debt could lowers their whack provided the increased financial risk not outweighing the tax benefits perceived risk profiles beta measures a company's sensitivity to their overall market movements a higher beta indicates the higher systematic risk Netflix's beta is provided as 1.3 which is relatively high meaning it's more than the market the market will have a higher impact than the average company segments like theme parks or traditional media networks might have different betas than a pure play streaming service so it's very hard to calculate the beta for Disney considering all those different business models a higher beta for Netflix Netflix would contribute to a higher cost of equity, and thus a higher WAC, so it can be assumed that Disney's beta is lower. In terms of industry positioning and competitive implications, differences in WAC between Netflix and Disney can have competitive implications, particularly in the streaming landscape where they are direct competitors. Cost of capital is a competitive factor. A lower WAC for Disney would seem it has a lower cost of capital to finance its investments, including its streaming services, which could allow Disney to invest more in content, technology, or marketing for a given expected return compared to Netflix. The WAC serves as a hurdle rate for investment decisions. A lower WAC for Disney means a higher range of potential projects, which gives them more flexibility in investment strategy. WAC is a key component in valuation models like DCFs. A lower WAC generally results in a higher valuation, predicting the market's perception of lower, reflecting the market's perception of lower risk and or more efficient financing, and a higher whack for Netflix, if observed, could reflect the market perception of its business as having higher risk due to intense competition content costs, subscriber saturation concerns, compared to Disney's more established and diversified business empire. In this competitive streaming war, having a lower cost of capital can be a significant advantage as it enables more aggressive investment, potentially faster growth, or greater profitability over the long term. and lastly strategic recommendations um based on the whack analysis the decision of how to finance this the five billion dollar content investment should consider both the cost of capital and the impact on financial health and flexibility um the analysis showed that adding three billion in debt slightly decreased the whack from 11.6 or slightly increased the debt from 11.6 to 11.66 It suggests that Netflix may not have reached its optimal debt capacity yet. Therefore, using a portion of debt financing for the $5 billion investment could be a viable strategy to potentially lower the overall cost of capital and take advantage of the tax yield. However, this decision should also consider the actual cost of issuing new debt in the current market environment and whether issuing a large amount of debt at once is prudent. Equity financing is also an option, though generally more expensive. It doesn't add financial risk, but it does dilute ownership. A balanced approach, using a mix of debt and equity, would probably be optimal. The specific mix would be determined after a more detailed analysis of the actual cost of new debt issuance, Netflix's current debt capacity and target leverage ratio, the specific risk and expected return of the $5 billion content investment, market conditions for both debt and equity financing, and issuing solely debt might be tempting due to the tax yield, but could unduly increase financial risk and borrowing costs if Netflix is nearing its debt capacity. Solely equity financing avoids this financial risk but is more expensive and dilutive. The pros of debt financing is it lowers cost of capital, does not dilute ownership, and can potentially increase return on equity if invested capital generates higher returns than the cost of debt. However, it does increase financial risk. and the pros of equity financing doesn't add financial risk and provides greater financial flexibility but has a higher cost of capital. The impact on financial flexibility. Debt financing uses a large amount of debt. Doing this for this investment would reduce Netflix's financial flexibility. Higher debt levels mean a greater portion of future cash flows that will be dedicated to debt service, interest, and principal, leaving less cash available for reinvestment and new content technology or acquisitions, which could limit Netflix's capacity to fund future growth opportunities, especially during economic downturns or periods of intense competition. But using high equity financing would maintain this higher financial flexibility. With fewer debt obligations, Netflix would have more discretion over its future cash flows, allowing it to more easily fund future investments, pursue strategic acquisitions, or navigate challenging marketing conditions. However, the higher cost of equity could make some marginal projects less attractive. Now, using this mixed financing, you get the best of both worlds and limit the risk of both of these, such as lowering capacity to fund future growth opportunities or making some marginal projects less attractive, which means a balanced approach is probably the best idea. Netflix's financing decisions for significant investments like the $5 billion content initiative should be guided by minimizing WAC to create value while also maintaining adequate financial flexibility to support future growth and navigate industry dynamics. The tradeoffs between the cost advantages of debt and the flexibility benefits of equity must be carefully evaluated considering the current market environment, the company's specific debt capacity, and the risk profile of the investment itself. Regularly assessing the optimal capital structure and the actual cost of different financing sources is crucial for long -term. success. Thank you for listening.",
  "video_url": "https://www.youtube.com/watch?v=JYu_pPYs1JA"
}