{
  "student_name": "Krish Aggarwal",
  "org_defined_id": "036289409",
  "username": "aggar117",
  "email": "",
  "transcript": "Thank you for my session 907. But first we'll start by defining and discovering the problem. The core question is what's Netflix's cost of capital and how it should inform the 5 billion content investment strategy. Most of the way we need to we need to answer also what's the minimum return Netflix must earn to satisfy the investors, what is the additional debt financing effect, how does additional debt financing affect the required return, should Netflix use different hurdle rates for different types of content investments, and how does Netflix's cost of capital compare to competitors like Disney and Amazon. This matters a lot because the WACC represents the blended cost of all capital, both debt and equity. The minimum return Netflix must generate onto investment to maintain firm value if Netflix invests in projects earning less than their WACC, they're destroying shareholder value. If they earn more, they're creating value. For content-heavy businesses like Netflix, where they're considering a massive $5 billion investment, getting this number right is absolutely critical, and the difference between an 8% and 10% WACC on a $5 billion investment is $100 million annually in required return. So some of the given information that we can be working with is a market market cap of $200 billion, a total debt at market value of $13 billion, equity beta of 1.3, indicating Netflix is 30% more volatile than the overall market, bond rating of triple B plus with a yield of 5.8%, and a corporate tax rate of 21%. Some of the market conditions currently are risk-free rates of 4.5% based on 10-year treasury yield, market risk premium of 5.5%, which is the additional return investors demand for taking on market risk, and media industry WACC typically ranges from 8% to 10%. Some strategic context, Disney is operating with a 70% equity and a 30% debt, achieving a 8.2% WACC, Amazon Prime uses Amazon's corporate WACC of 9.5%, and Netflix is considering issuing an additional $3 billion in debt. All right, so two of the main financial concepts we're going to be using is the log-on, so the weighted average cost of capital, and also the capital asset pricing model, where we have a lot of variables already, after-tax costs, after-tax cost-exec, looking at different capital structures. Okay, and so that's stage two. The research side of this was just looking at traditional media companies like Disney, and I saw that they use more debt because they have stable cash flows and fiscal assets. Peer-based streaming companies like Netflix historically use less debt to do the growth focus, and Amazon uses massive diversified cash flows to support prime video with higher leverage. Netflix's data 1.3 tells us that the stock is more volatile than the market, and that makes sense because streaming is a competitive industry. Content costs are significant and unpredictable, subscriber growth can be volatile, and Netflix lacks diversification of competitors like Disney or Amazon. All right, now kind of getting to the implement and doing all the analysis. So yes, we kind of just set up some of our messages, some of our givens, and then down to actual calculations. I'll just show you, this was step one where we calculated the current walk of Netflix, I'm collecting some of the key metrics I had mentioned earlier, and all the different parts of the formula needed to calculate the final one, and these are just all the different required analyses that was on the page that we had to run. So these are just all the formulas for it, going all the way to five, which was the capital structure recommendation, and created some visualizations also to better understand what we're working with here. Okay, so we can see our cost of equity using the CAPM came out to about $11.65, which means equity investors and affiliates require a $11.65 return to compensate the risk of investing in Netflix. Also, calculate the after-tax cost of debt. Cost of debt came out to about 4.58%, and what this number really means is while Netflix was 5.82 bondholders, the effective cost is only 4.58% because interest payments reduce taxable income. So you just calculate a little bit of market structure analysis here and there, and then finally got to our final walk number, 11.22, which means its current cost of capital is 11.22%. This is also the hurdle rate, so Netflix must generate at least 11.22% return to create shareholder value. And then also, I did the walk after $3 billion debt issuance, so it's $3 billion extra. Now, it comes out, the new walk comes out to 11.13% because it's dropped about 0.09 percentage points. So that was the really main change in work, and this project-specific, a lot of project-specific walk. So adjusting the data, sorry, hold on. So our US content investment, adjusted rate is 1.11, cost of equity is 10.61, and the walk comes out to 10.21%. For an international adjusted rate, it comes out to 1.56, cost of equity is 13.08, and the international walk, this is 12.56. So interpreting the walk as a hurdle rate, this reveals that US content projects must earn at least 10.24% return to create value. International content must earn at least 12.56 to create value, or provide and should use about 11.22% of the walk. Main reason for these differences is because international markets, they have currency risk, regulatory uncertainty, less predictable consumer preferences, and higher content production volatility. If Netflix used a single corporate walk of 11.22% for all their projects, they would reject good US projects earning between 10.24 and 11.22%. They would end up accepting bad international projects that are earning between 11.22 and 12.56%. This demonstrates why big companies should use project-specific discount rates using a one-size-fits-all walk to support capital decisions. And there was also some done for Disney in comparison with Disney. So Disney is 70% equity, 30% debt. Disney and Amazon come out to 8.2% and 9.5% walk respectively. And why Netflix is 3.02% percentage points higher, they have lower leverage, they use much less debt, there's higher business risk for Netflix compared to the other two companies, and they have different tax-shared benefits. Disney saves far more taxes from interest deductions, and their tax share is about five times larger than Netflix in percentage terms. Strategic implications, this comparison reveals that Netflix could potentially lower cost of capital by moving toward a more balanced capital structure. This must be used against maintaining financial flexibility, resolving their triple B plus credit rating, and avoiding financial distress in the fall climate issue. So ultimately, using our sensitivity analysis, calculated a walk, a debt ratio is from 0 to 50%. Results are shown below. Right here, in this area, the current debt ratio is roughly about 6.1. The theoretical optimal debt ratio would be roughly about 50%. Walk is minimized. And the optimal walk is right about at 7.87%. While the theory suggests 50% debt would minimize more, this ignores financial distress, cost, credit rating, and distribution volatility, and strategic flexibility. So ultimately, the recommendation is Netflix should gradually increase debt to 25% to 30% of capital structure. By this range, this captures significant tax-shared benefits without over leveraging, moves closer to Disney's structure while respecting streaming industry differences, would reduce walk on 11.22 to approximately 9.5% to 10%. Maintains flexibility, it preserves the ability to invest aggressively in content-driven opportunities, and stays comfortably within investment-grade territory. So on a $5 billion content investment, the current walk on 11.22, they must generate about $5.61 million annually. At an optimized of about 9.7, they must generate $4.85 million annually. So there is a difference of about $76 million in annual flexibility between the optimal and current walk. And I can also just break down these graphs really quick. So this visualization, this shows the equity component, this is the debt component, and this is the walk here. So the debt column is only 0.28%. This demonstrates that Netflix's walk is almost entirely driven by equity cost. Equity cost is 39 times larger than debt. This tells us that Netflix has significant opportunity to add debt and reduce overall cost of capital. As we kind of saw here, this blue represents the walk at different debt levels. The red dash is where Netflix's current position is. And this green dash over here is the theoretical optimal at 50% debt. And essentially, we just see the difference in where Netflix could be and where it currently stands. And then for this one right here, the blue is the current. And then this is after the $3 billion debt issuance, it dropped it down to about 11.13%. That's a small but meaningful difference. This reduces 0.09 percentage points in the walk. And that's worth about $4.5 million annually. So this confirms that this $3 billion debt issuance is a step in the right direction. So this green bar is the US content at about 10.24%. Blue is Netflix corporate. Here, red is international content. Purple is Disney. Orange is Amazon. These gray dashed lines show the industry ranging between 8-ish to 10% average. But obviously, we see they do go a little high. This visualization shows how risk affects the walk. The US has the lowest risk with the lowest hurdle, while international has the highest risk. Netflix sits above both Disney and Amazon, which means Netflix is paying more for capital than its competitors, which is a disadvantage. If Netflix can't lower their walk towards entry norm, they need to generate high returns on content investments to compete effectively. So a project earning 11% should be accepted for US content, a marginal for corporate average, and rejected for international content. Then ultimately, main recommendations. Again, gradually increase that to 25-30%, capital structure over two to three years. For implementation, proceed with proposed $3 billion issuance. Continue with additional $7-10 million in debt over the next 24-36 months. Monitor the credit metrics to maintain the triple V plus or better rating. If we can expect a walk reduction, it should drop to about 9.5-9.8%. Annual savings of $60-85 million on $1 trillion content investment. Improve competitive positioning versus Disney and Amazon. A secondary recommendation would be implement a tiered walk framework. US should use 10.24%, international use the 12.56 hurdle rate, corporate use 11.22, and acquisitions at 2-3% premium for integration risk. This prevents value destruction from mismatched risk return profiles and improves capital allocation efficiency. Overall, to summarize this, there was a lot to learn in comparing what's in Netflix's debt and capital structures compared to main competitors of Disney and Amazon, looking at the different metrics used to calculate the weighted average cost of capital. It's interesting learning about that and using how that also acts as a hurdle rate and what are the different required returns for it to make sense to invest that much in capital. Yeah, it was a good project.",
  "video_url": "https://youtu.be/-S8Ag7Pj9-M"
}