{
  "student_name": "Andrea Typaldos",
  "org_defined_id": "036748997",
  "username": "atypaldo",
  "email": "",
  "transcript": "Hi, my name is Andrea. In session nine, I'm working on one main question. What hurdle rate does a company need to earn so that both deb holders and shareholders are satisfied? To make it concrete, I imagine I'm the new CFO of Tech Forward, Inc. The CEO shows three projects, each needing $100 million. First one, Project Alpha, that's an AI research lab. Expected return is about 15%. Then project beta which is a manufacturing expansion and the expected return would be 12%. And third project gamma an international expansion with an expected return of 9%. We can only pick two out of the three options. So my first thought was I need to compare this returns to the company's cost of uh cost of capital. That cost of capital is the WACC the weighted average cost of capital. And in this session I will use driver to understand what WACC is, how to calculate it and how to use it as a hurdle rate for these projects. First in the driver method I will I will define and discover. I define the problem the the problem with two main sources of money. Sorry. Tech forward uses two main sources of money which are equity and debt. Equity is the money from shareholders and debt is the money from bonds and loans. Shareholders want a higher return because they take more risk and lenders want interest and want to be paid back on time. So the company's true cost of capital is not just the interest rate on debt or the return shareholders want. It's the average of both the weighted by how much of each we use that that average is the WACC. My goals in this session are first to understand what goes into WACC which are the cost of equity, the after tax cost of depth and the market value, weight of depth and equity. Then I want to see how WACC becomes a hurdle rate for projects like Alpha, Beta and Gamma. And I want to connect this to my Netflix assignment where I'll estimate ne Netflix's WACC and decide if a 5 billion content investment clears that hurdle. I also connect back to earlier sessions with the time value of money, bond pricing, CAPM, and the market efficiency. Now, the WACC puts all of that into one number the CFO can actually use. Then I'm going to represent my problem. I represent WACC in a way that's easy to remember. WACC is the average return the company must pay all investors based on how much equity and depth it uses. That's putting it in simple words. The steps there's five steps which are the first one is to find the market value of equity. Uh the formula is shares outstanding times stock price. Then to find the market value of debt and to do that we use the market value of bonds or loans not just the face value. Third to compute the weights. There's two formula for this two formulas for this. The equity weight formula which is equity value divided between equity plus depth and the depth weight formula which is depth value divided by equity plus depth. Fourth, I estimate the component costs. To do that, the cost of equity for from CAPM, we use this formula, which is risk-free rate plus beta times market risk premium. Then the cost of depth is the current yield on debt and the after tax cost of depth would be cost of depth times 1 minus the tax rate. The fifth step, the fifth step is to blend them where the where the formulas would be for WACC equity weight times cost of equity and depth weight times after tax cost of depth. This one number is the hurdle rate and the projects with a return above WACC create value while the projects with a return below WACC destroy value. Obviously, we want uh the project with a return above wacc. Then we implement um I'm going to implement with the code you can see in the screen. Um I'm going to show you how to implement with a very simple code. In this session here, I pretend Tech Forward is financed with 40% equity, 60% depth. Depth cost 6% before tax and tax and the tax rate is 25%. The cost of equity comes from VCAPM. So let's say risk-free rate is 4% uh market risk premium is 5% and beta is 1.2. I wrote a small Python example like this one. And this code takes simple inputs we talk about in class, calculates the cost of equity using CAPM, adjust the cost of depths for um taxes and blends them into WACC. If this prints a WACC around let's say 9% then that becomes the tech forwards hurdle rate and then I have to compare it. Here you can see obviously the here um I did it in Python instead of showing it in Google Gemini for this session and you can see what the co so we can see what the code returns um so I now have to compare it I compare project alpha which is 50% which is um larger than wcc meaning it creates value project beta is also larger than WACC meaning it also creates value but product gamma project gamma is 9% almost the same as WACCC which it's barely at the hurdle so based on WACC alpha and beta look much better than gamma if I have to choose two projects now I have to verify um my work in this verify stage I ask myself does my WACCC make a number makes sense. So I would check are my inputs reasonable? Is it risk-f free? Real risk-free rate realistic is a market risk premium in the range we use in class. Is a beta typical for a company like this? Are the weights based on market values, not book values? And is my WACCC in a reasonable range compared to similar companies? I can also change inputs a little to see how sensitive the WACC is. If interest rates rates rise, the cost of debt goes up then WACC rises too. The if the firm takes on more debt beta may rise, meaning the cost of equity goes up and tax rate changes also move the after tax cost of debt. This helps me see that the WACCC is an estimate I can move when the market changes because we have to be careful with not only the code but for it to be reasonable. Then I evolve in evolve I think about where WACC shows up beyond this simple tech forward example. Once I know how to calculate WACC I can use it as a discount range rate in NPV and capital budgeting. I can also use it in valuation where WACC discounts free cash flows. I can also use it as a performance benchmark comparing returns to WACC and I can also study how changing the mix of depth and equity changes WACC in capital structure problems. So now to reflect uh which is the last driver step to wrap it up. The main thing I learned in session 9 is that WACC is the bridge between investors and managers. Investors say given the risk, here's the return we need. WACC turns that into a clear rule for managers and we only accept projects that earn more than this rate for tech forward. That means using WACC to choose between alpha, beta, and gamma. So for me, WACC is no longer just a formula. It's the minimum return the company must earn to keep all of its capital providers satisfied and to make smart discipline investment decisions. Thank you. This is what I learned for session 9. Uh, putting it in a example.",
  "video_url": "https://youtu.be/iOJPPs84p4Q"
}