{
  "student_name": "Bella Hess",
  "org_defined_id": "037228782",
  "username": "hessi",
  "video_url": "https://youtu.be/muXheSizlKE",
  "transcript": "Okay. Um hello. This is the session 12 um assignments business valuation and financial modeling. Just diving right into the driver framework. We our objective is to value Panera Bread for a prospective KKR takeover contra contrasting financial versus strategic buyer perspectives to recommend an overall bid range and strategy for the company. So we are combining DCF trading comps and precedent transactions to produce an informed bid range while contrasting financial buyer discipline with strategic buyer synergies. So we are given a couple different things here for the assignment. So the scale, the market references, the capital assumptions and the growth levers. Um, and like I mentioned, we will create an executive ready recommendation that states the valuation range, the winning bid strategy, and the rationale for choosing the financial versus strategic positioning. So we have uh some of our key drivers or the why for this um session is looking at the financial profile with $900 million um eBay on $6 billion revenue or 15% margin um which is stable, profitable and cash generative. Um, but it's important to recognize our growth thesis here. So, like stated, the unit expansion we're looking at is 500 new stores or 20% increase in 5 years. Our digital scale is 50% digital sales um providing a strong basis for the 70% target in the menu/jport expansion having dinner catering international um all of which are high lever growth areas that we can further implement with this. So for the bidder context, we are looking at KKR, which is the financial buyer, and they're needing a clear path to 20 to 25% um irr internal rate of return um constrained by the WACC of 9% and comps. the strategic buyers or the strategic strategic biders that we're looking at are MCD and SBUX. Um, with this it can justify a higher price due to the potential synergies. So some discovery evidence that we've looked at through the case is that the initial analysis confirms that Panera's quality so the high digital mix and the strong brand equity um 15% margin all warrant a premium to the average industry the uh price equity of 22 times but likely below the peak multiple of Chipotle as theirs is 35x PE. E moving on to the represent stage, we have an analytical plan here um complete with methodology, the purpose, the inputs or assumptions and the buyer context. So for the discounted cash flow or the DCF the purpose is to establish the intrinsic value or the anchor and the assumptions are 5-year projection WACC of 9% and the terminal growth of 2.5% to 3.5%. um which we can get from this inference with the deal snapshot from the case in the context here for the financial buyer. Um this defines the disciplined maximization or the maximum bid. The trading comps or the TC's the purpose is to establish the market price or the relative value. Key inputs consist of the peer set. So the MCD of 25x PE SBUX Chipotle um Darden and the multiples of 12 to 15X EBITA 22X industry PE and the buyer context. The financial buyer identifies a reasonable multiple premium. The precedent transactions were the key T established control premium. The synergy qualifications established strategic value added. Um and then again with the multiples here, synergy operating overlap, supply chain techn technology integration. Um and these two focus on the strategic buyer rather than the financial buyer. So for the president sets expect the expectation for premium. The synergy qualification justifies the premium above the financial buyer price. Implementing a discounted cash flow analysis. So the DCS DCF is the foundation of a financial buyer valuation. So we have some assumptions here. Um WACCC justification. We're using the industry of 9% as the base in the sensitivity test for the 8% upside and 10% downside. terminal growth um for the base case is 3% which is above the US GDP which reflects the global growth potential and the sensitivity for this is 2.5 to 3.5 and operating projections through the five years. So we have a revenue growth that starts at 8% declines to roughly 5% by year five and then the rest of the operating projections. So with this um our result summary here shows the different scenarios. So downside base side base case and upside and the WACC with the terminal growth and the implied enterprise value or the EV. So starting with the downside. So um the WACC for this would be 10% with the terminal growth 2.5% and the implied endprise value of $9.8 billion. The case base consisting of 9% WACC the upside consisting of 8% WACC terminal growth for base case would be 3% so um larger than the downside but in between the upside so less than the upside and the implied EV for the base case would be 10.8 with the upside being 12.2 2. So with this we're able to interpret that the highest EV would belong with the upside scenario, the lowest EV for the downside and base case kind of in between there with again the upside projecting the most growth through their terminal um growth ratio and then comparable company or the TC and the precedent transactions PT analysis. So this um the comps provide a market-based sanity check and help the price control premium or just help get a reasonable estimate on what exactly this would look like. So we have the valuation method consisting of the trading comps and the president trans um and the peer/transaction sets then the multiple use the range and the implied um enterprise value. So for the trading comps for the peer/transaction sets we can infer McDonald's, Starbucks and Chipotle would all fall under this category while the precedent um belongs more to restaurants/ the retail M&A. The multiples used here is the average um PE of 27X which is the midpoint of 25 to 35 and 14X EBIT TA for the precedence of the midpoint of 12X to 15X. So the range for the trading comps consists of 25x to 30x um PE and 13x to 15x ebda for the president trans. With this the implied um enterprise value for the trading comps is between 10 billion to 12 billion and 11.7 billion to 13.5 billion. So um we're able to derive this information since Panera deres a premium to the 22x industry average PE due to its digital leadership. So the 50% sales and the strong pipeline but is not yet as scaled as McDonald's with that 25 XP or as highly valued as Chipotle with the 35XP. um a 14x ED EBIT TDA multiple for control premium is reasonable um based on the precedent range that was given and then financial versus strategic buyer assessment. So for the financial buyer which is KKR in the situation the disciplined would be bound by roughly 9% WACC and the base case DCF um enterprise value of 10.8 8 billion. Some constraints to note with this is that there needs to pay a control premium over the current market price but must realize a high irr on their own and essentially they will need to anchor their bid to the low end of the 10.5 to 11.5 billion range that was given to us within the um the compar comparable analysis above management rollover. So the 10% rollover request suggests a motivated manager team which reduces KKR's required cash outlay and aligning the incentives for the strategic buyer. Um a couple synergy qualifications. So the cost synergies which would be the supply chain leverage, the IT integration, the store overlap efficiencies estimated for $40 million per year in savings and then the revenue synergies. So cross-selling, higher catering penetration and international acceleration estimated $30 million per year in the new revenue/improved margins and overall synergy value assuming the 9% WACC and 3% perpetual growth. The present value of the synergies is approximately 500 million. Um this is through their equation for the present value of $7 million times the 0.75 / the 0.09 minus 0.03. And then the impact with this is essentially that a strategic buyer can justify paying the financial buyer price and the value of the synergy. So pushing this justifiable enterprise value to 11.3 billion to 12.7 billion. For the validate stage, we're looking at the synthesis and the sensitivity. So using the football field synthesis um the chart essentially visually triangulates all valuation ranges with the valuation methodology considering of the DCF. Um so what we evaluated based off of the different scenarios the base the upside and the downside the trading comps so the 25x to the 30x um PE and the precedent transactions from the 13x to the 15x and then overall combined implied bid range so 10.5 to 12.5 to help the validate stage and kind of go into the implement stage as well. There is the valuation triangulation or the football field um visual that represents this and um it essentially visualizes and tables um table design to provide decision makers with a quick executive ready grasp of Panera's valuation and the sensitivity of the analysis to the key assumptions. So the dotted red line represents the base case EV. So falling in between the 10.5 EV and the 11.0 EV. And then the recommended bid range consists of that 10.5 to that 12.5 as we mentioned earlier. So over on this axis here, we're looking at the trading comps, the DCF analysis, and the precedent um transactions and where exactly they fall on the EV. um and just again highlights the recommended bid range of that 10.5 to 12.5. Some key insights. So the from the chart the DCF analysis provides the tightest range the 9.8 billion to the 12.2 billion um which represents the intrinsic value based on Panera's future cash flows and also to highlighting the premium. So the president transactions imply the highest value the 11.7 to 13.5 billion which demonstrates the typical control premium a buyer must pay and then the conversions as well. So the most compelling valuation range is where the DCF and the trading comps overlap which supports a competitive bid strategy anchored in the 11 million to 12 billion or excuse me 11 billion to 12 12 billion range and then also to the sensitivity table something to highlight. So the DCF valuation is pretty much highly sensitive to the cost of capital with the WACC and the assumed long-term growth rates. Um and again this table down here demonstrates the range of the potential EVs based off the changes to the inputs. So the downsides, the base case and the upside and then what this looks like with the terminal growth um at 2.5% 3% and 3.5%. And then again the high sensitivity to the growth. So with this we're able to see that even moving the terminal growth rate from the base case to the upside. So literally by 0.5% it increases the EV by 1.5 billion. Um so that 12.2 billion to that 10.8 billion. So even with the small terminal growth rate we're able to see a big outcome with the EV. And then the thing to walk away with this is that the downside scenario which has the high WACC and the low growth clearly defines the minimum justifiable valuation at 9.8 billion. So, we're able to see this with the graph, but we're also able to see it with the sensitivity table. And then again highlighting this sensitivity analysis um which essentially can be visualized in Python, we're able to see the change the WACC has and the terminal growth rate and the synergy captured um based off of the um volatility to the EV. So the key insights here is that the 10% EBITDA margin assumption um on the new store growth is crucial because it increases that synergy 50%. So that price value the present value of 500 million to the present value of 750 million. Also something to look at too is the terminal growth rate. So increases BPS um 50 increases 50 bps so 3% to 5 p 3 3.5% and the impact um from the base case is an increase of 0.8 billion and also two decreasing that 100 bps from 9% to 8% actually increases the um enterprise value from one or to 1.1 1.4 4 billion. So to take away from this, Panero is highly sensitive to the WACC due to its long-term stability. And then for the evolve stage, we're looking at the bid strategy. So the overall recommendation would be to do a strategic buyer with the financial discipline. So again, the recommended EV bid range is 11.5 to 12 billion um or equivalent to that 13.5 times um EBIT TDA because the range sits comfortably around above the DCF base case and within the president transaction range and it incorporates the roughly 50 to 70% of the strategic synergy value which makes it highly competitive against the other other strategic biders. Um, and it still maintains a clear path for the KKR. The digital premium for the is the argue for multiple at the high end of the comps. So closer to that 30x um PE due to the 50% digital sales pitch for the sales mix and the growth certainty um highlight the 500 store pipeline and international roll out as d-risisked future value. Some financing considerations should take into account um that KKR will seek a high leverage ratio. So five X to 6x to boost equity IRRa and the 10% managing rollover minimizes the upfront equity cash and aligns incentives for the growth. So again setting this walk away price. So set the firm's walk away price at 10 billion EV which is the bottom of the trading comms range in the downside DCF. So um just kind of taking the worst scenario and going with that for the walk away price. So all in all for our last stage of driver our learning and conclusion the analytical learning focus here was that the then our initial focus was too heavily weighted on the WACC the 9% and the sensitivity analysis actually revealed revealed that the terminal rate was um driven by the long-term growth rate is the single most impactful variable in valuation and a seemingly small small change in this rate has a massive effect on the fi final EV as we saw down here also in this um the tri the football field visual and with our volat volatility um analysis we're able to see again that the smallest increase in this growth rate has the a very large effect on the EV which underscores the importance of defending the 3% growth assumption in the report So our overall conclusion is that Panera Bread is a high quality high growth assets and while financials buyers disciplined price ceiling is around 11.5 billion the competition from strategic buyers means a winning bid must be very aggressive because the competition is so high and it is very in demand. And the recommended bid range is 11.5 to 12 billion which achieves this B balance which offers a premium that reflects the synergy potential while also anchoring the price to the defensible DCF and the comps metrics. All right, thank you so much and have a great rest of your night."
}