{
  "student_name": "Demi Freeman",
  "org_defined_id": "035770733",
  "username": "freem174",
  "email": "",
  "transcript": "Hello everyone. My name is Demi Freeman and this is my session 8 assignment where I'm going to be investigating market efficiency using the GameStop short squeeze as a real world case study. The key question I want to answer is, did GameStop price behavior violate the efficient market hypothesis or can it be explained by existing theories like behavioral finance and market structure? Before I do anything else, I started with factchecking. This assignment stated that GameStop traded at 4 cents in August of 2024, but that's incorrect. According to Yahoo Finance, GameStop actually closed around 1.67 67 $1.67 per share in August 2020 on a split adjusted basis or around $4 to $6 unadjusted. Yes. So yes, it was trading at low levels but nowhere near 4. This stage helped me define the real data, confirm the timeline, and understand the core events like Ryan Cohen's investment. the January 21 2021 price surge to 483 in the trading restrictions that followed. Next, I mapped out my analytical plan. And then this is the represent stage. I decided to test how gain, stop, price movements fit into three forms of the efficient market hypothesis. The weak form which says prices reflect all past data. The semi-rong form which says prices reflect all public information. in the strong form, which would mean even insider information is reflected, though that's almost never realistic. I also plan to explore behavioral finance explanations like hurting, overconfidence, attention bias, and FOMO, as well as limits to arbitrage since short selling constraints in margin requirements played a major role in this case. To test efficiency, I chose an event study approach, comparing GameStop's actual returns to what the CAPM model would predict around key events. Now, let's move to the implement stage where I actually put the analysis into action. I use Python and Google Collab and pulled data from Yahoo Finance for both GameStop, GME, and S&P 500. Then I ran a CAPM based event study. That means I estimated GME's alpha and beta using a 250day estimation window and then calculated abnormal returns and cumulative abnormal returns around important dates like August 2020 13D filing and the December 2020 increase in Cohen stake in the January 2021 trading hall. And so as you can see here is on the screen I have my code listed out here. You can see I have everything in here and this was AI generated. So I'm not going to go through and fully elaborate everything on there, but my results that I'm able to get from this collab um and Python, you can see we have some visual representations here. Here's a first graph and this is the GME C around that first state there 21208. And so you can just see those visual representations of those important timelines that were stated in the earlier. So the graph shows how abnormal spikes return spikes massively in the mid January 2021 especially when retail volume increased 10fold in trading platforms like Robin Hood began limiting purchases. So you can see those spikes um around that time. In the validate stage, I tested whether those abnormal returns were statistically significant, and they definitely were, particularly during the 2021 January surge. But that doesn't necessarily mean investors could systematically profit. During the peak, we saw buying restrictions, margin calls, and haltered halted trading, which made it almost impossible for rational traders to capture those gains in real time. So while GameStop's price clearly overreacted, the presence of these frictions actually supports part of the EMH because if inefficiencies couldn't be easily exploited. The next stage is evolve. And this is what I learned and how I'd apply going forward. This event shows that while markets aren't perfectly efficient, short-term distortions can still be explained by behavioral forces and real world constraints. Social media coordination, emotional investing, and limits to arbitrage cause temporary mispricing. But over time, prices move back to back towards fundamental values. It highlights how behavioral finance completes the EMH, showing that human psychology can dominate for a while, but not forever. Finally, in the reflect stage, I looked back at what all this means. GameStop short squeeze challenged the semi- long the semi- strong form of market efficiency. Prices didn't immediately reflect information and they reacted irrationally for a period. However, when we factor in things like risk, transaction costs, and trading restrictions, the efficient market hypothesis still holds up reasonably well. To me, this case proved that markets can be both efficient and emotional. efficient in the long run but tempor temp temporarily driven by crowd behavior and attention. It also shows why passive investing remains powerful and why trying to time hype driven trades is incredibly risky. Thanks for watching my driver analysis of the GameStop short squeeze. This project helped me connect financial theory, behavioral economics, and data analysis all through one of the wildest markets ever wildest market events in recent history.",
  "video_url": "https://youtu.be/6OxZIAOmElA"
}