{
  "student_name": "None None",
  "org_defined_id": "036050644",
  "username": "jdragoni",
  "video_url": "",
  "transcript": "All right. Hello there. I'm Joe Dragoni. This is my management 310 mini project 3 where we're going to build an advanced AI finance tool um using an AI finance platform. Uh for me, I'm going to be using Google AI studio to do this. Um as well as iterating through a couple loops of the driver framework to help create uh what what we've progressed to as an intelligent finance tool. at least what I hope is seen as an intelligent intelligent finance tool. So, um going through the driver framework to create an app to make a intelligent financial decision. Um, with some help from Google Gemini, um, I looked through a couple options about what could possibly be a good calculation to make that also can be explained. And I came to I decided to make a safe withdrawal safe withdrawal rate calculator or SWR um, which is used to tell a retiree or a person who's recently retired how much they can spend in a certain year um, for every year until the end of their life. um how much they can spend out of their retirement fund without running out of money. Um and this is something that would be useful for people who recently retired to figure out a plan to spend their money and how certain economic conditions might play a part in changing their spending habits. So that was my D for driver, the define and discover stage where I really just, you know, figured out the decision I wanted to make and the goals and, you know, how it could be useful to someone. for the represent stage how AI can help to develop something to make it smarter and actually do something. Um what I determined or had Google Gemini help me to determine was um what it can calculate in this app. So given a sum of money in retirement um a certain retirement fund that a person might have um they can calculate the withdrawal percentage from the fund using the cape valuation or the cy cycllically adjusted price to earnings calculation and then you can also calculate withdrawal rate using the guidinger guardrails logic um which is the industry standard for dynamic withdrawals and it prevents the user from running out of money by slightly cutting spending during crashes and giving raises during booms. So something to else to do in this app would be to you know sort of model different calculations or different economic conditions to show that the e the economy especially in the United States is dynamic and it won't be perfect all the time. Um and can also this app can also check for personal inflation using past history as well as flexibility rates to cut spending when needed based on transaction history. So that was my represent stage um to implement AI into this app. Like I said, I developed the app using Google AI Studio. Um I use Google Gemini to help come up with the idea and using that information generate a prompt to input it into Google AI Studio. So I couldn't get my app to this is my final loop, my second loop of the app. Um as you can see, we have the initial portfolio. where you can in input a number um that you have in retirement, the cape ratio valuation which helps like I said to calculate the um withdrawal percent from the fund um per year and then also the flexibility score um from 0 to one and then there's different market scenarios like a random walk using the Monte Carlo simulation um an early crash in the economy an extended bull run and a flat loss last decade. So, we have the ability to change the scenario um of the economy, but for the sake of ease in demonstrating this app, I'll just be using the random walk scenario. And then we also have a place to input an inflation rate. So, 0.05 would be 5% inflation for the year. We can also we can, you know, raise that as much as we want to do, but we we'll play with that for a little bit. Um, I'll have some different scenarios to implement to show how this works. And then it shows us a portfolio trajectory, um, how much we'll have left per year depending on inflation, um, or past spending habits. And we can see, you know, how much could go back into our account based on investments we have or, you know, if it goes down based on spending habits. Um, and we can see it also tells us the action, which I'll explain in a second was part of my second loop. Um, then we also have the annual income based on our flexibility score. Um, some years it goes up, some years goes down again based on withdrawal rates and the action that we could take as well as, you know, how the economy was being that year. Um, and then you go down here and it runs a simulation. Um and then it'll show you the outcome of survival as in how much you'll have positive funds in your account. Um how much you'll withdraw over the 30 years which is you know what we what we came up with as the typical um period of retirement until the end of life for a person. So 30 years, how much they would withdraw over that time and then the final balance based on, you know, time value, money, the economic conditions and investments that they may have. And then like I said, this is the final outcome of we're running through two loops of the driver framework to de develop this app. And this ledger details part was part of my second loop where I wanted to help it to explain better, you know, how to um yeah, explain in words the actions to take um and how that would affect our withdrawal amount in our portfolio. So like in our current situation that we have here just a test run we can see you know the returns per year um in our portfolio or withdrawal and then the action to take. So in this case we would freeze our spending habits a little bit um in the second year 11.2% return how that impacts our portfolio. Um our withdrawal stays the same. Um and this is due to you know an infl an inflation increase. Same with year two. Um and then you know the guardrail metrics here for the next five years of cutting spending due to the returns. So that just shows the little basics of how it works. We'll be able to I have a couple of inputs to test out with this app. So moving on to the validation stage of you know seeing if it's helpful. So I had Gemini also help me to come up with a couple of you know input examples um based on certain economic conditions to run to test. So we can play with those real quick here. So for example the stagflation nightmare um an initial portfolio of 750,000 in the fund. So 750,000\n\nthe cape ratio of 12 which is a low ratio. So get that to 12. The flexibility of 0.2 which is also pretty low. Um you know it shows us the again with these ratios these toggling these slide toggle things. It shows the implied S SWR and the um you know if it's if we're spending if we are highly fud flexible with our spending or more um rigid due to the risk of depletion. And then the inflation rate was 9.5%. So higher inflation. So it doesn't go to 9.5% but we can just do 9% just to show it show it off. So we run the simulation. For example, this shows us that in a couple of first years we go from having a balance our initial portfolio of 750,000 to you know almost a million dollars. And then as that goes along we we are losing money at year eight. Our our lowest point for a while. The local minimum is um $447,000. Goes back up and then again goes down um towards the end of our period of retirement and we end up you know at a withdrawal rate of 7 $75,000. So losing almost all of the money we have over time due to you know spending economic conditions. Um, and then we can also see the annual income year by year. And then we go down to look at our simulation income. You know, we have a survival rate. We survive all 30 years. We've we've withdrawn in total 1.4 million. So almost double what we had in our portfolio originally. And our final balance is, you know, $75,000. 08 million. Um, and looking at our ledger details, we see the inflation increase for the first three years and how the high those gives us those high returns, but then just over time it the returns decrease, increase a little bit, but constantly decrease for a while. Um and our action is to you know cut our spending just because of how much money you know we're spending each year um due to our you know flexible or our non-flexible rather spending habits due to our low flexibility score. So, just another test we could do. Um, the boomer baseline start with a million dollars here. 1 million\n\nthe cape ratio of 20. So, a high cape ratio or a higher cape ratio rather than the 12.\n\nThere we go. 20. The flexibility of 0.5. So, right in the middle also. and then an inflation rate of 3%. So go to.3. You run the simulation here\n\nand then we see we start you know with right around a million dollars the first year and then over time that trajectory of our portfolio you know increases due to our you know our higher cape ratio. our flexibility score of, you know, not spending overly or yeah, not being overly spendy but not really being rigid with spending. And then the the lower inflation rate also helps us um as the value of our money increases over time. And then again surviving all 30 years, withdrawing almost 2 million um over the 30-year period and then our final balance being, you know, 3 million when we start out with a million. So this is a very you know a ideal situation to have as our balance grows over time. Um we can see you know we don't really need to cut spending here. Um besides a couple years where we get you know a little bit of negative returns but the inflation increase action is the most most common action to take. years 19 to 21, you know, we can raise our spending um because of our very positive returns. Um so this is a good case to have. Um and then the last case to run, you know, the tech level start with where we got a higher cape ratio, higher flexibility, the lower inflation rate, and then $2.5 million to start with. So $2.5 million to start with cape ratio of 38\nright cape ratio of 38 flexibility of 08 also high still in the balanced category but also high and then our inflation rate was 2.5 we'll just call it two we run this and then we see here we start with $2.5 million And that increases all the way up to, you know, $16 million over time. Which, as we've learned about with tech startups, you know, in this class, these can be risky investments, but with the right outcomes, this can be very good for our retirement fund over time. Again, our annual income increases. And then we look down here and see that, you know, most of our actions are positive. we can raise our guard rail by 10%. In a couple years, just keep how we're spending. Um the first couple years we increase the guardrail, maybe a couple times we get negative returns. So we just, you know, freeze our spending habits, sort of be more conservative with those, but for the most part getting positive returns. So that's just a couple a little bit of demonstration of how this app works. this dynamic SWR engine made with the guid and clear model in Google AI um Google AI studio. So that's how we can show that it's helpful to someone who wants to you know figure out what to do um with their spending habits in retirement when they're not really earning a steady income from a career. So how to make this app more useful in the future in the evolve stage? Um, you know, like I said for my first loop when I was going through the driver framework, I thought, you know, adding explanations for year-by-year action was something to make it more useful. Um, and you know, like I said, the course 30 years, retirement period of person, which I looked up. Um, was how we can make it more useful after the second loop with our final product here. Um, I think the way we could make this more useful might be to, you know, add a couple more configuration features. Um, maybe test it with some other market scenarios and add a place, you know, to talk about like stock or bond investments and how that might affect our portfolio trajectory. Um, with certain risk rates as well, maybe even, you know, a couple hurdle rates to jump over and the rate of return we need to have positive returns in retirement. And then just lastly the reflection stage. What we thought what I think is different about building with AI as a component rather than you know making things all myself. um embracing the use of AI to build a cool platform that can simplify tasks and also that when you know how to use the app, it is really not that hard um you know to make something cool and useful and also intelligent and can be used to make and we can use services like N8 and Google AI studio to make many cool apps that don't just perform finance tasks but maybe other things. Um I I found the driver framework to be very helpful in this case as the systematic way of thinking allows me to think through step this step by step and I think it is very helpful when looking to build something like an app or platform. I think this app is a way to have easier to interpret results from the inputs you put in like the cape ratio or the flexibility score and then how our money could grow over time. Um, and it gives you insights year by year as to how spending habits might change. Um, which I think is very helpful. Financial prompt engineering was a little challenging in my opinion just because calculations might not be right at the first couple loops. You know, I I did spend a decent amount of time on this, but nothing like crazy. A lot of these professional apps are developed taking months, even years, and I only spent, you know, a few hours working on this. So definitely would need to implement a lot more driver loops um to really trust it. Um you know a little bit of over reliance on AI like discussed in class might setting might set this app back a little bit um sort of overrusting it but for now I think this is a good place to be. Um an ethical consideration you know tying into the last bullet point here is that users might blindly trust it with trust it with their money. Um but if the calculations are wrong and cause the loss of this money, then that is on you know the company that developed the app. So say I have a company and this is my product, it would be on me and we would be you know in a lawsuit or something that could really hurt me. So I think you know we must perform more loops to refine this app, spend more time on it to really get it to where we want to be. And then lastly, um, just at this stage in time, I would I would not personally invest my own money in this, um, or trust it with my own calculations and follow what it says just because, you know, it's hard to trust the AI calculation without more validation and more driver looping to ensure it works perfectly. So, I would say you can use it to get an idea about the strategy um and a way to visualize this plan, but I wouldn't, you know, follow everything it says to a tea with my own money in retirement without taking more time to refine it. So, this is the app that I created with my mini project 3 and I appreciate you watching this. Thank you."
}