{
  "student_name": "William Borowski",
  "org_defined_id": "035938460",
  "username": "wborows",
  "email": "",
  "transcript": "Hi, my name is Will Borowski, and today I'm going to be presenting our comprehensive capital budgeting analysis for the Starbucks proposed flagship roaster project. This is a $12 million strategic decision, and our job as financial analysts is to cut through the excitement and ensure that this investment creates tangible shareholder value. We'll be using the firm's 8.5% Weighted Average Cost of Capital, or WACC, as our minimum hurdle rate, and the Net Present Value decision rule as our golden standard. Our analysis rigorously follows the DRIVER framework, which ensures a disciplined, step-by-step approach. First, in the 'Define and Discover' stage, we frame the problem: Does this 10-year project, with its complex cash flow patterns, earn returns above the 8.5% cost of capital? We immediately identified all incremental cash flow components: the initial $12 million equipment cost; a temporary but necessary $500,000 working capital outflow at time zero, which is fully recovered at the end; a multi-phased annual operating cash flow driven by revenue changes; a depreciation tax shield from the $1.2 million annual straight-line depreciation; and finally, the crucial terminal value in year 10, which includes both the working capital recovery and the after-tax value of the asset. Moving to the 'Represent and Implement' parts of this, we moved these components onto a 10-year timeline and automated the entire process using Python. Here is our script. As you can see, we coded it and imported multiple modules to ensure we got a good final result. The complexity here lies in the phased revenue: $8 million initially, peaking at $11 million in the mature phase, and declining to $9 million. This requires a dynamic, year-by-year cash flow calculation. The most common error in capital budgeting is the terminal value. The assignment gave us the gross salvage value of $3 million. Since this asset is fully depreciated, we must correctly calculate the after-tax salvage value. For our after-tax salvage value, we got $2.25 million. This is the correct value that flows into our year 10 calculation, which, along with the half-million dollar working capital recovery and the final OCF, yields the 10-year net cash flow value of $4.55 million. And as you can see down here, this is where we got that $4.55 million cash flow. Now let's review the base case financial metrics using the 8.5% WACC. As we scroll down here, you see that we got the 8.5% WACC. The Net Present Value is calculated as a positive $2.69 million. A positive NPV is our primary indicator, telling us that the project generates $2.69 million in value above and beyond what is required to compensate our investors at 8.5%. The project's Internal Rate of Return is 12.84%. Since 12.84% is significantly greater than the 8.5% WACC, it confirms that the Net Present Value decision is financially attractive. Next, we get to the Profitability Index. The Profitability Index is 1.22 times. This means that for every dollar invested at time zero, the project generates $1.22 in present value of future cash flows. This is a strong acceptance signal. Then we get to the payback metrics, where the simple payback is 5.28 years and the discounted payback is 8.21 years. This project recovers the initial capital relatively quickly, well within the 10-year life, which addresses a key liquidity concern. Financial analysis is incomplete without testing assumptions. The 'Validate and Evolve' stages test the robustness of our accept recommendation through sensitivity analysis. We focus on two major areas of risk: operational risk and market/financial risk. A flagship roaster's success hinges on attracting foot traffic and driving high sales. What happens if our revenue projections are optimistic by around 20%? Under this stress scenario, the NPV plummets from a positive $2.69 million to a deeply negative $3 million. The IRR falls dramatically to just 3.13%, which is less than half the WACC. The insight we gain from this is that the project is highly sensitive to revenue risk. Even a moderate sales shortfall transforms a project from a value creator into a value destroyer. This vulnerability must be addressed in the final recommendation. For scenario B, we test financing risk. We tested the decision against a WACC range from 6.5% to 10.5%. As seen here, at a lower WACC of 6.5%, the NPV increases to $4.24 million. Crucially, even at a stressed WACC of 10.5%, the NPV remains at a positive $1.35 million. This project is robust to moderate increases in the cost of capital. The 12.84% IRR provides a healthy buffer against market fluctuations. This means the decision's vulnerability does not lie in financing, but purely in operations and revenue execution. This chart confirms the financial logic. The NPV line is clearly above the zero net present value line, as seen here. Next, we see that the WACC range we tested indicates a profitability buffer. However, the extreme sensitivity to revenue shows that the profitability buffer is thin relative to sales volume risk. This project's economic viability hangs on hitting those sales targets. This brings us to our final stage: reflection and the execution recommendation. The final conclusion is clear: based on the base case model, we should accept the project. It generates a $2.69 million net present value for shareholders, outperforming the cost of capital by over 400 basis points. However, our managerial recommendation must be conditional. The quantitative results demand we move forward, but the sensitivity analysis exposes a critical risk. The project cannot absorb a 20% drop in expected sales. Next, we get to our strategic justification for brand and strategic fit. This roaster is not just a coffee shop; it's a flagship, a brand investment. Its value extends beyond a cash flow model and supports the premium brand image, which is a qualitative benefit that often justifies some financial conservatism. Next, we get to our financial leverage. The PI of 1.22 times is strong, and the quick simple payback of 5.28 years minimizes the time Starbucks' capital is at risk. The actionable mitigation plan is this: before breaking ground, management must conduct a highly detailed market validation study to refine the sales forecast for the $11 million in the two-to-five-year phase. This strategic importance justifies the investment, but the financial risk determines better execution. Certainly, this entire exercise confirms the central role of the NPV. It is a framework that systematically converts a complex idea into an objective, value-based metric. It cuts through the emotional arguments of supply chain independence and brand positioning and provides a single defensible number that guides a firm towards its ultimate goal: creating wealth for its shareholders. Thank you.",
  "video_url": "https://youtu.be/ZGEqmtJ4Aiw"
}