{
  "student_name": "Isaac Buche",
  "org_defined_id": "036112318",
  "username": "buchei",
  "video_url": "https://youtu.be/vnjb7cOUI6s",
  "transcript": "Hello, this is Isaac Buche and this is my uh session 11 assignment. So, jumping into this assignment, um we're asked to evaluate Apple's hypothetical $90 billion share repurchase using the driver method. Act act act as an independent analyst who must determine whether the buyback creates value relative to the alternative alternative uses of cash while balancing the stakeholder incentives. So, a little bit of our givens here. We jump into our liquidity being $165 billion cash and investments and $100 billion annual free cash flow. Our market context at $185 um at $185 share price PE 30 dividend yield at half at half a percent and then $15.5 billion in shares outstanding. Our balance sheet shows $110 billion in debt and that Berg share owns 6% CEO holds about three million shares. Our retail investors averaged 100 shares and employees have $170 strike options. So our proposal being 90 billion buyback executed over one year at a 10% market cap. And then all alternatives are a $6 special dividend um a strategic ARVR acquisition a debt a debt reduction in incremental R&D. So deliver a recommendation that explains the stakeholder impacts agencies considerations and value creation value um versus value transfer outcomes. So to define our problem here we have a liquidity surplus of about 165 billion in cash and then the hundred billion um in annual free cash flow. So, our proposal to is to deploy a $90 billion um into buybacks, which the core question is does buying back stock at the at a PE of 30 $185 per share um create value or is it just a value transfer that um satisfies the management's incentives. So jumping into our represent stage um we're going to want to um figure out um these all these um givens here. So our buyback calculate shares retired at a current price. So, we want to find our new EPS and then our dividend. Um, we want to calculate the total cash flow, um, no changes in shares, the stock price adjustment, and our valuation check, um, we're going to compare the earnings yield and, um, versus the cost of debt and the cash yield. So, our output, our output is going to be this a stakeholder impact showing um, who wins and who loses in each of the scenarios. So, jumping into our implement stage here, I had um Gemini write us a code here and this is what it populated and I put it into um Google Collab. So, looking into this, we have our input assumptions. um all of our financials, our logic here written written into our code um the execution and our output. So we already ran this code but we can run it again. This is our um our outputs here from this code. Um so it shows that with no spend about 6.617 in um and um EPS for the status quo buyback at 6.18 our dividend at 5.98 at the $6 per share. So our shares, it shows our shares here, our in net cash, our incach, and then our net cash position. So um the model shows that a $9 billion buyback retires roughly 486 million shares. Um which is about 3.1% of the float. This drives EPS from um 617, which changes EPS from 617 to 6 um 18 there. Um but however you can see the um the cash drops by about um the cash drops about about 90 million there are in cash from 265 to 175. So if we only look at um the 90 billion in the factoring of the income. So since um Apple generates about 100 billion of FCF annually they push the cash out immediately. So the balance sheet remains um slightly fortress like so going into our value our validate um stage here um buying back stock at a PE of 30 implies in earning yields of about 3%. If Apple cost of capital is higher than that um which it more than likely would be um this pipeback technically destroys the economic value in short term even if it boosts the um EPS. So I validate So then we validated the CEO's incentives with options at $170 strike and the price at 185 in the CEO of the company and the dividend drops the stock price um to under $180 roughly um which reduces the value of these um options and a buyback supports the price the management team is biased towards the buyback. So in signaling um a $90 billion contract buyback signals we have established cash flow but we don't see the 90 billion worth of high growth R&D opportunities. It validates Apple as a cash flow rather than a high growth um compounder.\nSo moving into um our evolve stage. Um so why not the the first question in my evolve why not the $6 dividend? Well, it cost $93 billion, so it triggers immediate taxes um for the Birkshshire and retail. It offers no structural advantages to the EPS compared to the others. Um so why not acquisition? Um so then we're spending 90 billion on AIVR. While um this might be um would invite massive antitrust um scrutiny, it is likely impossible to execute in the current um environment that we are living in during for this um problem. And then why not the debt pay down? Um Apple has no necessarily net cash currently. So paying down cheap debt is um in inefficient and um just not worth it for them. So then going into our um reflect stage and our um where this is where I will give my recommendation. So um as a recommendation we um recommend approving the $90 billion uh repurchase of the program. Um it serves as the largest uh shakeholders uh shareholders in Birkshshire via the tax efficiency and aligns with the managerial um incentives their options. So even with this spin, Apple's $100 million annual FCF maintains a net neutral positive cash position as well. So the financial health is very is still solid and our market signal it provides a floor for the stock price. So that just gives us a little bit of safer option through that and um allows us to um create um a much safer for Apple. Um so that's pretty much it. That is my final conclusion of my session 11 assignment. Thank you. This is Isaac Buche and goodbye."
}