{
  "student_name": "Josh Saarnio",
  "org_defined_id": "037335313",
  "username": "jsaarnio",
  "email": "",
  "transcript": "Okay, this is my session nine assignment. So, first thing we're going to look at is our situation. So, we're calculating the weighted average cost of capital or the whack. I'm going to refer to it as the whack for the rest of the video, but that's what that is for Netflix in connection with a hypothetical $5 billion content investment decision. Your analysis must determine whack, evaluate the impact of additional debt financing, assess project specific project specific versus firmwide discount rates, and compare Netflix's cost of capital to industry peers. So, is this the right doc? Uh when looking at the define and discover stage, uh obviously the first thing that we want to look at doing is answering uh these five questions. So find their current whack, determine the whack after the $3 billion debt issuance, uh evaluate the project specific whack, compare Netflix's whack to Disney's, and then recommend uh optimal capital structure strategy. So yeah, that's what that is. Normally, this is where you do some data validation, but considering it is a it's basically a madeup scenario, and these are just the numbers, uh you don't really have to do this, but if I was doing this for a real scenario, this is where you do data validation to make sure that everything is the numbers are all correct and that you're working with the correct data. Uh yeah, that's what that's what this is. I just repeated that. So then looking at what I did with the AI, I basically just told it calculate those five uh five values and then gave it all of the crucial information and then have it use kiss. And what we have here, so the first task that we had to look at was calculate Netflix's current whack. As we can see, it is 11.22% previous before the decision we're trying to make. Uh the next thing we want to look at is the whack after the $3 billion debt issuance, which is what this is. As you can see, it changes slightly. It goes from 11.22% 22% to 11.2%. So there is a little bit of a decrease and as you can see it says here uh the whack decreased slightly due to the tax shield of the new uh debt. So that's what that is. Is there anything else? Yeah. And then the next thing that we wanted to look at was evaluate project specific whack. What we got for this was looking at I mean we don't know what uh we're not 100% sure what the beta could be in this scenario because we don't know the ins and outs of the project because obviously it's a madeup scenario. But what it used for this was uh a US uh market versus an international market. And what this would show is the US market would have lower risk because it's a very established economy. Whereas if you're going to an international market, there's a lot higher risk involved because it doesn't have the same financial backing potentially that the United States does. It's not as reliable. So that's the comparison that we're doing here. Then with the US uh market the project specific whack would be uh 10 point 19% and then with the international market with the potentially riskier propositions it would be uh 12.25%. So yeah, there would be a slight difference depending on what market you're trying to launch the uh the projects into. So that would be something that you would have to look at when uh you'd have to specifically calculate that when looking to potentially launch the projects. Next you're going to look at is compare Netflix's whack and Disney and then look at trying to explain the difference in the two. So, as you can see up here, the whack for Netflix is 11.22%. As we said earlier, uh Netflix is dead is 6.1%. Disney's whack is 8.2% but their debt is at 30%. So, obviously, uh the big difference is the debt and then the leverage surrounding that. So, obviously Disney with 30% debt versus Netflix is 6.1. Disney is going to be far gonna have significantly more leverage than Netflix would. Uh something else to note is that more debt would create a larger tax shield from tax deductible interest which will then end up lowering the whack because uh obviously taxes are part of whack calculation. Uh the other thing that it talks about is the cost of debt. So, since Disney is like a hundred years old and they're very established, large company, it is likely that they would have a higher credit rating than Netflix would, which would allow them to potentially get lower cost of debt and better interest rates, stuff like that, because they're just a more established company that banks are willing to lend money to a lot easier than Netflix. Now, Netflix is a big company. It doesn't have the credit history. It's a somewhat newer company, particularly in comparison to something like Disney. And then cost of equity. I kind of just talked about that, but oh, what this talks about is diversification because Disney is pretty diversified. I mean they're they have their hands in just about everything in the entertainment industry which would lower their beta because say there's some huge like co for instance would be a good example of how Disney could potentially survive that because although their parks would take a big hit there stuff like their TV movies and streaming would potentially go up because of something like that and it would help kind of balance out the hit that they would take. Whereas if Netflix had a problem with their streaming, they would get absolutely ravaged by it because it's really their only it's the only business that they're involved in. And then task five, recommend optimal capital structure and strategy. The big thing here is obviously that Netflix is underleveraged. 6.1% of debt probably isn't probably it definitely isn't anywhere near where it should be. It's not optimal. Uh goes to kind of perfect. Yeah, obviously what you want to do is if you're able to add more debt, it will uh give you a better whack in the end. However, there's a balance to this, which I think it talks about here, like finding the sweet spot. If you add too much debt, it can give you a risk of bankruptcy because you won't be able to pay it back. Uh so that's something you have to consider. But obviously at 6.1% they're pretty uh far off of having to worry about that. There's plenty of room for them to add potential debt to try to increase their leverage and try to get that better uh whack. uh a potential recommendation, it's not exact, but somewhere around 30%. It could be a little bit more, it could be a little bit less, but somewhere around there would be a lot more appropriate than being at the 6% that they're currently at. So yeah, I would I mean I would give a range anywhere from you could say probably 25 to 35% even a little bit more or a little bit less if you want to be on the cautious end of things but easily double where they're at right now would be beneficial to their company. So that would be my recommendation to uh Netflix in terms of trying to restructure their uh restructure their capital structure. Uh thank you",
  "video_url": "https://youtu.be/x73qlnMBsZM"
}