{
  "student_name": "None None",
  "org_defined_id": "034075524",
  "username": "htobias",
  "video_url": "",
  "transcript": "Hi, my name is Hillary Tobias, and this is my video for Mini Project 3. I used Google AI Studio for this project and the finance tool that I created is an app that will analyze a what-if scenario based on the user's current financial position. In order to use the app, the user starts by putting in numbers to reflect their current finances. The inputs include a monthly salary and any other monthly income, monthly expenses including rent or mortgage, utilities, food, transportation, insurance, entertainment, loans, and any other monthly expenses.\n\nNext, the user can put in their total assets, including cash, savings, investments, and property. And lastly, the user can input their total liabilities, including credit card debt, student loans, car loans, and any mortgage balance that they have. After inputting the numbers, the user can easily see a snapshot of their current financial health. This displays the user's monthly income and monthly expenses on the left, as well as their net cash flow and savings rate. And on the right, it shows a breakdown of the user's expenses, and at the bottom here, it shows what percentage of their income the user is using to cover their expenses.\n\nAnd next, the user can type in a what-if scenario that AI will analyze, or the app also provides suggestions of scenarios that the user can select as well. I'm going to ask the app what will happen if I buy a $20,000 car with a $3,500 down payment. And so, after putting in a proposed scenario, the user can click the run simulation button, and the app will analyze their proposed scenario.\n\nThe output of the app includes the bottom line of a scenario followed by the monthly deficit or surplus caused by the financial decision, the cash runway, and a key risk factor. Next, the output shows a visualization of the user's cash flow and their net worth over the next 24 months. And finally, the output moves beyond the numbers to provide an in-depth narrative analysis and an immediate action plan with three potential steps for the user to take. And then after the user reviews this analysis, they can click this button to run another simulation if they wish. So, the output for my potential what-if scenario shows a bottom line that buying a new car significantly reduces my monthly financial buffer, leaving minimal room for unforeseen expenses despite maintaining a small surplus. It shows that purchasing this car would decrease my monthly surplus down to just $99 per month. However, since I am in a surplus, I will not run out of cash. And the key risk factor that it identified is the increased loan burden.\n\nThe 24-month trajectory graph shows that my liquid cash will increase over time, as will my net worth. And the narrative analysis says that purchasing the car will immediately reduce my liquid cash savings from $5,000 to just $1,500. And while my net worth remains unchanged at the point of purchase due to the new asset and corresponding loan, the crucial impact is on my monthly cash flow. My existing surplus of $410 dwindles to just $99, which is primarily due to the new car loan payment of approximately $311. And this means that my financial breathing room has become quite narrow. It says that I can think of my financial life as a road trip. Before I had a decent amount of fuel, which was my cash surplus, to handle any detours. But now, I've swapped some of that fuel for a fancier car. And so, while I'm still moving forward, my fuel tank is a lot closer to empty, and my daily fuel consumption has gone up. And therefore, any unexpected bump in the road, like an emergency car repair or a medical bill, could quickly deplete all of my remaining cash. For the immediate action plan, it first suggests building an emergency fund by prioritizing saving at least 3 to 6 months of essential expenses given that I have a low cash balance currently. The second step is to re-evaluate my discretionary spending by looking for areas within my current budget, such as entertainment or food, that I could free up more cash for savings or debt reduction. And the third step that it suggests is exploring income generating opportunities, such as considering a side hustle or other ways to increase my primary income so that I can improve my monthly surplus and rebuild my financial buffer faster.\nWhen I first built this app, it had all of the input boxes it currently has, the text box and suggestions for the what if scenario, and all of the outputs that it currently has. In order to improve my app, the thing that I did was improve the user experience by adding this visualization of the user's current financial health that updates instantly as the user enters their data. This addition was beneficial because it helps users understand their current reality before they simulate a future scenario. Another way I improved the app was by adding this disclaimer here at the bottom that informs users that the content of the app is generated by AI and therefore they should verify the figures produced by the app and consult with a professional before taking any action. This app can be used by anyone that wants to analyze a potential financial scenario, such as a major purchase or consequences of losing their job. A major benefit of the app is that it handles natural language input, so it can be easily used by anyone, not just finance experts. This app is more useful than other financial calculators that you can find on the internet because this app provides an explanation of the financial situation and actionable steps for the user to take rather than just providing numbers. And while the explanation and suggested steps are a major benefit of the app, they could also be seen as a drawback because they are generated by AI, and AI can make mistakes. Users should be extremely cautious when they take any financial advice from AI. They should first ensure that all the numbers provided by the app are accurate and make sense. It would also be a good idea for users to consult with a finance professional before they make any major financial decisions. And the user should also be aware that the app might fail to consider all of the necessary information that contributes to major financial decisions, such as market volatility or taxes. So, overall, this app can be very helpful for users to quickly see how a potential scenario would impact their current financial position. However, users should only use this app as a starting point, and they should be sure to verify the results of the app and consult a professional before they take any major financial actions. Thanks!"
}