{
  "student_name": "Colin Crean",
  "org_defined_id": "037433259",
  "username": "creanc",
  "video_url": "https://youtu.be/9NxoQU1Q0l8",
  "transcript": "00:00 How's it going? My name is Colin Crean, and this is my Session 11 assignment on Corporate Financial Decision Analysis. So, we start with the D stage, or Define and Discover.\n00:12 So, for my assignment overview, I'm going to be evaluating applications. We're going Apple's hypothetical 90 billion share repurchase using the driver method.\n00:22 We're going to act as an independent analyst who must determine whether the buyback creates a value relative to alternative uses of cash while balancing stakeholder incentives.\n00:32 So, for our goal, we're going to determine if Apple should spend 90 billion dollars on share buybacks or pursue alternatives like dividends, acquisitions, debt pay down, R&D, which is research and development.\n00:44 The data we are given, so, liquidity, 165 billion dollars. 100 billion cash and investments, 100 billion annual free cash flow, the market context, there's, ah, Apple's 185 dollar share price, the PDE, or price to earnings ratio, of 30, a dividend yield of 0.5 percent, and 15 billion shares outstanding\n01:08 . The balance sheet is 100 billion dollar debt, Berkshire owns 6 percent, CEO holds 3 million shares, retail investors average 100 shares, employees have 160 shares.\n01:20 The balance sheet is 100 billion dollar debt, Berkshire owns 6 percent, CEO holds VR Acquisition, Debt Reduction, and Incremental R&D.\n01:41 For the Stakeholder Outlook, Berkshire Slash Institutional Holders, they want Capital Appreciation, which is tax efficient. The CEO holds 3 million shares, so he wants the price up.\n01:51 Employees hold options at $170 strikes, so they want the price to be greater than $170. And retail wants steady income, dividend, or growth.\n02:01 Uh, so the problem we are trying to solve, essentially, is does a $90 billion buyback create intrinsic value or just transfer wealth?\n02:08 How does this impact the agency conflict between management, uh, want a higher stock price for options, and so how does the agency conflict between managers and shareholders?\n02:22 So, for the Represent Stager, our, For the Represent section, I'm going to display a flowchart, a stakeholder map, and a pseudocode that will set us up for the Implement stage.\n02:32 These three will all tie together and will represent and build an outline for the code in the Implement section, which will provide us the data.\n02:39 I've prompted AI to, provide us with a flowchart and a pseudocode to help, uh, work my way towards the actual code.\n02:46 So for the flowchart, um, we can see here, first I mapped out the logic. So the logic's up here, we're going to define the inputs and calculate the base metrics.\n02:55 So define the inputs, calculate the base metrics, and then I get into the decision scenarios where we explore the three distinct paths, the buyback, dividend, and the growth.\n03:06 So you can see scenario A, the buyback, scenario B, special dividends, scenario C, the strategic growth, and then compare and recommend.\n03:12 So now for the flowchart, which I made here. With this flowchart, first I map, sorry, I mean moving on to the stakeholder map, which I made.\n03:21 So for the stakeholder map, so we have the sections up here, so stakeholder, primary interest, preferred outcome, and then Y.\n03:28 So for the first, we have the retail investors. So their primary interest is income stability. Their preferred outcome is a special dividend, and then Y.\n03:35 They prefer tangible cash in hand, less tax sensitive than institutions. Now for the stakeholder, we have Berkshire Institutions and institutions.\n03:44 Holders. So they, their primary interest is capital appreciation. Their preferred outcome is a buyback. This increases ownership percentage without spending cash and avoids immediate tax bill.\n03:56 Now for CEO, the stakeholder CEO and management. Other primary interest is performance bonuses. They prefer buyback. This directly increases EPS or earnings per share, which is often a bonus metric and supports stock price for options.\n04:12 Now for employees, their primary interest is option value. Their preferred outcome is a buyback. This keeps stock price above the strike price of $170, which all the employees have, and which is to ensure options have values.\n04:26 So with this stakeholder map, we can anticipate how different groups would react. This helps track the value transfer versus value creation.\n04:32 So now for the pseudocode. So as you can see, it's the model blueprint here. So step one, define the constants, so set the cash equal to $165 billion, shares $15.5 billion, price $185 billion, so on, all the stuff we were given above, and then step two, it's scenario A for a buyback, so the input $90\n04:49 billion, it's going to calculate, uh, shares retired, which is buyback divided by price, new share count, shares minus shares retired, new EPS, net income, divided by new share count, and then it's going to print the buyback EPS.\n05:04 That's for the scenario B, special dividend, the goal is to determine the cash payout per share, so the dividend per share equals the buyback divided by, or the buyback size divided by shares, uhm, the new stock price equals price minus dividend per share, and then it's going to print the dividend yield\n05:20 . And then for scenario C, the growth acquisition, determine impact if cash is invested in AI slash VR, so the input is assumed ROIC, which we're assuming is 10%.\n05:31 We're going to calculate the added earnings, the new net income, and the growth EPS, and then it's going to print the growth EPS.\n05:36 So from this pseudocode, we can make sure that formulas like EPS and share count are correct before we get into the actual code.\n05:43 So you can see all the formulas, all the stuff we did here. And then now we get into the I or the implement section.\n05:48 So here's the Python code that I've prompted AI to write following our pseudocode. This is kind of the frame for our code.\n05:54 The pseudocode is the frame for our code down here kind of. So as you can see, it's the same stuff to find the inputs.\n06:00 So we have all the inputs here. We're calculating the base metrics, and then we get into scenario Video A, no, Empire Press, all that.\n06:08 Scenario B, so Scenario A, the share buyback, Scenario B, special dividends, Scenario C, the strategic acquisition, and so on and so on.\n06:16 So what we get outputted to us is, so base case snapshot. So the current EPS is $6.17. The current netting is income $95.58 billion, and the market cap is $2867.5 billion.\n06:35 So the comparison output, So we're given here the categories metric, E, F. EPS, share count, and stock price. So you can see the status quo, 6.1667 EPS.\n06:47 So on the buyback, 6.36, special dividends, 6.1667, so on. I'll go over more of these in my explanation down here, but you could also see, see that, um, so each section there's the status, oops, sorry.\n07:00 There's the status quo, the buyback, the special dividend, and the strategic growth section. And they're all on here too. The status quo, buyback, dividend, and strategic growth section.\n07:09 This red line here is the baseline EPS. The Y, um, axis is the EPS too. So here we'll get into this now.\n07:20 So to explain this Python model, there are parameterized inputs like the 90 billion buyback size and the 30 times P to E ratio.\n07:28 So we can change them if the market conditions were to shift. This makes the model very dynamic with the market rather than static.\n07:36 The status quo was calculated first to establish the baseline EPS of 6.17. So here, status quo is the gray 6.17.\n07:44 Here are the numbers, the metrics for it. Then I ran the code for the buyback scenario. And the buy... I ran the code for the buyback scenario.\n07:57 And by retiring roughly 480 million shares, the EPS was bumped up to 6.37. So you can see here, EPS in the buyback scenario was bumped up to 6.37 above the baseline EPS.\n08:09 And you can see the numbers right here for On the other hand, the dividend scenario dropped. The share price to $179 as cash leaves the balance sheet, but the EPS stays at 6.17.\n08:25 So you can see here, the dividend stays at 6.17, but the stock price bumps down to 179. And then for the growth scenario, I assumed a 10% return on investment capital and it moved the EPS all the way to $6.75.\n08:48 Obviously this growth option could provide a high, the highest EPS, however, it also carries execution risk. The buyback option provides the most immediate guaranteed boost to the EPS.\n08:57 So here's the growth. You can see it bumps it up, the EPS up to $6.75, but it is very risky.\n09:04 For the validate section now, for the validate section, I'm going to check three things. The share count, the leverage, and the dividend drop.\n09:11 When looking at the share count with the buyback scenario, we can see it has dropped from $15.5 billion to roughly $15 billion.\n09:18 This validates that the retirement logic works. When looking at the leverage, we want to think about if we spiked our risk.\n09:25 In this scenario, we used cash on hand, so our net debt position worsened, which means less cash, but we didn't take on any new high-interest loans.\n09:34 And then for the dividend drop, in this dividend scenario, the share price dropped to roughly $179. This validates the ex-dividend theory behavior where you can't just pay out cash and keep the same stock price.\n09:45 The market cap has to adjust. So that was our validate section. Now we move on to the E or the Evolve section.\n09:51 So for the Evolve section, I first wanted to explore the value creation versus value transfer. Using the Python model above, if we use an alternate growth scenario where we invest into AI slash VR to generate new cash flows that didn't exist before, this creates value creation, which is growth.\n10:08 While, for the buyback slash dividend, the same kind of idea adds value transfer. The company isn't getting bigger, it just has fewer shares or less cash.\n10:17 Think about it like you slice a pizza into six pieces instead of eight. You created more pizza per slice, but not more pizza.\n10:24 Pizza overall. This is what the buyback is doing. The Python model shows us that the buyback increases EPS, which is primary value transfer.\n10:32 This is the transfer of cash from corporate balance sheets to shareholders, which is not organic growth. I also wanted to look at the agency theory.\n10:40 The problem is that management holds 3 million shares in options, so they have a personal incentive to choose the buyback option because it boosts the stock price immediately.\n10:50 However, this also aligns with the Berkshire Hathaway 6% owner, who prefers the buyback to avoid the tax hit. In this special case, the agency cost is low because the largest shareholder wants what the CEO wants, which is to buyback because it moves the stock price up to $190.\n11:10 Now to explore the signal theory. Apple signals the market by choosing a $90 billion buyback that they believe, sorry, Apple signals to the market by choosing a $90 billion buyback that they believe their stock price is undervalued at $185 and they might not have any better reason to use the cash.\n11:29 This would be a strong confidence signal that usually supports the price. Now for the last section, the R or the Reflect section, based on all the information I just walked through and the driver analysis, I recommend executing the $90 billion share repurchasing program.\n11:44 To justify this, Apple has excess capital in $100 billion and trying to force $90 billion into R&D will likely lead to wasteful spending or diminishing returns.\n11:55 In terms of stakeholder balance, it satisfies the largest institutional holder, Berkshire, because of tax efficiency. It also incentivizes the CEO by price share support and protects employee option value by keeping the price above $170.\n12:09 To add on, the buyback has flexibility and unlike a reoccurring dividend, a buyback is one-time and doesn't commit Apple to paying $90 billion.\n12:16 The driver framework prevented me from jumping straight into a decision. The represent stage helped me map out the stakeholder conflicts before running the numbers.\n12:27 The evolve stage revealed that though the growth scenario looked good mathematically, the execution risk of finding out $90 billion worth of profitable projects was too high.\n12:35 Overall, I learned a lot from this assignment about corporate financial decision analysis and how to look, and how to look how decisions affect every level of a company.12:45 Thank you for listening, and that was my session 11 assignment."
}