{
  "student_name": "Braden Schroeder",
  "org_defined_id": "037406900",
  "username": "schro187",
  "video_url": "https://youtu.be/ia6AlPuDtlA",
  "transcript": "00:00\nMy first steps for this assignment were I copied this part here, so just this assignment overview, and then I really wanted to emphasize that these questions get answered.\n\n00:20\nI found in Gemini that maybe if I would have just copied this part and then copied this and not really emphasized that I want these questions answered, it might just kind of answer these vaguely and then maybe some of these vaguely, but I made it a point that I really wanted pretty in-depth answers with those.\n\n00:42\nSo, like I said, copy and pasted those, and then I need Python code that answers these four financial analysis questions, again, putting a bigger emphasis on those four, and then obviously Qix Principle, just gonna make it a little bit simpler.\n\n00:58\nSo, I got working code on my first try, which was pretty nice, but I was a little bit confused initially. I was a little bit confused. I was honestly confused conceptually about the buyback, kind of what that meant for the company, why would they do that.\n\n01:18\nSo, I did a little digging on my own and found that the buyback, or in this case, Apple's buyback, they're basically buying their own shares to kind of inflate the company's value or I guess the perceived value earnings per share goes up.\n\n01:35\nSo, that's generally a good sign that kind of – I guess that kind of gives the perception of higher credibility. If that share price goes up, you're kind of doing that by making those purchases.\n\n01:53\nAnd then there's the flip side of that, where if you're not investing that elsewhere in the company, spending that on innovation, new ideas, trying to expand in that way, that could be a little bit of a cause for concern. I'm gonna get into that a little bit more later, but those were just kind of my initial findings on the buyback and how that would apply to Apple.\n\n02:15\nSo, here we can – we're just kind of given information here. I know one of the questions asked about – I think it was – it was, yeah, retail, institutional, holders, management, employees, bondholders.\n\n02:30\nSo, you can see we get investors. That ownership increases a little bit. Makes sense if Apple is buying their own stock. There's gonna be less other people, essentially, that can buy the stock. So, the people that have their money in Apple, ownership's gonna go up a little bit. Makes sense.\n\n02:56\nSame with Berkshire Hathaway. And then employees, it just kind of gives you the value for here, $15 a share. And then our bondholders, you can kind of see leverage increases, cash cushion drops from $165 billion to $75 billion.\n\n03:19\nThat's that 90 million that is talked about in here, that $90 million. And then we can see kind of here what happens with the buyback. This one was a little bit more confusing.\n\n03:35\nAgain, I'm just gonna briefly go over this first one because I think my next one provides much better explanation. So, you can kind of see what happens with the earnings per share, some of these trends here, net debt, all this with the buyback versus the dividend.\n\n03:55\nAnd then you kind of see how expensive that stock is relative to this 4.5% cash returns is telling you it is expensive. And that buying back stock does reduce total net income. But then, yeah, you're kind of transferring from the company to exiting shareholders at the expense of the remaining holders.\n\n04:22\nAnd then, again, this is kind of what I was alluding to earlier, that we lack high growth R&D ideas. You're kind of just mailing it in at that point if you want to go this buyback route because you could, I mean, the sky is the limit with R&D.\n\n04:41\nAnd I guess if you're really confident in a product, like in theory, your business should explode after that. But I think it kind of does signal a lack of innovation. But again, I tweaked the AI a little bit. I just wanted kind of further explanations.\n\n04:59\nSo, I just wanted further explanations on each of the questions, go a little bit deeper in explaining this as if I was a five-year-old reading this, essentially. So, all of these, I got really in-depth explanations here. I was really impressed by this, actually. I didn't have to do too much for the AI, tweak a couple things.\n\n05:21\nSo, again, this stuff is all the same. Up here, I liked that this net cash position falls. I don't think that was above. So, you can see $55 billion to negative $35 billion. So, in debt, negative cash flow, not good.\n\n05:42\nAnd that's, again, that $90 billion here, that is the buyback, $90 million buyback. And then I think this was just a clear comparison of the alternatives here. You can kind of see how with the buyback, earnings per share, $6.15. With the dividends, it goes down a little bit. Liquidity is a little higher with that.\n\n06:06\nSo, there's one upside. And then, again, growth, R&D, definitely highest earnings per share. I think this one absolutely has the most upside. However, it is a little bit riskier. And in the analysis, it kind of supports that. Creates the highest long-term EPS, if, big if right here, if execution succeeds. So, if you're very dependent on that, really trusting in your company.\n\n06:36\nThis is kind of the same thing. It's presented a little bit differently. You still have that stock's earning yield at 3.3%. Cash yield, 4.5%. So, it's kind of just talking about, yeah, the company's buying this yielding asset, which is its own stock, using cash that could earn that 4.5%.\n\n06:58\nAnd it kind of dilutes the value for the remaining shareholders, transfers value to exiting shareholders who kind of sell at the top there. So, just talking about these implications, you can see a CEO. The buyback is definitely going to benefit that CEO pretty significantly.\n\n07:20\nIf they hold 3 million shares and that earnings per share price goes up, that's going to significantly benefit the CEO, not only the CEO, but other people in power that have substantial shares in the company. So, you can kind of, I guess, inflate your company with that.\n\n07:42\nI was doing a little digging, too, online, and I guess the ethics and I guess the validity of that can be a little shady. It kind of depends on the situation, but that is certainly one way to increase your earnings per share, guaranteed. I mean, you don't have the risk that you do with this R&D. You don't have to hit a slam dunk product, anything like that. You can just funnel in money, essentially, and purchase these shares.\n\n08:10\nAnd then, just kind of, let's go to question four. Yeah, so this was signaling effects, market perception. I kind of talked about a lot of this stuff. Again, I think that, yeah, so management sees no internal projects with returns that are greater than this, because if they did, they'd probably go the R&D route.\n\n08:32\nAgain, market perception, what I've been talking about, safe, defensive, like you are guaranteed to raise your earnings per share. But yeah, how are you going to really sustain that? You really can't, so it could be good, I feel like, for the short term. And yeah, it will raise the stock, but I don't think it inspires a ton of confidence about the direction of the company, because if this company was super innovative, I think you would have confidence that you could pull it off.\n\n09:00\nI think you would have confidence that you could put this $90 billion into designing a new product, or making a prior product better, improving upon those. So, I think there's definitely other things that you could use this $90 billion on. I mean, it's subjective, but if I was investing my money, I would be a little concerned with the way that that's being spent, even though earnings per share, technically, will go up from that.\n\n09:30\nBut this is a really interesting assignment. Just, again, I got to learn a little bit more about buybacks, research and development, this R&D, and just kind of how shares of a company will be affected by the buyback, how companies are using this, how people in power are using it strategically to line their pockets.\n\n09:55\nSo, it's interesting. I was really satisfied with the code I got from Gemini to Google Colab. And then, yeah, I was just able to, I mean, even after the first one, pretty good code. Went a little bit deeper with the second one. Was able to kind of clear up some of those questions I had.\n\n10:20\nSo, pretty smooth assignment. Yeah."
}