{
  "student_name": "Ethan Enav",
  "org_defined_id": "037523768",
  "username": "eenav",
  "video_url": "https://www.youtube.com/watch?v=DCxpR638R14",
  "transcript": "All right. So, for my project, I didn't\nwant to use NHN because I had a lot of\ntrouble in the past using it because\nwhenever I would use it and I would have\nAI teach me how to use it, I was like\nchat GBT was really confident that it\nknew how to use it and it it didn't and\nit kept leading me in circles. So, I\nfigured using a Python script would be\nbetter because it's more consistent and\nI know I can get a natural result that I\nwant instead of just talking AI for 10\nhours with no result. So, what I made\ntoday was um basically\nyou call it a calculator that you give\nit the financials of a you really don't\neven have to give it anything. you just\nask like\num\nwhat it ask what company you want to\nknow and then it gives you a full\ninvestment memo on everything you need\nto know on that company and it's\ninteractive too and like you can tell it\nexactly what you want but it really just\ncreates a whole memo um and this can be\nreally helpful if you're going into a\nbusiness meeting and you need to know\nlike if you need to be educated on\neverything about McDonald's like their\num ITA or their key performance\nindicators. Like it'll tell you all of\nthat so you can\nbe well informed on whatever company\nyou're talking about.\nSo let's run\nthis.\nSo first step, you always got to tell it\nthat\nI'm not exactly sure what this does\nbecause I don't really understand\nPython. That's okay. So, for company\nname, let's um just do like Nike, I\nguess. Yeah.\nLet's get all this information. What\nthey do,\nproducts, customers. Sure. Let's get all\nof it,\netc.\nSo first gives you a quick snapshot with\nthe re what their revenue\num net income debt all this other stuff\nwhile it's drafting the memo.\nAnd\nlet's look at the memo.\nSo let me just briefly go through it. So\nactually that works.\nSo executive summary.\nOkay. These are just a lot of numbers.\nWe don't need to get go through those.\nLet's go through the business overview.\nNike is a global leader in athletic\nfootwear, apparel, and equipment. The\ncompany serves a broad customer base\nranging from professional athletes and\ncasual consumers. Its products its\nproduct portfolio includes innovative\nperformance gear lifestyle products\nsupported by strong brand recognition\nand extensive distri distribution\nchannels. Yep, that sounds right.\nAnd then it gets more into the\nfinancials talking about revenue\nincreasing from year to year. That grew,\nnet income grew, seems like like he's\ndoing pretty good right now.\nUm earnings per share went up a\nsignificant amount.\nAnd then it gets into the key\nperformance indicators,\nrisk and red flags. Declining EVA.\nOh yeah, the margins did decline. Okay.\nselling revenue billions questions.\nSo yeah, so um I started with basically\nit only gave you it only started with\nonly giving you this quick snapshot up\nhere and then I grew it to include more\nand more questions and then my final\nevolve step was adding this like risk\nsection because\num I don't know why but it never\nincludes stuff about risk. So, I thought\nrisk is very important to include here.\nUm, to validate it, I basically just\nlooked up if Nike, like when I did it\nearlier with Starbucks, I looked up the\nStarbucks numbers were actually correct\nand they were. Um, for reflection, I\nenjoyed working on this because like I\nhad complete freedom of what I wanted to\nmake with this project. And so, I tried\nto think of something that I would\nactually use in real life. And I couldsee myself being like like, \"Hey, let me\nlearn about this company really quickbefore I have to talk about them.\" So, I\ndecided to make this project and Ienjoyed working on it."
}