{
  "student_name": "Juan Antonio Sevilla",
  "org_defined_id": "033541051",
  "username": "sevillaj",
  "email": "",
  "transcript": "In this presentation, I'm going to walk through how I used the DRIVER method to understand WACC and evaluate a project for a fictional company called HarborLink Transport. Before this session, WACC felt like one of those formulas you memorize for the exam and quickly forget, but going through the process step by step—and actually coding it myself—helped me see what each number means and why companies rely on it when making big investment decisions. My goal today is to explain the logic behind the model, show the results from my Python code, and then walk you through the final decision for the project. The first step of the DRIVER method is Define. Here, the core question I wanted to answer was: how do companies know if a project is actually worth doing? They face this question constantly, and instead of relying on intuition, they use the Weighted Average Cost of Capital as the benchmark. So I defined my guiding question as: does HarborLink's project create value, and can I prove it using real data? To answer that, I needed to understand the market value of equity, the market value of debt, how the cost of equity works through CAPM, how taxes reduce the cost of debt, and how to compare a project's return to the WACC. This became the discovery part of the process. The next step is Represent, which is where I simplified the problem into a clear structure instead of a pile of formulas. I broke the whole model into six steps: calculate the market value of equity, calculate the market value of debt, compute the capital structure weights, calculate the cost of equity through CAPM, calculate the after-tax cost of debt, and finally combine everything to get WACC and compare it to the project return. Once I visualized the process this way, WACC stopped feeling overwhelming. It became a straightforward decision path: figure out how much the company pays for capital, and check if the project can outperform that number. Then I moved into Implement, where I used Python to compute everything. I began by storing all the inputs—number of shares, stock price, beta, risk-free rate, market return, and the details of the company's debt. Python handled the rest. The market value of equity came out to about 2.066 billion dollars, which makes sense given HarborLink's share count and price. The market value of debt was 432.6 million dollars, based on the bonds trading slightly above par. Then I calculated the costs of capital: the cost of equity was 8.34%, and the after-tax cost of debt was 3.87%. That relationship made sense—equity is riskier, so investors demand more, while debt becomes cheaper once taxes are considered. The Validate step is where I checked whether the numbers lined up logically and whether the final decision was trustworthy. Using the cost of equity, cost of debt, and their respective weights, the WACC came out to 7.57%. This is HarborLink's hurdle rate. I compared that to the project's expected return of 9.85%, and since 9.85% is higher than 7.57%, the project clearly adds value. The correct decision is to accept it. To make sure the model was reasonable, I checked a few rules of thumb: the cost of equity should be higher than the cost of debt—which it was; WACC should sit between the two—which it did; and even if assumptions changed slightly, the project would still pass the threshold. So the decision was consistent and stable. Finally, in the Evolve and Reflect stage, I thought about what changed in my understanding. Doing this exercise made WACC feel less like a memorized formula and more like a real decision-making engine that captures risk, taxes, market expectations, and capital structure all in one place. Writing the model in Python also made the logic transparent. Instead of plugging numbers blindly, I could see how each input affected the outcome. The biggest lessons I took away were that the cost of equity captures investor risk expectations, taxes materially lower the cost of debt, market values matter more than book values in financial decisions, and a project is only worthwhile if it beats the company's cost of capital. Overall, this assignment helped me connect classroom theory with real financial modeling, and I feel far more confident evaluating investment decisions now. Thank you.",
  "video_url": "https://youtu.be/Zh3hr3KjvbU"
}