{
  "student_name": "Taylor Blanton",
  "org_defined_id": "037019479",
  "username": "tblanton",
  "email": "",
  "transcript": "Okay, so this is session 10. Um, our objective was to determine the financial viability of a new 10-year flagship roaster requiring $12 million initial outlay and its hurdle rate is 8.5%. So, some key project parameters on the initial investment is $12 million depreciated straight line over 10 years. Working capital is 500,000 deployed year 0 recovered year 10. Tax rate is 25% which is a corporate tax rate. Terminal value is 3 million that is pre-tax salvage rate at year 10. Um its revenue profile year 1 $8 million it's ramp up. Years 2 through five is 11 million that's peak and year 6 through 10 is 9 million which is steady state. So to represent this I took an analytical approach using the discounted free cash flow model. Um here's the map of the logic. So we calculated incremental value using the following flow. So operating profit is revenue minus COGS plus labor plus rent plus marketing minus depreciation equals EVIT. Um after tax profit EBIT time 1 minus tax rate equals NOPAT um free cash flow NOP AAT plus depreciation minus the change in NWC minus capex and some metric definitions. NPV is the sum of all discounted cash flows and this must be greater than zero to accept and the IRR is the discount rate that sets MPV to zero. So it must be greater than 8.5 to accept. So the code sorry. So I'm going to install the library that I need. And then so I'm going to run this code which this code as you can see it gives the it is a cash flow model for years 0 through 10. So it defines the inputs as we've already mentioned. It has the terminal value which is at the end of year 10. It also has the book value um is zero at year 10. So the whole amount is taxable gain. So then here it's just building the cash flows. So they use a list to store the data for each year. You can see they've year zero is the setup. And here's years 1 through 10. And so it's determining the revenue based on each year, determining the marketing based on year, calculating expenses, calculating the EBIT and the NOPAT, and then it'll c calculate the FCF. Um there's no cap X in operating years. Um, and then we also have the handle year 10 specifies the WC recovery plus terminal value. Then it's just adding to the data list. And as we can see here, here's the cash flow model from year 0 to 10 and it outlines the revenue as I have previously said. So then this block will calculate the capital budgeting metrics. So it's just going to calculate the net present value, the internal rate of return, the simple payback period, and it's also going to find the first year where cumulative cash flow turns positive. And then it'll also calculate the profitability index. And as you can see here, the MPV is 2,690,8.79. The internal rate of return is 12.84%. Payback period is year 6 and its profitability index is 1.22. So the result of the analysis is the project generates significant value above the cop c above the cost of capital excuse me. So as you can see here the MPV is 4,821,412 and it was just had to be greater than zero. So that passes. The internal rate of return is 16.14% and it is greater than 8.5% so it passes. Payback period is roughly 5 years. Um this is kind of at a management discretion but it's relatively satisfactory and its probability index is 1.39 which is greater than 1.0 and so it passes. So then I put it under a stress test. So we're just evaluating risk by modifying key variables. So some of the scenarios it was tested um base case which is the current assumptions bare case which is revenue risk. So revenue decreases by 20% across all years and cap cost of capital risk. So the WACC increases to 10.5%. So as you can see here, base case is a strong buy. Um when you increase the um WACC 2% to 10.5%. it still impacts it impacts um the MPV it has a less MPV um than the base case but it's still a buy just because it still produces a high value and then when you decrease revenue by 20% now you're in the negatives so we would reject this if the revenue decreased um because the project is highly sensitive positive to demand. So my final decision is to accept it. Um some financial justification. The project clears the 8.5% hurdle rate with a substantial buffer. An IRRa of 16% indicates high efficiency and the profitability index of 1.39 suggests we generate $1.39 for every dollar invested. um for strategic and brand fit. As a flagship roaster, this project serves as a marketing vehicle for the broader brand um which likely drives sales in other channels which is not captured in this cash flow model. So to purchase risk mitigation, the sensitivity analysis reveals that volume/revenue is the critical risk factor. So my recommendation is to proceed with the investment but structure the marketing budget to be heavier in year one and two to ensure we do not fall into the negative 20% revenue scenario. So that is session number 10",
  "video_url": "https://youtu.be/9i0XocUv2Yo"
}