{
  "student_name": "Kendra Zylstra",
  "org_defined_id": "034289869",
  "username": "kzylstr",
  "email": "",
  "transcript": "Hello. Today we are going to be doing a cost of capital analysis. We're going to be using the driver framework to do this and really focusing on the financial numbers of the why behind this analysis. So diving right into the first step of driver, we are going to define and discover. So we first want to define our goal. So, our goal is to calculate the weighted average cost of capital or WACC for Netflix in connection with a hypothetical $5 million content investment investment decision. We have five key questions that we're going to answer. What's Netflix's current WACC? What is the WACC after $3 billion, excuse me, debt issuance? When should we use project specific versus firmwide wide rates? How does Netflix's WACCC compare to Disney's? And then finally, what is the optimal capital structure strategy? Next, we're going to move on to representing. So, as I talked about, this is a datadriven analysis. So, we have a few different things that we're going to calculate and model um and different formulas that we're going to do for this. And then our next stage is the implement stage where we're going to build our code and look at it in collab and talk about those numbers and what those mean. So to represent first we're going to calculate the cost of equity. We're going to be using the capital asset pricing model or capme for this. So our formula is K= RF plus beta * the MRP. So our inputs in this case our RF is 4 1/2% our beta is 1.3 and our MRP is 5.5%. And then in our implement stage we going to calculate these things and talk about what they mean. Second calculate after tax cost rate of debt. Our model is the after tax cost of debt. Our formula is KD or capital of D equals the yield times 1 minus the tax rate. Our inputs are the yield is 5.8% and our tax rate is 21%. Third, we're going to calculate our current WACC. We're using the weighted average cost of capital model. Our formula is that WACC equals U over V * A plus D over V * KD. So our process, we're going to be using the numbers that we calculated in steps one and two of our represent stage of driver. So we're first going to find the total firm value. We know that V= E plus D. And then we're going to find the weight of equity, which is E over V, and debt, which is D over V, and then plug all components into the formula. So we're going to find our K of K and KD in steps one and two, and then plug those in to find the current WACC. Fourth, we're going to model the new WACC. we must add the $3 billion in new debt and recalculate to find the new WACC. Then from there, after we've done those calculations, we will analyze the project versus firm WACCC. We'll discuss when to use project specific rate versus the firm firm YWACC. Then we'll compare with peers. We'll place our calculator WACC for Netflix next to Disney's 8.2% and Amazon's 9.5%. We're going to kind of use those as benchmarks to compare and see where Netflix lands. Then we'll explain the likely drivers of any differences such as different capital structures and different business risk or beta. Then lastly, we will formulate a recommendation. So based on results from steps four and six, which are modeling the new WACC and comparing that with the peers, we will recommend an optimal capital structure strategy commenting on the trade-offs of adding more or cheaper debt. So that's just kind of our road map there. we wanted to represent after we defined and discovered our problem then represent what numbers we need to calculate what analysis we need to conduct and now we'll move on to our implement stage where rubber really meets the road and we will um calculate what we represented so I'm going to share my other screen here so here is the from the collab notebook here. Um, this is the Python code that I have written with the help of Gemini and I'm going to kind of break it down step by step. We have the code run there as you can see. So, I'm going to break it down step by step here um kind of chunk by chunk. So, first we know for our implement stage we have a lot of different things to calculate. So we want to do our WACC calculator for Netflix. So first we need to define our key inputs in billings for dollars decimals percent. So we know our Netflix data here. Our market cap equity is 200. Market value debt is 13. Equity equity beta is 1.3. Our bond yield is 5.8% and our tax rate is 21%. For our market data, we know that our risk free rate is 4.5%. Our market risk premium is 5.5%. In our scenario, the additional debt is additional debt that we're going to deal with is three. So in a represent stage, we had a lot of different steps here. So we're going to kind of walk through those. The first one is to calculate the cost of equity or K using C capm that model that we talked about. So we know that the calculation for this is K equals RF plus beta* MRP. And so our cost of equity is the risk free rate plus equity beta times market risk premium or MRP. So the first step will be for the cost of equity. And then secondly we will want to calculate the after tax cost of debt or KD which that is yield time 1 minus the tax rate or cost of debt equals bond yield time 1 minus tax the tax rate. Third, we will need to calculate the current WACC, which is E over V * K plus D over V * KD. So with this, we'll first find the total value, which is V and the weights. And there's a little bit more information there on how the total value, the current total value, current equity, and current weight debt are calculated there. So the to the current total value is the market cap equity plus market value debt. The current weight equity is the market capital equity divided by the total total current value. The weight debt current is the market value debt divided by total value of current. So then from there we'll be able to calculate our WACC with that formula there. The current weight equity time cost of equity plus weight the current weight debt times cost of debt. And then we'll be able to yeah calculate our current WACC. And then with the added $3 billion in debt, we will model the new WACC. So, first we'll need to find our new DNV based on the new $3 billion in debt. We're going to assume that the market cap of equity is unchanged. And then we'll need to find the new weights and then calculate the new WACC. So, in this case, we're going to assume that beta is stable and that it doesn't change with more debt. But in a more complex analysis, it might change. And then our for our fourth step there, calculate our new WACC after the $3 billion in debt. So we have some of those calculations for that. That way we can find the new market value of debt, the new total value or V, the new weight of equity which is E over V, and the new weight of debt which is D overV. And then finally we'll have our new WACC. So after we have ran the code here, we have some of our results. So for our first step when we calculated the cost of equity or K we found that that is 11.65%. Our after tax cost of debt is 4.58%. Our current WACCC our total current value or V is 213 billion. Our weight of equity is 93.9%. Our weight of debt is 6.1%. So then using those numbers we calculate the current WACC as 11.22%. For our fourth step, finding our new WCC after the $3 billion in debt, our new market value of debt is $16 billion. Our new total value is 216 billion. Our weight of equity is 92.59% and our weight of debt is 7.41%. So when plugging in these numbers for our new WACC, we find that our new WACC is 11.13%. So the main numbers that we'll be focusing on here is that our cost of equity is 11.65%. Our after tax cost of debt is 4.58% and then using the numbers we calculated our current WACC is 11.22% and then our new WCC after the $3 billion in debt was changed a little lower to 11.13%. So that is our implement stage. Let's hop back over to our PowerPoint to continue our analysis. So we have we did our implement stage. We found the numbers to do the analysis and then our really our next really important step here is to validate. So we know that we always need to validate validate numbers to make sure that the code that was run is consistent with the real world numbers. First we're going to do an internal just kind of logic check thinking of the debt scenario. So our observation is that adding $3 billion in debt lowered our WACC from 11.23% to 11.12%. We when we kind of evaluate this we notice that this result is correct and expected. We intentionally the proportion of our company financed by cheaper debt which has an after tax cost of only 4.58% and decrease the proportion financed by expensive equity which costs 11.65%. This is the tax shield and leverage effective action. So, we can validate that this makes sense. Adding the $3 billion in debt lowered our WACC from 11.23 to 11.12%. Second, we want to do an external benchmark check. We want to check with industry and peers to see if this is validated. Our observation is that our calculated WACC of 11.23% is significantly higher than both the media industry range, which is 8 to 10% and Disney's WACC, which is 8.2%. Our validation and is that this is actually not an error even though it is s the WACC is of Netflix is significantly higher than the others. It's not an error. It's a key strategic finding. Our calculation is correct and the difference is explained by two different drivers. First the high risk profile or better. So we know that Netflix's beta of 1.3 is really high which reflects its market volatility and singular focus on the higher risk streaming content industry. This drives its cost of equity which is 11.6. 65% of significantly. The second driver is the lowle lever structure. Netflix is underlever underleveraged compared to its peers. Its current capital structure is only 6.1% in debt whereas Disney is on 30%. Is at a 30% in debt in its capital structure. So this means that Disney uses far more of the cheaper debt financing which which folds its overall WACC down. So we can validate that even though Netflix's WACCC of 11.23% is significantly higher than the 8 to 10% and 8.2% of the industry and of Disney its peer. It is because of these two drivers. It's not a mistake. It's a key strategic finding. Finally, we're going to validate our sensitivity analysis. We want to test our assumptions. So we want to test the numbers that we ran and test our assumptions to validate and make sure that the code was correct and that our numbers were correct. So the WACC is highly sensitive to our key assumptions especially beta. To validate this we have this table here which shows that a small change in our beta assumption can swing the WACC by over 170 basis points which is 1.7%. A beta of 1.1 would put Netflix inside the industry's WACCC range which confirms that our 1.3 beta is the primary driver of its high WACCC. So here we have our assumptions of the equity beta the cost of equity in the Kland WACC and then for the low base and high case we have um different betas. So our case our base case is 1.3 beta. We want to test it with 1.1 beta and with 1.5 beta. So our equity at beta there is what we were just talking about and we can see how this affects the cost of equity and the calculated WACC. So in the low case the um cost of equity is 10.55% and the calculated WACC is 10.15%. Then in the high case assuming a bet of 1.5 the cost of equity jumps to 12.75% and the calculated WACC jumps to 11.91%. So this confirms that the reason why we have such a high WACCC is because of our beta. Because we can see here that if we lower the beta just to 1.1% the WACC jumps down from 11.23% to 10.15%. So the conclusion of all of our validations is basically that our calculated 11.23% to 3% WACC is a robust figure and its high value is a direct and logical result of Netflix's high-risisk equity and low debt capital structure. So we know that the WACC is robust and that the reason it's high is because of Netflix's high-risisk equity and low debt capital structure. And in the other stages of driver, we'll kind of look at what happens if we change this around a little bit. Next, we would like to evolve. So we're going to evolve first. We're going to evolve the hurdle rate which is the project first firmwide. We cannot use the one number 11.23% for every decision. We must evolve our approach base on risk. So the problem is that if we use the firmwide WACC of 11.23% for everything that's really dangerous because for safe projects the bar is set would be too high for stable low risk projects such as renewing a hit US show which has the potential of rejecting value creating investments. But if we use it for risky projects, the bar is set too low. If Netflix would want to enter a new unstable international market, this would the 11.23% would be too low. So this would have the potential of accepting bad investments. So what's our solution? Our solution is that with US content, which is a really established market, we should use the firm WACCC or slightly lower because cash flows are predictable. So for international or new markets that Netflix might want to jump into, we should add a risk premium of 2.3%. The hurdle rate should be 13 to 14%. As opposed to 11.23% to account for currency risk and political uncertainty. Secondly, we would like to evolve the capital structure or the optimization gap. Our analysis reveals a massive efficiency gap between Netflix and Disney. So Netflix's profile is a 6% debt and a 94% equity, which gives it a WACC of 11.23%. Disney, on the other hand, has a structure of a 30% debt and 70% equity, which gives it the WACC of 8.2%. So the 11.23 and 8.2% WACC is a massive gap. So we would like to look at evolving the capital structure for Netflix. Our insight here is that Netflix is quote unquote paying too much for its money because it relies too heavily on expensive equity, which is 11.65%. The evolution, the hypothetical $3 billion in debt issuance was a correct move, but it was too small. It only moved the WACC from 11.23% to 11.12%. It still gave a certain effect because it lowered the WACC, but it didn't have the a big enough effect as we wanted. Our strategy is that Netflix should continue to increase leverage because debt is cheap and the goal is to shift capital structure closer to 20 to 25% debt as opposed to the current 6% debt to lower the WACC towards 10% rather than the high 11.23%. Increasing the value of the firm while likely maintaining an investment grade rating. So we can evolve. We want to evolve our strategy here to um recommend that um Netflix would lower its um WCC from the 11.2% and they could do this by adding more debt. Finally, we would like to reflect and talk about what we learned and how to move forward with this analysis. Number one is that the hurdle rate and debt have a big impact. 11.23 is our current WACC and that is the minimum return required for the $5 billion content investment. After the three $3 billion in debt, the WACC did lower to 11.12%. The debt provided a small benefit via the tax shield. The cost of equity is 11.65% and the after tax cost of debt is 4.58%. Our optimal capital structure recommendation. This goes back to what we recommend towards the beginning here. We had one of our key questions as when as what is the optimal capital structure strategy or what do we recommend? We already answered the other questions talked about um those four and here we want to talk about the optimal capital structure strategy. Going back to our reflect here. So our ob observation is that Netflix's WCC is significantly higher than Disney's due to its current low leverage of 6% debt because um Disney as opposed to Netflix, Disney has 30% debt. And you can see here um in this mm theory graph here that the cost um having cost of capital versus the gearing DE we can see the cost of equity rising as opposed to the WACC and the cost of debt being a lot lower. So our recommendation is that Netflix should aggressively increase its leverage targeting a debt to value ratio of 20 to 25% to lower its WACCC below 10% and maxim maximize firm value. Finally to reflect we want to talk about our key financial insights. First the tax shield. The interest deducted deductibility dramatically reduced the cost of debt from 5.8% to 4.58%. proving the immediate value of debt financing and second risk matching. The firmware WACC is only appropriate for average risk project projects. High-risk projects such as international content require a higher project specific discount rate. So overall I learned a lot in this project. Um WCC was something I wasn't super familiar with before this project and I learned a lot conceptually but also financially. One big thing that I learned financially was um that I found really interesting was how um adding the $3 billion only lowered um the WACC a little bit. I thought it would lower a lot more. And it was also interesting to look at the optimization gap between Netflix and Disney. how Netflix having only 6% debt profile and Disney having 30% debt made a big difference on their WACCC as Netflix is we calculated was 11.23 and Disney's was 8.2%. So this is my analysis here super interesting to explore more about WACCC and the cost of capital analysis. Thank you.",
  "video_url": "https://youtu.be/GwFqk3sH8ng"
}