{
  "student_name": "Elisah Korinne Liban",
  "org_defined_id": "038014499",
  "username": "eliban",
  "email": "",
  "transcript": "Hello everyone. So today we're doing another assignment. This time it's session 10 for capital budgeting and investment decisions. So this time we are evaluating Starbucks's proposed flagship roaster that requires a $12 million upfront outlay and expected to be operating for 10 years. So to ensure disciplined financial analysis, I was able to utilize the driver framework. um define, represent, implement, validate, evolve and reflect. So we'll first begin with the two stages. So first is define. You were given the project parameters which involves the initial investment of $12 million, working capital of $500,000 deployed at launch and recovered in year 10, revenues as $8 million in year 1, $11 million in years 2 to 5, and $9 million in years 6 to 10. and operating costs at with COGS as 40% of the revenue, labor 2.5 million, rent and utilities as 0.8 million, marketing $0.3 million in year 1 and then $0.1 million thereafter. So this also includes taxes that we have to consider which would be 25% corporate rate with terminal value of $3 million at end of year 10. So um that is our discover stage. Um, and our objective is to evaluate whether Starbucks should allocate capital to a new roaster. And that decision rule is simple. If the net present value NPV is positive using our 8.5% whack hurdle rate, the project creates shareholder value and should be accepted. If it's negative, it destroys value and will be rejected. So upon reviewing the project parameters um we are now able to interpret that. So we have that initial outflow which means that the project starts in a deep financial hole and with a revenue volt volat volatility the revenue isn't flat. It jumps to $11 million um in years 2 to five and then drops back to $9 million as me as I mentioned earlier. So this midterm bump is carrying a lot of the project's value and the operating leverage I noticed has high fixed costs. So specifically it's 2.5 million um as mentioned earlier and combined that with other costs that must be paid regardless of how many coffees we sell. This suggests that the project will be highly sensitive to revenue fluctuations a risk that we will be testing in our code later. So now um with our represent stage I was able to create a program wherein it has the baseline calculations um and I have chosen to represent this problem using a cash flow model using Python. So this allows for automation and rigorous sensitivity testing which is difficult to do um cleanly in static spreadsheets. And um as I go through this, I'll be explaining the logic of the model structure here. So I was able to represent the cash flow calculation as a reusable function. So this is vital for the evolve stage later um wherein we're going to improve our functions and um add more depth to our output. And instead of hard coding one outcome, this function accepts whack and revenue as variable arguments. And inside the function, the logic follows standard accounting flow. So we're first able to calculate EBIT by subtracting COGS fixed labor rent and depreciation from revenue. And then we calculate NOPAT or the net operating profit after tax over here. Um and then finally we derive unlevered free cash flow by adding back the non-cash depreciation charge and adjusting for capital and expenditures and changes in working capital. So over here and I also represented the timeline using um these arrays here and this will create a discrete but bucket for every year from year 0 to year 10. And now if we print this, if you run this, um, we'll be able to get a cash flow table as you can see here. And now we'll look at the implementation stage. So I used a for loop to iterate through years 1 to 10. And you can see as well that the conditional logic over here um if it is year 1 we use the specific startup revenue of $8 million. If it is between years 2 to 5 um we shift to the peak revenue of $11 million. And then um for the remaining years we revert to the steady state. And further down you can see I also utilize the financial library and this provides us with the industry standard functions for NPV and IRR over here and with this um it removes the risk of manual formula errors in discounting 10 years of cash flows by hand. So finally we'll be going to the validate stage and this is the validation stage and we were able to run that. As you can see these are the same values as the one that we were able to get earlier during our represent stage um just more specific in terms of which values are which nit FCF etc. So this is a model as good as its inputs and I have programmed the code to print a validation table for the key years as well. um as uh you can see over here. And now you can now we can check year zero and we see a negative cash flow over here of roughly -12.5 million. And this is correctly um this correctly sums the 12 million capeex and 500,000 working capital. And with year 10, we see a massive spike in cash flow. Why is that? because the model correctly adds back the $3 million terminal value and the 0.5 million working capital recovery on top of operations. And quick mental math check on depreciation. The $12 million asset is depreciated over 10 years. That should be about $1.2 million a year. And with that, the table confirms exactly $1.2 for every operating year. And that means that the math holds up for the validation stage. And the base case result shows an NPV of roughly 1.27 million and an IR of 10.74 um as well. And since the IRRa is higher than our 8.5 um $ 8.5 whack, $ 8.5% whack, the base case suggests acceptance over here, as you can see. And of course, um we don't just stop at that base case. We evolve our thinking through sensitivity analysis which is why um we were also able to create this stage wherein we have two scenarios. Um the first scenario we'll look at a chart of um the walk sensitivity case. We know the interest rates and um that can fluctuate. So the chart for this scenario shows the MPV at 6.5 8.5 and 10.5%. So even in the worst case cost of capital scenario which is the 10.5% the bar is still above the zero line. So this will tell us that the project is robust and against interest rate risk. And of course um the scenario B would be the revenue sensitivity and this is where we model the scenario where the proposed flagship appeal is lower than expected resulting in 20% lower revenue across the board. So this kind of result is alarming over here. This is the first scenario A and then this is scenario B. And this result is alarming because the green bar flips to a red bar with a negative NPV of nearly negative $1.9 million. So this does confirm the earlier suspicion we had about operating leverage because the rent and labor costs are fixed. that drop in sales wipes um wipes out more than 100% of our profit. So with that um we move on to the last stage that is the reflect stage. So on these findings um we have a recommendation strictly based on the numbers the base case is positive right. However the evolve phase revealed that this project is very fragile. it relies a lot on hitting those optimistic revenue targets in years two to five. Um, and because of that, my recommendation would be a conditional acceptance with a specific strategic requirement because a project destroys value if revenue misses by just 20%. Management should only approve this capital if we have pre-signed contracts or high certainty market data supporting the $11 million figure or if you view this flagship as a marketing expense for the broader brand accepting that the roaster itself might not be standalone profitable in a downside scenario. Um, and if this is a purely standalone financial play, the risk of negative NPV is too high and ultimately I would just advise caution. So this is it for our um session 10 assignment. I hope this was useful. Um and the evaluations of for Starbucks proposed flagship roaster is essentially um accepted however with certain conditions and if purely a standalone financial play then um I would advise caution. Again thank you very much and have a great day.",
  "video_url": "https://youtu.be/XJMmv9H9Zqg"
}