{
  "student_name": "Mya Dodson",
  "org_defined_id": "034223308",
  "username": "dodson22",
  "email": "",
  "transcript": "Hello, so my presentation is going to investigate market efficiency using the GameStop short squeeze of the 2020 to 2021 as a case study. So I've used the driver framework for this analysis as required. So first, for define and discover, which is the first step, the problem was to test the efficient market hypothesis against the GME event. So a critical first step defined in the assignment was to verify a specific claim, which was that GameStop traded at four cents in August in 2020. My research also focused on answering the key questions from the rubric, which forms of E&H were violated, what behavioral biases were at play, and what role did limits to arbitrage have in this event. So, stage two, which is represent. The second stage was to create my analytical plan and this had to be done before my implementation. So my plan was to use Python in the Google CoLab notebook to acquire data from Yahoo Finance. I would then use that data to first verify the 4 cents claim and second create a visual event study by plotting the price and volume against key event dates. and this data would then be used to answer the analytical questions so then on to implement which starts right here we move to the implement stage where i will execute the python code so first the code installs and imports the necessary data from the yahoo finance and all that and then it filters the data for august 2020 and finds the lowest trading price in that month And then it generates the main study event bot, showing price and volume, with key dates like the squeeze peak and trading restrictions labeled. So I will now run the entire notebook, which I've already done, but I will do it again. The code is executed, see the output down here, this chart, so this is the chart, the code generated this is the primary data that i will use for my analysis in the validate stage so you can clearly see the price and volume spikes as well as the event markers so on to stage four which is validate the fourth stage um where i use the code's output to kind of answer my answer the questions so first a critical step is that the code's output shows the lowest split adjusted price in August 2020 was $4.0150, so $4.01, almost two. The assignment's claim of only four cents is therefore factually inaccurate by a factor of over 100. So second, the test of the EMH forms. Based on the chart, the weak form was violated. The clear momentum bubble shows the past price was used to predict future price, violating the random walk idea. And the semi-strong form was also clearly violated. The price soared to $483, which we can go back down to here. Okay, I'll just see these spikes. Which completely disconnected from public fundamental information. The price was driven by hurting and social media, not a rational incorporation of data. So, the limits to arbitrage anomaly is what I will be speaking about next. So, rational investors knew that GMU was overpriced, but they could not correct it by shorting the noise trader risk, which is the risk that the irrational herd could keep pushing the price up, and the high cost to borrow shares made shorting impossible. So this is what allowed the inefficiency to persist. And then on stage five, which is evolve, I analyze the implications of this. So the event is strong, is a strong argument for passive investing. So it shows that trying these speculative bubbles is gambling, not a repeatable active strategy. The event also has major policy implications as it has highlighted structural market failures, like trading restrictions that led to congressional hearings. And then we have the last stage, which is reflect. So finally, in the reflect stage, I can kind of synthesize the findings. So, in conclusion, the GME event is a textbook case study where behavioral finance provides a much better explanation than a strict EMH framework. It was a sentiment-driven bubble and weaponized by social media that was allowed to grow because limits to arbitrage prevented rational correction. so and it proves that while markets may be mostly efficient they are not always rational and this is the rest and that just concludes my presentation thank you",
  "video_url": "https://youtu.be/K0aIkhIXCwo"
}