{
  "student_name": "Andrea Typaldos",
  "org_defined_id": "036748997",
  "username": "atypaldo",
  "email": "",
  "transcript": "Hi, this is Andrea and in session 10, I'm pulling together everything from time value of money and cost of capital to make a big capital budgeting decision using NVP. First, using a driver method, I'm going to define and discover. So, imagine I'm on Apple's capital location committee, a location committee. Tim Cook asks, should we spend $2 billion to build an advanced semiconductor factory in Texas? So the finance team gives this cash flow forecast from years one to three $500 million per year which would be the ramp up uh period from years 4 to 8 and 800 million per year which would be a full reproduction from years 9 to 10 $300 million per year which declines the purchase and in year 10 plus 200 million from selling the facility. Apple's WACC is 8.5%. So that's our hurdle rate. The strate The strategy team is excited about supply chain independence and ops says outsourcing might be cheaper. So my job is to cut through emotions and ask one clear question. Does this project create shareholder value in finance language? is MVP greater than zero when we discount all cash flows at Apple's WACC of 8 point 8.5%. So the goal in this session is to use capital budgeting as a glue that connects time value of money risk and return and WACC to make a clean accept or reject decision with the second step of the driver method we represent. So, first I map the cash flow timeline. I'll measure everything in millions. Year zero, meaning today, would be CF0 equaling minus $2,000. This is the 2 billion investment. So, in years 1 2 3, CF1 it would be 500. CF2 500, CF3 500. And from years 4 to 8, CF4 to CF8 would be 800. And then in years 9 to 10, CF9 would be 300. CF10 would be 300 plus 200. That's the 200 is the sale value, which would equal 500. So the cash flow stream is um - 2,500 500 500 800 800 800 800 800 300 and 500. And the NVP formula is NVP equals the sum of T = 0 um to 10 of C of F of T divided by 1 + R to the T where CF0 would be the minus 20,000 we talked about and C FT are the future cash flows. R would be 8.5% which is Apple's WACC. So the decision rule is that if NPV is greater than zero then the project creates value so we accept it. If NVP is um lower than zero it destroys value so we reject it. Now um to implement I'm going to use a simple Python MVP example you can see on screen. So now I turn that timeline into a very simple Python script. I'm not trying to be uh I'm just doing a simple Python script. So just I so that I can just translate a story uh into a code. So when I run this the MVP comes out strongly positive around 2.1 billion in today's dollars which means that after covering up 8.5% cost of capital there is still a lot of value left over for shareholders. Here you can see the MVP and then you can it also does the accept or reject decision. In this case, we obviously accept the project because the MVP is positive. Now for our driver method, we verify. And to verify my analysis makes sense, I check three things. First, cash flows. And I ask myself, did I include the initial investment, operating cash flows, and the terminal value? Um, yes, I did as you can see. Then second, the discount rate. I used Apple's WACCC of 8.5% which is the right hurdle rate for a project with similar risk to Apple's core business. And third, the decision rule NPV is well above zero. So the project clearly creates shareholder value that matches the intuition that a two billion spend that generates large cash flows for 10 years plus a sale at the end should be attractive if the numbers are realistic. So the math and the business story are perfectly aligned. Then um for the next step on the driver meth method we evolve. So I evolved the analysis but I but I asking some what if questions. I asked myself what if the project is riskier than Apple's core business to this I I thought then the discount rate should be higher than 8.5% and I can change the WACC in the code to 10% or 12% and see how MVP changes. The other question I did to myself is what if the cash flows are over optimistic? I can multiply each feature future cash flow by let's say about a 0.8 uh which would be a 20% haircut and return the model to see whether NVP is still positive. This is how co cor cooperative finance terms use sensitivity analysis and scenarios to see whether a project is still attractive when key assumptions move against them. for the last um uh step on the driver method. My biggest I reflect. So my biggest insight from session 10 is that capital budgeting is where everything comes together. Where TVM gives me the mechanics to discount future cash flows where WACC gives me the market based discount rate that reflects risk. Cash flow analysis forces me to think carefully about what actually changes if we do the project and MVP turns a messy emotional strategic idea into a single objective number. Does this investment create value after paying investors the great return? So in Apple's example, instead of arguing we need supply chain independence versus outsourcing is cheaper, MVP let's give gives us the opportunity to say at an 8.5% cost of capital the factory adds billions in present value. So financially it's a go unless there are huge qualitative risks we haven't priced in. The same logic is exactly what I'll apply in my Starbucks sorcery assignment. Well, I will build incremental cash flows, discount them at WACC, compute N and PV and IRR, test sensitives, and then make a clear manager friendly recommendation that connects the number two strategy. That's what I learned on session 10 that using NVPN capital budgeting as a disciplined way for companies to decide which big projects deserve their their scarce capital. Thank you so much. That was my session 10 assignment.",
  "video_url": "https://youtu.be/eZFsEJYuDBs"
}