{
  "student_name": "Deep Patel",
  "org_defined_id": "037663656",
  "username": "pate2233",
  "email": "",
  "transcript": "Hey guys, today I'll be doing math session 10 cost of capital analysis. Okay, so for my define and discover stage. So the purpose of the analysis is to evaluate Starbucks proposed 12 million flagship roaster investment. So they're deciding if they should invest $12 million on on it or not. Um determine whether the project creates value using the 8.5 WACCC. So, we're going to see if Starbucks um if Starbucks invests the 12 the 12 million, is it going to create value for them or not? And then we're going to create an automated Python capital budgeting model. And then it's going to assess how sensitive the recommendation is to revenues and WACC changes. So, the questions that we must answer is what are the projects yearly cash flows? What is the NPV IRR payback period discount payback? and the um PI how does changes results change if revenue drops by 20%. How does the NPV change if WCC is equal to 6.5% or 10.5% instead of the 8.5% and if Starbucks should approve or reject the project and the given data we're given is that the initial investment is $12 million and the depreciation is 1.2 million a year. The working capital that we're given is 500K with YO equals the outflow recovered in year 10. Um the revenue for year 1 is 8 million. Revenue for year 2 to 5 is 11 million. And the revenue for 6 to 10 is 9 million. Okay. And the operating cost is four 40% of revenue, 2.5 million of labor,8 million of rent and.3 million um for year 1 for marketing and then 0.1 each year after that. The corporate tax is 25%, terminal value is 30 million in year 10 and WACC is 8.5%. So we're going to represent all of this using the key model component. So depreciation um of 12 million divided by 10 is 1.2 million. Um cost of goods sold is 40% of revenue. Tax is 25% multiplied by the EBIT and it's floored at zero capped at zero and the discounting rate using the WCC is 8.5%. And then the outputs should generate using the Python code is the NPB, the IRRa, playback period, discounted payback, profitability index, sensitivity tables for revenue for negative 20% and walk um WHDC plus 2% and the cash flow plots for it. Now I'm going to implement the information that we already know using Python. So using Python I'm going to build the cash flows which will help me define the parameters um compute the depreciation compute the EBIT taxes and OCF adjust for working capital add terminal value assess FCF list and it's also going to help me do the capital budgeting metrics using the NPV and WACC value of 8.5% IRR profitability index and the simple and discounted payback back. And then the sensitivity analysis I'm going to be doing later on would be the revenue decreasing by 20%, the WACC equaling to 6.5% or 10.5% instead of the current 8.5%. And I'm going visualize this using a bar chart and a line chart. Okay. So I told Gemini that your financial modeling assistant produced a complete runnable Python code that performs capital budgeting analysis for Starbucks proposed flagship roaster and then I give it all the inputs that we were given and then I told it the required outputs and then it gave me code. However, I was getting some errors. Um so I gave it the errors and then it fixed the errors and then this is what it gave me. Okay. So this is the code that um Gemini gave me. So this is just it importing the um code and the um pandas numpy mattplot lib and then it's um if that doesn't work it's going to run this and then these are the inputs that we are given. So the investment is $12 million, working capital is half a million, tax rate is 25%, WCC is 8.5%, terminal value is 3 million and years are 10. Um so the core functions is um stuff like this like get revenue. So if year one if year is equal to one then it's going to return 8 million. If it's two to five it's going to return 11 million. If it's between 6 to 10 it's going to return 9 million. And then this is the marketing um scenario. And then this is all just formulas like cost of goods sold would be um revenue times 4%. And then it's just um finding more functions. And then this is it finding the discounting rate. Um this is it finding the payback period. This finding the discounted payback period. And this is it for the um outputs that it gives me. And these are the different types of scenarios of revenue dropping by 20% which would make it 80% of what it is right now. The WACC equal to 8.5% and 10.5%. And this is what it gave me. So like this is the revenue for each year. This is the EBIT the notepad and then this is like the FCV present value FCF. Um and then this is other stuff like the financial metrics. So the NPV is 3.022. Um so basically almost 3 million. The IRRa is 13%, profitability index is 1.24 times. Um payback period is 5.28 years. Discounted payback is 8.21 years. And then this is it um showing the um FCF. So this is showing the 12 million that they invest in year zero. And then this is starting from year one. So like year one they're going to make about 1 million. Year two will be two and a half million. Then year one, two, three, four, five, six. So this like year six and this is year 10. And then this is the sensitivity um scenarios for the NPV versus WACC. And this just shows that the two intersection lines is around 3 million which is what we got right here the NPV. Okay. And then um I can validate this by um the depreciation is confirmed at 1.2 million since um we know that the depreciation is right depreciation is 1.2 million a year right here. Um and then cost of goods sold is always equal to 40% of the revenue. taxes is 25% of the EBIT and cash flow ties with proper um capital budgeting structure and the benchmark validation is Starbucks typical retail projects used 8 to 10% hurdle rates which is consistent and then for sensitivity testing um we show we found out that the negative 20% impact on NPV and IRR and we also tested the 6.5% 10.5% on NPV and then the lower revenue leads to a lower FCF which leads to a negative FPV um possible and the higher discount rate leads to a lower NPV which is a typical time value behavior. Okay. Now I can evolve on this by making enhancements to improve accuracy. So I can do that by adding inflation adjusted cost and revenues. I can model seasonality and revenue which is peak coffee months. Um add risk which would be like for college students it'll be like when college is open and then um add risk adjusted discounted rate beyond um based the geographic factors and then I can add the Mont Carlo simulation for de demand uncertainty. I can also add the tornado diagram for sensitivity visualization. And then I can also evolve on strategic eval evaluation recommendations like I can consider revenue strategies from tourist traffic. Explore premium pricing strategy within the roaster evaluate staffing optimization to reduce fixed cost and then revisit the projective real real estate cost change materially. So I can reflect on this by the key takeaways which is that the NPV and IR provide a rigorous finance ground decision tool. Python automation ensures consistency and eliminates manual errors. Um the sensitivity tests um reveal key risk drivers which is the revenue volatility and discount rate and then the reflection based on decision if the NPV is greater than zero then the project adds shareholder value and I'll discuss that in just a minute um strategic factors the which is like the brand halo um experiental um store visibility and reforms decision and then risks like demand uncertainty and fixed cost sensitivity should be monitored and the overall recommendation is based on finance and strategic alignment. So going back to this if NPV is greater than zero the project adds shareholder value. So we found out that the NPV is um 3 million which is greater than zero. So it's going to add value to Starbucks. So at the end of the day, Starbucks should invest the 12 million because it's giving them a um profit and the payback period is 5 years, five, five and a quarter years and then the discounted payback after depreciation of the roaster is going to be eight years. So in the long run, so like in 10 years, they're going to be starting to make more money than if they were not to invest on the um project.",
  "video_url": "https://youtu.be/vkK_k4ZvZSA"
}