{
  "student_name": "Qianyue Wang",
  "org_defined_id": "034658523",
  "username": "wang5687",
  "video_url": "https://youtu.be/JrnD6qocwF8",
  "transcript": "Hi, this is Tang and in the session 12\nassignment we will use the Panera bride\nas an example and we need to deliver a\nfull valuation of Panera bride for the\nKK take over using driver method. We are\ncombine DCF trading comps and precedent\ntransactions to produce the to produce\nan informed bid range. We are\ncontrasting financial buyer displaying\nwith strategy buyer synergies.\nSo we will use DCF trading cams pre\ntransactions\nand this notebooks will be will show all\nthe steps I need to use.\nSo the first one is the\ndecision is that the GR is consider\nconsidering the takeover of Panera\nbride. We need a B range and a winning\nstrategy. We're comparing the financial\nbio display and strate.\nWe will\nuse all the information it gives us for\nthe deal snapshot\nto what we and what we will estimate is\nthat the enterprise value and limit and\nimply the equality value and we will\nget the big range and walk away price\nand why the KR versus strategy buyers\nvalue is differently.\nSo now let's get get started for our\ninput. We will have some core company\ninputs which is given in the context and\nwe have valuation hormone which years is\nfive and the year index we will use a\nrange function.\nThe base operating assumptions is we we\nwill use the text rate is about 25%.\nAnd here is all the information we need.\nSo the baseline like margin is about\n15%.\nSo what we will for the represent part\nwhat we will build is the DCF model. The\nproject revenue we need project revenue\nfor five years project um EBITDA\nand convert EBITDA to EB it\nand trading CMS. we will use PN approach\nusing net ecom and e\nuh or like ebitda approach using\nso let's get started\nwe will build a five-year projection\ntable for revenue uh ebita ebit uh nat\nand fsaf and we will return data frame\nwith the intermediate steps\nAnd all this data we will use in next\nstep.\nSo for the trading cams we will have\nequality calculate equality value and\nconvert equality to EV by adding net\ndepth\nand we will get this for different\nwe have indust is 22 equal value\nuh 8,800 and chip is 75 for P& and the\nequality value is 40,000 and McDonald's\nis 25 rupe and 10,000 for the equity\nvalue and for the trading cams\nfor the different scen uh for different\nscenario like trading low the multiple\nwill be 11 implied ei will be uh 9,900\nthe trading m will be 13 and imply we\nwill be 11 uh,700\nnow for the precedent transactions We\nwill have metric value metric the\npresent low the EV or EBI TDA will be 12\nthe implied EV will be uh 10,800\nand for the precedent high the evil EBI\nTDA will be 15 and the implied EV will\nbe uh 13,500.\nSo now when it comes to financial versus\nstructured buyer what changes like for\nthe financial buyer they usually assumes\nlimited synergies and they care about\nthe downside protection financing and\nexit multiples and they set a straight\nwalk away price\nand for the strategy buyers we like for\nStarbucks they may justify pay more\nbecause synergies like cost savings\noperating leverage but It has the\nintergreation risks and exclusion risks.\nSo below we will model synergies extra\nebit and also give us synergy capture\nrate because synergies like never are\nnever 100% guaranteed.\nSo for the synergy uh G assumptions\nthe percentage we will assume five\npercentage of EBITD as a potential\nsynergy and only 16 will reise.\nSo now for the base EBITD is 900 and for\nsynergy EBITD will be 27 and for\nstrategy EBIT will be 927\nfor stretching multiple will be 15 and\nimplied stretchy EV will be uh 30,900\nso for the valid validate validation\npart we validate that outputs are\nlogical the DCF in values should be in\nthe same ballpark as EV or EBIT TDA\nmethods and we upside the DCF EV should\nbe higher than base downside should be\nlower and strategic EV should rise but\nif we increase synergy capture or\nsynergy percentage and sensitivity\nshould have correctly like higher W in\nrefers to low EV and higher terminal\ngrowth refers to high EV\nso let's check that\nso we have checked the ordering that the\ndown set is less than base and less than\nupset. So what we what the method we use\nis totally correct.\nAnd for\nsensitivity we have this as our output\nand for synergy capture and implied\nstrategies\nfor football field. So that will be more\nstraightforward. We will have DCF range\ntrading e or eB\nand also the pre uh precedent range.\nSo under different method we have low\nwith EV and high EV. And all the result\nit shows that the strategy\num\nuh has the highest low E and the pre\nthen EV or EBITD has the highest high\nEV.\nSo let's plot the\nuh plot the view.\nSo here is what we got for the pin\nvaluation field for both field for the\nEV ranges. We can see the DCF covers\nlike the like the most longest one and\nthe PE which is industry one covers the\nshortest.\nSo\nuh our best strategy here is like the\nit's also known as the executive ready\nlogic like how a financial buyer should\nbet like Kr should alter near the middle\nof the display valuation methods like KR\nshould set a work price near the top of\nit downside protect protected range and\nif strategies are like circling cur Kr\nmust decide compete and accept lower\nreturns or state is blind and avoid\noverpaying.\nSo for the management roll over\nroll over reduce cash\num paid up front and aligns management\nincentives but it also signals\nmanagement believes in upside it can\nstrengthens the kick's case.\nSo choose a plain character range like\nthe low means DCF base minus some\nnegotiation negotiation buffer m the\naverage of DC base and trading mid and\nhigh we will walk away like\nso from that we can see that the\nstrategy reference has the highest EV\nand the KQR low still has the lowest\none.\nSo for the reflection part like this\nevaluation forced me to separate value\ncreation like from value justification\nand DCF taught me that small changes in\nV and terminal growth can move e a lot.\nSo I must careful with assumptions like\ncomps and precedents give a reality\ncheck. Even perfect DCF must be\nconsistent with what the market pays and\nfinancial versus strategy bias differ\nbecause strategies can a scenaries like\nhigher scenaries can carry exclusion\nrisk. So using driver I learned a lot\nfrom this courses and I hope I can apply\nall these things uh into my future study\nfor for finance. And that's all about my\nuh assignment 12. Thank you for\nwatching.\n\nAll\n\nFor you\nRecently uploaded"
}