{
  "student_name": "Aiden Rittenhouse",
  "org_defined_id": "037138232",
  "username": "aritten",
  "email": "",
  "transcript": "This is our section six assignment of market efficiency investigation. Um this is session 8 section six. Um our assignment overview uh we're going to investigate market efficiency using the GameStop short squeeze event of 2020 2021 as a case study and we'll verify the accuracy of the stated facts and analyze price behavior relative to efficient market hypothesis predictions and evaluate whether market anomalies constitute evidence against market efficiency or can be explained within existing frameworks. So, the critical first step, verify the statement that GameStop was traded at 4 cents in August 2020 against actual historical data. Um, so I can look it up right here. I see GameStop stock and we can go to August and you can see that it's trading well above 4 cents. Um, and there's more weeks into August. Um, a$135. So, we can say that it was definitely trading at above 4 cents. I don't think anywhere on here it's saying it was trading at 4 cents. And uh we have put this into or I put it into Gemini as well and looked it up there. And it again uh said that the market was trading at around a dollar and with stock splits it was like $6 or uh or around a dollar and the stock splits it still would have been like around a dollar. It's gone back and forth. Um, so yeah, we throw that in there. Uh, so the event timeline, August 2020, GameStop nears bankruptcy levels. GME is GameStop. It's just their ticker symbol. Uh, Ryan Cohen, the chewy founder acquired 13% stake January 2021. Reddit, uh, Wall Street Bets, uh, drove price surge to $483. Uh there was a congressional hearing on the market manipulation and as of now uh the postevent price stabilization and uh so some key data points uh short interest peaked at 100 140% of float. Uh retail trading volume increased 10fold during the squeeze which is incredibly volatile. uh trading restrictions implemented at peak and that was on Robin Hood uh which is a trading app for stocks and stuff. Uh hedge fund Melvin Capital sustained a 53% loss requiring bailout and analyst fundamental value estimates $10 to $40 per share. Um and then we verify all stated historical data price and document corrections. So obviously we know that GameStop was trading at a little bit more than well not a little bit more it was actually a lot more than 4 cents a share in August 2020. Um we'll test which form of market efficiency weak semi semi- strong strong was violated. Uh evaluate whether rational investors couldn't have profited systematically. Compare efficient market hypothesis EMH predictions to observed behavior. Assess behavioral finance explanations for observed anomalies. So, we throw all this in and um we see that GameStop was struggling uh in August 2020 and the stock is actually traded around $167 on average. Um we see our 10 our 13% stake. Um we see the peak at $483 and how it uh increased 140%. So now we talk about the efficient market the hypothesis test uh the three forms weak form semi- strong form strong form um so we can see what was affected or violated uh so all the past price volume data is reflected you can't profit from technical analysis in the weak form and with GameStop the price surge showed strong non-random momentum patterns which came out of nowhere like what was his name? Roaring Kitty, the guy on Reddit that decided to uh have this go viral uh cause non-random momentum patterns. So this is likely violated. Um all public information, news, financials, analyst reports is reflected. Uh so the price surged $483 exceeding the public fundamental value of 10 to $40. Um so it's clearly been violated. semi- strong and strong. Uh this is not directly tested by this public retail event, but market structure issues suggest deeper flaws, but this one's not aable because there's no private information that was being traded. Uh so as you can see the verdict, and I agree with this, uh the prices are rational and didn't reflect public fundamental information resulting in a clear failure of the semi- strong uh EMH. Um why did the price go so high? um behavioral finance came in. So the short squeeze mechanism uh there was a fatal flaw extreme vulnerability uh short interest was at 140% a float. This meant that more shares were show sold short than actually existed and were available to trade uh the squeeze. So when retail buyers or stock buyers flooded the market, the price went up and then this triggered margin calls for the short selling hedge funds like Melvin Capital which has seen a 53% loss. There's actually a a movie about this called The Big Short and you can see uh the effect that this is having on hedge funds and stuff. Uh there's a scene in the movie where Roaring Kitty, his girlfriend or wife uh I forget, uh like talks to him and asks him how much they made today. He's like a couple billion or a couple million. And then there's a hedge fund uh director. He he controls the hedge fund. and his wife asks him, \"How much did we lose today?\" And he said, \"A billion.\" And then it goes again and he lost a billion the next day. Like it was cuz they were calling shorts on GameStop stock. And then since it was rising, they were losing all this money. Um, and then there's forced buying and to meet margin calls, short sellers were forced to buy back the stock to cover their bets, which drove the price even higher and higher. So people thought they went out too early and then they wanted to get back in and it kept driving the prices. Um there were behavioral biases and hurting uh retail traders didn't act as isolated rational agents. They used they acted as a collective driven by emotion which was due to uh this like Reddit page. Uh they were all driving the price. Uh Roaring Kitty I I forget the guy's actual name. Uh he had put out a video saying I want to talk about a stock. It's GameStop. And they all went after it. Um, so they followed the crowd and once people started to see it go up and go up and up and up and up, everybody got in and the buying pressure uh increase and everybody started to hurt. There was also FOMO. Uh, the rapid gains fueled a massive influx of buyers who ignored the fundamentals just to chase the return. Uh this is like when you see a meme coin or something now uh like Dogecoin uh it was going up uh significantly in uh 2020 and 2021. It's like people were just thinking that this random stock or memecoin like what we said crypto was going to boom. They were trying to get in early. They wanted to be a part of it. They wanted to make a ton of money. So you're just throwing all rationale out the window and just listen to this and everybody was buying into it. Uh sentiment farming uh there was uh framed as a fight against Wall Street and hedge funds. Uh turning the trade into a social cause and motivating people to uh hold on for dear life even as the price became absurd. $483 for GameStop stock is unreal. Um it's just absolutely insane to think about. a failing company had their publicly traded stock rise an insane amount of money limits to arbitrage uh in an efficient market uh rational investors arbit I can't even say that word so I'm just going to say rational investors uh would have sold the overpriced stock short at $483 to profit when it inevitably dropped and uh this process corrects the price however they couldn't uh the retail traders acted as unpredictable noise and uh the rational investors feared the price would go even higher before correcting leading to unlimited losses on short positions. Um and there were trading restrictions uh like I said earlier like Robin Hood that trading app uh broker the they restricted trading effectively freezing the market and preventing rational selling from correcting the price. Um, so people that were in it and were just waiting and waiting and waiting until they could sell for the highest uh possibility kind of got screwed by these apps uh just because the the stock was just so volatile and there was something they noticed that there was something definitely wrong with it and uh rational profitability uh before the fact. No, a truly rational investor following fundamentals would have either avoided the stock or shorted it just like the hedge funds did. Um, I mean, a a failing company like that, people are going to short it. And the fact that it went up, no rational person was betting or making calls on GameStop stock to go up. Um, it's just not very smart. um after the fact, yeah, people would have like bet on bet on this and made money off this uh just because it it was going up and everything. So, yeah, now that we see that it went all the way up to $483, it would have been a good idea to invest, but you you would have never known before uh that fact. Uh so the EMH uh versus behavioral finance uh the GameStop event was temporary random bubble that eventually popped proving that uh prices must return to fundamental value in the long run. Uh behavioral finance finance's view uh this event proves that the psychological biases and market flaws can sustain a massive mispricing for extended periods making market efficiency a poor description of reality in a short term. Um Keith Gil of course I had the slide that's what his name was. Roran Kitty. Um, they actually did it again. Um, I know he came back. I saw it in the news. He came back and I think they did the same thing with GameStop stock. And I think that's what this is right here. Um, this uh jump from down here. So, as you can see, this is this area right here is if I could get this ticker away. This area right here. I can't get this away. But um this is where it happened. This is where they all went crazy. And then as you can see, it slowly slowly slowly goes down, goes down, returns back to normal. And then he made his return and said something again. He posted another video. Let's like let's do it again. Um but obviously they're violating the uh EMH. And then uh yeah and then here's the the coding used to uh calculate that stuff with the 140% increase and stuff and uh yeah so the perfects you can see the purposes of the code uh right here um data retrieval basic for all the empirical tests of the image uh verification uh that was for the the stock price key metrics, the abnormal returns and daily returns, the volatility and abnormal returns. Um, but yeah, that talks about the GameStop stock. Um, we we talked about the behavior relative to the efficient market hypothesis, it violated it. Um, whether market anomalies constitute evidence against it or can be explained existing frameworks. Yeah, we talked about that as well. Um, but yeah, all in all, it was a very uh a very interesting time in the stock market and in the GameStop stock.",
  "video_url": "https://youtu.be/Kq_eALGv4Rw"
}