{
  "student_name": "Robby Bergeron",
  "org_defined_id": "035626927",
  "username": "bergeror",
  "email": "",
  "transcript": "Okay, so today we're going to be talking about GameStop stock price change during the December 2020 and the January December or January 2021 market. We're going to be looking about did their price change violet violate any market efficiency principles? Did any investors profit by any insider work? Could the average investor profit? And then the key points of the case are that the August 20th, 2020 stock price ch stock price was wrong and that it is not 4. It is $1.15, which isn't a whole lot better than 4 cents when it's going to be rising to the rate that we see. However, it's not as an extreme number as the four cents compared to the$1.15, which at least makes it look like it is a company that is reliable and not a $4 like penny stock. So, that is an important note. And then I have the timeline, which is August 20th, that they're near bankruptcy. Uh they have a new leader takeover.Reddit starts to promote the stock. it surges to $483 in one day. This is the January 21st day. And I looked, according to ABC Finance, the $483 was just an intraday peak, which means that that's what it was traded for one point throughout the day. However, it settled around $94 for that day. So, it didn't close on the market at 300 or $400. That is incorrect technically but it did reach that number. So looking back at the history of GameStop to understand what they really went through and why their price shot up and then uh the reason why their price shot up like it did and it was such a big deal. So GameStop was at 2020 during COVID they were starting to decline especially during 2021 because PC gaming and console gaming wasn't as big of a deal. everything was starting to shift to an online presence. So, they started to lose like the instore feel, which is what GameStop was known for because if you're not going to go to the store to buy games, you're just going to start buying them online. And the company started to appropriate for that, making GameStop feel like a third irrelevant middleman leading to their industry dying. So, then they had a new over new owner take over where they were in a time of disarray. Meanwhile, on a Reddit, uh it was r/wall street bets. So, yes, a formal company like um so they were like formal, but they were not looking at Wall Street. They were more like taking bets or unofficial action. It wasn't not Wall Street affiliated. So it becomes like this meme stock or joke gaining celebrity attack attention as we can see by Elon Musk tweeted out the Reddit that game that everybody was promoting uh GameStop stock to uh implying that he wants to make it rise and bring back GameStop. I have the screenshot of Yahoo Finance as well, showing if we look at the numbers, how it just really increased during this period of celebrity attention and kind of being made fun of to seem like a joke because it was like everybody loves GameStop. We don't want to see the company go out of business, so we're going to offer our support for it and maybe make a little money. So that was kind of the philosophy behind everyone's point of view when they were investing into the GameStop stock. So today we're going to do the market efficiency test versus behavioral finance and just explain how that is a problem and how this relates to this issue. Calculate abnormal returns in communive abnormal returns or the C. Gather GameStop prices using Yahoo Finance as an accurate source. Evaluate the risk adjusted. Is this market predictable is something we're going to be looking for. And then other things are the price behavior compared to the prediction. Is there a large discrepancy? What other behaviors could uh explain this anonymally? Uh, and then did GMV GME violate all three of the market efficiency test? So, going straight into the code, I worked with Gemini to create all of the graphs that I made using Yahoo as a reference for the stock prices and all the other information as it is so easily accessible. I was just able to import Yahoo as one of the accesses for collab. So that was absolutely incredible making my life a lot easier. So this is the stock price uh representation of GameStop stock through August from August 20th to January 2025. So as we can tell GameStop is doing horrible in 2020. their stock is down in the dirt. And then when that January 2021 reaches towards late January 21, the stock immediately peaks to what we know is a high of $94.93. Causing a fall off directly after because most people would sell as reflected by they wanted to make money was the major point behind uh bringing Gamestock back. So most people thought of it as an investment. However, as we can tell, the varying degree at which it was being sold throughout the day heavily influenced whether or not you were going to be actually making money or not. And then ever since it had a bounceback in August of the next year, so about a year, maybe people invested more into their game stock or game stop stock in hopes that it might do better or grow in the future. But it is just a steady decline till about 2024, another 3 years after the event. Slight increase. You never know what the market game could have released, something like that. But overall, it's been decreasing and has never reached the amount that it was during the January 2021 where it got all this propaganda., yep. Okay. So here is the cumulative market returns where we're going to start talking talking about the market efficiency test. So this is the abnormal returns percentage for GameStop from the years 2021 and January. Sorry, this is just a month from February and 2021. So first off talking about weak forms in the market efficiency test. This would be if we look at historical data or have no other information other than our own intuition and things that we can gather in front of us by looking at the company's information that we should we're going to invest in them. So if I saw a stock that was trending upward I would invest money in that and that would be a weak form. However, this was violated as there was no historical data that showed there was going to be an increase in GameStop stock and it was a complete abnormality. The semi- strong form would be using public forums such as Reddit or like a stock trading website to look at what stocks are doing better and then using that to buy the stock. And then a strong form violation would be or a strong form would be when you have insider information that this like a company is about to like release a new phone and you invest in Apple or something where you directly know their p their price is about to go up so you invest before that. All three of these were violated by from the market efficiency test as it is an abnormality that could not be explained from any of these forms showing that it is a completely different entity in and of itself. As we know the average return went from about 0% rising up from 100 to 400% before it averaged out at about 250%. showing just completely crazy all over the board unexpected the return for GameStop's price was and very low predictability as I said and the price was driven up through social media and what seemed to be jokes or hopeful a hope for the future I should say for GameStop to do better and just love that company that so many people grew up with. So, as we can tell, GameStop did violate all the forms from here as the market data doesn't suggest there's anything. Reddit didn't suggest that it was going to be rising this much and there was no insider trading because GameStop was not doing very good at the time. This was all based on behavioral finance as we'll find out later on. So this was not anything that could have been predicted in the financial scope necessarily. So that's what we are saying with our implement stage. So validate checking with the code. I kind of talked about my experience with the coding. It was very simple. Yahoo finance and collab did a very good job. I got a very good uh symbiotic relationship between the two. So I heavily use that to interpret these results. And this verified data about the short interest and the volume I all conser or I confirmed using ABC finance which is how I also confirmed the $483 uh intraday peak which is very interesting. I learned a lot through that ABC article and it helped me understand a lot of what we're going through in this case. So I found it very helpful. Um and then looking at the the short squeeze abnor abnormal returns graph. This just once again validates our claim that the uh forms were completely blown out of the water and there was no predicting the amount or return that we were going to get back from our investment when investing in GameStop between this specific time. And it also brings up the X post and X anti-terms showing that short-term profits at a high risk um for the X post. And so the the meaning for this is when we look in the past so or when X post is looking in the past and X aantie is looking in the future. So looking back from the past, it was obvious that we should have invested January 21st and literally sold the next day to make a bunch of money, but that wasn't the case for everybody as we know. And but a lot of people did do that. And Xanti was predicting when the peach would reach its height. So this this is what we'd see as more of like an expost problem as X anti would be very hard or almost impossible to predict when it would reach its peak as GameStop was not a very stable stock and was relying solely on the support of the people to increase its stock price and not other things like it should have like its product. Um so this is where we're going to talk about the behavioral bias. I mean this is how many people were influenced into buying the stock. This is pro. This is when GameStop started to go under and under new leadership. And this is when the Reddit post was posted in rstap r/wolf of or wall street bets. So yeah, the behavioral bias was a large part of this incident. Uh hurting large groups of people online saw the rising stock in game rising stock of GameStop and wanted to invest. Fear of missing out. Everyone else is going to make money off this. I need to as well. And then overconfidence. Well, since everyone else has invested into this stock, I can't lose money, right? Nope, that is not the case. They are doing other things. They have different motives. They might have already cashed out by the time that you've invested. So this was just a major cause of social media influencing the rise of this price that allowed it to soar so high and even allowed or even made Robin Hood restrict how much GameStop you could buy as its abnormal return was so all over the place and it was just surging and they saw it as unrealistic as I mean look at this. You're not you don't know what you're making when you invest in GameStop. It could be in one thing the next and another thing the other. So they did that to save their butts. Kind of looking on to the reflect, we see how EMH versus behavioral finance is important as EMH shows the long-term price changes and behavioral finance offers an explanation for the short-term chaos. So the EMH shows us that this was not possible through the financial lens and then the behavioral finance offers us an explanation for this short-term chaos pretty much. And the active result was the explanation where people are buying and selling rapidly to increase their profits. And this would be an example of active management in this case. And passive strategies are looking into the market and predicting when it's going to rise and fall kind of like an X anti sort of move. So looking at the market efficiency policy implications uh they trade halted trade. Robin Hood did at least other companies did not. And then have a margin where if it's swaying so much um have it so it limits at maybe 90 and um or caps at 90 and limits at like 60 for that period of time and then change that depending on the day. So overall Reddit and the online culture led to a shock of the Gamestock price increasing so rapidly leading to a unknown financial relationship that violated EMH standards and could be explained using EMH and behavioral finance.",
  "video_url": "https://youtu.be/IV4dJxDOIJo"
}