{
  "student_name": "Jay Saini",
  "org_defined_id": "037907174",
  "username": "saini52",
  "email": "",
  "transcript": "\"All right, so this is the session eight assignment. Um, we basically have to analyze the GME short squeeze event by examining GME and the market data, calculating the returns and volatility, uh, visualizing prices and return behavior, and evaluating the event against the efficient market hypothesis (EMH) to identify anomalies and discuss potential, uh, explanations. So, to start, um, we analyzed right here, sorry, I'm also pulling up my notes. Okay. Um, so, the first part here is to examine the GME and the market data. So, we have our code right here that basically takes the statistics from, um, the websites right here to print them out. So, this is what we get. Uh, to kind of sum it up a little bit quick, this is the data frame. So, for the first five rows, um, looking from 2020, um, of June, um, all the way from the first to the fifth, we have the close GME, the high GME, the low, the open, and the volume. Um, and then we have the market data frame for the first five rows as well. So, the close, the high, the low, open, and volume for the SPY values. Um, so you would have all that data right here. Um, and then we can kind of see right here, um, it categorizes and and notes it very simply for us. Um, to get the describe or the descriptive statistics. So, we have count, mean, like we have all these statistics that we could use, um, to just help us understand the main objective here, which is analyzing that. Um, so to simplify the data across the manipulation, they will, uh, standardize the columns of both GME and market from Gemini by the way, of data frames by collapsing the multi-index columns into a single level. So, um, we have some code here that will print out the GME data frame columns, so the index would be the close, high, low, um, open, volume, stuff that we saw up here. Right. And then to also get a visual examination of kind of how the trends work, we have, uh, a bunch of graphs right here that is printed out for through the data. So, we have the GME close price over time. Um, you can see it goes kind of slowly up and down and then it goes skyrocketing up and then falling right back down, and then continues to go a little bit up. Um, same with the trading volume. This one's a little bit more up and down, so it's less, uh, consistent. Um, and then the closing price also has a positive correlation, and the trading volume over time is also a very just up and down thing right here. So, you can see those graphs and kind of get a more visual understanding. Um, so then to calculate the returns, um, we just take the data from the top. Um, so we get the standard deviation of the returns, which for GME would be $0.1876$ and for the SPY, it would be $0.0112$. Um, and then to visualize again the price return behavior, we have more graphs here for us. So, we have the GM close price over time. Um, and then, actually, these look very similar to these. Also, you can see kind of analyzing how they, um, work. There's a few differences that I see, but mainly they look pretty identical, um, for all those four figures as well, with the same deviation. Um, so now, based on our price and return analysis, we also need to understand how the behavior aligns and deviates from the efficient market hypothesis. Um, so here we have another chart. This one is, um, the GME price data for August of 2020. So, we have some important here dates from the 3rd all the way to the 31st, which show us our close, our low, open, and high rates right over here. Um, and Gemini, or I guess Colaboratory, has a feature where we can extend and understand and format it in different ways and entries. Um, so now to verify the GameStop traded for a $0.04$ in August of 2020, we need to basically review the GME, um, data frame from August of 2020 and it is clear that they did not trade for $0$ and uh, or I guess $4$ cents during that period. So, with what we learned up here and the ways the statistics are calculated, Gemini was able to take all that information, put it into the, um, algorithm, and then tell us the answer to our main objective question, which is that GameStop did not trade for uh, $4$ cents during that period. So, when, um, kind of looking at all this data right here, we were able to understand just how we can see it. Because with our visual right here, we have more of an idea of what correlations to look for, and it not necessarily helps us answer the question from just our mind, but um, having an algorithm where we can actually put a real-world situation into, can help ease the time and process to make sure that we're not spending so much time analyzing stuff when we have AI that can do it for us. So, right here, um, there's some key observations that Gemini has pointed out for us. One is the price action. So, prior to late of 2020, the prices were relatively stable and low for trading, mostly in single digits, and then around late 2020, that's when they saw the uptake for that. The daily returns were vividly shown in periods of exceptionally high volatility. So, before the surge, returns were typically within a narrow band, and then during January 2021, it's been swinging widely. Um, some other important ones is the again, the price action and the daily returns for SPY, very similar to our GME up there. But overall, it's important to know that the data from the late 2020 and early 2021 clearly show a period of extreme price dislocation, characterization by an exponential price surge. Um, and we have a lot more information that Gemini talked about over here. But to kind of just talk, um, a little bit about how driver fits into this framework, um, so defining the problem, the main question was, is, you know, the GameStop short squeeze of 2021 consistent with the efficient market hypothesis, which Gemini was able to answer for you. Um, for research, we had to do a few things. So, we had to first fact-check, um, ourselves, because no matter how much the algorithm can make this easy, it's important for us to also give it a double check, um, and the claim that it was traded for, uh, $4$ cents was false. Um, it was verified it was more $1.4$ to $1.7$ in the in late August of 2020, and this was through Yahoo Finance. Um, and so after getting all that, we were able to make an algorithm that was making sure it was spinning out the right values, calculating and pulling from correct databases to make it, or to give us the right answer. Um, to interpret the data, we were able to see the past returns and predict the future returns, price change around major news, compared to the market, and market overreactions and volatility. To verify our findings to make sure the algorithm was doing a good job, we cross-checked from Yahoo Finance, like I mentioned, Bloomberg, and just confirmed the August 2020 prices. Um, to evaluate, we wanted to see if EMH failed or not. So, short squeezes and social coordination introduce behavioral bias, uh, hurting FOMO and overconfidence, showing that behavioral finance can be a better explain real-world outcomes. To reflect over the report, um, we've realized that it's very important to combine the EMH and behavioral finance to get a full picture of what we're talking about and not just picking apart because truly it takes a lot of puzzle pieces for all this to make sense. Um, but yeah, that is my Session 8 assignment, and I hope you have a good day.\"",
  "video_url": "https://www.youtube.com/watch?v=tx0v67KNEN0"
}