{
  "student_name": "Carson Parmer",
  "org_defined_id": "036732462",
  "username": "cjparmer",
  "email": "",
  "transcript": "Hi everyone, my name is Carson Parmer, and today I'm walking through my full DRIVER analysis of Netflix's Weighted Average Cost of Capital and how a new $5 billion content investment should be evaluated. ________________________________________ D — DEFINE The core question I'm solving is: What is Netflix's true WACC today, how would a $3 billion increase in debt change it, and what discount rate should Netflix use when evaluating U.S. versus international content investments? This matters because WACC is Netflix's hurdle rate — it determines whether a new content investment creates or destroys shareholder value. Since Netflix is evaluating a major financing decision, understanding the impact of leverage is strategically critical. ________________________________________ R — DISCOVER In this stage I gathered all key financial inputs. Netflix has a market capitalization of $200 billion and market-value debt of $13 billion. The tax rate is 21%. On the market side, the risk-free rate is 4.5%, the market risk premium is 5.5%, and Netflix's equity beta is 1.3. The company's bond rating is BBB+, which corresponds to a 5.8% cost of debt. From the industry perspective, Disney operates with roughly 30% debt and has a WACC of 8.2%, while Amazon Prime Video uses Amazon's corporate WACC of 9.5%. These benchmarks help us evaluate whether Netflix's capital structure is efficient. ________________________________________ R — REPRESENT Next, I converted all of this data into the components needed for WACC. Cost of equity: Using CAPM, I calculated: Risk-free rate of 4.5% + beta of 1.3 times the market risk premium of 5.5%. This gives a cost of equity of 11.65%. After-tax cost of debt: With a 5.8% bond yield and a 21% tax rate, the after-tax cost of debt is 4.58%, reflecting the tax shield benefit. Capital structure weights: Equity is 200 billion, debt is 13 billion, so total value is 213 billion. This means Netflix is financed with about 94% equity and 6% debt, which is extremely equity-heavy. Current WACC: After weighting the costs of equity and debt, Netflix's current WACC is 11.2%, which is above the media industry range of 8–10%. ________________________________________ E — EXECUTE I then evaluated what happens if Netflix adds $3 billion in new debt. Total debt rises to 16 billion, and the debt weight increases from 6% to roughly 7.4%. Because debt is significantly cheaper than equity, the added leverage slightly lowers Netflix's WACC to about 11.1%. So Netflix is still highly equity-dependent, but modest leverage helps reduce its cost of capital. I also calculated project-specific discount rates. U.S. content has more stable, predictable cash flows, so the appropriate discount rate is around 10.5 to 11%. International content carries higher country, political, and FX risks, so the discount rate increases to 12 to 14%. As part of implementation, I also created a sensitivity visualization showing how WACC changes as debt increases. The curve shows that WACC decreases when Netflix adds moderate leverage but would eventually rise if leverage became excessive. ________________________________________ R — VALIDATE To validate the work, I re-checked all formulas, confirmed that market values—not book values—were used, verified the accuracy of CAPM and the after-tax cost of debt, and compared the results with analyst estimates of Netflix's WACC. The results fall within the expected range, which increases confidence in the analysis. ________________________________________ R — EVOLVE My final recommendation is that Netflix should increase leverage gradually toward a target of 10–15% debt. This moves Netflix closer to Disney's more efficient capital structure and helps reduce WACC without taking on excessive financial risk. This moderate increase in debt would support large-scale content investments, enhance returns to shareholders, and improve Netflix's competitive position in the streaming industry. ________________________________________ CLOSING That concludes my DRIVER analysis of Netflix's WACC and leverage strategy. My name is Carson Parmer, thank you for watching, and I look forward to answering any questions.",
  "video_url": "https://youtu.be/viP-lRhSX-A"
}