{
  "student_name": "Ethan Enav",
  "org_defined_id": "037523768",
  "username": "eenav",
  "email": "",
  "transcript": "Okay, so today we're going to go over the session 9 assignment. And to start, let's just look over the define and discover step of driver. So we said the objective is to code a re reusable Python script that will answer the following financial questions. The rules to follow or to act as as an investment professional, act as a coding expert, keep it simple and stupid. And I told it to only give me the script. don't give me any additional info from here. I just copy and pasted the um parameters highlighted in the session 9 assignment. So basically this whole page right here and I gave that to Gemini and it returned with this script right here. So let's look through the script. So the first part of the script is basically calculating the cost of equity which is going to be the risk-free rate plus beta multiplied by the market risk premium. We've gone over that formula before. And next it calculates the weighted average cost of capital. Um this formula is going to be the cost of the equity equity multiplied by the weight of equity plus the cost of debt multiplied by the weight of debt multiplied by one minus the um corporate tax rate. One minus corporate tax rate. Yeah. Add those two together and we get our weighted average cost of capital. This next section is just formatting um the first answer to what our weighted average cost report is going to be. So no calculations here. Um and then this next section of the script is just looking at the inputs that we gave it. Um including like Disney's info and the market rate premium and all those. And then the rest of the script is mostly just print functions grabbing calculations from using the weighted average cost of calc of weighted average cost of capital formula and just pulling it down um for more print functions and other companies like Disney. So let's get into our answers. So first one was what is the weighted average cost of capital for Netflix? Um, as you can see here, it's going to be 11.22%. And when we get to the validation step, I'll go over how we got that. Um, number two, what is going to be the weighted average cost of capital after 3 billion of debt insurance. So, what this did, if we look closely, the market value of debt increased by 3 billion, right? This also increased the total firm value by three billion and slightly um changed what the cost of debt would be and the cost or the weight of debt and the weight of equity would be. And so the end result of having 3 billion more in debt, which this will come into play later, but adding debt actually lowered our weighted average cost of capital. Not by a lot, but it's important to notice that it did. All right. And now we're going into the what this is evaluation of the weighted average cost of capital. What this means um and I believe it asked for um like a US content versus international content. So the sorry so for US content since this is more of a a market that Netflix is used to used to it has this weight average cost of capital is actually which is also basically the hurdle rate is actually going to be higher than what Netflix really should be using because the weighted average cost of capital that we calculated is Netflix's entire higher debt and equity, right? But we're not going to be we're only focused on like US content for this, right? So, it's actually going to be higher than we would want to use. And for international content, it could actually be lower than what we would want to use. Um, since we're going to a different country, it's we would probably want to use a higher hurdle rate. So, the example that the script gives is maybe 13 to 15% and for US content, maybe we should use 9 to 10%. And this is because like I said earlier, the weighted average cost of capital that we um calculated was for all of Netflix. You know, we didn't we didn't specifically do it for US content or international. All right. And then going into number four. Um number four asked, compare Netflix's weighted average cost of capital to Disney and explain the differences. So the script automatically calculated Disney's weighted average cost of capital for us and it was found to be 8.2% 3.02% lower than Netflix. The reason for this was because Disney has more diversified revenue avenues. You know it has media that it's making like movies and things like that but then it also has its parks and a ton of other projects. Um also the cost of equity um was higher for Netflix because of their high beta um which end up giving them a high cost of equity which is the primary driver of its high weighted average cost of capital. Um and Netflix is also underleveraged compared to Disney. Um Netflix is only 6% debt. Well, um, Disney is funded by 30% debt. Um, then number four brings into Amazon weight average capital cost of capital is 9.5%. And it's not very comparable because it's an entirely different industry, I'd say. So then the opal optimal capital structure recommendation um is to basically this to summarize this entire paragraph when we tried adding more debt to um Netflix's current situation it actually lowered their weighted average cost of capital. So in the future when they're trying to fund more projects instead of using equity since they already use so much equity they should try to fund more their future projects with debt. So that was the implement stage. So now we're going to go into the validation stage and to validate I calculated the weight average cost of capital myself to verify it was done correctly. So, we can move over to Desmos here and we can see this um weight of equity right here times by the cost of equity. Add this to the weight of debt multiplied by the cost of debt multiplied by 1 minus the corporate tax rate and we get that 11.22% if you round um which was the same thing that we got right here 11.22% 22%. So after validating, we know that's correct. To evolve um to evolve the script, add another section to the bottom of the Python script where it shows how weighted average cost of capital changes as beta or the market risk premium are slightly different. So in this script it actually so right here is this sensitivity analysis where you'll see it at the bottom but it's basically just testing different betas and different market risk premiums. So if we go to the bottom of this script number six sensitivity analysis we can see obviously as beta increases cost of equity increases and in turn our weighted average cost of capital increases. Same thing for market risk premium. Um as this increase as market risk premium increases so will the cost of equity so will the weighted average cost of capital. So that was how I evolved. Um lastly um the last type of driver are to reflect. Um, I think while doing this project, what was most interesting to me was that um, I didn't really realize that like Netflix could actually lower their weighted average cost of capital just by using more debt instead of equity. And then I also found it interesting that um, you you can't really compare Netflix that well with Amazon because like they're just two different companies. Yeah.",
  "video_url": "https://youtu.be/vLfmXz24vRk"
}