{
  "student_name": "Shane Shuman",
  "org_defined_id": "036088017",
  "username": "sshuman",
  "email": "",
  "transcript": "Hello. Today, uh, I'm Shane Schuman. We're going to be going through, um, capital budget valuation for Starbucks with proposed, um, 12 million flagship roaster and then a projected design to operate for 10ear uh, horizon. Uh obviously our mission here is pretty clear to determine if the investment creates shareholder value using the firm's 8 point 8.5% weighted average cost of capital as the hurdle rate. Um going through a lot of this we have some parameters here. We have our initial $12 million outlay for assets including the building and equipment which will be depreciated straight line and then we'll have 500,000 for working in capital deployment at launch and then making our total initial investment um 12.5 million with an actual added on there. Um we then model the revenue stream beginning at 8 million in year one. um according to acceleration 11 million through year five and then before setting 9 million that for the remaining years all cash flows are fixed at um 25% corporate rate and the analysis concludes in year 10 with recovery of working capital and a 3 million after tax terminal. Obviously we have some other requirements here. Um, we'll have to go through some more data and then over to the driver method. Go all the way back up here. We um had to go through all these other settings of technical requirements and financial analyst requirements. So from going through there we obviously see the long long Python that was made using um obviously a lot of the same methods and we also have some analysis on Gemini for all this information going through it all. So going through the analysis over here. Let me let it run here really quick because as I remember it's very very big. We'll also and I will go through some of it here. We obviously have the projected parameters including capital budget inputs. We have our project investment and depreciation, working capital, revenue forecast, cash forecast, cost forecast, and then core functions. A lot of information that was given to us between year one, year two through five in the year six through 10, which we know is all different numbers in different ranges. Um, and just a lot of general information, taxes, just general formulas to go through that has already been gone through in the class. I feel isn't extremely necessary, but if you want to slow down and go through them, they're all the actual formulas. But for the analysis, which is really, really cool. Um, we have the incremental cash flows or schedule here. We can see the depreciations. You can see all these amounts taxes being 500,000 for the what would that be the second through the fifth year and then obviously dropping as I'm assuming that's accumulation of tax being the amount that it was and then the cash flows being I think it was 12 million then 9 million or yeah 12 million to 9 million and going through all these differences we have our free flow or free cash flow and then we have our capital budget metric including our net positive value or IRR or simple payback period a lot of analysis 8.5 8.5 10.5 and then 6.5 with the plus or minus two or plus or minus 2% for our weighted average cap uh cost of capital and we can see the big differences here which we'll see visualized here on our cash flow chart year one being obviously negative plus 10 million probably 12 million and every other year being gradually higher, especially year two through five and then it dropping off from six to nine and then 10 going up, but ultimately it's uh pretty gradually or it's pretty stably going up. We have the NPV here and um based on the uh rigorous cash flow model that we have here, we can see that the results are pretty positive. the projection yields a substantial positive net positive or net present value which we see right over here of um what would that be of 5.7 million I think is the total amount it's pretty high and this confirms the expected future cash flows which when appropriately discounted exceed the cost of the initial investment significantly a clear creation of wealth for Starbucks shareholders is um complementing this is our IRR over here which we have at a high 12.84%. Which is more than double the required uh it's not more than doubled but it's a lot higher um percentage of return than what it was. And then we have our PI right here of 1.43 43 which is um strongly correlates the decision indicating that the present value of the inflow is is nearly almost one and a half times the required investment which is obviously really really good. Um obviously the no investment without risk as we can see around here. Sincerity analysis reveals um here we are reveals that we have revenue vol uh volatility um is resilient enough to absorb a 2% increase in the weighted average cost of capital and still maintain a positive net positive value of 20%. Um but the revenue reduction obviously is catastrophic. It's huge here. it turns um negative resulting in a 1.4 4 million I guess in this case we got different numbers here 3 plus million over here loss and drops the IRRa to a lower amount over here. This demonstrates the project successfully is highly revered to achieving its uh ambitious sales forecast though. So after all of that um in conclusion I think the best decision going through all this information it would be to accept the project the financial rationale is robust with the big big big net positive value and IRR figures that we were given over here being so positive. But this investment serves a crucial brand building asset that enhances the premium experience and will innovate halo for the entire company to mitigate the significant revenue risk identified which we've seen on this chart over here. recommend I would recommend an aggressive site selection, targeted marketing and immediate operation or operational controls to ensure the millions in year one. we see. But this project would be um a good engine for the creation of value and would help with revenue once it gets up to full. But obviously we'll have problems in the first couple of years and going back to the beginning using the driver method since I'll talk a little bit about that. uh going through a lot of this chart was um I had to have make multiple iterations to get all the analysis and all these charts on for the Python using the driver. So going through it all and defining and eventually getting down to evolving it resulted in this over here which obviously helps see everything and uh make it a lot easier to analyze and understand with actual numbers.",
  "video_url": "https://www.youtube.com/watch?v=upm8HCu5o8g"
}