{
  "student_name": "Colleen McCarthy",
  "org_defined_id": "034532957",
  "username": "mccar169",
  "email": "",
  "transcript": "McCarthy and this is my session 8 assignment about market efficiency investigation. So to start off with define and discover the objective is to assess market efficiency using the GameStop short squeeze of 2020 to 2021 as a case study. We begin by verifying all factual claims in the prompt most critically the assertion that GME traded at or cents in August 2020 against actual disordal data. If incorrect, we document the accurate figures and compare clear evidence-based correction. Non-verification. The analysis will examine price and volume behavior between price volume behavior relative to EMH predictions. Identify which form of efficiency weak or strong may have been highlighted and evaluate whether observed analies reflect true inefficiency or can be explained by behavioral biases and market frictions. So key data requirements include daily adjusted closed prices and trading volume from GME and the S&P 500 from August 2020 to November 2025, short interest history, and a timeline of major events listed below. Sources include Yahoo Finance, SEC fillings, and financial news archives. Preliminary checks confirm that the 0 point the four the 4% price in is inaccurate and short interest peak above 14% 140% and volume recurs for 20 times and monthly capital reported a 53% loss. This stage establishes a solid foundation. Verify first facts and apply event methods including abnormal return calculations, volume analysis and risk adjusted performance to test EMH. Assess rational profitability and integrate behavioral finance insights such as shortity and limits to okay moving on from define and discover we talk about represent. So the analytical approach follows a structured event study to test market efficiency about around the GME short squeeze. So we will bare fail product claims calculate abnormal returns. Measure abnormal value to detect hurting and microtor effects and evaluate risk adjusted returns using the sharp ratio to determine rational profitability. And number five, compare the EMH verse behavioral finance and draw policy strategy implications. So what are we solving for? Number one is did public information get priced instantly? Number two, were returns predictable or exploitable? Number three, did prices eventually stabilize near fundamental value? So some key formulas and components. We're just going to try to speed through this. We have the market model. So we're using returning with we have the formula here and what everything goes into it and estimated over window of August to December 2020. Number two we have the abnormal return with this formula here and for the abnormal volume this measures the retail frenzy versus normal trading. And then for the sharp ratio, this tested gains more scaler look. And so for some practical meaning, a significant C over than zero means a semi- strong EMH violation. Um like a high AV and A with social media timing is a hurting bias. And then high sharp unpredictable timing is a non systematic profit. and then posting pit price near 2025 shows efficiency is restored. Okay, moving on to implementation. We're now executing the full event study using real market data pulled directly from Yahoo Finance. And this code will be able to show seven things. Number one is load GME and S&P 500 data. Verify the 4 cent claim. Run the market model to calculate abnormal return returns AR and cumulative returns C. Number five, measureable volume. Six, compute risk adjust returns using sharp. Seven, show post evidence post event price stabilization. So we know the finance drives the logic and the code is just engine and let's run it. So here's the code given by um AI and to see the results down here um you can see right away that You can see right away what the numbers actually mean is that the assignment says GameStop traded at 4 cents in August 2020, but our data pulled from Y Finance shows the lowest price was actually $342 on August 13th, 2020. And also there's some strong EM was violated and this is because public information such as Reddit posts for 140% short interest ride co was not reflected in price. Also, pre-event average volume at 5 million shares and then during the squeeze there is 112 million shares per day. So this increased to 22.4% said that a 10fold increase. So reality was more than doubled than that and this is just textbook hurting behavior retailer retail traders moving in lock step driven by social media sentiment and no fundamentals. Lastly, the sharp ratio during the event window is 2.78, which is excellent risk adjusted performance. But the catch here is that no one could predict the exact timing and the strategy was not repeatable and it was pure hindsight. Rational investors cannot have profited systematically and this supports the image in the long run. So just to you know final big takeaway the GameStop short squeeze was a temporary market failure. semi- strong EMA broke down for a few weeks hurting social media and limits arbitrage drove a 30 398 abnormal return but no rationale systematic profit was possible and within months price stabilizer fundamentals so the bottom line is EMH is not dead it's just human in the short run so for investors this means to stick to strategies And for regulars, this means fix broker aification and payment for order flow, not short selling and markets are efficient enough just not during wars. Moving on to validate. So the objective here is to confirm that the implementation implementation is correct, robust interpretable. So check the code execution. We ran that through Google Collab and it was real and verified. Data integrity was is here shown below. It shows where we got it. The event study also was given all these numbers and you can just see how it aligns and matches up. For robustness, we use actual daily prices and we log returns adjusted prices and we statistical test confirms that ar is not zero. So logical explanation here all outputs match the event of events. So a massive C is in full lag volume search is hurting and price return is efficiency restored. So time to evolve and where we will optimize, reflect and extract actual insights. So does it all make sense? Yes. C being 398% the two 22.4 times volume and sharp is 12.78 matches real GME squeeze 3.42 is low.4 is currently actually correct. Semi strong EMH violated shortterm restored long-term consistency with theory. So better ways to improve. Some options are to useful Yahoo Finance data set instead of hardcoded or expand the event window maybe five for robustness. So these are all the metrics and their meaning here but we got to kind of move on and then this is just some more structural reflection and logical conclusions on where these numbers can be coming from. So markets are efficient in the long run but fragile in the short run psychology meets leverage. So some strategies to avoid chasing squeezes by fundamentals post crashes and regulate broker incentives not shorting. So to reflect we started with a simple typo 0.04 instead of 3.42 and end up unpacking one of the wildest events ever using the driver framework. I went from facting factchecking claim to providing semi- strong EMH that got crushed for a few weeks in January 22. The data showed plus positive 298% of Google returns and 22 times volume spikes and Reddit driving the train. All systematically bulletproof. But by 2025, prices back at $24 where fundamentals said it should be. Markets aren't perfect, but they're self-correcting. This process taught me that finance isn't about genius predictions. It's about method. Define the problem, map the truth, run clean code, how they number, and evolve influence and send amendment data. I've hit lots of back roads. The driver can't be grounded. Fix, test, improve, repeat. That's how you turn chaos into clarity. So, here's a key takeaway. EMH holds in the long run. But social media and retail firepower can break it short term. Don't chase squeezes. Don't fight the market. Build systems. Trust data. Let the process do the work. That's what this assignment gave me. Not just a grade, but a playbook for thinking like a real analyst. Okay. Thank you. I'm sorry that was also very long and I didn't go through everything cuz I ran out of time to submit this assignment and for AI help me with the coding even though you know the coding was a little all over the place. I had a hard time coding with this project. I would use a bunch of different AI sources and they would all give me different different numbers and different codes to use and different solutions. So I decided just to stick with one and try to work around it. So thank you for that AI and thank you for listening.",
  "video_url": "https://youtu.be/kKQndjBAIGY"
}