{
  "student_name": "Ryan Gilbert",
  "org_defined_id": "034365943",
  "username": "rgilber",
  "video_url": "https://youtu.be/ziVNnxQYMb0",
  "transcript": "Hi, this is Ryan Gilbert, and today I'm going to be demoing my investment analysis capstone project.\n\nThis project is not a presentation or a theoretical exercise. It's a working, interactive tool designed to help people make better financial decisions under uncertainty using AI. The goal is to show that I understand both finance and how to build practical AI-powered solutions that people would actually use.\n\nI want to start with the problem.\n\nMost people don't lose money because they can't calculate returns. They lose money because they underestimate downside risk, ignore opportunity cost, and make decisions based on incomplete or overly optimistic assumptions. Traditional tools focus heavily on upside, but in real finance, especially investing and capital allocation, the cost of being wrong matters just as much, if not more.\nSo the core question this tool answers is not \"What's the best investment?\"It's \"What does this decision cost me if I'm wrong?\"\n\nThat framing is intentional.\n\nThis tool is designed to evaluate investment and financial decisions by forcing structure, surfacing trade-offs, and quantifying downside in a way that's understandable and actionable.\n\nNow I'll briefly explain what the tool does at a high level.\n\nThe user starts by entering a snapshot of their current financial situation. This includes things like available cash, income, fixed expenses, existing investments, and basic risk tolerance. This information anchors the analysis in reality instead of generic advice.\n\nNext, the user proposes a specific action in plain English. For example, investing ten thousand dollars, buying an asset, reallocating a portfolio, or choosing between saving versus investing.\n\nFrom there, the AI does not immediately give advice. Instead, it reframes the decision into a structured financial choice. It identifies the primary action, the best alternative use of capital, and the option of doing nothing. This step is critical because most people never explicitly compare alternatives.\n\nOnce the decision is framed, the tool evaluates it across multiple financial dimensions.\n\nIt looks at liquidity impact, opportunity cost, risk exposure, time horizon, and flexibility. It also considers what happens in best-case, expected-case, and failure scenarios. The failure scenario is emphasized intentionally, because that's where poor decisions usually reveal themselves.\nAfter this analysis, the tool produces a clear recommendation. Not a vague \"it depends,\" but a definitive stance based on the inputs and assumptions provided. This recommendation is always paired with transparent reasoning, so the user can see exactly why the tool reached that conclusion.\n\nThe output is broken into four main sections.\n\nFirst, the recommendation. This states whether the proposed action makes sense right now given the user's financial context.\n\nSecond, the reasoning. This explains the decision in plain language, supported by numbers. It highlights things like changes in cash buffer, long-term opportunity cost, and how the decision affects financial resilience.\n\nThird, decision boundaries. This section explains what would need to change for the recommendation to flip. For example, a higher emergency fund, a lower price, a longer time horizon, or reduced risk. This helps users understand that decisions are conditional, not permanent.\n\nFourth, hidden risks. This section surfaces risks that people often ignore, such as illiquidity, behavioral risk, or second-order effects that aren't obvious at first glance.\n\nWhat makes this tool interactive is that the user can adjust inputs and immediately see how the recommendation changes. By changing assumptions, the user learns which variables actually matter and which ones don't.\n\nNow I want to emphasize why AI is essential here.\n\nA spreadsheet can calculate returns, but it can't interpret ambiguous decisions, challenge assumptions, or translate financial trade-offs into human language. The AI is used to reason through the decision, ask the right follow-up questions, and explain consequences in a way that aligns with how people actually think.\n\nAt the same time, this is not a black box. The user stays in control. The AI does not replace judgment. It enforces discipline.\n\nThis is important because the assignment explicitly requires building something that an AI alone could not do. The value comes from the combination of structured financial inputs, explicit trade-off analysis, and AI-driven reasoning layered on top.\n\nNow let me walk through a quick example of how someone would use the tool.\n\nSuppose a user is considering investing ten thousand dollars. They enter their financial snapshot, including current savings, income, expenses, and investment horizon. They then enter the proposed action.\n\nThe tool reframes the decision by comparing investing the ten thousand dollars against keeping it as liquidity or using it for an alternative purpose.\n\nIt evaluates how that investment affects short-term flexibility, long-term growth, and downside exposure. It calculates the opportunity cost of not investing, but it also calculates the cost of needing that cash if something goes wrong.\n\nThe recommendation might be to invest only a portion of the amount, or to delay until certain conditions are met. The tool explains why, in clear terms, and shows what would need to change for a full investment to make sense.\n\nThis approach encourages better financial behavior without pretending to predict the future.\n\nIn terms of validation, this tool was tested with real users. The main question I asked was whether the analysis changed their thinking or increased their confidence in a decision. In multiple cases, users said the downside framing made them reconsider assumptions they hadn't thought about before.\n\nThat's the outcome this tool is designed for.\n\nNow I want to briefly talk about scalability.\n\nThis tool could easily be extended to support more complex investment scenarios, different asset classes, or collaborative decision-making. It could be adapted for advisors, sales teams, or internal capital allocation decisions. The core framework stays the same: structured inputs, explicit trade-offs, and AI-driven reasoning.\n\nFinally, I want to reflect on what I learned building this.\n\nThe biggest takeaway is that AI is most powerful when it enforces clarity, not when it tries to replace human decision-making. In finance, the goal isn't perfect prediction. It's making decisions you can live with even when things don't go your way.\n\nThis project taught me how to design AI systems that support disciplined thinking, how to balance quantitative logic with qualitative reasoning, and how to build something simple, functional, and defensible.\n\nThat's what this capstone represents.\nThank you for watching the demo of my investment analysis tool."
}