{
  "student_name": "Kevin Sales",
  "org_defined_id": "033940131",
  "username": "kfsales",
  "video_url": "https://youtu.be/RIjgHUyoU-U?si=7uOXZselndcS_vZD",
  "transcript": "All right, good afternoon and welcome to my presentation. So this is my comprehensive valuation of the Panera bread for a potential KQR takeover and essentially I'll be using the driver framework to structure the entire analysis starting from define and discover to frame the deal represent and implement to uh present the evaluation models and validate to stress test the results and finally evolve and reflect on investment decision and learning. The goal is to answer one central question. What is a disciplined defensible bid range for KKR? And how does that differ from what a strategic buyer like Starbucks or McDonald's might play? So to keep this project organized and simple again we're going to be using driver framework. By now you should be very familiar with this um structure but to quickly go through it define is what is the problem we're trying to solve. Discover is what information assumptions do we need represent is how would this analysis for model be set up implement actually run the models and some actually run the numbers and scenarios validate make sure everything makes sense evolve think about the bigger picture and long-term impact and reflect look back and summarize what I learned and this just helps keep the story clear and logical so to begin with we enter the define stage so I narrow the problem to KQR's court decision KQR is considering a leveraged buyout of Panera Bread the seller has valuation expectations and for my public comps and prior restaurant deals. My job is to determine what Panera is worth, how that compares to um um how that compares to higher prices strategic buyers might justify through synergies and what KQR should actually bend, including an explicit bid range and a clear walkway price. So here I summarize the dealer numbers. So Panera overview, there's about 2.1,000 stores and this just indicates a strong national footprint. Their EBITDA is roughly around $900 million with a 15% margin. their net income roughly around $400 million. Digital sales 50% and expected to grow to roughly around 70% and industry PE is set at 22x and president EBITDA multiples of 12 to 15X and Chipotle is set to 35X and McDonald's is set to 25x PE. industry WACC is roughly around 9% and strategic buyers strategic biders that we're going to be comparing with is Starbucks and McDonald's. So in the discover stage is what drives Panera's value. So store expansion there's roughly 500 new locations in the next 5 years and their digital mix is rising to 70%. Dinner and catering outside early stage international rollout margin expansion potential and house strategic value synergies capital structure and 10% management rollover and restaurant sector WACC 9% and risk profile. So at the same time I will be keeping out on competitive pressure and execution risk and especially as the category is crowded and consumer prefaces can shift. So discover so this leads us to the working hypothesis that guide my modeling. So first a DCF anchored in a realistic operating assumptions should give a disciplined financial valuation range. Second trading comps and presidents will show how the market has historically priced similar restaurant assets. Third is strategic buyers can logically pay more because they can capture supply chain synergies, marketing scale and digital integration. So their fair value range should sit above KRS. My overarching hypothesis is that financial value clusters roughly the low to mid teens billions while strategic values could stretch into the high teens or even low 20s. So KQR must take that into consider consideration and state irr discipline and avoid paying for synergies it does not control. So the stakeholder map clarifies who cares about what KQR as a financial buyer is focused on IR downside protection and exit multiple. Sellers want a competitive auction and the highest possible price leveraging interest from strategics. management with a 10% rollover wants a price for the rewards past performance but less enough upside for the next chapter. Strategic buyers like Starbucks or McDonald's value synergies and may be willing to overpay relative to standalone fundamentals and ultimately customers are the ones that are driving and care about the experience, convenience and digital ease which feed back into the growth story and understanding these incentives is critical for designing a bid strategy and not just a spreadsheet. So in for represent I lay out the architect the architecture of the valuation engine. So the model has four main components. A DCF engine projecting revenues, margins, capex and working capital to derive free cash flow and terminal mileing. A multiples engine using PE and EV/ EBITDA trading comps to translate Panera's earnings into valuation range. a transition engine applying president deal multiples to Panera's EBIT TDA a strategic synergy model that layers in incremental EBIT TDA and higher multiples for strategics on the top of that I include scenario toggles base upside and downside and sensitivity tools around WACC terminal growth and synergy capture so that I can see not just a single point estimate but a full valuation range here I define three core scenarios in the base case I assume revenue growth in the mids to single to high single digits roughly 6.5% CAGR modest margin expansion from 15 to um roughly around 16% and digital mix ramping steadily in the upper case store growth and digital objectation and adoption move faster revenue growth pushes toward around 8 to 9% range and EBITDA margin climbs higher towards 17 or above driven by operating leverage and mix shift in the downside ID growth down to around 4% assume slower store openings and bacon margin pressure from competitive and competition or cost inflation. So these scenarios frame the valuation not as one fixed number but as a distribution of outcomes. So moving into the implement I start with the base case DTF. I model a 5-year operating forecast for revenue and free cash flow as well as EBITDA. I assume a 9% WACC consistent with the restaurant sector risk and a terminal growth rate in roughly about the 2 to 3% range reflecting mature stable growth slightly above inflation and free cash flow is defined as the equation that you see below and the Python model essentially is going to be parameterizing these assumptions uh which included WACC terminal growth store openings and margin trajectory and this is all so I can adjust them live during the video and immediately see the impact on enterprise value. I then extend the DCF to multiple scenario mode. The same structure used for upside and downside. I varied the topline growth, margin expansion and reinvestment intensity. And this creates three DCF ranges instead of just one number capturing the idea that valuation is inherently uncertain. And it also lets me see that the market based methods, comps, and precedents sit inside or outside the DCF range, which is an important cross check. Next, I turn to trending comps. I anchor Panera against this sector using PE and EV/ EBITDA. The industry trades around 22xp with high quality names like Chipotle Chipotle at about 35x PE and McDonald's is roughly around 25 XP and on an EV/ EBITDA basis restaurant peers typically cluster around 12 to 15 times and applying a sensitive um a sensitive and sensible range of revenue and EBITDA multiplies to Panera And essentially this gives a market implied valuation range of roughly 12 uh roughly 10 to roughly 10 to$16 billion and this will end up becoming one of the key points later on. So I then look at president's transactions, president transactions and what acquirers have actually paid in prior restaurant deals and the relevant deal generally falls between 12 to 15 times EBIT TDBA band as well but with somewhat tighter clustering around than the public comps. So applying these deal multiples to Panera's $900 million um of EBIT TDA yields a president-based valuation range of about 10.8 to$13.5 billion. And essentially this just tells us what real buyers have historically been willing to pay for similar cash flow profiles. And this is a great basis knowledge before we add any strategic synergy premium. So for strategic buyers, I build a simple synergy valuation overlay. I assume strategic acquirers can realize about 150 to $250 million of incremental EBITDA through shared supply chain and procurement marketing and brand skill and leveraging an existing international platform and digitally ordering integration across a larger ecosystem. And that essentially lives Panera's adjusted EBITDA into roughly the 1.205 to$ 1.15 billion range. So if strategics are willing to pay a richer multiple say 17 to 18 times EBITDA and that implies a strategic synergy valuation range of approximately 17.8 to 20.7 billion and this essentially creates a very clear gap between what KQR should pay as a financial buyer and what a strategic buyer could justify. So in validate I stress test the model rather than just blindly trusting these base assumptions. I run sensitivity analysis on three levers. WACC testing in 8 uh 0 to 10% range to see how cost capital shifts impact value. Terminal growth testing roughly around 2 to 3.5% to reflect different steadystate views. Synergy capture which this is ranging from roughly 0 to 10% of potential synergies especially relevant for strategic biders. The key takeaway is that terminal value typically accounts for 60 to 80% of the total DCF value. So small changes WACC or terminal growth can move valuation by billions and the sensitivity tables in charge help ensure that the recommended bid range sits in the robust portion of the distribution and not at the edge of overly optimistic assumptions. And finally, this brings us um into the football field or I like to say the synthesis and the final stage of evolve. So the DCF range spans roughly 11.8 to 16.5 billion depending on scenario and discount rate. Trading comps point to about 10.8 to 16.2 billion. Precedent transactions are tighter. These are roughly around 10.8 8 to 13.5 billion. And strategic synergy frame sits higher as expected at 17.8 to $20.7 billion. When I overlay when I overlay these and compare these, the financial buyer value clearly centers around 13 to 15 billion. While strategic value justifies something close to 18 to 21 billion. For KQR, the right answer is simply to not pay what a strategic would pay, but rather stay within the discipline financial value zone while recognizing the strategic's cap are upside. And based on strangulation, my recommended bid range for KQR is 13.5 to 14.5 billion with a hard walkway price at $15 billion. And the logic is simple. DCF and comps both converge around 14 billion dollars roughly which becomes the center of gravity for this whole operation. Presidents confirmed that pushing anything above 13.5 billion starts to look rich for a financial buyer. The synergy upside belongs to strategic Starbucks or McDonald's and KKR should not pay for benefits it does not control. And in negotiating terms, KKR can position its bid as full and fair based off fundamentals while acknowledging that if SUI wants to stretch to the high teams, KQR is prepared to walk away. And the balance protects um downside while still leaving room for attractive irr if the company executes on its growth and margin expansion plan. So to close, I'll briefly recap on what we went through and the driver process and what this assignment reinforced. So define and discover. This essentially forced me to slow down, clarify KQR's real decision and identify the specific drivers and stakeholders before touching the model. Represent made me design a clean architecture DCF comps precedents and synergies so that the model wasn't just a tangled spreadsheet. Implement in Python help parametize the key assumptions enabling fast and narrow and sensitivity analysis instead of static off um one-off calculations. validate reminded me that valuation is highly sensitive to WACCC terminal growth and synergy assumptions and that triangulating methods is more robust than relying on single approach and evolved um connected this case directly to real world private equity and strategic acquisition decisions. And overall this project just shows that that it is very beneficial to utilize this format. And ultimately it is important to pay attention what drives a deal and what actually creates value. So I hope you enjoy my presentation. Thank you."
}