{
  "student_name": "Michael Powell",
  "org_defined_id": "037117204",
  "username": "powel281",
  "email": "",
  "transcript": "Hi, this is my uh section six assignment 10 cost of capital analysis uh assignment and I'll get right into it. So our assignment is to evaluate Starbucks's proposed flagship roaster requires a 12 million upfront outlay and is expected to operate for 10 years. use the firm's 8.5 WACCC as a hurdle rate to determine whether the project creates value and to recommend an accept/reject decision supported by driver documentation. So uh we have a few project parameters which is uh our initial investment which is 12 million in building equipment and training uh which is depreciated using the straight line method over 10 years. And then we have care capital working capital which is $500,000 deployed at launch and it is recovered back in year 10. Our revenues in year one were 8 million in years uh 235 is 11 million and year 9 6 through 10 was 9 million. And then operating costs for uh cost of goods sold was 48% of revenue. Labor is $2.5 million. Rent and utilities $.8 million. Marketing is 300k in year one. and then 0.1 uh million thereafter. And we also have to include our taxes which is a 25% corporate rate uh terminal value 3 million at the end of year 10. And for this we're focusing on analysis on producing a transparent cash flow model uh core capital budgeting metric sensitivity test and an executive ready recommendation. And a few specific requirements are the financial analysis requirements is building that cash flow schedule including the revenue, operating cost, depreciation, tax shields, taxes and so on. Calculating the NPV IR uh writing sensitivity analysis and providing the recommendation and then we're going to be using Python for our code visualizing the cash flows at least once sensitivity to support the narrative. So that's where I'll kind of get into the uh driver framework and that is kind of defining and discovering our goal and what we have to uh define that goal. So our goal is to determine if the 12 million capital outlay yields a return higher than the 8.5 cost of capital. So I kind of made a table to kind of make it simpler to understand kind of what was going on. I'm not going to go through it all cuz um you kind of know what's going on here. But uh I have the revenue our time 10 years depreciation straight line. Uh but yeah so it's kind of what I have make it easier to understand what's currently going on and kind of before we write the code we need to define the mathematical relationships that will help us uh figure out our main goal which begins with operating cash flow. Um we will calculate the operating cash flow using the tander standard top- down approach which is a bit uh which is revenue cost minus cost of goods sold minus fixed cost minus depreciation. And then we're going to move on to the terminal cash flow for the final year of year 10. Um we recover the working capital assets and sell the assets at the end. And our book value at year 10 is $0. Since assets fully depreciated over 10 years, we'll get a salvage value of $3 million. Tax gain will uh you have that $3 million minus the book value times that 25% uh cap corporate tax get $750,000. Um and then that's where we'll get to our net terminal value. Uh 3 million minus the 750k plus the 500k for the NWC recovery. uh which then gets us to a $2.75 million. Um and yeah, um kind of we're going to be recommending on decisions. Um now we'll go on to the represent part which is mapping the complex cash outflow cash flow structure. So this is uh kind of just a short visualization of what my code will look like at the bottom of my uh code. Um but yeah, to kind of simplify it, kind of start at the $112 million from year one or year zero and as we head into year one, uh we start off with $1.2 million and then we kind of uh for years 2 through five, you get the $2.7 million. Then years 6 through9 is $1.8 million. And then our last year ends with $4.55 million. And that's kind of going back to our uh breaking down our revenue uh throughout the years that we would be having. Um just dividing it up because again we have cumulative of $1 million within these years. Um the visualization below that I'll kind of show illustrates the investment phase which is your beginning year or before year zero and the ramp up in maturity phase which is your years 1 through 10 and that term of recovery again which is your last year. So capital budgeting timeline, you have start year zero. You got your $12 million, your equipment, and then you have your working capital, which adds to that to make a 12.5 million total investment, which is what we see at the beginning. Uh what kind of that's why it's in the red right now, because that's what you invested. That's outflow. The red is your outflow. The green is your inflow. Um but as you see, years go on, you get that green, which is our inflow, which begins with year one, the $1.2 $2 million lower revenue, higher relative marketing. Then you get to years 2 through 5, $2.7 million annually. Um then uh that does accumulate to 11 million. And then you get years 6 through 10, 1.8 million annually gets you to $9 million. And then that terminal recovery which is what you um see at the asset sale which is your 3 million sale price minus your 750 mil uh,000 tax uh corporate tax gets you a net proceeds of $2.25 million. Um so now um let's see now we kind of move on to the uh working capital which is the 500k million or 500k recovery with a total terminal inflow of $2.75 million additionally and our NP that's how we were to kind of get into our NPV calculation. Um, our NPV, uh, we kind of had chat help me with this because again, that's kind of a lot going on right now, especially for me to do myself. So, NPV was 12.5 million plus 1.2 over the uh, the timing rate uh, that we'd be doing this for plus the summation um, for the uh, five and the time is two for that $2.7 million. And you take that same denominator. uh the denominator is the same uh all the way through. Just your time your exponents can be different. As you can see, we have two and then we have six in the second month. Um and that's but that's what we get uh for years 9 and then years five. Um and then when we take those you add the 1.8 million and the 1.275 million over the same denominator uh the 1.085 085 and the exponent would be 10 because that is your last year that is the entire uh your entire thing that you're taking over. Um and that's kind of where we will get into the implement part which is the code now. Um that's what I'll get into right here. Let's make sure it works. Yeah. Yeah, it's all good. Okay, so uh this stuff doesn't really matter right now, but this is my assumptions, which is the capital structure, the WACC, which we up at 8.5% with a corporate tax of 25%. And then again, we're doing 10 years, the investment of $12 million of capital 500K. And this is kind of just a breakdown to the revenue COGS, more than that. But um here's where I kind of get to the construction of the cash flow schedule. Um right here is kind of all the math the doing the revenue operating cash flows fixed cost marketing so on so on depreciation but further below is where I actually have the numbers. Um right here with the starting at zero again we have no revenue as you can see nothing really happens except for our capital expense and the change in NWC which gets us to that 125. Um, but that's when year one start with $8 million and year two we have $11 million throughout. Um, and then 67 6 to10 is $9 million. Um, but as you can see the tax is 500k and that goes down as we slowly uh give less revenue which kind of makes sense. That's you get taxed for le tax less for the uh less revenue they bring in. um in years 2 through five or if it was $2 million while 60 through10 it was $800,000. Um or the depreciation is the same because it is straight line. Um so that's going to stay the same. And then our fixed cost marketing that's just uh fixed cost that's always the same and marketing that's just based off uh fix as well. Um but as you can see our future co cash cash flow again started with -12 five um and then it got us up to positive 1.2 and then we had two uh 2.7 through years 2 through 5 and then we had 1.8 through years 6 through uh 9 and then 4.5 for to end it off. And as you can see our terminal cash flow is only in our last year of the $2.25 million. Um, and that's also another thing I want to bring up with the change in uh NWC. We start off with 500K, but at the end uh goes out within minus 500K because we no longer have that. Um, that's kind of where we get into the MPV part and I which is the MPV is 2.69 million uh with an IR 2.84 and this is like a payback of uh 28 years. Um yeah, it's kind of the code that I have. Um but yeah, this is the everything same things that I have and basically it's saying um if every ACC it was 10.5% which money is more tight uh we would accept we would recommend um long thing if it was a 6.5 we would accept too. Um but with revenue being 20% uh that risk to look at, we would reject in that scenario. Um and that's where we'll kind of get um into uh kind of the key features of the code I just showed you guys. Uh the clashbased structure, the capital budgeting model keeps uh assumptions, logic, and results organized. Um uh this makes it easier to kind of extend later. uh I'll show you how um robust metrics uh I implemented calculate uh metrics to compute MPV IRRa and uh the payback time and this kind of ensures that the code runs without requiring really any specialized uh financial uh uh necessaries and automated sensitivity. Um the rent sensitivity method automatically toggles the inputs. So like your revenue and weighted average cost of capital and requires the impact on the metrics outputting a clear comparison table. And one of the questions that you asked us to answer is does this demonstrate proper application um of capital budgeting principles to corporate investment decisions? And overall yes. This implementation demonstrates a highly uh uh highly professional and theoretical sound application of capital bching principles. Uh it moves beyond simple textbook math and into realm of dynamic financial modeling using uh used in corporate financial departments like FPNA. Um and now that is where we kind of get um uh kind of into the depreciation tax shield with this um we did calculate the tax on it and then added depreciation back and it's kind of accurately captures the tax benefit of depreciation without treating it as a cash outflow. That's kind of what you see my code. I'll bring that up. um where depreciation right here uh and the tax. So that's kind of the tax shield. Um it's kind of what I just talked about and your working capital that's just are included uh initial outflow which is the 500k at zero and then a recovery uh you get rid of that that recovery. Um many notices forget that recovery fees uh which does lower your NPV. And then we have a terminal uh value tax. Uh uh that's something I was going on over earlier in this and that uh knowing that is pretty critical in a scenario like this since the asset is fully depreciated as we see at the end of a straight line depreciation. Um the book value is equal to zero and this model does correctly uh taxes the entire salvage value. Um and now that's when we kind of get into our validate part which is uh cash flow verification are all relevance inflows and outflows included and yes the python model that I uh created does construct a UFC which is an unle free cash flow and this kind of ensures that no double counting on the missing items such as initial outlay uh the depreciation tax yield terminal value uh which I did talk just now. Um and then you also have growth phases which accurate models the ramp up year. Then your peak and your stabilization which phase is defined in the assignment. And that's where we move on to discount rate appropriateness. Does the 11% reflect project risk? Um the assignment specifies an 8.5% uh which reflects corporates cost of capital which is low risk stable cash flows. Harbor um 11% which is suggest a risk adjusted um and is it appropriate for 11%. for a flagship oastery which is likely riskier than a standard coffee shop um using a higher discount rate like 11% uh is a prudent stress test and um a validation check would be at 8.5% which is our base uh percent uh the project likely has a positive NPV 2D due to the strong midyear cash flows however at 11% the MPV will drop significantly and you If they sensitivity, robustness, how sensitive is the decision to key assumptions? Um, high sensitivity to uh revenue operating leverage. The model highlight the model highlights a critical risk factor of operating leverage. So like our fixed costs and revenue impact a 20% revenue drop does not reduce cost or 20% only your cost of goods sold will drop. meaning that the bottom line of EBT, EBIT takes a disproportionately uh large hit. And then uh strategic consistency does quant quantitative analysis aligned with strategic objectives and yeah the verdict would be yes with certain conditions though like if financials the project passes the hurdle rate of 8.5% in the base case generating uh shareholder value. Um and that's kind of when we'll get into our evolve part uh capital budgeting applications. So going over the different applications from the past sessions session 11 uh 10 11 12 um and then we'll get to 13. Um so the scope the micro level analyzing discrete investment with a start and end date. Our Starbucks is evaluating the single regary flagship and the evolution that we uh the way we could evolve is this is a foundational skill. So if you cannot correctly calculate the cash flows of one store, you cannot calculate the value of the whole company. And then that's where we get to strategic finance portfolios. Um that is kind of choosing between competing projects under budget constraints. So instead of yes or no on one roaster, the CFO might ask, \"We have $500 million in capital. Should we build 10 flagship roaries or 200 stranded drive-throughs?\" Um, the evolution um risk management, you balance steady projects, drive-throughs with low variance against high growth and high-risisk projects, groceries. So the reason why uh a roaster versus a normal Starbucks is completely different. like in downtown Chicago. They have a roaster. Um it's like multileveled. Uh they have a lot more on the menu. Um a lot more food act. It's like an actual place you can go eat. Uh do whatever. Um it's not like a normal drive-thru where it's cook and go on the go. like uh a roaster is like more of a uh I wouldn't I would call it more of like a uh it's not as it's more rare to see those. It's not as often you'd see those. So uh it's definitely a different experience and that's where we get to our business valuation session 12 um valuing the entire Starbucks corporation company is simply a collection of projects. So project ECF the life of 10 years um at terminal life valued is based on your liquidation in your corporate which is based on your perpetuity growth. Um kind of your connection to that is that the free cash flow you calculated to your tax to notepad to adding depreciation capex and NWC is the exact same method uh actually used by Wall Street analysts to set their share price target for uh Starbucks. and they kind of use it something like this for other stocks. And that's you get to integration of strategic analysis session 13 scope uh M&A real options um should Starbucks buy company like Tioana or build their own tea brand. Um and then real options your roster analysis was static. In reality, you have options. the option to abandon and close early if your three fails or the option to expand uh build five more if your three ends up to be great. And the evolution in this would be um numbers tell you what happened uh how to move forward where to where to look for uh strategies. Uh strategy tells you why it matters. Roshi might have been a break even MPV but a huge strategic value marketing halo just the investment just to find the investment and that's where we get into our last part of the reflect um investment decision-m insight. I have two of them that stuck out to me is that cash is reality that income is an opinion. Um, and the hurdle rate protects share value, shareholder value and the accounting profit uh for cash is reality that is an option. Net income is an option. The insight is that accounting profit your net income smooths out reality. It spends the cost it spreads the cost out of the building over 10 years. But in finance reality is harsh. you spend $12 million today. And the principle is that corporate decisions must be based on the timing of actual cash movements, not accounting conventions. And then your hurdle rate uh project protects shareholder value. Um in this scenario, we use 8.5% as our weighted average uh capital cost. This wasn't an arbitrary arbitrary number. It represents the return shareholders could get elsewhere for the same risk. The inside is that if the project's irra was 7%, it might still be profitable in absolute dollars, but it would be a value destroyer. Why is that? That's because shareholders could have just bought an index fund and earn that 8.5% instead. And kind of the principle behind that is that growth is not your goal. Value creation is your goal. So, companies should shrink uh rather than invest in projects that return less than their capital of cost cost of capital. And yeah, that's where I'll kind of end with the driver method. And um just kind of quick brief of this is uh the code. This is kind of the visualization of the cash flows. While this is more the numbers part as I kind of showed we started with -125 and ended with the 4.5 for that year. So this is per year. This isn't cumulative. Uh so that was 1.8 for one year and then 7th 8th 9th and so on. Um, and that's where this one will show the revenue uh for those years. Um, and yeah, I thought this was kind of a great way of uh showing the cash flow schedule years 0 through 10. Bro, broke it bro it down uh by everything that you were asking for. Um, and yeah, this is kind of the driver method, but yeah, this is awesome. My code just kind of showing how to calculate for appreciation, the tax tax logic. Um, as you can see, the tax calculations is the total expenses and then you have your COGS plus your fixed cost plus marketing and depreciation. And that's kind of what I went over earlier in the code or early in my uh doc. And that's kind of what the rest is like the marketing. It kind of takes your marking from year one plus year two and then blah blah bl uh multiplies it by the year minus one. And that's where I kind of fixed cost. Fixed cost is the same cost for all your years. uh your operating expenses that is your revenue times your costs percent um to get your cost of goods sold and your revenue that was kind of given to us for all the years one and then years 2 through five and then 60 and then yeah that was pretty much my entire code um and yeah I think that's about it um yeah thank you for listening",
  "video_url": "https://www.youtube.com/watch?v=9bpK8Fauoos"
}