{
  "student_name": "Luke Hardymon",
  "org_defined_id": "035866355",
  "username": "lhardymo",
  "email": "",
  "transcript": "0:00:02.240,0:00:05.920 So for my session 8 assignment, we are looking at the efficient market hypothesis 0:00:05.920,0:00:11.680 um specifically with the GameStop situation. So first we have the first critical step of 0:00:11.680,0:00:22.560 um seeing the price of GameStop stock at in August 2020. Um and we can see here 0:00:22.560,0:00:28.480 um we're supposed to verify that trade at 4 cents. Um, however, I pulled in from Yahoo Finance 0:00:28.480,0:00:36.800 um the stock price and it was actually um right here at $1.35. Um, so it was not at 4 cents. So, 0:00:36.800,0:00:43.920 just verifying that. Um, so first in my define and discover stage, I want to um look at all the 0:00:43.920,0:00:48.160 different parts of the efficient market hypothesis and relationship at GameStop. I want to look at 0:00:48.160,0:00:52.480 the behavior biases and market anomalies. And I also want to look at informationational advantages 0:00:52.480,0:00:57.760 really quick. Um so first you have sort of the weak portion of the efficient market hypothesis 0:00:57.760,0:01:04.960 um saying that um all past historical data is already kind of like set into the price. It's 0:01:04.960,0:01:11.200 basically already accounted for in the price of stock. Um and with this um there is no technical 0:01:11.200,0:01:15.520 analysis you can do um because everything's already accounted for. Um, and so it's kind 0:01:15.520,0:01:22.160 of like what they call a random walk um of this stock could go up, down, like we don't know. Um, 0:01:22.160,0:01:27.040 and there's nothing you can really do to change it. So obviously with the GameStop situation 0:01:27.040,0:01:34.000 um this was kind of like a failure um at this part because it wasn't a random walk, right? Like there 0:01:34.000,0:01:39.920 was a bunch of historical data and then all of a sudden um the stock dramatically changed. Um and 0:01:39.920,0:01:44.880 so obviously this was a failure. Um then there's the semi- strong. Um so basically you can't do 0:01:44.880,0:01:49.760 any technical or fundamental analysis. Um and this is basically saying that all information 0:01:49.760,0:01:56.160 or all public information um is already accounted for. So just interest rates and trading volume and 0:01:56.160,0:01:59.520 things like that that's already accounted for in the price. And so basically it's also kind 0:01:59.520,0:02:06.800 of this aspect of no free lunch um saying that you can't expect higher returns without higher 0:02:06.800,0:02:13.760 risk basically. Um and then finally there's the strong portion of this efficient mark hypothesis 0:02:13.760,0:02:18.000 um saying that not even insider training so basically saying that private information 0:02:18.000,0:02:22.800 um is actually already accounted for as well and so you can't even like inside trade and like try 0:02:22.800,0:02:31.120 to get ahead on something u because it's already accounted for. Um and so next talking about 0:02:31.120,0:02:34.960 the behavior biases specifically relates to the GameStop situation. So basically there was hurting 0:02:34.960,0:02:39.680 behavior and social media influence. Um, and I I kind of look at them sort of very intertwined. Um, 0:02:39.680,0:02:45.360 I think one was one caused the other. Um, basically hurting behavior. Everyone saw 0:02:45.360,0:02:50.080 the stock going up. Um, and sort of had the belief kind of from social media that everyone 0:02:50.080,0:02:54.720 was holding on to it. Kind of like the time with hands sort of reference. And so that everyone was 0:02:54.720,0:02:57.520 going to hold the stock and it was just going to go up up and up. And obviously that didn't happen. 0:02:57.520,0:03:03.040 It was squeezed and the stock came crashing down and a lot of people got burnt. Um, and then also 0:03:03.040,0:03:08.880 talking aboutformational advantages. Um, basically if you have anformational advantage in public 0:03:08.880,0:03:13.520 information, this contradicts the semi-strong portion because like semi-strong believes that 0:03:13.520,0:03:18.720 all public information has been accounted for. Um, and then if you have an private informationational 0:03:18.720,0:03:22.480 advantage that contradicts the strong portion because that's basically just like being able 0:03:22.480,0:03:28.560 to insider trade. And so basically this next step um I'm and I represent stage I want to show the 0:03:28.560,0:03:33.920 market return the stock return normal return and abnormal returns um from like kind of the time 0:03:33.920,0:03:42.000 period of the squeeze happening. Um and basically this is going to just show us like mathematically 0:03:42.000,0:03:49.360 how the efficient market hypothesis kind of broke down and how sort of um these like behavioral 0:03:49.360,0:03:55.920 biases and market anomalies sort of happened. And so basically, um, it pulled in all the prices and 0:03:55.920,0:04:01.360 everything from Yahoo Finance. It kind of used the CAPM model, um, to calculate everything. And 0:04:01.360,0:04:07.600 basically, if I just scroll all the way down here, um, you're going to see stock actual returns, 0:04:07.600,0:04:12.880 S&P market returns. So, they just pulled this in, no equations necessary. And then it used 0:04:12.880,0:04:21.520 expected returns um using the equation of well so the abnormal returns that is calculated from 0:04:21.520,0:04:29.200 actual returns minus expected returns um and then expected returns uses a another equation. It's 0:04:29.200,0:04:38.640 this one right here. Um it's that CAPM uh equation um using that beta. And so you can see here um 0:04:38.640,0:04:45.360 specifically with expected returns um looking at this past data right expected returns and abnormal 0:04:45.360,0:04:51.440 returns with the efficient mark hypothesis especially like that weak version should 0:04:51.440,0:04:56.320 pretty much be equal. There shouldn't be anything abnormal um because everything should already be 0:04:56.320,0:05:04.720 accounted for. But you can see here there are some crazy abnormal returns right 92% 170% like 0:05:06.000,0:05:10.720 137% like crazy crazy amounts. And so you can obviously see here like this was a breakdown 0:05:10.720,0:05:18.480 in the efficient market hypothesis and um this was a massive market anomaly and weird behavior 0:05:18.480,0:05:22.640 specifically like that hurting behavior I was talked about kind of generated these numbers. 0:05:22.640,0:05:30.320 Um so that's kind of like a mathematical way of looking at it. And then um going next into kind 0:05:30.320,0:05:34.480 of validate, I specifically kind of wanted to look at like predictability patterns and 0:05:34.480,0:05:46.880 systematic profit opportunities. Um and so I kind of used the prompt here. Um let me get to it. 0:05:46.880,0:05:54.080 Not that um 0:06:02.160,0:06:07.760 So, I kind of asked is there any specific like patterns or opportunities for this situation? Um, 0:06:07.760,0:06:16.080 and this basically said it was kind of predictable in that it used I'll go back here used sort of 0:06:16.080,0:06:20.640 high short interest as a signal. And so it was basically talking about how there was interest 0:06:20.640,0:06:27.600 over 100% of its already like of its stocks. And so um this allowed investors with high capital 0:06:27.600,0:06:35.600 allocation um and high risk tolerance to sort of short sell all this um and also the social media 0:06:35.600,0:06:44.560 as well. And then um there was systematic profit opportunities um and so like again sort of exante 0:06:44.560,0:06:49.360 um allowing investors with sufficient capital high risk tolerance to sort of create this short 0:06:49.360,0:06:55.120 squeeze and it actually became like a mathematical certainty um and like this was a bet on like just 0:06:55.120,0:06:59.520 pure market mechanisms and not the stock's fundamentals and that's going to we're kind of 0:06:59.520,0:07:05.360 get into that more later. Um, and then there's obviously the still the arbitrage limits. Um, 0:07:05.360,0:07:08.960 and that's there still isn't free lunch even though it seems like a certainty. Um, 0:07:08.960,0:07:14.720 and there's still extreme high risk and you can ask the people that bought probably when it was 0:07:14.720,0:07:19.280 going really really high and then kind of kept it and they got really badly burned um by the people 0:07:19.280,0:07:25.200 that just immediately sold. Um, and then going to evolve, I looked at two specific things I kind of 0:07:25.200,0:07:32.160 wanted to look more at. um talking specifically about the mark hypothesis versus sort of behavior 0:07:32.160,0:07:35.600 um plus market microstructure issues. And so this kind of bleeds into what I was talking 0:07:35.600,0:07:42.640 about earlier. Um and basically EMH is not perfect because it's assuming that all people 0:07:42.640,0:07:48.240 are rational perfectly rational investors which we're humans. We make states and so we're not. 0:07:48.240,0:07:54.960 Um and basically these two things of EMH and behavior financial analysis or BFA should kind 0:07:54.960,0:08:00.640 of be used together to explain markets. Um I think EMH should be used longterm and BFA should be used 0:08:00.640,0:08:06.240 short-term to kind of explain anomalies and weird behaviors and things like that. And then secondly, 0:08:06.240,0:08:10.240 market microructure issues. So obviously the market is not perfect and that's why this 0:08:10.240,0:08:14.560 thing like GameStop kind of happened. um sort of like I said before there was these short 0:08:14.560,0:08:19.040 interest over 100% of his available shares which kind of set the stage for a squeeze 0:08:19.040,0:08:25.280 um and all of this massive amounts of capital and everything um kind of intervened in the market's 0:08:25.280,0:08:31.680 price setting mechanism um yeah and then kind of reflecting kind of just talking about what 0:08:31.680,0:08:43.360 I learned so exante versus expost investing um basically exante is kind of looking at the past 0:08:43.360,0:08:48.400 um or looking before and making decisions. And then X post investing is kind of 0:08:48.400,0:09:01.760 um looking at the past to sort of set up like future models um for for for trading. Um 0:09:01.760,0:09:08.320 and then um also active versus passive management implications. Um when there's active management 0:09:08.320,0:09:13.200 implications, there's obviously going to be more risk involved. um and more market anomalies and 0:09:13.200,0:09:17.440 things like that where passive management implications. Um and this more agrees with 0:09:17.440,0:09:22.080 kind of the efficient market hypothesis of that you should kind of just stay back and 0:09:22.080,0:09:26.480 kind of don't touch it because it's impossible to time the market is kind of the the ground rule of 0:09:26.480,0:09:31.040 the efficient market hypothesis. Um and then also market efficiency policy implications. So 0:09:31.040,0:09:36.240 the biggest thing that kind of comes to mind is like insider trading laws. Um, so this is where 0:09:36.240,0:09:41.600 kind of the EMH is kind of strengthened because there's actually policies that are sort of you 0:09:41.600,0:09:47.920 can't use private information, you can't use sort of public information um to like get an advantage, 0:09:47.920,0:09:50.720 I guess. And so I thought that was really interesting that kind of strengthens kind 0:09:50.720,0:09:55.120 of the EMH like I said before. Um, so yeah, this is basically my session 8 assignment. Thank you.",
  "video_url": "youtube.com/watch?v=37YmXmGnbRA"
}