{
  "student_name": "Hillary Tobias",
  "org_defined_id": "034075524",
  "username": "htobias",
  "email": "",
  "transcript": "Hi, my name is Hillary Tobias, and this is my video for the Session 10 Assignment. I'll start with the Define and Discover stage of the DRIVER framework. My objective for this assignment is to use core capital budgeting metrics to provide an accept or reject decision for Starbucks' proposed flagship roastery. The scope and horizon for this scenario is that Starbucks' roastery is expected to operate for 10 years. The constraints for this assignment are that I am limited to the data that was provided, but I don't think that should be an issue. My success metric for this assignment will be successfully calculating the core capital budgeting metrics and then using those to provide a recommendation. And some of the capital budgeting metrics I will calculate include net present value, internal rate of return, and profitability index, along with some other ones. The benchmark for this assignment will be using the base case scenario to compare different sensitivity analysis scenarios to. Continuing with the Define and Discover stage of the DRIVER framework, I'll now go over the data inventory that was provided for this assignment. I was told that the initial investment will be $12 million, and that will include the building, equipment, and training, and this investment will be depreciated using the straight-line method over 10 years. Starbucks' weighted average cost of capital is 8.5%. I was told that this project will require a half a million dollars of working capital to be deployed at the launch of the project, and that amount will be recovered in year 10. As far as revenues go for this project, it is projected that it will bring in $8 million of revenue in year 1, $11 million in years 2 through 5, and $9 million of revenue in years 6 through 10. Continuing with the data inventory, as far as operating costs go, I was told that cost of goods sold will be 40% of revenue, labor will cost $2.5 million each year, rent and utilities will be $0.8 million each year, and marketing will be $0.3 million in year 1 and then $0.1 million the remaining nine years. Starbucks' corporate tax rate is 25%, and I was told that the terminal value at year 10 will be $3 million. Now I'll move on to the Represent stage of the DRIVER framework. And in this stage, I came up with four steps to help me complete this analysis. Step one will be to visualize the cash flows for years 0 through 10, and I will do this using my Python code. In those cash flows, I will include revenue, operating costs, depreciation tax shields, taxes, working capital changes, and terminal value. Step two will be to calculate the core capital budgeting metrics, and I will also use Python to do this. The metrics that I will calculate are net present value, internal rate of return, simple payback period, discounted payback period, and profitability index. I also plan to parameterize my assumptions so that revenue, cost, and discount rate inputs can be updated easily. Step three will be to perform sensitivity analysis, also using my Python code. The sensitivity scenarios that I will test will be if revenue is reduced by 20%, and then if the weighted average cost of capital is increased or decreased by 2%. I will then summarize the impact of these changes on the capital budgeting metrics, and I will also show a graph of how sensitive net present value is to changes in weighted average cost of capital. Finally, step four of my plan will be to provide the accept or reject decision. I will provide this decision by using the financial metrics that I calculated and also considering the strategic fit, brand implications, and risks of this project. Now I'll move on to the Implement stage of the DRIVER framework. In order to implement my plan, I provided Google Gemini with my objective for the assignment, all of the data that was provided in the data inventory, and also the first three steps of my plan from the Represent stage because those are the three steps that I wanted to use Python code for. I asked Google Gemini for any suggestions to my plan, and it gave me some refined logic. And then after that, I asked Gemini to write simple Python code that would execute my plan. Now I'll switch over to Google Colab to show you the code that I ended up with. The first thing the code does is import the necessary libraries it needs for this analysis. And then it sets up the parameters and assumptions for this case. So it starts with the weighted average cost of capital, which was 8.5%, the tax rate, which is 25%, the number of years for the project, which is 10, the initial investment, which was $12 million, the initial outlay of working capital, which was $500,000, and the gross terminal value, which was $3 million. The next thing the code does is define the core function that it will use to run this analysis, and that function is called, \"Evaluate Project.\" The first thing that the code does is build the timeline, so it builds a range of the number of years of the project. The next thing the code does is construct the revenue schedule. For the initial scenario, that would be $0 of revenue in year 0, and then $8 million of revenue in year 1, $11 million of revenue in the next four years, and then $9 million of revenue in the last five years. Next, the code sets up the operating expenses. It starts with cost of goods sold, which is 40% of revenue. So, in order to find the amount for cost of goods sold, it takes the amount of revenue and multiplies it by 0.4. Then, it sets up the amount for labor, which was $2.5 million each year. Next, it does rent and utilities, which was $800,000 each year. And finally, it sets up the marketing costs, which will be $0 in year 0, $300,000 in year 1, and then $100,000 in the remaining 9 years. The next section of code is where it calculates the amount of annual depreciation. It finds this by taking the initial investment of $12 million and dividing that by the total years for the project, which was 10. So that will result in annual depreciation of $1.2 million. Next, the code moves on to calculating earnings before interest and taxes, and then also net operating profit after taxes. The first number that it finds is the total for the operating expenses, and in order to find that, it adds the cost of goods sold, the labor cost, rent and utilities, marketing, and the depreciation expense. And next, it finds earnings before interest and taxes, which is also known as operating profit. And it finds that by taking revenue and then subtracting the total operating expenses. The next number that it calculates is the amount of taxes for each year, and it finds that by multiplying the operating profit by the tax rate. And then the last number that it calculates in this section is the net operating profit after taxes, and in order to find that, it takes the operating profit and subtracts the tax amount. The next thing the code does is build the free cash flows, and the first thing it does in this section is add back depreciation. Depreciation was deducted from earnings when calculating the tax amount because depreciation is a tax-deductible expense and therefore it reduces the amount of tax a company has to pay. And this concept is known as the depreciation tax shield. But since depreciation was deducted from earnings, we then have to add it back when considering the cash flows because it's a non-cash expense. So, after adding back depreciation, then the code sets up the capital expenditure, which will be the initial $12 million investment in year 0. The next thing the code sets up is the changes in working capital. So, in year 0, that will be a negative cash outflow of $500,000. And then in year 10, it will recover that working capital, so that will be a positive cash flow of $500,000. And then the next thing the code handles is the terminal value. And so, I was given the gross amount of the terminal value, but that will be taxable. So in order to find the amount of tax on that gain, the code multiplies the gross amount of the terminal value by the tax rate. And then in order to find the net terminal value, it takes the gross terminal value and subtracts the amount of tax. And then that gives it the net terminal value. And then the next thing the code does is calculate the total free cash flow for each year. And so in order to do this, it takes the net operating profit after taxes, adds the depreciation add back, adds any capital expenditures, which will be the initial $12 million cash outlay in year 0, adds any changes in working capital, which will be in year 0 and year 10, and adds the net terminal value of the investment, which will occur in year 10. Next, the code moves on to calculating the capital budgeting metrics. The first one it calculates is net present value. So that finds the present value of all of the cash flows related to this investment and it uses the weighted average cost of capital as the discount rate. And the next number the code finds is the internal rate of return. And then after that, the code moves on to calculating the simple payback period. And so it finds the payback period by finding the cumulative cash flows. And then it finds the last year that the cash flows are negative, and then it finds the fraction of the next year that it takes to recover the initial cost of the investment. And so then it takes whatever number the last negative year was and adds the fraction of the next year to find the total for the payback period. And then the next thing the code calculates is the discounted payback period. In order to find this, it finds the present value of each specific year's cash flow using the weighted average cost of capital as the discount rate. And then it uses the same logic that it used for the simple payback period of finding cumulative cash flows, and then finding the last negative year and adding the fraction of the next year it takes to recover the investment. Next, the code moves on to calculating profitability index. So, it identifies what the total initial cash outflow of this project was, which would be the $12 million capital expenditure plus the $500,000 of working capital that would be needed in year zero. And then it calculates the present value of cash flows from year 1 onwards. And then it calculates the profitability index by taking the present value of the future cash flows and dividing that by the initial cash outlay. The next section of code just tells you what the output will display. So it will tell you which scenario it is running the function for and then it will tell you the NPV, IRR, simple payback, discounted payback, profitability index, and all of those metrics that it calculated. So the next section of code is where it gets into calling that function. It starts by calling the function for the base case scenario and all of the original facts that we were given. And then it formats that scenario and prints out the calculation of the cash flows for each year. And then it also prints out all of the metrics that were calculated for that scenario. And it also will provide an accept or reject decision. And this code's decision is based simply on if NPV is positive or negative, which I will also use whenever I give my recommendation, but I will use the other metrics as well. Next, the code moves on to performing the sensitivity analysis. In order to do this, it runs the \"Evaluate Project\" function for four different scenarios. It starts with the base case scenario to use as a benchmark. Then it runs the function as if revenue decreased by 20%. Next, it runs it as if the weighted average cost of capital was 10.5%. And finally, it runs that function as if the weighted average cost of capital was 6.5%. And then it has code that will display the results from that sensitivity analysis. And then the next section of code sets up the two visualizations that it will provide. The first graph that it will show will be a waterfall chart of the yearly cash flows, so you can see if they're negative or positive. And the second visualization that it will show is the sensitivity of the net present value to changes in the weighted average cost of capital. So now I'll run this code so you can see how it works. The first thing in the output is the display of the yearly cash flows. So you can see it has years 0 through 10 here and it shows the amount of revenue, operating income, taxes, net operating profit after taxes, and free cash flow for each year. And then below that, it shows all of the metrics it calculated. It found the net present value to be about $2.7 million. The internal rate of return is 12.84%. The simple payback period is 5.28 years. The discounted payback period is 8.21 years. The profitability index is 1.22, and based on the positive net present value, it recommends accepting this project. The next section of output shows the results of the sensitivity analysis. This first line shows the base case scenario, and it shows the net present value of the base case scenario, the internal rate of return, the simple payback period, discounted payback period, and profitability index. And then it also shows all of those metrics for the decrease in revenue and the increase and decrease in cost of capital. And as you can see, whenever revenue is decreased by 20%, then the net present value became negative $3 million. The internal rate of return became 3.13%. Simple payback period became 9.3 years. It actually would not recover its initial investment based on the discounted payback period, and the profitability index was only 0.75. And then for the two different costs of capital, the net present value was still positive. The internal rate of return was the same. The simple payback period was the same. The discounted payback period was slightly different, and the profitability index was still above one for both of those. Next is the visualization of the free cash flows for the base case scenario. And it shows the large initial cash out outflow in year 0 of $12.5 million. And then after that you can see the various positive cash flows in years 1 through 10, and they vary based on the amount of revenue for each year. And then also year 10 is greater because that includes the recovery of the working capital and the terminal value. And lastly is the graph of the sensitivity of the net present value to changes in cost of capital. The cost of capital is used as the discount rate in the calculation of net present value. And the cost of capital is on the x-axis here and net present value in millions of dollars is on the y-axis, and this blue line shows the relationship between the two. So, as you can see, whenever the cost of capital is lower, net present value is higher. And then as cost of capital increases, net present value decreases. And this red line shows the break-even point where net present value equals zero. And this green line here shows the internal rate of return, which was 12.8%. And as you can see, whenever the weighted average cost of capital is equal to the internal rate of return at 12.8%, that is where net present value equals zero. Now I will go back to my slides and move on to the Validation stage of the DRIVER framework. In order to validate the results from my code, I created an Excel worksheet to check all of the calculations. So, I mapped out all the cash flows and then I used Excel's net present value and internal rate of return functions to find those numbers. I performed this verification for the base case scenario and all of the sensitivity analysis scenarios. Whenever I was checking all the numbers, I found that the code was calculating the profitability index incorrectly, so I corrected that. And then I also found that the code did not initially include a calculation of the discounted payback period. It was only doing the simple payback period, so I added in the calculation of discounted payback period. And other than that, all of my numbers were correct, so that was good. And I will show you my worksheet here. So, you can see here are all the cash flows for the base case scenario, and over here are where I calculated the capital budgeting metrics. And all these numbers are the same that my code gave me. And then here are the cash flows and the metrics for the decreased revenue scenario. Here are the numbers for the increased cost of capital scenario. And finally, here are the numbers for the decreased cost of capital scenario. Now, I'll move on to the Evolve stage of the DRIVER framework, and in this stage, I will discuss the sensitivity analysis a little bit further. The sensitivity analysis from this case showed us how different assumptions might change the ultimate investment decision, and it also highlights how important it is to have good estimates. As we saw in this case, if revenue falls short of the original estimates by 20%, the project will have a negative net present value, which means it will destroy value to the firm rather than create value for the firm. So, in that case, you would not want to accept this project. And we also saw that the weighted average cost of capital changes still both resulted in positive net present values, and internal rate of returns that were greater than both of the cost of capitals, and also profitability indexes that were greater than one. So, in both of those cases, we would still accept this project. And sensitivity analysis is important to any capital budgeting decision, and it can be really useful for analyzing different cases such as a best-case and worst-case scenario and determining if you should accept or reject a large investment project. Now I'll move on to the Reflect stage of the DRIVER framework, and in this stage, I will revisit all of the capital budgeting metrics that I calculated, and I will also discuss some other strategic implications of this investment, and finally, I will provide my ultimate recommendation to either accept or reject this project. Starting with net present value, that is the total value a project will add to a company in today's dollars. A positive net present value creates value for the firm, but a negative net present value destroys value for the firm. And the NPV rule is that you should accept the project if net present value is greater than zero, and you should reject the project if net present value is less than zero. In our case, the net present value was about $2.7 million, which was positive, so based on that, I would recommend accepting this project. The next metric I found was internal rate of return, and that is the expected annual percentage return of the project, and it is also the discount rate that would force the net present value to equal zero. The internal rate of return rule is that you should accept the project if IRR is greater than the cost of capital, but you should reject the project if IRR is less than the cost of capital. In our case, the internal rate of return was 12.84%, which was greater than the cost of capital which was 8.5%. So based on the internal rate of return, I would also recommend accepting this project. The next metric that I calculated was payback period, which measures the time it takes for an investment to generate enough cash flow to recover its initial investment. Shorter payback periods are preferred because they suggest lower risk and greater potential returns, whereas longer payback periods indicate higher risks associated with the project. The payback period rule is that you should accept the project if the payback period is shorter than the company's specific cut-off target. For this assignment, I was not given a specific cut-off target for Starbucks, but I found that their simple payback period was 5.28 years and their discounted payback period was 8.21 years. So, if these amounts of time are shorter than the company's cut-off target, then it should accept this project. The next metric I calculated was profitability index, which compares the value a project is expected to create to the cost of the project. If a profitability index is greater than one, it indicates that a project is expected to generate more value than its cost, but if a profitability index is less than one, that indicates that the project is not expected to cover its initial investment. So, the profitability index rule is that you should accept the project if the index is greater than one, but you should reject the project if the index is less than one. In our case the profitability index was 1.22, which is greater than one, so I would recommend accepting the project based on that. Another important note on profitability index is that it is very useful for ranking projects. So if the company has several capital budgeting decisions that it's trying to make and it can only invest in one, then it should invest in the one with the highest profitability index because that is the one that will create the most value relative to its cost. Next, I'll go over the sensitivity analysis again. Once again, we saw that the project should be rejected if the revenues are 20% lower than the original estimates because this resulted in a negative net present value, an internal rate of return lower than the cost of capital, it would not recover its investment using the discounted payback period method, and its profitability index was less than one. I would still accept the project even if the cost of capital was 2% higher or lower because all of these metrics were still good and pass the test to accept the project. Also, for the sensitivity analysis, based on the graph that was generated by the code, we can see that if the cost of capital were to increase beyond the internal rate of return of 12.84%, that is when net present value would become negative, and then is when you would reject the project. So as long as the cost of capital is less than 12.84%, then it would be good to accept this project. Now I'll move on to some strategic implications of this investment. As far as a strategic fit goes, this flagship roastery is a very specific, premium type of retail location. And it's not only a retail location, but it's also branded as an experience of seeing the whole manufacturing process of the coffee. And these roasteries are designed to elevate the brand image and make the brand appear as more of a \"premium\" company. These roasteries are typically very large establishments in premium locations, and these roasteries also charge significantly higher prices than standard Starbucks stores. And customers spend more per visit when they visit these flagship roasteries compared to a standard Starbucks. Some implications of this investment for the overall brand of Starbucks are that it would elevate overall brand equity. It would also enable Starbucks to charge more in its other stores since the brand is seen as being a \"premium\" company. And this roastery could also be used as a testing ground for new products before Starbucks rolls those products out worldwide, which could be very beneficial for the company. And lastly, this investment also creates a competitive advantage for Starbucks because it differentiates it from its competitors who don't have these premium stores. Some key risks related to this investment are, first of all, the very large capital expenditure. We saw that it would require a $12.5 million initial cash outlay from the beginning, and then in addition to that capital expenditure, these roasteries also tend to have very high operating expenses due to the large staff that is needed, the specialized master roasters that are needed, and the expenses of operating in a prime location. And another risk is that this premium roastery may compete with the standard Starbucks that are nearby, and the premium roastery might just eat into the profits of the other surrounding Starbucks, which would not be good. So, my final decision recommendation is to accept this investment project. I recommend accepting the project because all of the core capital budgeting metrics for the base case scenario resulted in an acceptance decision. However, it is important to point out that the company should be mindful of its estimates, and it should be very confident in its projections of revenue, because the sensitivity analysis showed that whenever revenue fell by 20% then the project turned into destroying value for the firm, and in that case, it should reject this project. So based on that, I would recommend that Starbucks make sure they are very confident that they will achieve at least the amount of revenue that was given in the base case scenario. And not only do I recommend investing in this roastery because of the financial metrics, but I also think it will be a good strategic move for Starbucks. The roastery will improve the overall brand equity of Starbucks, which will help the company become known as a premium producer of coffee products and it will separate it from its competitors. Thanks!",
  "video_url": "https://youtu.be/CFyORC-4o-c"
}