{
  "student_name": "Jake Patterson",
  "org_defined_id": "037362505",
  "username": "patte269",
  "email": "",
  "transcript": "Slide 1 — Title \"Hi everyone, my name is Jake Patterson, and this presentation covers my full Cost of Capital Analysis for Starbucks' proposed flagship roastery. I applied the DRIVER analytical framework and Starbucks' 8.5% WACC to determine if this $12 million, 10-year project creates value. I'll walk through the business question, the modeling approach, the financial results, the sensitivity tests, and finally my recommendation.\" Slide 2 — DRIVER: Define & Discover \"In the Define & Discover stage, the goal was to clarify the key decision: Should Starbucks invest in this roastery based on whether the NPV at an 8.5% WACC is positive? I gathered all required inputs—revenues across the 10-year life, cost structure, working capital needs, tax rate, depreciation, and terminal value. I also verified that we only consider incremental cash flows, since that's the foundation of capital budgeting.\" Slide 3 — DRIVER: Represent \"Next, in the Represent stage, I designed the model structure. I mapped out a full Year 0–10 timeline with the initial investment, annual operating cash flows, depreciation, taxes, and both working-capital recovery and after-tax terminal value in Year 10. I selected the OCF formula based on tax shields and structured the model so all assumptions—revenue changes, cost adjustments, and WACC shifts—could be easily parameterized.\" Slide 4 — DRIVER: Implement \"In the Implement stage, I wrote a Python function that automatically builds all yearly cash flows. The model uses a depreciation-tax-shield structure, computes OCF each year, and adds the salvage value and working capital recovery in the terminal year. The code then calculates NPV, IRR, simple payback, discounted payback, and profitability index. Lastly, I included automated scenario analysis for revenue shocks and WACC changes.\" Slide 5 — Base-Case Cash Flow Chart \"Here is the base-case cash-flow profile. We begin with a $12 million capex plus $500,000 of working capital at Year 0. Operating cash flows range between around $1.2 million in Year 1 and about $2.7 million in the middle years, then drop slightly as revenues decline. In Year 10, cash flow increases due to the salvage value and working capital recovery. This pattern aligns with Starbucks' typical store lifecycle, where early years have higher marketing and lower volume.\" Slide 6 — Base-Case Metrics \"In the base case, the NPV at an 8.5% WACC is approximately $2.69 million, which is positive. The IRR is 12.84%, safely above the required return. The simple payback period is roughly 5.3 years, and the discounted payback is about 8.2 years, both reasonable for a retail flagship project. The profitability index of 1.22 also signals that the project creates value per dollar invested. Overall, the financials under expected conditions support accepting the project.\" Slide 7 — Revenue –20% Sensitivity \"Next, I tested a downside scenario where revenues fall 20%. This has a massive impact on returns. NPV becomes –$3.08 million, which is value-destroying, and the IRR drops to around 3.1%, well below WACC. The simple payback stretches past 9 years, and the discounted payback does not occur within the project's 10-year horizon. This reveals that the project is highly sensitive to demand risk, and Starbucks must be confident in expected traffic and pricing power.\" Slide 8 — WACC ±2% Sensitivity \"I also tested discount-rate sensitivity using WACC at 6.5%, 8.5%, and 10.5%. NPV remains positive across this whole range, falling from about $4.1 million at the low WACC to $1.35 million at the high WACC. Since IRR stays constant, the project still exceeds the hurdle rate even at the higher discount rate. This tells us that cost of capital risk is not the critical vulnerability; revenue accuracy is far more important.\" Slide 9 — Strategic Fit, Brand, and Risks \"Beyond the numbers, Starbucks is known for experiential and premium-positioned stores. A flagship roastery strengthens brand storytelling, boosts loyalty, and supports premium pricing. However, the risks include traffic shortfall, the high fixed-cost structure, competitive pressure, and macroeconomic slowdowns. Starbucks can mitigate these by adjusting staffing, deploying targeted marketing, and establishing performance milestones to reassess the investment.\" Slide 10 — DRIVER: Validate, Evolve, Reflect & Final Recommendation \"In Validate, I verified depreciation, taxes, terminal value, and working-capital flows. In Evolve, I tested key assumptions to understand downside risk. In Reflect, I gained a clearer view of how WACC, tax shields, and revenue volatility shape project value. My final recommendation is to ACCEPT the project, based on a strong positive NPV in the base case, strong brand strategy alignment, and a manageable risk profile—with the caveat that Starbucks should closely monitor early demand and adjust operations as needed. Thank you.\" 2-Minute Code Breakdown Script Code Explanation — Part 1 (Model Structure) The core of the script is the build_cash_flows() function. It constructs all incremental cash flows from Year 0 to Year 10, applying the standard operating-cash-flow tax shield formula: OCF = (Revenue – Cash Costs) × (1 – Tax Rate) + Depreciation × Tax Rate. In Year 10, the function automatically adds both the after-tax salvage value and the working-capital recovery.\" Code Explanation — Part 2 (Metrics & Sensitivity Engine) \"After generating cash flows, the model calculates NPV by discounting each cash flow at the chosen WACC. IRR is computed using Newton's method so it works without external libraries. I also compute simple payback and discounted payback by accumulating cash flows and interpolating when they cross zero. The profitability index divides the PV of future cash flows by the absolute value of the initial investment. I then call the function four times: base case, revenue –20%, low WACC, and high WACC. The print functions at the bottom display full cash-flow tables and metrics so the entire analysis is transparent. This modular structure makes the model easy to audit and modify.\"",
  "video_url": "https://youtu.be/4TKKtesRsYA"
}