{
  "student_name": "Brianna Miller",
  "org_defined_id": "036177508",
  "username": "mill3280",
  "email": "",
  "transcript": "Attached the presentation I was flipping through because my computer broke and I am using a temporary one that doesn't have advanced features. Didn't realize until after recording a few times. Okay. So, good morning. We're here to determine the weighted average cost of capital or the WACC for Netflix. So the primary goal is to establish the minimum acceptable rate of return which is the hurdle rate um that Netflix must achieve on its new 5 billion content investment to create the shareholder value. If the project returns less than the WACCC, it destroys value. If it returns more, it creates value. So this is just a little graphic I have of the cost of capital. A critical point in our analysis is we must use market values over the book values for all components. So the market cap of equity and the market value of debt reflect the actual trading price providing the most accurate representation of the firm's current economic standing. So for our base calculation, we're given the market value of equity of $200 billion. The market value of debt is 13 billion. And this gives the firm a total value of 213 billion. Um here are the formulas that we were working with for cost of equity. cost of debt and capital weights. And here is what they look like just being plugged in. So, and then here are the data assumptions as I just said. So, for represent the WACC is a blended cost. So, to find the cost of equity, we use the capital asset pricing model. This model is essential because it counts for the systematic risk and that's the risk that can't be diversified away. The formula incorporates risk-free rate plus the beta multiplied by the market risk premium. So looking at our current capital structure, Netflix is highly equity focused. The current weights are approximately 93.9% equity, 6.1% debt. So the heavier reliances on equity will be a major driver for our final WACC result. Um going into our implement stage, we have our two main cost components of cost of equity. Um, it yields a high cost of equity at 11.65%. As we see in the formula right here and the high beta of 1.3 confirms that Netflix stock is significantly more volatile than the overall market, the cost of debt is we calculate the cost of debt um as shown in this formula right here. The tax shield is crucial. The results show 4.582%. So that's significantly cheaper than the equity due to the tax deductibility of the interest payments. Some special security notes are we're fortunate that Netflix doesn't have significant preferred stock or convertible securities that would require additional complex complications and calculations for separate cost components. So finally we calculate the current WACC um which is the formula right here. Uh this is the initial hurdle rate that leads us into the validate stage um which is validating and verifying just the information. So I was able to compare that with just other um reliable sources that I found online but also were verifying it through our capital structure shift slightly to 7.41% debt and 92.59% equity. So the new WACCC drops marginally from 11.21 to 11.13. So the small decrease tells us that something very important about our current weights versus the optimal target rates. The minimum change shows that we're far from the optimal target rates that would minimize the WACC. So our WACC when we added debt proves that Netflix is currently underleveraged. We don't maximize the tax shield benefits of the debt. And compared to industry peers where WACCC often falls in the 8 to 10 percent range, Netflix's 11.13% rate is relatively high, driven by the low debt utilization and the high equity risk. Moving on to the evolve stage, the next step is to evolve our current hurdle rate. So using the 11.13% firm YWACC for the entire $5 billion investment is financially flawed. Why? because the risk of profile content differs dramatically. Investing in established US-based drama is far less risky than high budget um specifically sci-fi. So then we must implement the risk adjusted WACC for the $5 billion content investment. We must segregate for the capital. Lower risk content is we could assign lower hurdle rates perhaps 10% and we might assign a higher hurdle rate perhaps 12% for the newer international markets. Um moving on to the R is reflect. So in reflection our analysis yields two core strategic findings for Netflix. First the hurdle rate. Um the firmwide WACCC should only be a starting point. Netflix must use risk adjusted WACC to properly evaluate the diverse content portfolio. And second is the capital structure. It's clearly underleveraged. Um, so Netflix should execute a financial policy to significantly increase its leverage. By issuing more debt, Netflix could reduce the overall cost of capital from the competitive 8 to 10% range, maximizing the tax shield and increasing the net present value. In conclusion, the decision to invest $5 billion in content is sound, but only if the content can generate returns a properly risk risk adjusted hurdle rate guided by corporate finance strategy that targets a more optimal structure. So, now we're going to be flipping over to Collab because I was able to use Google Gemini to generate code for Collab, which just helped me with some of my numbers of the WACC analysis, the cost of equity, the aftertex, cost of debt, the equity weight, the debt weight, and what all of this looks like through just general coding. So this all just encapsulates the findings using the numerical proof generated by scripting and collab. So yeah, thank you.",
  "video_url": "https://youtu.be/v25WN3lbD9c"
}