{
  "student_name": "Ryan Date",
  "org_defined_id": "037312318",
  "username": "rdate",
  "video_url": "https://youtu.be/Z1e5_mrTalw",
  "transcript": "0:00 Welcome to my session 11 assignment. I will be starting with D, the define and discover portion of the driver method.\n0:14 Now, as for this decision framing, basically the problem we're looking at is should Apple execute a $90 billion share repurchase, which is about 10% of their market cap, or would shareholders and stakeholders be better served by alternative capital allocations?\n0:31 So the key facts that we're given were the cash investments are $165 billion, the annual FCF is $100 billion, the share price is $185 dollars, the shares outstanding are $15.5 billion, the debt is $110 billion, and the ownership is Berkshire at 6%, CEO has about 3 million shares, and the retail average\n0:54 is about 100 shares. Employees hold options with $170 strike, and buyback is $90 billion overall. And core tension is, is this value creation or value transfer?\n1:11 So is this improving intrinsic value and capital efficiency, or is this redistributing ownership, boosting EPS optics, and benefiting insiders today?\n1:20 Disproportionately. Now, moving on to the represent portion, um, monolith economics, uh, the buyback mechanics, are the shares repurchased, are about, when you, when, are about 486 million shares.\n1:36 Uh, and you get that by taking $90 billion and dividing it by $184, which is the share price. Um, and then the percent reduction in share count is 3.1%, and you get that by dividing $486 million by $15.5 billion.\n1:57 Um, mechanical EPS increases about 3.1% before any operating improvement, and this is purely financial engineering, so there's no cash flow growth here.\n2:08 And now looking at this chart that I've created with the help of AI, I'm looking at the impact on different stakeholders.\n2:16 So for retail investors, ownership percent rises if shares held, minimal income effect versus dividends. For Berkshire, ownership increases passively without investing new capital.\n2:31 For the CEO, value increases about $17 million from EPS, multiple effect. And for the employees, with options at $10 and $170, um, strongly benefits them.\n2:44 Buyback support stock above strike. Um, and for bondholders, they're slightly worse off, um, and their cash decreases, but their leverage increases and for the company.\n2:56 I mean, there's reduced flexibility, but still strong liquidity. Now, moving on to the implement portion, right? Comparing it to, comparing this to the alternatives.\n3:09 For the $90 billion buyback, right, the pros are it's tax efficient for long-term holders, uh, signals confidence and EPS and ROE increase.\n3:20 Now, the cons are, uhm, it occurs at 30 times earning, uhm, expensive capital return. No, uh, operational growth and primarily benefits, continuing holders, insiders, option holders, you know, and so on.\n3:36 And it also created a Python notebook, which explores, um, this option in comparison to the alternatives and creates a nice, easy chart to- we can see.\n3:45 Umm, so looking at my Python notebook, right, it starts out and analyzes the inputs from the assignments. Umm, next it creates the baseline metrics, then the scenario functions, then a summary table.\n4:00 Go. Umm, then acquisitions and R&D sensitivity, then it moves on to a stakeholder snapshot, then it moves on to EPS visualization, and that's how it wraps up.\n4:13 Umm, 4- See you. The verify. Umm, for the verify portion of the driver method. Umm, I've created this chart which looks at each option and whether it creates value or transfers value.\n4:31 So bye back. Creates minimal value, it's negligible, but it does transfer value. Dividend, um, it's neither for acquisition, it does create value and does not transfer value.\n4:39 For debt reduction, it creates weak value, umm, but it's f***ing It does create value for bondholders and for R&D, it creates value in the long run, in the long run, um, and it's not transfer value.\n4:56 And the key point is the buyback largely reshuffers owner, free shuffles ownership claims rather than growing future cash flows. Now, to evolve this and look at the long-term implications.\n5:08 Repeated buybacks and high multiples may signal lack of strategic imagination, um, and the risk of reinforcing managerial incentives tied to EPS and stock price.\n5:19 And, There's a missed opportunity to lead next platform shift, so AI hardware and the computing or AR. Um, capital allocation discipline requires matching cash returns to valuation, not defaulting to buybacks when growth options remain available.\n5:36 So, for the Reflect stage, uhh, I'm gonna provide my final recommendation. Umm, and my final recommendation is to modify the $90 billion buyback to a $45 billion buyback and reallocate the remaining capital towards a strategic- strategic AI or VR acquisition and expanded internal R&D investment.\n5:59 My rationale for this is partial buyback, maintain signaling, and support stakeholders with equity exposure. Umm, strategic investments offer true value- variation via ROIC, uhm, being greater than WACC.\n6:14 And this balanced approach reduces agency concerns while protecting Apple's innovation premium. The bottom line is at Apple's current valuation of full 90 billion dollar buyback.\n6:24 Is more valuable transfer than value, or is more value transferred than value creation. A blended strategy, better serve shareholders, employees, bondholders, and the company's long term competitive position.6:37 Thank you."
}