{
  "student_name": "Alejandro Jervis",
  "org_defined_id": "036132121",
  "username": "ajervis",
  "email": "",
  "transcript": "Hello everyone my name is Alejandro Jervis and today I will be presenting my session 9 assignment. I'm going to walk through the concept of the cost of capital—specifically the Weighted Average Cost of Capital, or WACC—and then explain how the Python code uses the DRIVER method to calculate it and evaluate a project. The cost of capital represents the minimum return a company needs to earn on its investments in order to satisfy both shareholders and lenders. Since companies typically use a mix of equity and debt, the total required return must reflect the cost of both. Equity investors take on more risk because they get paid last, so they demand a higher expected return. Debt is usually cheaper since lenders have priority in repayment and interest is tax-deductible, which effectively lowers the true cost of borrowing. WACC blends these two financing sources into one percentage that shows the average return the company must earn. If a project earns more than the WACC, it creates value for the firm; if it earns less, it destroys value. Using the DRIVER method, we can break down the code in a simple and logical way. First, Define: the goal of the code is to calculate the WACC for BlueWave Logistics and then decide whether a new project with a 10.8% expected return should be accepted or rejected. The code is written with no functions and no external libraries to keep it beginner-friendly. Second, Reason: WACC depends on three essential components—capital structure, cost of equity, and after-tax cost of debt. Capital structure determines what fraction of the company is financed with equity versus debt. The cost of equity is calculated using the CAPM formula, which starts with the risk-free rate and adds a reward for taking on market risk, scaled by beta. The cost of debt is adjusted for taxes because interest reduces taxable income. These pieces combine in the formula: (E/V × cost of equity) + (D/V × after-tax cost of debt). Third, Inputs: the code begins by defining all key financial inputs. For equity, the company has 82 million shares trading at $26, an equity beta of 1.12, a risk-free rate of 4%, and a market return of 9.5%. For debt, BlueWave has $520 million in total face value of bonds, trading at 98% of face value, with a pre-tax cost of debt of 5.8% and a tax rate of 25%. The project requires a $125 million initial investment and has an expected return of 10.8%. These inputs represent realistic financial data that feed directly into the WACC calculation. Next in the DRIVER method is Visualize, which means walking through what the code does step by step. First, the code calculates the market value of equity by multiplying shares outstanding by the stock price. Then it calculates the market value of debt by multiplying total face value by the trading price of 98%, giving us the market-based value instead of relying on the book value. Adding these two amounts gives us the total capital structure of the firm, which is necessary to compute the capital weights. The code then divides equity by total capital and debt by total capital to find the weights E/V and D/V. After this, it applies CAPM to calculate the cost of equity by taking the risk-free rate plus beta times the market risk premium. Then it computes the after-tax cost of debt by multiplying the pre-tax cost of 5.8% by (1 minus the tax rate), which accounts for the tax benefit of debt. With all components ready, the code calculates WACC by multiplying each capital weight by its corresponding cost and adding the results. Finally, the code moves to project evaluation, printing the project's expected return and comparing it to the WACC. If the project's return exceeds the WACC, the code prints \"ACCEPT,\" meaning the project should move forward; if not, it prints \"REJECT.\" Fifth in the DRIVER method is Example, where we interpret the outcome. In this scenario, the project's 10.8% return is higher than the company's WACC, so the project creates value and should be accepted. This shows how financial theory becomes practical and WACC becomes a decision-making tool when assessing investments. And finally, Review: this code demonstrates how WACC helps companies evaluate whether projects meet the minimum required return to satisfy both equity holders and lenders. It shows how CAPM captures the risk of equity, how taxes make debt cheaper than it appears, and how capital structure determines the weight of each source of financing. The Python code ties these ideas together cleanly, using simple math and readable steps to produce a meaningful financial decision. By the end of the program, we understand not just what WACC is, but also how to compute it and apply it to real business decisions in a straightforward and structured way. In conclusion, understanding WACC gives us a clearer picture of how firms balance risk, return, and financing decisions, and this Python code shows how programming can transform complex financial formulas into quick, accurate, and practical tools. Python allows us to automate calculations, explore scenarios instantly, and apply financial reasoning more efficiently, making it an essential skill for modern finance, accounting, and business decision-making.",
  "video_url": "https://youtu.be/yySzGIlSFD0"
}