{
  "student_name": "Tirth Patel",
  "org_defined_id": "037647601",
  "username": "pate2347",
  "video_url": "https://youtu.be/n8xTCVbl6ak?si=xuQ-rFY9PDmiuA3Z",
  "transcript": "Hello, my name is T Patel. Today I'm going to be doing section six of uh session 12. In this video, I'm going to be presenting a comprehensive business evaluation of Panera Bread for a potential KKK KKR acquisition using the driver framework. Um I'll work through assumptions of a model approach valuation output sensitivity analysis and conduct a um discipline bid recommendation integrating DCF trading compositions uh and also strategic considerations. So the overview is a deliver a full Panera bred um evaluation for a takeover using the driver framework combined the CF trading comps and other data to make the decision. Here are the deal snapshots which I'll be covering. Create a executive ready recommendation that states your valuation range, winning bidding strategy and rationale for choosing finance for strategic positioning. Okay, so here is going to be my process using the driver framework. So I'll start with define discovery um which is required for any modeling. The goal of this analysis to recommend a defensible bidding range for KKR acting as a potential financial buyer not a strategic acquirer. This means to focus on intrinsic value, downside perfection, protection, discipline and not maximum um synergy extraction. So the deal context is Panera has 6 billion in revenue growing at 8% 900 million EBITDA at a 15% margin. They have around 2100 stores and around 50% digital sales. Market references include a PE multiplied around a 22x presidented ETDA multiples of 12 to 15x uh strategic peers like Chipotle and McDonald's trading higher than Panera is. So the key questions I'm going to have is what is Panera standalone? um basis worth how sensitive is the value to growth margins and WACC what does the intrinsic value sit relative to market compositions and what is a rational walk away price for KKR these questions I'll define using the model and what I will do\n\nin the repment uh represent stage of the driver framework the model going going to walk through four layers operating driver. This includes revenue growth, margins, store expansion, digital mix. It's also going to go through free cash generation, no pack, capat, and working capital. Um valuation, it's going to go through discounted cash flows plus terminal value. Deal output, it's going to go through enterprised value, uh equity value, and beta range. And the output is going to be a structured long. Um I explicitly modeled this with three sners downside bases and upside. So valuation reflects uncertainty rather than a single point estimate. So the implementation stage I used uh Chad GBT to help me create a model to decide um what I should do for this case. This model goes through all the basics required by the assignment as well as other things. Here I here's the code that I used to build a 5-year operating projection for each scenario. Revenues growing at a 5% in the base downside case, 8% in the base and 10% in upside case. EITDA margins expand gradually from 15% towards a higher study state level reflecting operating leverage digital mix improvement and store growth. I kept the models intentionally clean um growth margin capsex and working capital are parized so they can be stress tested.\n\nUm so here's all the code all the basics are given here all the valuations are given here assumptions and as if we wanted to change the assumptions to consider other parameters we could also do that however we're going to stick to parameters stated in the GitHub\n\nokay\n\nthis all.\n\nAll right. See if this runs again. Okay. Yeah, perfect. This runs and it gives us here are the projections.\n\nLet's see.\n\nOkay. So apparent yeah I feel like I said this earlier but revenues grow at a 5% in the downside case 8% in the base case and 10% upside case. Here are all the margins that we are looking for tax not capex also changes and the amount of stores increasing dash decreasing\n\num let's see\n\nif we look at the FCF the free cash flow is calculated using a standard enterprise framework ebe E EIT minus cash taxes minus depreciation minus capex minus changes in working capital and that gives us this column. This ensures the model reflects cash available in all capital providers.\n\nAll right. So now let's move on to the DFC summary. the enterprise value using cash flows as stated from earlier. I discounted them on a scenario specific WACC. Um the base cases uses a 9% WCC consistent with industry references. I also applied a conservative adjustment in the downside and upside cases. So downside is a 10% and then the upside is also a 9%. The terminal value is calculated in two ways using the Gordon growth for intrinsic value and exit multiple as a sanity check against market pricing. In the base cases, the terminal value represents 60 to 70% of enterprise value which is reasonable considering a mature business like Panera. Next thing we're going to move on to is going to be the equity bridge using the Gordon um EV.\n\nAfter doing the DFC summary, I moved on to Empor's Enterprise\n\nvalue. This is going to be stated here. The code gave us\n\num the base up dot downside and up. Since this is a private equity deal, I feel like the explo explicitity model managed 10% equity rollover which reduces the required cash flow check improves returns.\n\nNext thing we have is a management rollover impact.\n\nAnd here's our cash equity from that. We have a base case sensitivity test also as well. We have a chart produced by the enterprise value against a WCC base G\n\ntrading comp is down here. Let's see\n\nthe trading comps imply valuation using EV EVI TDA and then also there's PE multiplies a second reference\n\nprecedent transactions cluster around a 12 to 15% EBT IDA which aligns closely with the exit multiplied by the DF DCF F.\n\nLet's see what else do we have. This is the range which is kind of interesting. This prompt made Gwent to very high depth\n\nstrategic synized case is also here and then okay we have a football field which we'll go to now. So the football field summarized the entire valuation did DCF plus synergies as well as the trading comp ranges and a strategic synergize adjustment. The key since this slide for decision makers.\n\nAnd here we have the summaries, the quality control checks as long as the bid\n\nQC.\n\nOkay, now that was the implement stage. Now we're going to go on to the validate stage. So we're going to check the terminal value as a percentage of the total thing. um the implied exit multiples and when free cash flow turns positive all the outputs we got from this they seemed about right compared to economic um uh like similarly companies and they seem economically feasible. This confirms this model is just not mathematically correct but also financially credible based on the validation this frame uh the wall framework\n\nadjusting leverage assumptions for LBO modeling stress testing recession scenarios updating capex and margin assumptions on new data arrivals. The flexibility is exactly how evaluation models are used in practice. And now we're going to move on to the reflect and recommendation stage. The main and um I will provide a recommendation of what we should do and also what I think. Bringing everything together as a financial buyer, the KKR should anchor valuation near the base case DCF we have in the model supported by trading comps and precedents. I recommend a dis a disciplined buying range centered near intrinsic value, a clear walk away price below strategic buyer territory and then letting strategic buyers overpay if synergizes don't materialize.\nUm to summarize the analysis completely using the multiple scenario DCF as a primary value anchor also in joint with trading comparables and precedents um and strategic buyer center overlay. I have developed the feasible enterprise value range rather than relying on a single point estimate using the downs and ups. The results indicate a pair's intrinsic value on a standalone basis supports a disciplined buy range consistent with financial buying return requirements while strategic buyer might justify higher valuations through synergies. These incremental values come with um execution integration risk that a financial buyer like KKR should fully underwrite and look at before making a purchase. According to my recommendations, I think that KKR is to pursue Panera with a clearly defined bidder range anchored to intrinsic value, maintain a strict walk away price, and allow strategic biders to overpay if their centeres assumptions fail to materializes. This approach um uses quantitative rigor and professional judgment rather than just reflecting um by the numbers. It reflects how valuation is used in real world real world private equity decision-making. That is my analysis for this assignment. Thank you for watching."
}