{
  "student_name": "Jasvika Patil",
  "org_defined_id": "036591563",
  "username": "patil173",
  "email": "",
  "transcript": "This is assigment 10 where I am going to do a Cost of Capital analysis for the proposed Starbucks Flagship Roastery project. My objective today is to evaluate whether this $12 million investment creates shareholder value using a transparent, data-driven financial model built in Python. To ensure rigor in this analysis, I have followed the DRIVER framework.This ensures we don't just jump to calculations, but rather structure the problem correctly first. Let's begin with Phase 1 which is Define and Discover. The core financial problem here is capital budgeting. Starbucks is considering a 10-year project with a heavy upfront outlay of $12 million. The Hurdle is that we are using the firm's WACC of 8.5% as our discount rate. And the Goal is we need to calculate the Net Present Value (NPV), Internal Rate of Return (IRR), and Payback periods to determine if this exceeds that hurdle. The Complexity is this isn't a simple annuity. We have variable revenues rising in years 2-5 and stabilizing in years 6-10 along with complex operating costs and a terminal value calculation at Year 10. By defining this scope upfront, I established that a simple spreadsheet might be prone to error, whereas a Python script allows for reproducible, parameterized sensitivity analysis. Moving to step 2 which is Represent. Instead of hard-coding numbers inside formulas, I have parameterized every assumption the tax rate of 25%, the WACC of 8.5%, and the specific revenue tiers. the Working_Capital is set here at $500,000. The Investment is set at $12 million. Moving on to step which is Implement. I've built a function called calculate_cash_flowsthat iterates through years 0 to 10. First, we handle depreciation. Since this is straight-line over 10 years, we take the $12 million investment divided by 10. This is crucial because depreciation is a non-cash expense that creates a tax shield. Inside the loop, the code dynamically assigns revenue based on the year hitting $11 million during the peak growth years 2-5. I then calculate Operating Expenses including COGS at 40%, Labor, and Rent. I calculate EBIT (Earnings Before Interest and Taxes). I deduct Taxes at 25% to get Net Operating Profit After Taxes. To get Operating Cash Flow I add back the Depreciation. This ensures we capture the tax shield benefit without treating depreciation as a cash outflow. Finally, in Year 10, I account for the Terminal Value. The case estimates a $3 million salvage value. The code calculates the tax on that gain and adds the net after-tax proceeds to the final year's cash flow, along with the recovery of the working capital.\" Now to the next step which is Validate. For NPV I used the WACC to discount all future Free Cash Flows back to Year 0. And for IRR I utilized the numpy_financial library to solve for the rate that makes NPV zero. For payback I also implemented a loop to calculate the simple payback period—finding exactly when cumulative cash flows turn positive. And for profitability Index, this is calculated as the Present Value of Future Cash Flows divided by the Initial Investment. Let's look at the Base Case Results generated by the code. The model calculates a positive NPV around $2.5 - $2.6 Million. This suggests the project creates value. The IRR is approximately 13.5%, which is clearly above our 8.5% hurdle rate. We recover our investment in roughly 6.5 years. The Profitability Index is above 1.0, further confirming efficiency. These numbers validate that, under base assumptions, this is a financially sound project. Moving on to Step 5. a base case is rarely enough. Real-world projects have risk. here we integrate technology to perform sensitivity analysis. The rubric specifically asked us to test two scenarios: Revenue decreasing by 20% and WACC fluctuating by ±2%. I created a copy of the parameters and applied a 0.8 multiplier to all revenue streams. This simulates a market downturn or poor customer adoption. To visualize this, I made python create two charts. A Cumulative Cash Flow chart to visualize the payback curve. A Sensitivity Bar Chart to compare NPV across the scenarios. On the left you see the 'J-Curve' effect. The deep red trough represents the initial $12M outlay. You can see it crossing the x-axis (breakeven) between Year 6 and 7. On the right is the The Sensitivity Chart. The Green bar is our Base Case. Look at the Revenue -20% bar. The NPV drops significantly, potentially turning negative or barely breaking even. This tells us the project is highly sensitive to volume. The WACC sensitivities which are the grey bars show that even if interest rates rise by 2% to 10.5%, the project likely remains positive, though less attractive. The last step is reflect. This is where I interpret the data to make a management decision. Based on the model outputs, my recommendation is to ACCEPT the project. The base NPV is approx $2.5M. We are creating wealth for shareholders. The IRR of ~13.5% offers a 500 basis point buffer above the 8.5% cost of capital. We must look beyond just the spreadsheet. The Halo Effect is even if the cash flows are tighter than a standard store, a flagship location drives brand equity and marketing value for the entire Starbucks ecosystem. This intangible value acts as a buffer against the financial risks we identified in the sensitivity analysis. In terms of risk mitigation, the sensitivity analysis showed us that Revenue is the main risk factor. Therefore, my recommendation comes with a condition that we must closely monitor Year 1 revenues. Marketing spend must be effective in driving immediate volume to secure that payback period. I followed the DRIVER framework to Ensure the logic was correct before coding. Thank you.",
  "video_url": "https://youtu.be/_Qbj8tFNZk4"
}