{
  "student_name": "Ana Martinez",
  "org_defined_id": "033961971",
  "username": "am156",
  "video_url": "https://youtu.be/AgK5Yr1KEBc",
  "transcript": "Hello, my name is Ana and we're going to go over session 13. We're going to build our own AI powered financial innovation. So I used OpenAI, I used Gemini and I used Streamlit for this project. So I wanted to go over what my project was focused on. So I decided to create a personalized investment plan for college students.\n\n[00:00:21.46] - Speaker 1\nThe reason why was because I really wanted something that was catered to college students and the unique situation of on life campus and even if it was part time or full time students that they could have something that they could input their own finance and have it really cater to them. Whereas I realized that some of the online kind of investment plans kind didn't really cater to the idea of a college student's everyday life. So here we're going to see what the options are over here. So here we have for our financial health, we have the high interest depth. So for this is if you have student loans or if you have any other type of loan that you're living off of, something you have to pay back.\n\n[00:01:13.39] - Speaker 1\nAnd here we have our estimated monthly investment budget. So for this as some students have say scholarships that they live off of or they have a job on the side either on campus or part time, it really depends on the student situation. And so in some cases where you have a student who's living off of their scholarship and they have their parent support, but they also decide to work save part time just to earn extra money to work towards these goals, it can sometimes be not of a, not, not as of a high number as of somebody who's working full time. So I really wanted to cater this to reflect that where say a monthly investment could be like $200 and say for emergency funds, say you're really not, you don't really need an, an emergency fund if you're living on campus and everything is paid for by semester. But say you are living off campus.\n\n[00:02:32.27] - Speaker 1\nSo sometimes you don't have the resources to really allocate that money towards saving for multiple months of expenses. But we'll say that we can do one for now for this example and what are our goals? What is our time frame? Essentially this just gives an idea. I just wanted to give a little bit of perspective.\n\n[00:02:59.20] - Speaker 1\nBut say that we just want something short term. Say our goals are not really trying to score. We're trying to have this say that you're a freshman and you're trying to get through with this kind of dedicating this. So you're gonna do for like we're doing this for four Years you say you're in from a freshman to a senior. We're gonna see how it works out and say that 200 you can also, you can solid a little bit.\n\n[00:03:28.38] - Speaker 1\nSo your risk, you're gonna go about a four. We'll do that. Not, not all aggressive but you're not holding back. So here we're going to general generate this personalized plan and here we're going to go through these. So it says when reviewing the analysis.\n\n[00:03:46.14] - Speaker 1\nSo our financial health check here we have, we currently have one month of expenses saved and here's the actual allocate 100 per month to high yield savings account until you reach three months of savings. So that's, that's the idea if say that you are a student who doesn't have much to fall back on. That's just giving you an idea. It's just warning you, kind of trying to help you out. Okay, so for our personalized investment strategy here we have the mark growth with capital protection.\n\n[00:04:25.17] - Speaker 1\nSo recommended asset allocation. So these are just recommendations of how it would look like in a chart. Here we have our stock percentage, 65 of where this say $100 would go.\n\n[00:04:41.24] - Speaker 1\nSo here we have our, our cash and here our stocks and here we have our bonds percentage. This is just a recommendation or just giving you a visual of what it would look like. Here you have our action Plan monthly budget $200. Here's investing of a hundred dollars our savings a hundred dollars. So basically just split into half just to give you an idea of you're saving this and we're going to be investing half of it which gives you a good idea if you're somebody who really needs that flex might need that money in the future.\n\n[00:05:14.04] - Speaker 1\nIt's good to have this implemented into your investment plan to have your savings also counted for when you're making these types of plans. So account type is standard technical brokerage account for flexibility and your business a mix of broad markets, stock ETFs, short term bond ETFs and cash equivalents to reduce volatility and automation. Automate monthly investing for consistency. And here we have assuming the 5% annual return investing under dollars per month for four years could go, this could grow to $5,000. And we're going to try to check this now with tweaking these a little bit.\n\n[00:05:58.23] - Speaker 1\nSo we have, so you have one say 35, let's say you have a much higher budget, say we're just going to add 300 more. So for emergency fund you have at least the three months and we're gonna, we're gonna change this to a minimum. Let's say if our time frame is going to be a couple years after graduation, say that you're on your way out and you want to just continue this plan. Once you're at you're going to go for a more conservative perspective. Let's see, it says here your financial foundation is solid.\n\n[00:06:43.44] - Speaker 1\nYou're ready to invest. This just gives an indeed. This just reviews like what we inputted and compared to what we had in the other example. It was taken into consideration. Hey, you might need this money later for your safety net here.\n\n[00:07:01.30] - Speaker 1\nOur financial situation was a little bit different. So now when we go down check, here's our commission and here's our monthly budget. So you have the $300 here. Now it's ready to invest it fully. So it's not that worried about how your savings are doing in case of an emergency.\n\n[00:07:24.31] - Speaker 1\nAnd this is now seeing it for the monthly budget for what it was originally planned for, which is the investing part. You have the account type, the standard taxable brokerage.\n\n[00:07:37.17] - Speaker 1\nAnd so there wasn't much of a tweak. So here we have our annual return after investing 300amonth for eight years. 34,000 around almost $400.\n\n[00:07:52.20] - Speaker 1\nSo yeah, this is what I created and here we can see the code attached to it.\n\n[00:08:06.05] - Speaker 1\nThank you for watching."
}