{
  "student_name": "Ryan McNamara",
  "org_defined_id": "037202820",
  "username": "mcnama34",
  "video_url": "https://youtu.be/jOxkv2sjYgg",
  "transcript": "Hi, I'm Ryan McNamera and today I'm going to be talking a bit about a hypothetical with the uh huge company Apple. So, Apple um has been always been pouring money into uh buybacks of of their shares, but what we're going to be talking about in this video is what would something like a huge $90 billion buyback look like for this company? um is it smart or is it um not really something they should get into. So uh that's what we're going to look at. Um so coming in from the point of view as an independent uh financial analyst, we're going to look through the different um different kind of points uh different sides of this that you could be on from how it affects like just like the management of the company, how it affects the shareholders um and uh if it will be good for them, if it will be good for Apple and uh we'll get into it. So, um, to get started, um, the first thing we want to look at is kind of our is Apple's, uh, current, um, numbers. They're, so they're netting netting around hundred billion a year, um, in net income. They have 15.5 billion outstanding shares, and they trade at a price of about $185 a share. So with that in mind, we can go we can look get into our um earnings per share and as well as um we're going to see how that's going to increase or decrease based off of the of what's going to happen. So what we did what I did in order to figure that out is I use Google uh Gemini in partner with Google Collab to kind of create a model that's going to give us that data. So um have to pull that up. Um so what we want to look at first is our earnings per share. And so the earnings per share is going to increase um 3 uh 3.11 um over from 3.0 in order to um just from this the buyback itself right off the bat. So that's already going to show that we're going to be helping out our shareholders a lot which is good for the company. It raises the stock prices and it's um it makes everybody happy. Um now what is um really important is that there are also some alternatives of what we can do with this money rather than just increase a little bit of our return of our um small jump in of just over 3% on the earnings per share. So we can also see what would happen to our um other majority shareholders like the CEO or in Apple's case Birkshshire Hathaway. So we have actually a chart for that here in Google Collab. So I'm going to flip this camera around so it can be seen. But that's going to be this chart right here. Um, we can see stuff like your retail shareholders and how their earnings per share is going up. We have our institutional such as Birkshshire and their stake is going to be raised from this as well, which is good for them. Um, our CEO is going to be making more money. Our employees um are going to have higher uh prices for their options. and it's going to allow us to leverage ourselves a little bit more because we have more equity in the company. So\nyeah, um but there are also some other things that we could do. Um so our collab model showed that yes, we're guaranteed um this uh 3.11% increase. However, it also outlines something that could uh possibly give us a higher increase in the form of 13 1.5%. And that is from an acquisition. So, I can um with new technology that's coming out such as AI or VR as implemented by our prompt and that's going to be this chart. Apologize for the shaky camera. This chart right here. So, it's going to show first of all just our 90 billion buyback at an inc with an increase here. But we also are able to see how there are some other alternatives which are going to bring could allow us to increase our earnings per share a lot more which is ultimately what Apple should be doing is if they were to go this route they should be investing that money and not just trying to get a small 3% return but something upwards of 10% is really where this uh decision is going to shine. So, at the end of the day, I think that's what they should probably do. And yeah, thank you"
}