{
  "student_name": "Benjamin Engels",
  "org_defined_id": "037980105",
  "username": "bmengels",
  "video_url": "https://www.loom.com/share/0fa33e8def0d41c9b236cd243207becc",
  "transcript": "0:00 and welcome back. In this video, there in this assignment, we are looking at assignment or session 13 corporate decisions and incentives.\n0:11 So starting off, um, I use Google Gemini for my software and this is assignment. So within the driver method, uhm, started to define the problem.\n0:21 So we're evaluating Apple's hypothetical 90 billion share repurchase, uhm, against four alternatives. Um, those, uhm, stakeholders. And incentives are listed here below.\n0:35 Um, as we go through and we, we see those. Um, so now we get the input data. So we have, uhm, you know, a cache, our annual FCP, or FCF.\n0:48 Excuse me. Our, uh, current share price, P.E. ratio, a dividend yield, shares outstanding, debt, and buyback size. Um, and now this is our calculated inputs that we got from using these values.\n1:03 And we're able to use those in this hypothetical $90 billion valuation for Apple. Um, so Stage 2 is the R and driver of representing.\n1:14 So we now see, um, so we have obviously calculations here is our, um, $90 billion. Buyback, so $90 billion there.\n1:23 Uh, we have our financial impacts and our strategic intents of each. So, uh, each dividend, the strategic AIVR acquisition, debt reduction, and incremental R&D.\n1:33 So again, this is dealing with that $90 billion that we see, uh, from, um, this, uh, let's see, yep, so $90 billion here.\n1:45 And so, as we continue to go down the I, uh, which drivers implement, so we have a scenario here where we have a $90 billion.\n1:52 Buyback, uh, we have the shares repurchase that we're able to see divided by 185, so it's .48 billion in shares.\n2:00 Umm, as we go down to scenario two, we have a $6.00 special dividend. Umm, total dividend cost is $15.5 billion times six.\n2:08 So that equivolates to $93 billion for Apple. Scenario three is our strategic ABIR acquisition. So that is, uh, listed here.\n2:19 Scenario four is our debt reduction. Umm, you know, going down from 90 billion, you know, from 110 billion to 20 billion, uhm, or EPS, uhm, is 2.76%, so that's slightly less than our buyback percentage, uhm, and then our DNA ratio is significantly down, leading, potentially leading to credit rating, \n2:39 upgraded lower. Future cost of debt. So Area 5 is our incremental R&D, and then that assumption is listed here, so 0 NPV project for the base case.\n2:49 Um, so Stage 4 and Driver is Validate. Um, so now we take this information and we 3 Thank you. Make an assumption and we go, um, make our, um, decisions, so we have a buyback price or shares repurchased from the information above.\n3:06 We have our new EPS, and we have the EPS, uh, aggregation here. So 6.37 for 1.85 base for bio. Um, this was one of the points, uh, in the assignment that we needed to discuss was our new EPS rate.\n3:21 So that is listed there in our validate stage. Um, we have our value creation versus value transfer, so. So, Um, this information is important for this scenario.\n3:32 Obviously, we have our buyout. Um, we have our dividend and buyout, I should say. Uh, so, you know, acquisition, if that were to look different, uh, for our buyout.\n3:44 Or to be, um, transferring from a main cash balance, uh, to shareholders. Uh, so this only creates value if the stock is undervalued, uh, or if the firm is moving toward an optimal capital structure.\n3:58 Um, that is compared to our dividend. So then our third part here, uh, our, excuse me, in the E and driver is the goal is to evaluate, or adjust the model.\n4:09 So that is what we see here. We have our table, so we have our EPS impact, our ownership, leverage, value creation.\n4:16 Signaling, and agency risk, all of these are part of our assignment requirements. Um, we have our visualization, visual, visualization, excuse me.\n4:25 And then our final assessment and recommendation. So, for Apple, this 1990 billion dollar buyback. Apple offers a clean immediate 3.2 EPS, uh, accretion and signals management confidence.\n4:37 However, with, uh, given PE of 30, is primarily, uh, a value transfer mechanism. The ex-significantly exposes the firm to agency risk.\n4:47 Uh, and the- pleats a large portion of the cash without tackling a course or take a growth network. Growth needs, excuse me.4:54 And here's our final summary. So, thanks so much for watching."
}