{
  "student_name": "Ethan Sleeth",
  "org_defined_id": "038097599",
  "username": "sleethe",
  "video_url": "https://youtu.be/VaDwteBtLPg",
  "transcript": "0:25–1:35 — Define & Discover (show the visuals + snapshot)\"First is Define & Discover, where I document facts and assumptions before building the model.\nDeal Snapshot:\nRevenue: $6B, growing about 8%\nEBITDA: $900M → 15% margin\nNet income: $400M\nOperational scale:\n2,100 stores (show the stores chart)\n50% digital sales already (show the digital mix chart)\nThis matters because digital typically improves order economics and loyalty.\nMarket references (show PE multiples chart):\nIndustry P/E ≈ 22x\nChipotle ≈ 35x (premium growth benchmark)\nMcDonald's ≈ 25x (mature scale benchmark)\nThis frames where Panera should reasonably land—below Chipotle, stronger than typical peers.\nCapital assumptions:\nBase WACC = 9%\nManagement wants 10% rollover\nStrategic bidders like Starbucks and McDonald's may pay more due to synergies.\nGrowth levers:\n500 new stores in 5 years\nDigital mix to 70%\nDinner/catering expansion\nEarly international rolloutThat's the evidence and assumptions I'm taking into the model.\"\n1:35–2:50 — Represent + Implement (show model blueprint + DCF tables)\"Next is Represent, where I map the plan, then Implement, where I run the valuation in Python.\nI build a 5-year forecast with three scenarios: Downside, Base, Upside.\nFor each scenario, I project:\nRevenue growth\nEBITDA margin path\nFree cash flow detail\nFCF is built step-by-step:\nStart with EBITDA\nSubtract D&A to get EBIT\nApply taxes to get NOPAT\nThen: FCF = NOPAT + D&A – Capex – ΔNWCTerminal value uses the Gordon Growth model, and every assumption is parameterized so I can change it quickly in the video.\"\n2:50–3:35 — Validate (show sensitivity tables + charts)\"Now Validate. I stress-test the outputs using sensitivity analysis.\nI test valuation across:\nWACC changes\nTerminal growth changes\nThis confirms valuation behaves logically, and I track the terminal value share to make sure the result isn't driven by unrealistic terminal assumptions.I also run a synergy sensitivity to show why strategic bidders could justify higher values—but only if they actually capture synergies and manage integration.\"\n3:35–4:25 — Evolve (show football field + bid outputs)\"Next is Evolve, where I synthesize everything into a decision.\nOn the football field, I compare:\nDCF range\nTrading comps range\nPrecedent transactions range\nStrategic value including synergies\nThe overlap points to an enterprise value clustering around roughly the $12.5B–$13B range.\nBid recommendation (KKR):\nSuggested bid: ~$12.8B EV\nWalk-away price: $13.5B EVKKR should not overpay for synergies that a strategic buyer is better positioned to capture.\"\n4:25–5:00 — Reflect (show reflection cell)\"Finally, Reflect.\nThis reinforced that valuation isn't one exact number—it's a defensible range based on assumptions, scenarios, and stress tests.\nDRIVER forced me to document assumptions before implementation and separate standalone value from synergy value.The main takeaway is: process discipline beats precision, especially in competitive bidding.\""
}