{
  "student_name": "None None",
  "org_defined_id": "037003658",
  "username": "herre163",
  "video_url": "",
  "transcript": "Hi, I'm Jose Herrera. For Mini Project 3, I built FinSight AI, an intelligent financial tool designed to move beyond simple calculations. I used the DRIVER framework—Discover, Reason, Implement, Verify, Evolve, Reflect—to create an advisor that understands context and verifies its own advice. The tech stack is React with the Google Gen AI SDK using the Gemini 2.5 Flash model. Crucially, I'm using the new thinking to force the model to reason before answering and Google Search Grounding to implement real-world data.\n\nSo this is FinSight AI. It's a financial clarity, instant analysis. And this is just my app that I was able to create and make it look nice, so it's nice and personable. So it's like: Describe your financial goal, investment idea, or current situation. Our AI follows the DRIVER protocol to analyze real-time market data and assess risk.\n\nOkay, let's try a complex scenario. Let's say I have... let's say 50k. Uh, should I invest in Nvidia stock or a high yield savings account considering current inflation? And let's say I want to buy a house in 3 years. So this is what we're going to put into... um, so we're gonna analysis. Watch the status indicators here. First, discovers my goal, buying a house. Then it enters the reasoning phase, allocating token budgets to think through market volatility versus my short timeline. Next, it implements via the Google Search tool to fetch the inflation rates and Nvidia's current price. Finally, it verifies the findings.\n\nSo you could see... this is basically my, uh, executive summary. This is what I basically, um... so for a 3-year purchase goal with 50,000, a high yield savings account is strongly recommended over investing in Nvidia stock. The HYSA offers capital preservation, liquidity, and a positive real return above current inflation, crucial for a short-term, high-priority financial objective. And over here it talks about the risk assessment. And is it safe? It's low risk. Um, and look it, I mean it just tells you everything. I mean it gives you the recommendation of a high yield savings account creates a low risk score of 2 due to its capital...\nUm, and, and then this is the projected growth scenario. So, uh, so 2024... 52... and then you just keep... it keeps going up. Like keeps going up. Um, and you can see the blue case is the blue line, conservative case is the... that... the orange line. And, uh, the result... And then uh, it's just the \"Why.\" The user's primary goal is to... So this is basically uh, just showing everything and it gives you everything to help you out to see if you should or should not, you know, uh, use it to purchase stock or put it in a high yield savings account.\n\nUm, so in the code you can see I've... I've uh, configured the thinking budget to 2048 tokens. This implements... so like if we go back, uh, if we exit out of here... So if we look... we get out of here... And, and we're just basically everything that I told it to do... and this is the code over here. This code shows me everything. Um, and it's just helps me with everything and I mean... You can see that starting with the code right here, import React, and then loading everything and adding everything.\nand basically what in the code you can see I've configured the thinking budget to 2048 tokens. This implements the reasoning loop... reasoning loop preventing the AI from rushing to a hallucinated answer. I also enforce a strict JSON scheme that requires a risk reasoning field ensuring the verified step is transparent to the user. Thank you."
}