{
  "student_name": "None None",
  "org_defined_id": "038097599",
  "username": "sleethe",
  "video_url": "",
  "transcript": "hello my name is ethan sleeth and this is my Mini-Project 3: an AI-powered financial advisor built in n8n.The goal of this project was to move beyond simple calculations and create a tool that analyzes context, explains financial concepts clearly, and gives personalized recommendations.\"\nWorkflow Overview (40–45 seconds)\"My workflow begins with a Webhook Trigger, which takes natural-language financial input like income, expenses, and goals.\nNext, the Workflow Configuration node stores reusable settings, including my API URL.\nThe Analyze Financial Scenario node sends the user's information to OpenAI, where the prompt is designed to interpret goals, identify surplus income, and explain concepts in plain English.\nThen I use a Fetch Financial Data node to demonstrate advanced capability—external API integration. This allows the model to incorporate real-world data such as interest rates or market conditions.\nThe Analyze and Recommend node merges the AI's interpretation with any external data and produces structured, validated JSON recommendations.Finally, Format Output and Return JSON Response cleanly return the result.\"\nDemo Output (20–25 seconds)\"For example, with input:\n'I make $55,000, spend $32,000, and want to save for a house,'the workflow generates a personalized plan: build an emergency fund, allocate surplus income, and choose an investment approach aligned with the timeline—all explained in simple language.\"\nReflection (20–25 seconds)\"Using DRIVER, Loop 1 focused on core AI reasoning, and Loop 2 added trust features like disclaimers, structured outputs, and sanity checks.This project taught me that building with AI is as much about designing reasoning and safety as it is about building workflow logic.\"\nClosing (5 seconds)\"That's my AI financial advisor—an intelligent, explainable, and extensible tool built in n8n. Thanks for watching.\""
}