{
  "student_name": "Krish Aggarwal",
  "org_defined_id": "036289409",
  "username": "aggar117",
  "email": "",
  "transcript": "For a few weeks in January 2021, the entire financial world was captivated by a single stock in GameStop. But beyond all the memes and news surrounding this, the GameStop event provides us with a perfect natural experiment to stress test the core rules of finance. Today we're going to dissect this event not with headlines but with data. I'll do the driving homework. So, firstly, define and discover our problem is very clearly defined. We are conducting a quantitative test of the semi-strong form of the Efficient Market Hypothesis or EMH. The EMH states that all public information should be immediately reflected in a stock's price. Our research design is a classic event study to see if this held true for GameStop. To discover the context, let's look at the price and volume chart, which is right here. Also, from August 2020, GameStop is a very wide stock where our analysis identifies three key events. First, in around August 2020, activist investor Ryan Cohen takes a major stake. Second, in January 2021, the Reddit surge, the behavioral bias found as hurting, becomes visible in the data. And third, the squeeze peak, the price detaches from all fundamentals. The volume profile is flagging. On several days, volume was more than three standard deviations above its average. This wasn't just high volume, it's a statistical anomaly, a clear quantitative signal of a mass hurting phenomenon. Next, represent. To test the semi-strong EMH, we can't just look at price, we need a model. We have to represent what GameStop's price should have been. Our framework for this is Standard Capital Asset Pricing Model, or CAPM. We can use the CAPM framework to calculate the abnormal return. This R-key metric is the stock's actual daily return minus its expected return, given the S&P 500's footprint. This calculation isolates the GME-specific movement. Any persistence from non-zero abnormal will find volatile emissions, likely anomalies, and sign of inefficiency. Then we implemented the event study. We systematically executed this analysis using Python, leveraging libraries like Pandas for time-series analysis and Wi-Fi nets to source our data. Here are two other graphs. These charts just show our output of our implementation. For months, the cumulative abnormal return is nearly flat. It's flat and zero, just as EMH would predict, but then in January of 2021, it goes vertical. This is the squeeze represented in pure data, completely separated from market improvement. Our implementation also quantified the behavioral components. We found fat-tailers, which a kurtosis of 19.9 and a normal bell curve is only 3. This isn't just a fat-tailer, it's a statistical monster, meaning impossible events were happening. We also saw extreme volatility. During the peak, annualized volatility hit 421%. This is a perfect quantitative example of limits to arbitrage. Even if you knew this stock was overvalued, the volatility would force any rational short-seller to close their position, allowing the inefficiency to persist. So now we have these explosive results. Next, I'll validate, which is crucial. Are these findings statistically real or just noise? Our analysis returned a resounding note that the market was not efficient. Here's the validation. So quickly before I continue, here's a lot of the outputs and some of the code. Here's libraries defining some of the data, importing data from Y-Finance, the Yahoo Finance library, and then just doing some basic analysis of the different things. I used M9 to help me out a little on debugging. It kind of guided me along the right way and make sure all the formulas in relation to these variables made sense and then jumped into visualizations, which I went over and then did a little statistical significance testing and then just printed out all the results. I'll put Sean here so we can see. Our test statistic for this period was 2.01, which allows us to reject the null hypothesis that abnormal return was 41.55%. Our t-statistic was 2.01, which allows us to reject the null hypothesis that abnormal returns were zero. As a robustness check, we also looked at information appropriation, which really efficient market, which showed immediate price discovery. Instead, we saw slow persistent wave mean abnormal returns of 21% before the peak, 41% during, and negative 17% after. This slow-moving pattern is a classic example of a market anomaly, specifically a momentum effect, and to clear a validation of our inefficiency finding. Once we've validated this inefficiency, the problem evolves. We apply this answer to a core financial question. What are the implications for investment strategy? Could a rational investor have profited? The answer is a yes. Looking back, a simple buy and hold for a period netted about 4,900%. Your analysis of when to enter is key. The early entry period, which was around August or December 2020, saw 189% return. The late entry crowd saw 330, but with massive risk. We even evolved this into a simple active strategy, a momentum rule. For example, buy if up 5% yesterday, return to 307% with a sharp ratio of 1.71. As you can see right there, this confirms that the momentum anomaly was, for the time being, systematically exploitable. This highlights the ex-ante versus ex-post problem. We can't reverse this signal for obvious. In the moment, it would have been exactly identical. Finally, we reflect. This is our synthesis of EMH theory with behavioral finance reality and the Balfour-Gamestop choice who won. Clearly, behavioral finance won in this case. The GME event is a textbook case of how, in the short term, behavioral biases like herding can overwhelm fundamentals and limits our arbitrage, like exchange volatility, and can allow dislocation to persist. What are the final implications for active versus passive strategies? For most investors who are passive, this is a powerful lesson that reinforces the passive diversified investing. For active managers, it shows that while markets are generally efficient, they are not always efficient. For active strategies, this event shows that in rare dislocated markets, sentiment is the new fundamental. For policy makers, this event exposed real cracks in the market structure, triggering a vital conversation about short interest trends with circuit breakers and the responsibility of retail trading platforms. The GME wasn't just a fundamental stress test of our financial theories, and the data shows us exactly where the theories held up and where they broke down. Thank you.",
  "video_url": "https://youtu.be/kIH8mANSEs8"
}