{
  "student_name": "Jacob Polackin",
  "org_defined_id": "035981714",
  "username": "jpolacki",
  "email": "",
  "transcript": "Here is the corrected, polished, and continuous transcript. I have removed filler words (\"um,\" \"uh\"), corrected the financial terminology (changing \"MPV\" to \"NPV,\" \"IRA\" to \"IRR,\" etc.), and fixed the spoken numbers to logical currency formats while maintaining your natural speaking flow. You can copy and paste this directly into the YouTube subtitle editor. Hi everyone, my name is Jacob Polackin, and today I'm presenting a comprehensive capital budgeting analysis for the proposed Starbucks flagship roastery project. The question we're answering is simple: Should Starbucks invest 12.5 million into this new venture, and does it create shareholder value? To answer this, I didn't just plug numbers into a spreadsheet. I used the DRIVER Framework, which ensures we aren't just calculating, but also solving the business problem. I'll be walking through this with my DRIVER analysis, as you can see right here. So, starting with Discover—the first D. It's the way we frame our decision parameters. Our goal is to determine the Net Present Value, or NPV. We need to see if it is positive using an 8.5% WACC, or Weighted Average Cost of Capital. If the return is lower than 8.5%, you're technically destroying value. Here are the realities of our project. First, the outflow: it's expensive. We need 12 million for assets and an additional 500,000 for working capital inventory. That's 12.5 million in the hole on Day 1. Second, the inflows: the revenue is volatile. It starts at 8 million, ramps up to 11 million, and settles at 9 million. Then we're looking at the cost structure, which is crucial. We have high fixed costs—3.3 million in labor and rent—and variable costs at 40%. Finally, the exit: we aren't doing this forever. In Year 10, we sell the assets for 3 million and recover our working capital. Next, we're moving on to the Represent stage. Before we get on to any calculation and numbers, this Represent stage is here just to give you a brief overview of what we're going to do and how we're going to look at it. So, in Year 0, we have our pure cash outflow. For Years 1 through 10, we have to calculate the Operating Cash Flow. Now, accounting profit is not cash. So, the logic I used is: take Revenue minus Costs and Depreciation to get EBIT; tax that EBIT at 25%; and then add back the Depreciation. Since depreciation is a non-cash expense, adding it back captures the Tax Shield benefit. Finally, in Year 10, we have a triple threat of cash: operations from that year, plus the building sale, plus the working capital recovery. If we miss any of these, our model fails. Now moving on to the I—Implement stage. I used Python to build a robust calculator. Using Python instead of Excel allows us to automate the scenarios and update the assumptions instantly. So first, look at the setup. I parameterized all my assumptions at the top. If the WACC changes to 9% tomorrow, I change one number here, and the whole model updates. This makes the model flexible and reusable. This is the hard-working code that I wrote. This is actually a pretty long one, longer than most, but it calculates the EBIT, Taxes, and OCF row-by-row, ensuring the math is transparent. As you can see, this is the financial report or the Cash Flow Schedule. Looking at our revenue, it's slightly going down. Our EBIT is 2 million for years two through five and slightly going down as well. Taxes are decreasing after year five. The OCF is varying, and the total free cash flow over here is decreasing and increasing as it goes. So, for the key metrics we looked at: with an NPV of 8.5%, we got $3,022,514. The IRR was 13.25%, the Profitability Index was 1.35, the Simple Payback was 5.28 years, and the Discounted Payback was 8.21 years. Then, looking at the sensitivity results: if there was a 20% decrease in revenue, the NPV would be negative $2,752,644 with an IRR of 3.88%. If the WACC was 6.5%, the NPV would be 4.636 million. And if the WACC was 10.5%, the NPV would be 1.627 million. So that's pretty interesting. As we take in those numbers, we can next move on to the V for Validate. So we check: Did we include the tax shield? Yes, we did, by subtracting depreciation before tax and adding it back after. Then, is the terminal value in Year 10? Yes, the code explicitly adds it to the final year. As you can see, these are all ways you can look at the model and say, \"Okay, this is solid, and we can trust the information it's giving us.\" Next, we're going to move on to our Evolve stage. I have another script as well. This is, once again, a longer script, but it advances the analysis and gives us a chance to visualize the risks here. So, this is the code here, and as we scroll down, we get to the charts. We have a chart that actually shows us the cash flow profile: deep investment versus slow recovery. The executive recommendations, before we get into these charts, is to Accept the base NPV of 3.22 million. The reasoning being the project creates shareholder value and covers the 8.5% cost of capital. Regarding strategic fit, it aligns with the brand's expansion goals. However, there are some critical risk warnings. The sensitivity analysis shows that a 20% revenue drop results in a negative NPV. I believe I mentioned this NPV earlier as positive, but I meant to mention that it was negative. For the strategic conclusion: the project has high Operating Leverage because fixed costs are high. We should proceed, but strict volume requirements must be met. So yeah, once again, this is just another way to visualize the cash flow over the years and then the strategic risk, or the impact of volume drop. In the Base Case, NPV in millions would be closer to three. This was another way to visualize that 20% drop being closer to negative 2.8 million, which is a lot. So as we compare the best case versus the worst case (a 20% revenue drop), it reveals high operating leverage because fixed costs are high at 3.3 million. A drop in revenue hurts profit significantly. But the recommendation is still to Accept, but with a warning. Finally, as we end our analysis here, we move on to the last step in the driver framework, which is to Reflect. This is where I want to give my recommendation after seeing all this. The verdict, I thought, was to Accept. This project covers its cost of capital. However, we need to monitor revenue closely in years one to two. If it stays below 9 million, the project risks destroying value. This means that in those years one and two, we need to be hesitant and tentative to make sure that this project is going to be where it needs to be. If it drops like that, it might be a sign to get out. But if we do get past those years one and two, without a doubt, this is definitely something we do want to invest in and something that we do want to accept. So yeah, thank you for sitting here for my analysis. Bye.",
  "video_url": "https://youtu.be/bZpiHVBZHus"
}