{
  "student_name": "John Gascho",
  "org_defined_id": "035820898",
  "username": "gascho",
  "email": "",
  "transcript": "Hi everyone, my name is John Gascho, and in this video I'll be walking through my full cost of capital analysis for Netflix using the DRIVER framework. I'll calculate Netflix's current WACC, analyze how a $3 billion debt issuance will affect that WACC, compare Netflix to Disney and Amazon Prime Video, assess project-specific discount rates for U.S. and international content, and then recommend the optimal capital structure strategy for Netflix going forward. I'll also show the exact Python code I used to compute everything and explain every part of the model so the logic is completely transparent. So, here's some of Netflix's financial parameters. For example, the market capitalization is $200 billion, total debt is $14 billion, and we have various market conditions. These are just some of the key inputs. Let me go over to my code. Here's my code. I start with the imports and then define the inputs. I use millions as the unit, so 200,000 means $200 billion. I start with the Define stage. The main question for this assignment is: What is Netflix's true cost of capital, and how should this inform a $5 billion content investment decision? The WACC is the minimum return Netflix needs to earn in order to compensate both equity investors and debt holders. Determining an accurate WACC is essentially the hurdle rate that tells Netflix whether a major content investment creates value. Netflix's financial parameters include: market cap $200 billion, market value of debt $13 billion, beta 1.3, bond yield 5.8%, and tax rate 21%. Strategically, we also know that Disney's WACC is 8.2% with heavy diversification, Amazon Prime Video uses Amazon's 9.5% WACC, and the media industry average is around 8–10%. Netflix is considering issuing $3 billion of additional debt. The overall goal is to calculate WACC precisely and evaluate whether adding leverage provides a strategic advantage. Next is the Represent stage. This is where I translate the financial problem into a structured analytical model. Everything in this analysis is built on a few core formulas: CAPM for cost of equity: r_e = r_f + β × MRP, which gives the return equity holders require. After-tax cost of debt: r_d × (1 – T), because interest is tax-deductible. Weighted Average Cost of Capital: WACC = (E/V) × r_e + (D/V) × r_d × (1 – T). We always use market values of equity and debt, not book values, because market values reflect current investor expectations. Another key concept is the relationship between leverage and beta. As Netflix takes on more debt, its equity becomes riskier. I modeled this with Hamada's formula: β_levered = β_unlevered × [1 + (1–T)(D/E)] This ensures the model captures how higher debt increases equity risk. Now for the Implement stage. I'll walk through my Python code line by line. First, I define helper functions for cost of equity, after-tax cost of debt, and for unlevering and relevering beta. Using clean helper functions makes the code easier to test and extend. Next, I compute equity and debt weights: E = market cap D = debt market value V = E + D w_e = E / V w_d = D / V With the cost of equity and after-tax cost of debt, I get: Cost of equity: 11.65% After-tax cost of debt: 4.582% Current WACC: 11.2186% This matches expectations for a subscription-based digital media firm with fairly high equity volatility. After adding $3 billion of new debt, I model the new leverage: D_new = D + new debt V_new = E + D_new I adjust the marginal borrowing rate slightly, assuming it rises as Netflix leverages more. Then I unlever the current beta and re-lever it using the new D/E ratio, giving a new levered beta of 1.3147 and a new cost of equity of 11.7306%. The new WACC after the additional debt is 11.2245%, which is almost identical to the current WACC. I also ran a sensitivity analysis to show WACC as debt weight increases to 30%. WACC stays in a tight range around 11.19–11.22%, declining slightly at moderate leverage and rising slightly at higher leverage. The chart shows that WACC doesn't dramatically change for small additions of debt, which is exactly what you expect for a firm like Netflix, where debt is relatively cheap but equity risk rises quickly when leverage increases. Next is the Validate stage. I check whether the outputs make sense relative to industry benchmarks. The media industry WACC is about 8–10%. Netflix comes in at 11.2%, slightly higher, which aligns with Netflix having higher equity beta, more volatile earnings, and less diversification than Disney. Validating assumptions shows the model behaves realistically: cost of equity rises with beta, debt provides a tax shield, and too much debt increases financial risk. In the Evolve stage, I identify improvements and alternatives. For example, I could run scenario analyses with different market risk premiums, marginal debt yields, or country risk adjustments for emerging-market content. Another improvement could be modeling currency risk for international content or incorporating Netflix's recent shift toward ad-supported revenue. Overall, though, the current model is sufficient for capital budgeting decisions. Finally, the Reflect and Recommend stage. Current WACC recommendation: Netflix's firm-wide hurdle rate should be about 11.2%. Project-specific WACC: For U.S. content, use 11.2%. For international content, add a country risk premium of 1%, resulting in 12.2%, accounting for FX risk, regulatory uncertainty, and political risk. Issuing $3B of new debt: Moderate debt barely increases WACC, after-tax cost of debt remains cheaper than equity, and Netflix is still lightly leveraged compared to Disney. So yes, the $3 billion debt issuance is feasible. Optimal capital structure: Netflix currently has a debt weight of 6%. I recommend moving toward 10–15% debt weight to capture the tax benefits of debt while avoiding excessive financial risk. Disney sits at 30% debt, but Netflix should avoid that high level due to sensitivity of cash flows to subscription churn and competition. Overall, this analysis shows Netflix can strategically use moderate leverage to reduce its cost of capital and increase content investment capacity without taking on excessive financial risk. That wraps up my full WACC analysis for Netflix using the DRIVER framework. I calculated the current WACC, modeled the impact of an additional $3 billion debt issuance, analyzed project-specific discount rates, compared Netflix to Disney and Amazon, and recommended an optimal capital structure strategy. Thank you for watching.",
  "video_url": "https://youtu.be/6r_Zi1UII7w"
}