{
  "student_name": "Abha Gupta",
  "org_defined_id": "037604525",
  "username": "gupt1107",
  "email": "",
  "transcript": "Hi, my name is Aba and this is my section 9 assignment for the management 310 class. And in this assignment, I'll walk through my analysis of Netflix weighted average cost of capital and focuses focuses on how the WACC changes when the firm raises an additional $3 billion in debt to finance new content investments. I'll also explain how um the different discount rates differ for US versus international content, compare it to Netflix, Netflixes to its peers like Disney and Amazon and also give it a recommendation at the end. Throughout this analysis, I followed a driver framework which requires the define, represent, implement, verify, evaluate, and reflect. and I'll show how every decision that I made throughout this project was using the driver methodology. Um, and just as a preface, I did use an AI chatbot to help make sure my code was as efficient as possible um while making it. So, initially I start off in the define and discover stage where which is the most foundational step of the driver framework. here. It's just so I can understand the problem and understand um and identify the core financial questions that need to be answered before I even started writing any code. So, this problem revolves around determining Netflix's current weighted average cost of capital and understanding how adding $3 billion of debt will influence um that capital. Now, because Netflix is deciding whether to issue more debt to fund a $5 billion content investment, knowing the cost of capital is essential for evaluating the investment's profitability. Um so, initially I start off by understanding all the components of the walk um WACC. This starts with the cost of equity which can be calculated using the CAPM model um which is Netflix beta risk-f free rate and market risk premium were all provided in the problem parameters. So those are things that I would I documented in this section right here um as part of the code. I also needed the cost of debt which is based on Netflix yield of 5.8% um which is listed right here because debt is taxdeductible. I also made sure to include the after tax adjustment um with Netflix's corporate task tax rate of 21%. I also identified the capital structure inputs like Netflix's $200 billion equity um market cap over here and then the $13 billion market value of debt. And these figures allowed me to calculate the debt and equity weights which are required for the WACC model. I also recognized that leverage changes a company's financial risk. So I need a method to adjust Netflix's beta after increasing debt. This led me to the ham equation which let me um unlever and then relever the beta based on changes in capital structure which was noted in my discover stage because ignoring leverage and beta would give me misleading results. And then another part of discover was identifying the strategic context. So Disney has a walk of 8.2% 2%. Amazon uses one of 9.5% for Prime Video and the overall media industry tends to fall within an 8 to 10 range. Understanding those benchmarks would be important later when assessing whether Netflix is taking on excessive risk or whether it's walk is competitive. Finally, I need to determine which analysis the assignment required. Um there was many different options but um I c I captured them in the discover stage document and I also had a full understanding um of what the problem required. From there um I moved on to the represent stage. So in the represent stage I translated everything I discovered into an analytical blueprint. This was essentially the architectural design for the rest of the work. Um I planned out all the different variables and values and started laying out the formulas in order so that they could be calculated. First, I needed the CAPM model for the cost of equity. Then, I needed the after tax cost of debt. Then, I planned the capital structure weight formulas and finally the walk formula itself. Um, and because assignment required scenario modeling, I also planned for multiple versions of the walk. the baseline walk using Netflix's current current 13 billion um dollar debt level. Then the post is walk using the 16 billion dollar total of total debt. The represent stage also included how I would um use the hammada equation to unlever and then relever the beta. And this step was critical because leverage affects the riskiness of equity and ignoring that would make the walk inaccurate. I also mapped out how the project specific discount rates would be handled. I decided to define the corporate walk and then adjust the international content walk by adding a country risk premium. I also included that in the represent stage because project risk adjustments must be conceptually just justified before being implemented. Um then I designed the Python code itself and finally outlined all visualizations which is a bar chart comparing the walk before and after debt issuance a line chart showing walk versus debt levels and a chart showing peer comparisons and another chart for project specific walk. After I built this road map I road map I started going into the implement implementation stage. So initially like I showed before I started off by defining all of my variables um which captured Netflix's current and future capital structure and then I implemented all the functions designed earlier. For example, here is my cost of equity um function. Here is the walk function that handles both equity and debt component. Um and then I also have one for after tax cost of debt and then the capital structure weights. After all these functions were created, I use them to compute Netflix's baseline um walk which included calculating um the debt and the equity weights, unlevering the current beta, computing the cost of equity using the CAPM um and determining the after tax cost of the debt. I then plugged everything into the walk function. Um, and then the next part of oops from here you can see that I created a table at the bottom which just shows a data frame of all the values. It shows the beta levered the beta unlevered the cost of equity the cost of debt pre-tax the cost of debt after tax and also the walk here at the end. This is just so you have a baseline of the current um Netflix baseline walk to compare against. The next part of implementation involved calculating Netflix's walk after issuing $3 billion of new debt. To do this, I recomputed the capital structure weights based on the $16 billion debt figure and then relevered the beta using the Hammada equation. This gave me a higher beta which produced a higher cost of equity reflecting the increased financial risk associated with more leverage which you can see in this table over here. In next session the walk was 0.112 and over here it was pretty similar. The main difference that you can see between before and after 3 billion of new debt is a WD and WE where this one is 0.61 61 and 0.93 and down over here at 0.074 and 0.92 sorry 0.61 up here. Now after completing the scenario walks I implemented the project specific walk calculations for US content I used the corporate walk. For international content I added a 2% country risk um premium to reflect exchange rate and regulatory rates. I also created a peer comparison data frame and visualizations. For example, I plotted a bar chart showing Netflix walk to next to Disney. Um that's over here. Initially um I showed a bar chart that shows the difference between before and after the $3 billion of debt and the walk um difference between the two. Then down over here um I plotted a bar chart which shows the Netflix walk next to Disney and Amazon's over here. Oh sorry. So then I showed the um I plotted one that shows the difference between corporate US content and um international content which you can see within the international content due to the 2% country risk premium it is a little bit higher than the corporate and US content. And finally, I repeated that, but I did it with Disney and Amazon's so I could visually interpret how Netflix fits into the competitive landscape. The final part of the implementation involved building um the sensitivity analysis. So, I created a loop that calculates the walk across a wide range of debt levels from $10 billion to $40 billion and plotted the result um of the resulting walk curve. I also built a gridbased sensitivity analysis um to evaluate how changes in beta and the market risk premiums influence Netflix walk. By um the end of this implementation, I had the complete anat analytical model that was fully exe executable and aligned with the represent plan. So here is the um the walk curve which shows um if the debt goes from $10 billion all the way to $40 billion and how the walk is affected by that. And then down over here shows the walk versus the um beta to show how the changes in the beta um and the market risk premium influence Netflix's walk all the way from one to 1.6 and how the walk influences by that. Each one also has a data table to show the values as well. Exactly. Um I also just created a sanity check section where you can see um all the main um values that are important. So in the verify stage I examined whether the results generated by my code were reasonable and consistent with corporate finance theory. Verification is essential to ensure the model is behaving as expected. The first thing I checked was whether Netflix's current walk fell between um the media's industry of the typical 8 to 12% range. Based on my calculations, Netflix's walk did indeed sit within a reasonable part of that range. This suggested that the input parameters and methodology were producing realistic outputs. Um, next I looked into how the walk changed after the $3 billion in debt due to the increase in leverage. Um, the beta increase which caused the cost of equity to rise. Now the actual walk of Netflix did not raise that high. It actually lowered by 02%. Um, and this shows the difference between tax benefits and the increased financial risk. I also checked the project specific walk results. The US content walk aligned with the corporate rate while the international content walk was higher due the country risk premium. This behavior made sense financially and pass the verification check. Finally, I compared Netflix to its peers using my walk data frame. Um Netflix's walk was somewhat higher compared than Disney's 8.2% 2% and uh Amazon's 9.5%. But this reflects Netflix's higher beta and less diversified revenue streams. And and this made sense because Amazon uses a corporatewide walk that reflects the risk of the entire company. Um, now in the evaluate stage, I brought together the numerical results and visual outputs to imp interpret what they meant for Netflix's financing decision, and overall capital structure strategy. The goal here is not to just compute the walk, but to explain what the numbers actually imply for Netflix's risk profile, cost of capital, and investment choices. Starting with the baseline walk, the model shows that Netflix's current walk falls within the 8 to 12% industry range. And this tells us that Netflix's combination of a relatively high beta and moderate debt load results in a loss of cap in in a cost of capital that is competitive, but slightly higher than more diversified companies like Disney. This makes sense because Netflix is more concentrated in one business line and its cash flows are more sensitive to market conditions. Next, I evaluated the impact of issuing $3 billion in new debt. The bar chart comparing the original walk to the post debt walk makes the effect very clear clear. The additional debt raises Netflix's debt to equity ratio which increases its leverage beta through the hammada equation. The higher beta increases the cost of equity which pushes walk upward unless the tax shield offsets it. Um, in my results, the walk changed modestly. This suggests that the new debt does not drastically destabilize Netflix, but the company is approaching a point where more leverage would start raising the cost of capital more noticeably. In the walk versus debt sensitivity chart, it provides even more insight. Um, the curve typically slopes downward at first, but eventually slopes upward as equity holders demand higher returns for taking on more risk. Um, but we can see this trade-off visually. Netflix benefits from some leverage, but it moved closer to $30 billion or $40 billion in debt. The walk would start climbing rapidly. In the project specific walk chart, it's important for evaluation. The US content uses the corporate walk because its risk is aligned with Netflix's core operations. And then the peer comparison chart, it helps evaluate Netflix's strategic position. The Netflix's walk sits right above Disney, which reflects Disney's diversified revenue streams and extensive non-streaming segments that smooth cash flows. Overall, this analysis reinforced the purpose of the assignment to understand not only how to compute walk, but also how the walk informs strategic decisions about financing and content investment. It shows me why firms must continue reassess their cost of capital as conditions change, why project specific discount rates matter, and why capital structure is a key driver of corporate value. Applying the driver framework made this entire process more structured and intentional. And now I have a better understanding of how to analyze and communicate cost of capital insights in a real corporate finance context. Thank you.",
  "video_url": "https://youtu.be/pPnajSx2tx0"
}