{
  "student_name": "Ella Brummet",
  "org_defined_id": "037237297",
  "username": "ebrumme",
  "email": "",
  "transcript": "Hi, my name is Ella Brummet and today I am going to be walking you through my session 10 assignment. So, let's go ahead and get started. So, the session 10 assignment essentially covers the cost of capital analysis. So, in our define and discover stage, the first part of our driver framework, um the primary goal, what we're trying to determine is whether Starbucks should accept or reject the proposed flagship um roaster project that's based on his financial visibility and strategic alignment. So decision is going to be based on core capital budgeting metrics uh with the net c with the net present value or the NPV rule being the definitive financial um criteria. So the key questions that I'm going to be answering throughout this assignment are what are the projects incremental annual cash flows from year 0 to year 10? What does a project what does the project generate a positive NPV when discounted at the firm's 8.5% WACC which is the weight average cost of capital? Uh what is the project's internal rate of return or the IRR and does it exceed the 8.5 WACC? Uh what are the project's payback periods the discounted and simple and how sensitive are the results? So the NPB and IRR to the 20% revenue reduction and a plus or minus 2% change in the WACC. So let's go ahead and get into our represent stage which is the second stage our driver framework. So the R stage is essentially going to be talking about what formulas I'm using um in the code that um I had Google Gemini write for me and essentially just broke it down this way so it's easier to explain. So let's go ahead and get into it. So the first one is the annual operating cash flow also known as the OCF um which this will be calculated using the tax shield approach. So next we have the NPV or the net present value. So this is the sum of all the present values of the incremental cash flows that are coming in. So we have to total those all up for this one. Then we have the incremental cash flow which is the ICF. Um and essentially this is the formula for it. And as you can see we have T0 which is like the initial investment and then it goes all the way to T10 which is the terminal year. So that would be the year that it would end. Next is the IRR which is the internal rate of return and this is the discount rate that makes the NPV equal to zero. And then lastly we have the profitability index and this is the ratio the present value to the future cash inflows to the initial investment. So this was all of these formulas are very important for the code which we're about to get into in the implement stage. Um, essentially I had the AI write this code based on these formulas. Um, I was able to put in a few prompts that were like what what formulas do I need to be able to solve um for like what would be a better investment to be able to figure out the you know year 0 to year 10 and like whether or not this would be a good investment or um we should be able to accept it. And so that's what we're going to do in the implement stage which is the I stage of the driver framework. So essentially the first thing that I have here is I did my code in collab. So um this is the code time and essentially it calculated everything out for me and it has this 10ear incremental cash flow schedule um which basically is just telling you how much each year. So we have cash flow, revenue, the total operating cost appreciation, um EBIT, taxes, OCF, and then the ICF, which is the total. So this is it for every year. And then we have base capital budgeting metrics. So this is where we kind of were able to figure everything out a little bit more which showed the NPV, the IRRa, the PI um and the simple payback period of the years and the discounted um which is answers one of our first questions that we talked about earlier whether it was discounted or simple. So this one's discounted. Um next is the sensitivity and like the impact it's going to have on the value. So if the uh WACC were to decrease by 2% which would make it the 6.5 from the 8.5 to the 6.5 um that means our total value would be about 4,000 that's well that's the um NPV the net present value would end up being 4,000 uh or I'm sorry 4,636,96 and then if the WACC would increase by 2% so it go up 10.5 that would be 1,627,268 um dollars. So this is really important because it kind of leads us into a little bit of the explanation. So again, we used all of these formulas in the code. this was really important to make sure we had our depreciation, the operating cost, the earnings before interest in taxes, like everything like that to be able to determine whether or not we should accept this deal or not. Um, so again, these are just more of the formulas that I used and like it even like um broke down a little bit more in like the metrics calculations. So like the NPV uses um the numpy PMP P NPV which will correctly handles year zero and then IR uses point IRR and I think this is really helpful to fully understand the code and the breakdown. So um basically based on all of this the NPV so the net present value is positive uh which means the project's cash the project's cash flows we discounted at the WACC exceed the initial cost indicating it is an economic value ad so the IR the internal rate of return is 26.60 60 which is significantly greater than our 8.5% WAC hurdle rate. So based on this implement stage and all of the code details that we were given the base decision is going to be to accept this this project. So to validate all of this information given um I went ahead and did this the data source um so this was all given directly from the document um that we were provided on the website. The next would be the formula check. So everything was based off the 8.5 WACCC. The initial outlay in year zero is modeled. It was at 12.5 million. Terminal year was the last year. So it's year 10. So our initial financial financial analysis indicates that the project is highly valuable generating a positive NPV approximately 8.67 67 million and an IR significantly higher than the 8.5 hurdle rate. So last um in our last two stages here we have the evolve stage which in one round of the coding I tried to kind of like mess a little bit more. So like the revenue was down 20 uh%. So this is causes the NPV to decrease although it does remain positive the IR remains high. So the basically meaning that even when we evolve it and change like our profits and our um revenues a little differently um the project is still highly robust and it is going to be a little bit um not as sensitive to market downturns as we can see here. And then lastly in our reflect stage or the last stage of the driver framework um this was based on the financial analysis. Again, I recommend to accept the proposed Starbucks uh roaster project and that is again because of the strategic fix fix fit that it has. The project aligns perfectly with Starbucks long-term strategy. Um and essentially they're very vertically um integrated company so they keep everything within. Um, so basically being able to roast and do retail would be really great for enhancing their brand image and their global positioning. Thank you so much for listening. I hope you have a great",
  "video_url": "https://youtu.be/BZRFnKMCZL8"
}