{
  "student_name": "Daran Ebadi",
  "org_defined_id": "036201910",
  "username": "debadi",
  "email": "",
  "transcript": "Hi everyone and in this presentation I'm going to be walking through a full driverbased uh whack analysis for neckl for Netflix using the collab notebook you see on the screen and I'm going to reference exact lines of the code as you go so you can see how I'm implementing them um in real time. So we're going to first start off with the you know define a discover stage. Um at the very top I've inputed an input parameters block. Um and I've lo loaded all the necessary assumptions. So these are going to include the 200 billion market cap 13 billion market value of debt beta of 1.3 um debt yield 5.8% and the 4.5% risk-free rate and a 5.5% um market risk premium. So, and then I'm going to define the problem. Um, Netflix is evaluating a five billion content investment. We need to understand it current whack. Whack after issuing 3 billion in new debt, a project specific whack for international content, and how Netflix compares to peers like Disney and Amazon. And so now um in the represent stage I'm going to turn financial theory into code um uh using helper functions and then we're going to use uh define cost of equity um on the screen over here and here I'm going to implement the CAPM to compute the cost of equity the after tax cost of debt and the full whack formula using market value weights And this structure is just going to insert ensure the model is transparent repeatable. Um and now we're going to run the model um number three over here current whack. Um so as you can see the output here the equity weight um is 93.9%. The debt weight is 6.1%. Uh the cost of equity is 11.65% and after tax cost of debt is 4.6% which gives us a current whack of about 11.2%. 2%. And so this number is above the industry whack range of 8 to 10% and well above Disney's 8.2% reflecting Netflix's higher beta and concentrated business model. So now we're going to scroll down to the whack after additional um after additional debt whack after additional debt. And when I'm going to add 3 billion into the new debt, debt weight raises to about 7.4% and equity weight falls slightly. Um, and concerning the whack, it barely moves and it drops to roughly 11.1%. And then I'm going to run a yield sensitivity. So if the market demands 6.5% instead of 5.8%, you can see here that the whack still sits around 11.2%. And that's going to be a sens sensitivity output over here. Um, and this tells us Netflix is in a region where moderate leverage doesn't meaningfully increase risk. And then part three is going to be our project specific whack over here. Um so for US content risk matches the core firm and WAc is around 11.2%. For international content I'm going to add a 1.5% country risk premium and that's going to push the cost of equity to around 13.6% and the WAC is going to go all the way up to 13%. And this really just highlights why global content requires um a larger hurdle rate. Um, now to validate these results line up with the expectations, Netflix has a higher beta driven risk than Disney or Amazon. So even with more debt added, it's wacc stays above periods, which confirms we're mod we're modeling um a reality, not just not just numbers. And now we're going to scroll over here to the leverage sensitivity curve. Um, and so we're just going to uh visualize the WAC sensitivity to leverage. Um, so this sure this curve is going to show the classic behavior. Um, whack decreases with low debt due to the tax shield um and then increases as financial distract distress risk um poses raises both re um and RD and this is going to give Netflix insight into optimal capital structure. Um so a modest increase in leverage is fine but large increases can um backfire. So reflecting on all of this um that I discussed through my code um Netflix's whack is high because of business risk not due to a lack of leverage. So adding 3 billion in debt is manageable and may slightly reduce whack if it does reduce. But international content should clearly use a project specific whack um around 13%. And so in strategic terms, Netflix should definitely maintain um a disciplined incremental leverage policy and rely more on risk adjusted hurdle rates for uh um you know just greenlighting their global content. And that's going to be my full driver workflow. Um and it's going to be referenced to that code on the screen. And this this is the foundation that kind of flows directly into capital budgeting or whack becomes a discount rate um for our MPV analysis.",
  "video_url": "https://youtu.be/f5iXZR-32fQ"
}