{
  "student_name": "Abdulrahman Ali",
  "org_defined_id": "037005845",
  "username": "ali243",
  "email": "",
  "transcript": "Hey, how you doing? My name is Abdulrahman Ali. Today is session 9, and we have another discussion to talk about, and let's get to started. Um, so, the cost of capital analysis. Let's get started. Calculate the weighted average cost of capital for Netflix and connection with a high. Your analysis must determine current WACC, uhm, which is cost of capital, weighted average cost of capital, though it impact of additional debt financing asset projects specific, versus firm, where I discount it. And compare enough. All right, so let's first start off with understanding what the question is asking us and what it is, all right. So, this is what the question is explaining. Um, as for your, how much, how much of cost level does it get money? So it's the way you see things. So, let's like, you can decide if spending $5 billion on your content is a good idea or not. So today you must find if it's current cost of money, so how much it has right now. See what happens if it borrows more money, choose the right discount rate for the projects and projects are safe for a risk year. So, like, for example, bringing a movie where rock doesn't actually movie, you know that the rock in action. In, well, most likely generate a lot of money. Or, for example, if you were to do a, uh, Marvel, you know that Marvel 6 on Marvel 8, whatever it is, it's gonna get you a lot of money. It's not really risky. It's more of a safe. No matter how much money you spend, you know that you're gonna get this much amount. Or is it an average? But if you were to do, like, the rock in a, maybe something that's unrelated, and maybe not horror-moving, we're not usually used to seeing rock and horror, so it'll be something new, so that'll be very risky. Choose the right discovery for some projects, and compare Netflix's cost of money to other companies like Disney. Alright, so that's basically what. There's asking, and I was actually, let's, let's now explain. Alright, so Netflix's current WHZ is, cost of accruiting is around 11-16% after tax, after tax cost of that 4.58% in weight is not 6% in WHZ. So the W, the capital after adding to the billion dollars, so if we were to take 3 billion dollars in that, we'd have 16 billion dollars in that, and total value of it would be 216 billion. Now, cost of that rises to 6.2% and cost of accruity rises slightly. It's 11.8%. The W-A-C-C goes up little because more debt equals more risk. So basically, the more money you take, that means the more risk you're at is just normal, just because you never know anything could happen at any time. Products specific and nothing you're Disney. So Disney has a much lower degree, because it has theme parks. Thank you much. So Disney basically has a steady annual income. Like, regardless if they bring movies out or don't bring movies out, they know that, because of their original, because of all the others that they own and they have, they're bound to make a certain amount of money. However, Netflix is only relying on one thing. And that's- So if there's no movie, there's no money. Didn't they otherwise? No. So best recommendations. Netflix should add some debt, because that's cheaper. You know, so it's easier to borrow money to spend some money that's cheaper than getting your own money. But don't add too much or the credit rating will drop. Go- towards 10, 15, 20% debt, but still safe, but still safe, but cheaper, you know. Um, so that's basically explaining what's happening in that. But now let me give it to you more in a word way. Alright, so, umm. That's kind of like, another way is Netflix should increase debt, rather than obviously an entirely capital structure closer to yours. Maybe 15% use 10.5% of WAAC for U.S. project and what is W-A-C-C meaning? So as they finance so much that there are business companies blended cusp cap or cus, or across all socials. In a simple way. As a company that's blended cusp water. They're all funding. So basically, all this money that is getting, and it's paid to investors and all that stuff. So basically, their W-A-C-C is a little bit more, it's already a little bit more, but they're thinking about bringing it up even more. So I would agree with whatever they said. Also, here's the, the Google, the Google Cloud. How do we need it? And then here is what Google Gemini said. Basically the same thing. Very similar to what I said. Um, benefits lower W-A-C-C. Recommendation increased the financing, 3 billion, so sending increased the, uh, the, increased the debt finance and, you know, don't increase it too much, it'll increase it a little bit. And, you know, just be safe and same thing as anything, but there's, uh, Netflix that doesn't have other incomes, um, however, never really has one. Um, with that being said, I would like to conclude my thing with saying thank you guys very much for listening to my, uh, little podcast, my little, uh, explanation about- Oh, session nine, the cost of capital cost, the cost of capital analysis. And, um, hopefully we'll see you guys next week, and I thank you guys very much. Have a wonderful day, and another remind. Bye-bye.",
  "video_url": "https://www.loom.com/share/30a037bb9d924b8fbe51f37426260277"
}