{
  "student_name": "Qianyue Wang",
  "org_defined_id": "034658523",
  "username": "wang5687",
  "email": "",
  "transcript": "Hi, this is Tan and this is my session 10 assignment. For this assignment, we need to we will evaluate a proposed Starbucks flagship roster that requires about 12 million upfront outlay and operates for 10 years. So we will build a year 0 to 10 cash flow model and we will compute NP IR payback discounted payback and profitability index using an 8.5% W. So I will also run run a sensitivity analysis on revenue which is negative 20% and work which is plus or negative 2%. And I will also document each step using the driver framework. So now in the simple what our business scenario is that should the Starbucks invest um 12 bill $12 million into a new flagship roaster that will run for 10 years giving what we expect about its sales cost and risk. The goal is to use capital B budgeting tools to decide does this project create value which means NPV is larger than zero and should Starbucks accept or reject the project. Also for the K decision rule if NPV is larger than zero we will using back and the project is value and we recommend accept. If NPV is smaller than zero we will recommend reject. So what was information we have is that uh in the case we we have the initial investments uh working capital and revenue revenue and operating cost taxes and discount rate also the terminal value. What we still need to compute is the year-by-year operating cash flow and increment and incremental free cash flows including initial investment and working capital. Also we need to capital budgeting. We have capital budgeting metrics uh MPV R simple payback and also sensitivity analysis like we mentioned in the goal part. So how we plan the model is that we will represent the model in a structured programmable way. The timeline is year zero is today and the year 10 to the investment date. The units is all cash flows in millions to keep numbers small and readable and revenue schedule is year one is eight, year 2 to 5 is 11, year 6 to 10 is 9. So also for the operating cash flow formula we first compute uh earnings before investment and taxes which equals revenue minus cost of goods sold minus labor minus rent minus marketing and depression. Also for the um project free cash flow each year, year zero is initial investment minus working capital. Years one to nine is FCF equals OCF and year 10 FCF equals OCF plus terminal value plus working capital recovery. And the matrix we will use is MPV present value of all FCFS using V IR discount rate that gives NPV equals zero and the simple payback years until the cumulative undiscounted cash flow becomes positive and discounted payback years until cumulative discounted cash flow becomes positive. So now let's get started for the programming. We will install and import libraries first and also we will make tables and plots looks a bit nicer. For the next sale we will have some core assumptions based on the um business context. We will have our time horism discount rate and investment and working capital and depation also revenues by year cost assumptions. So now after we run that the assumptions are all set all cash flows are in millions dollars for the sales three we will helper the functions for cash flows and matrix we will build a data frame with the four cash flow schedule and it will returns the uh the data frame like with columns year revenue cost of goods source labor marketing depit taxes and net income and operating uh cost and free cash flow here is what we got. Yeah. And so also for next step we will compute the MPV IR payback is counted payback and after we run that we will have the base c base case capital budgeting matrix which also are in millions dollars unit the will be um 3.02 IR is 30.25% the simple payback is years will be 5.28 into eight years the discounted payback years will be 82 8.21 the profitability index will be 1.24 24. So for interpretation part, the MP tells us how much value into this dollars the project is and IRR is the rate of return the project generates internally and the payback measures how long it takes to recover the initial investment. The discounted payback does the same but respect the time value of the money and the PI is equals is larger than one means the project C value create relative to its cost. I will plot this free uh cash flows over time is kind of like this also will help build the uh help to build a scenario with scaled revenues and it will give us base uh different under different scenarios what is and NPV and IR we have baseline scenario revenues which is um minus uh 20% which uh V is equal to 60.5% or V equals to 10.5%. And also we create a simple bar chart for this MPVS across scenarios. So here we can check the results to make sure that the beha the model behaves logically. What we check is that year zero cash flow should be larger negative and year 10 should include operating cash flow recovery of working capital terminal value and the MPV pattern across scenarios should make economic sense. Lower revenue refers to lower MPV it can turn negative and lower V refers to higher MPV higher W refers to lower MPV. So val matters for beginners like us. So validation is where we can confirm the model is not product producing garbage like finance or post must follow economy intuition if not the model will be wrong. So let's uh I will print the validation checks. So now the free cash flow is negative um 12.5 year 10 components is 1.8 eight of operating cash flow and free cash flow is five 5.3. So now we interpret how the project behaves under different assumptions. So scenario A the revenue drops by 20% the NPV becomes negative IRL falls below V and discounted payback becomes extremely long and also if the roster underperforms in sales Starbucks loses money into the dollars and for syn changes in uh plus or minus 2% at 6.5% W the NPV rises sign significantly but at 10.5% W NP drops drops but stays positive and for interpretation the financing cost matters but even a higher W does not destroy value in the base case revenue profile so why the involve stage matters this is where we learn how fragile our recommendation is managers don't just want answers they want to know how the best things can get okay now for the reflection part what I learned is that MPV is the best measure for deciding if a project cris value because it converts all future dollars into today's dollar and IRRa is easy to understand percentage return but it can be misleading when cash flows are irregular so MPA must lead the decision and operating cash flow is not the same as accounting profit so depreation reduces taxes even though it is isn't a cash outflow so what depress me is that even a small change in revenue Revenue can move NP from strongly positive to negative and customer traffic and demand are critical risks and W changes affect MPV but revenue assumptions matter much more in this project. So how these uh cases will connect to real business decisions like Starbucks would not approve a flagship project only on financials and brand impact store experience tourism value and long-term position matter too. Still the cash flow model provides a displaying way to test if the project is financially sound. So that's all for my uh session 10 assignment. Thank you for watching.",
  "video_url": "https://youtu.be/Y84SIsr2vO0"
}