{
  "student_name": "Robert Dinn",
  "org_defined_id": "035870380",
  "username": "rdinn",
  "email": "",
  "transcript": "Hi guys. So in this video I'm going to be walking through uh my capital budgeting and analysis for um session 10's assignment in session 10 assignment proposed Starbucks grocery roy and flagship store investment. Um I'll be using the driver framework to guide the entire workflow which is define, represent, implement, validate, evolve and reflect. Um I'm going to re reference each of the Python code cells uh as I'm as I move through the analysis. Um and these Python code uh cells were created using the help of Gemini. Um and so yeah, let's start with the uh the driver process. And to start this, I'm going to need to do the uh define and discover stage. So in this stage my goal is to clearly understand the business problem uh that Starbucks is facing the decision criteria and the financial and uh modeling work needed. So yeah, Starbucks is considering a 12 million dollar investment in a note in a new roster and flagship store located in a hightraic premium downtown site. The project lasts 10 years and we need to assess whether the project creates shareholder value. Starbucks uh WACCC is 8.5% which becomes our hurdle rate. Uh we've been provided detailed revenue projections, cost structure, depreciation assumptions, taxes, working capital needs, and a $3 million terminal value. Um but this als the the assignment also requires uh calculating year-by-year operating cash flows depreciation tax yields adjusted uh free cash flows net present value internal rate of return payback period discounted payback period profitability index or PI uh sensitivity analysis revenue minus 20%. um a scenario analysis and an ultimate accept/rejection recommendation strategic and non-financial factors. Um yeah, the most critical requirement of the define and discover stage is um that this must be completed before implementation. So here I'm I was just um clarifying what the business needed and then um uh which is that Starbucks must decide whether this roaster investment generates returns above WACCC and supports strategic goals such as brand visibility and long-term market uh presence. Yeah, that completes the define and discover stage. Um but yeah, in this so the next stage is represent stage. Um, I'm going to be outlining the analytical approach. Um, and this is, so what I did before I wrote any code was I, uh, broke down what each cell would need. Um, so yeah, let me break down like what the Python code cells what what I was wanting them to represent. Um in cell one I wanted to import the the nump and pandas and encode the financial assumptions the investment amount wcc tax rate depreciation revenue schedule and operating cost structure and working capital. In cell two, I wanted to build a a full revenue and cost schedule um which lays out revenue by year, cost of goods sold, uh labor, rent and utilities, marketing depreciation, uh EBIT, taxes, and net operating profit or after tax. Um and then cell three, I converted profits into operating cash flows. I computed depreciation tax shield, operating cash flow, subtracted um capex, add working capital changes. I added terminal value and WC recovery in year 10. Um and then in cell four I uh I it included um the the reusable functions for net present value, internal rate of return, payback period, discounted payback, profitability uh index and then in in cell five um was the sensitivity analysis revenue minus 20%. So I recompeted cash flows in a downside scenario. And then um in cell six I calculated net present value at WACCC of 6.5% 8.5% and 10.5% plus highmid low revenue scenarios. And then in um cell seven um it create we created a plot graph for presentation clarity. Um but yeah, that's for um for for represent stage. It's about structuring the work before writing any of the actual code, which is why I was outlining all seven cells and not fully explaining it right now. Um yeah, now we can start with the implement stage. So I I'll walk through the implementations and reference the actual code cells. So in cell one uh I just imported and uh made some and used some of the assumptions. Uh here I set up all the the base parameters. Initial investment of 12 uh million revenue for for years uh 1 through 10 cost percentages uh depreciation straight line over 10 years the the tax rate uh working capital. So yeah, this cell really establishes every variable used later. So then um in cell two, this calculates cost of goods sold, uh labor, rent, marketing, uh depreciation, uh EBIT, taxes, and uh no PIT. Uh this builds uh the operating foundation for cash flows. Um and then cell three uh converts operating profit to free cash flow. This cell adds back depreciation, subtracts um capital exponentials and working capital in year zero and adds terminal values plus working capital recovery in year 10. It produces an array of free cash flows for all 11 periods. And then in um cell four um we used it to uh you using the cash flow from the previous cell I computed net present value at the uh 8.5%. Um and then uh internal rate of return payback period which looks at cumulative uh cash flows discounted payback uh using discounted cumulative cash flow and profitability index which is a prof uh present value benefits divided by investment. And then cell five was a revenue minus the 20%. uh this recalculates every cash flow and lower uh revenues and outputs a uh a new net present value and internal rate of return. This test uh downside vulnerability and then in cell six um I computed net present value at 6.5% 8.5% and 10.5%. I also you I also include best uh base and worst revenue cases. Uh this shows margin of safety and then in cell seven um you can see the the this cell plots cash flows over time in a sensitivity chart. Uh this completes the implementation stage. And then next uh let's validate and so in this stage I confirm whether the results align with the the financial in intuition. So, um, in cell four, um, the net present value at 8.5% should be strongly positive. That's consistent with a project generating c high cash flow relative to its, uh, $12 million cost. Uh, the internal rate of return exceeds the WACC. Another, uh, green light, uh, payback, uh, occurs relatively year early for a 10-year project. and discounted payback is is still acceptable. Um in cell five uh the revenue minus 20% uh scenario produces a significantly lower net present value. However, however, the project may still remain uh viable depending on the exact numbers. Um and then in cell 6 WACC uh sensitivity shows the project retains positive net present value even if discount rates rise which validates uh robustness. Uh the visualization in cell 7 um shows steady cash inflows and strong terminal year recovery. Uh all results appear reasonable and internally consistent with uh and align with typical Starbucks unit economics. So uh that's the validate uh model. Um and then evolve in the evolve stage I think about uh this analysis to uh to other corporate analysis uh um uh I analysize uh generalized to the uh other corporate uh finance workflows. So this template can easily evolve into a Starbucks wide capital allocation model, real options model, uh simulation framework using Monte Carlo ranges, a portfolio, a portfolio level return optimization tool. Um yeah, the structure related in cells 1 through 7 make it modular and reusable for other dis uh questionary uh investments across retail, hospitality and food service sectors. So we're reflecting on this assignment which is the reflect stage. Um the driver framework helped to keep this analysis structured and prevented me from jumping directly into coding before uh understanding a problem. The biggest insight is how critical in incremental uh cash flow indication is not accounting profit but actual free cash flow. Another takeaway is that net present value and uh internal rate of return are useful but sensitivity and scenario analysis reveal the true risk of profile. Um yeah most importantly strategic uh considerations such as uh brand enhancement experiential stores competitive presence and optionality often create intangible values uh beyond pure cash flow modeling. Starbucks flagship stores have marketing marketing value that doesn't fully show up in net present value. Overall, the project reinforced both technical modeling skills and strategic financial thinking. Yeah, that concludes the full driver walkthrough, the implementation, the financial evaluation and the uh investment recommendations supported by quantitative and strategic analysis. Um yeah, thanks for watching guys.",
  "video_url": "https://youtu.be/uxw_JUynqCY"
}