{
  "student_name": "None None",
  "org_defined_id": "037337729",
  "username": "skinne36",
  "video_url": "",
  "transcript": "0:00\nHi, I'm Sandy Skinner, and this was\n0:02\nmy mini project three evaluation.\n0:05\nSo for this one, I wanted to go a little\n0:07\nmore in depth and for present value, see\n0:09\njust how much risk has an effect on the\n0:13\npresent and future value of specific stocks.\n0:18\nSo I said to the AI that I wanted to\n0:21\ncreate the simplest possible financial\n0:23\nworkflow that analyzes present\n0:25\nvalue of money based on your level\n0:26\nof risk you take on when investing.\n0:28\nSo we wanted to assume a 2% inflation rate\n0:31\nbecause that's around the inflation rate\n0:32\nthat there's been over the last 20 years.\n0:35\nAnd for the low risk, I want to assume a\n0:37\n5% return on your money, which is the average\n0:40\ntreasury bond, with a 0.5 beta, which\n0:43\nis around the average treasury bond beta.\n0:45\nFor medium risk, I want to assume an 8%\n0:47\nreturn on your money with a beta of 1, which\n0:50\nI looked at the S&P 500 for, as that's the\n0:52\nmarket risk premium, with a beta of around\n0:54\n1 and an 8% average return, roughly. And\n0:58\nfor high risk, I wanted to assume a 12% return\n1:01\non your money with a beta of 1.5, as\n1:04\nthat's around what the average tech stock is.\n1:06\nAs we know, all these AI companies\n1:09\nhave a lot higher returns, but also a\n1:11\nlot more risk associated with them.\n1:13\nSo I said create the simplest possible\n1:15\napp where a user inputs the money they\n1:17\ninvest every year, their level of risk, the\n1:19\ntime period in years, and assumes an\n1:22\ninflation rate of 2%, where the workflow\n1:24\noutputs the present value of their money.\n1:27\nSo, to look at a few scenarios, let's\n1:30\nsay that we are a 16 -year-old who only has\n1:34\n$500 that they can put in every year.\n1:38\nWe want to have some money saved up after\n1:42\ncollege, as obviously we want to have some\n1:46\nsort of capital coming out, and we probably\n1:48\nwant to take more of a risk on our money.\n1:50\nSo, we'll go in here and we'll\n1:52\nput the risk level on high.\n1:54\nand we'll send it and we can see our future\n1:58\nvalue will be $35 .57, $1,007 made in\n2:03\nthat five years and our present value will\n2:05\nbe $32.22 which means we made $700 in\n2:08\npresent value and have some capital saved\n2:11\nup which is an okay amount of money to have\n2:13\ncoming out of college. As we all know\n2:15\nit's very easy to spend money in college.\n2:18\nHowever now let's say this teenager didn't\n2:22\nwant to take such high risk they wanted\n2:23\nto take low risk put this in here and we\n2:27\ncan see that our present value goes up a lot\n2:31\nless it only goes up a hundred and twenty\n2:33\nseven fifty whereas our future value goes\n2:36\nup only four hundred dollars compared to\n2:40\nthat much larger number with the high risk\n2:42\nso we can really see that the present\n2:44\nvalue has a huge impact based on how much\n2:46\nrisk you take however at the same time that\n2:50\n$127 is essentially confirmed.\n2:53\nYou know you're going to make that money\n2:55\nin the present value and that $400 from\n2:57\nthe future value you know you're going to\n2:58\nmake as well, which we can see for a\n3:01\nteenager you probably want to try and make\n3:03\nthat high percentage of money as it's not\n3:07\nit's not worth just making a small amount\n3:10\nof money. You really want to save that\n3:11\ncapital and see if you can grow it a lot.\n3:13\nNow let's look at a different\n3:15\nscenario. A 40 year old man who\n3:19\nhas $15,000 that they can invest every single\n3:22\nyear and they want to save up for retirement\n3:25\nwhich is in 25 years. We'll assume a\n3:27\nlow risk level because this is retirement\n3:29\nmoney and they don't want to lose it. So we'll\n3:32\ngo in here and we can see that the future\n3:36\nvalue is still $750 ,000 which is double the\n3:41\ntotal contribution of $375,000 and the\n3:44\npresent value is still up roughly $80,000 which\n3:47\nis obviously a huge amount of money and\n3:49\n$80,000 goes a huge way towards retirement.\n3:53\nWe can see even with the low risk\n3:55\nlevel, the time value of money shows\n3:57\nthat you can still make a ton of\n3:58\nmoney if you're saving it up that 5%\n4:01\nover years and out doing inflation.\n4:03\nNow say, for example,\n4:05\nthis 40 year old instead wants to have\n4:07\nhigh risk as they like to live dangerously.\n4:11\nNow we can see\n4:13\nthat their present value is $1\n4:16\n,365,354, a massive amount of money,\n4:21\nand their future value is over\n4:25\n$2,240,000, almost eight times the amount\n4:30\nof money that they originally invested.\n4:31\nHowever, that money could potentially go\n4:34\ndown, and we can see that the high risk\n4:37\nobviously returns a lot more money than the\n4:40\nlow risk even though you're taking on that\n4:42\nhigher risk so it makes sense for an older\n4:44\nperson to do the low risk if we were to\n4:47\ngo in here and see medium instead would\n4:53\nstill have a present value of nearly double\n4:55\nour money so to each their own but I like\n4:59\nthat money and I like seeing those higher\n5:01\nnumbers as a 19 year old person so I will\n5:04\nprobably be investing in higher stocks.\n5:07\nObviously, the beta is very volatile, so\n5:09\nit's really hard to predict how the\n5:11\nmarket's going to do. But over time, if\n5:14\nyou keep that money invested and you're\n5:16\nmaking those huge profits and outdoing\n5:17\ninflation, you can see that money will go\n5:20\nup a very good amount in the long run."
}