{
  "student_name": "Ramon Randolph",
  "org_defined_id": "036002798",
  "username": "randol15",
  "email": "",
  "transcript": "So for today's assignment, what we were tasked with doing is evaluating Starbucks investment into a flagship roaster. Um so the first thing that we know is that or our question is should Starbucks accept the flagship roaster requiring 1,200 million upfront uh operating for 10 years and how do we use the whack of 8.5%. Uh the key concepts that we need are our in incremental cash flows, the depreciation tax shield, terminal value and uh WC recovery, our working capital recovery, taxes is 25%, corporate rate. Um and then we need to know our discounting which is 8.5% the weighted average cost of capital and then we need to know our payback uh simple undiscounted payback and discounted payback and that shows our profitability index and our present value of future cash flows. So for our assumption our index capital is 12 million at year zero uh and straight line depreciation for 10 years. Our working capital is 500,000 at year zero and recovered at year 10. Revenues year 1 to is 8 million. Years 2 to 5 is 11 million. Years 6 to 10 is 9 million. Cost of goods is 40% of the revenue. Our labor is 25 million per year fixed. Our rent and utilities are 80,000 per year fixed. Our marketing is 300,000 in year 1 and 100,000 for from years 2 to 10. Our taxes are 25% of the corporate tax. Terminal value is 3 million at the end of year 10. That's our sav salvage value. We're going for 10 years and our whack is 8.5% base and it has plus or minus 2% for sensitivity. And then our strategic framing is that this ro street is both in a financial investment and a strategic bl brand play. Um the financial met metric will tell us whether it adds to shareholder value. uh and strategic items may justify accepting the project even if the net present value even with marginal net present value uh if it unlocks brand and opportunities not captured in the short run cash flows for our represent stage we're going to construct it yearbyear with the incremental cash flows um and then we're going to need the present value using whack and metrics um so the net present value sum of present value IR is just do the standard algorithm simple playback discounted undiscounted cumulative uh and positive or turning cash flow turning positive discounted is cumulative pe present value turning positive and the profitability index is the future present value of future cash flows over divided by the initial out absolute outflow. Um the sensitivity sc tests are the revenue scaled by minus 20% negative 20% so all revenues times8 um and the wack sensitivity as is with 6.5% and 10.5% using the original profile visualizations are yearly net cash flows as a bar graph and then the present value across scenarios as a bar graph. Um and then our deliverables are the Python script and the CSV outflow CSV flows metric and the instructions for the script walk through. Um as we as we have here these are our formulas to calculate all those that we just went over. Um and you can take a look at those but they're present in the code as well. So here we have the implement step for our code and we'll just run this. Um, and so now we're finished. So it's finished running and we'll go over the results in a second, but just for the notes, this is our implement step. Um, and this script builds a transparent year 0 to year 10 cash flow model. calculates net present value IRRa uh paybacks and profitability index and it runs a sensitivity test with revenues uh decreased by 20% and the whack increased and decreased by 2%. Um it produces charts and save the outposts. Um and this is what I had AI create for me. And so we can go over each of the each of the uh functions in a little bit but we'll get straight to the output for this. Um and so these are calculated in the millions. So for year zero our mill our cash flows is 12.5 million. For year 1 it's 1.2 million. Year two 270 million. Year two to year five is 270 million. Year six to year 8 1.8 million or 2.7 million year six to year 8 1.8 million and year 10 it's 5.3 million and the present value of these flows from for year 1 is 1.1 million for year two it's 1.29 million year 3 2.211 million year four 1.95 million year 8 1.8 million or year five 1.8 8 billion. Year 6 1.1 million. Year 7 1.02 million. Year 8.94 million. Year 9.86 million. And year 10 2.34 million. So our performance index is our base whack for for our base whack the net purchase value is 3.02 million. The IRRa is.117. The simple payback is 5.28 28 million and the discounted payback is 8.21 million. For the negative revenues, uh our net present value is or no no yeah for the negative revenues our net present value is -3.16 million and the IR is.031. Uh discount simple payback 9.39 million. Discounted payback wasn't available. Um, whack MPV 4.64 IR 1.7 5.28 7.27 and then for the increased whack or decrease that was decrease whack and for increased whack MPV is 1.63 63 irr is the same as the other ones. Um, simple payback is the same as the other ones and discounted payback is different at 9.17. And what that shows is that for the discounted payback, it actually matters what our whack is, but for the rest of them, it just calculates it. Um, for the rest of them, aside from net present value, it calculates it aside from that. So net present value and the discounted payback have a grip have a good correlation or are correlated in some way. And so our profitability indexes are right here. Um and then so this is our net cash flows as a bar chart. Um and you can just take a look at that. And then this is the sensitivity for revenues or this is the net present value and revenue sensitivity. Net present value sensitivity for revenue and whack changes. My bad. Um and so now that we've gone over the code, we can go back into our validate step. So the checks in I performed were the accounting cash flow. Um and the oh no these are the checks we performed and these are just the numbers. Um and so these are like conservative estimates and they're verified in the CSVs. Um the S sanity checks were right here. Um and the cross scenario is like when revenue is scaled all the dependent engines entries change proportionally and the results remain consistent. Um but the possible limitations the tax model assumes no nol are carried backs or carried forwards. So it it's conservative for the tax shields and there may have been losses elsewhere. The IR return of in it not available as the numerical algorithm used had trouble finding actual route and since NPV is positive IR should be greater than the whack but the AI recommended use computing IRRa via numpy financial and so that's one thing I could have done but MPV is the uh preferred decision metric for prof professional standards um there's no escalation or inflation of cost and revenues model all the numbers are as provided and so I could assume uh real and nominal or assumed growth but I didn't and then the strategic benefits beyond cash flow is the brand halo and marketing are not captured here and that's part of the next section so the validation conclusion is that internal accounting mathematics checks pass and the scenario outputs are consistent with in responsive to parameter changes. The base MPV is fet present value is positive and the sensitivity shows the revenue risk as a dominant factor. For the evolve we have applications for other analysises analyses and the first one we did was project portfolio ranking. So the profitability index allows ranking against other projects with a project index of 1.24. 24. The roster isn't attractive relative to projects with lower or neck or lower profitability indexes or negative net present values but compared to constrained capital budgets. But compare on constrained capital budgets which means that we know uh that the budget for this is 12 million. Like that's what we need for it. But if there's a project that has a similar profitability index with a much lower budget uh like much lower inputs, we should go for that uh project. Um and for our option value, it's a flagship branding project. So the thing that we were talking about last time up here uh with the with the brand halo and marketing value, it's a flagship project. It's the first one that Starbucks is doing and it can have like a very positive impact if it goes well. And so that's what uh that's what that's the intangible benefits that they're talking about like customer value, lifetime value uplifting, brand equity, and higher store sales elsewhere. Just people knowing that Starbucks is doing this and that Starbucks is making its own coffee could be a very good selling point, especially if they do it ethically cuz ethical consumption is a big thing now. So if they're using the beans farmed ethically or getting it from uh their theirelves or their want to say it's organic, they could do a bunch of marketing through this uh value option or through this um through this marketing play that actually increases the the stability of the brand in people's minds. Um and so the optional strategic benefits might justify accepting an otherwise marginal project. So, like I said, the outside benefits aside from money might justify this project and that though those outside benefits will bring more money in the future. Um, the real options is given potential uncertain uncertain revenues, Starbucks could stage investments. So that just means instead of dropping that 12 million in there, uh they could go say 3 million here, 3 million here to get like a very low effort, not low effort, low investment, low involvement, uh sort of preview of what this project would be like. not making their own uh not completely making their own roaster, but sort of investing in somebody else's roaster, buying a part of that roaster and running it and seeing how that works and how they can market that decision and then maybe going up to 9 million to get that to kind of scale it further after that going to the full 12 million and getting their full return on investment from the brand politics that they want to use for it. Um like it says incorporate expansion of options if early performance is strong reduce downside risk. So sort of just incremental steps like that 3 million, 6 million, 12 million or whatever it takes. Um and then so the risk management management the sensitivity suggests prior prioritizing mitigation on topline risk. So we knew we knew uh that instead of like the the revenue is a big risk in this. It's a marginal project but if you market it well enough the revenue doesn't become the main goal of it like we said before. So marginalizing that topline risk could include pre-launching marketing set partnerships or reserve capacity for special events to increase utilization. So like making a special coffee brand for Christmas or whatever, making a special bean roast for Christmas or um sort of like we said before with that incremental investment, investing in somebody else's owning a part of somebody else's roastery. So that partnership aspect of it and those pre-launch marketing commitments, sort of the the um ethical roasting and all of that. Um and then for our last one, it's capital structure interactions. So it assumes the project is financed with average company financing. So if Starbucks should do this differently, they can finance with cheaper debt or adjust the discount rate accordingly. So basically getting a better loan. Um, and these are some of the options that the AI suggested as a better uh a better or not a better a another way to sort of visualize the these evolved scenarios. Um, and so for the reflect the investment decision making and financial recommendation. Um so the BV the best case NPV or base case NPV is positive 3.2 million 3.02 million using the whack. Um the project so sensitivity to revenue a 20% decline converts to negative NP net present value. So that that revenue risk is very very significant. Even just a 20% decline. Well, 20% is pretty significant when you when you're moving at 12 million, but that 20% decline, that 210 decline can make the project go negative more than you would have made even if it was positive. But the non-financial strategic factors are the main point of are one of the main benefits of this that flagship grocery bring bringing B brand uh experience benefits like the marketing and the product development and PR which are not in those cash flows and they could add to cash flows after as a sort of uh as a brand loyalty argument. So the recommended case is accept on two conditions. Uh proceed with the given base case MPV using the company's given whack and the project uh project appears to create shareholder value under those assumptions. And then the second condition is to manage topline risk before the final approval require the met revenue mitigation sort of the pre-opening commitments the bud marketing flexibility and then the the incremental incremental investments because of 20 short because of this shortfall that that 20% re revenue change creates. Um and so the rationale is pretty simple. Positive MPV and project uh project um what is it? Profitability index. Oh yeah, positive NP net present value and profitability index above one combined with the strategic branding benefits justify this acceptance. Like I said before, all the benefits outside of the money are what really make this such a good investment. Thank you. I hope you learned something about uh MPV and uh and the benefits of financial investments outside of the financial returns",
  "video_url": "https://youtu.be/YT49iTUDRFU?si=Mj25RLORvhVYp6oR"
}