{
  "student_name": "Max Bradford",
  "org_defined_id": "036043612",
  "username": "bradfo27",
  "email": "",
  "transcript": "Hi, this is Max Bradford and today I'll be walking through my Starbucks roaster analysis using the driver framework. So, let's get started. So, Starbucks um so for define and discover, Starbucks is considering a $12 million investment in a flagship roaster with a 10-year operating horizon. Starbucks's hurdle rate is an 8.5% weighted average cost of capital. So the central question is whether this project creates value for shareholders or not. Before modeling, I identified all required components as you can see here like revenues, operating costs, depreciation, taxes, working capital, and terminal value. As you can see here, I also confirmed um straight line depreciation in the specific marketing cost pattern. Um so these discoveries frame the entire analysis. Moving on to represent. Before writing any of my code, I structured my analysis into a full incremental cash flow model for each year. I planned to compute revenue, cost of good sold at 40%, labor, rent, marketing depreciation, taxes, operating cash flows, etc. Um year zero includes the initial investment and working capital and year 10 includes both the terminal value and the working capital recovery. I also plan to calculate MPV, irritability index, simple payback, discounted payback, um, and run sensitivity tests for revenue, um, declines and weighted average cost of capital shifts. After outlining all the logic, uh, I was ready to implement. So that's takes me right into the next stage of the analysis here is implement. So here I run my Python code. I begin by defining all project parameters in a dictionary. So the model is fully flexible. Then generate year 0 through year 10 cash flows including depreciation and tax effects. I'll just show you here my output. So the model calculates MPV using Starbucks's 8.5% weighted average cost of capital and also computes IRR profitability index and payback periods which you can see here I'm circling. I then run the sensitivity analysis by reducing the revenue 20% and adjusting weighted average cost of capital up and down by 2%. Um and then finally the script um generates visualizations of year-by-year cash flows and MPV sensitivity to weighted average cost on capital cost of capital. Moving on to validate. The model produces consistent and intuitive results. The project's MPV is positive around3 to4 million. Um the IRRa exceeds the whack. The profitability index is above one and both payback measures fall within the project's 10year life. So sensitivity outputs show that revenue assumptions are the most significant driver of valuation uh and that MPV remains positive even if whack increases moderate moderately. Going on to evolve from these results. Starbucks should pay close attention to revenue forecasting especially after year five. Um, as you can see here, kind of dips down a little bit. Um, operational risks such as labor shortages, tourist demand variability, supply chain disruptions, uh, and construction overruns should be actively managed. Because the roaster also carries strategic upside and brand visibility and premium customer experience, Starbucks can enhance returns through exclusive offerings, bundled experience and merchandise. So that's just one way they can kind of evolve. And then finally for reflect using the driver framework ensured a disciplined analytical process defining the problem clarified the objective. Um representing the model ensured transparency before coding and then imp implementing produced reliable outputs. Um validation confirmed economic realism. Um and then evolution identified managerial insights and reflection um reinforced best practices and capital budgeting. So based on all my evidence, the Starbucks roaster should or the the Starbucks roaster project should be accepted. It generates positive MPV, clears the IRR hurdle and strengthens the brand um in strategically important ways. So thank you for listening.",
  "video_url": "https://drive.google.com/file/d/16eFRbq55RidJ2-oxXU29mQYS1IZoZojM/view"
}