{
  "student_name": "Nick Sikorski",
  "org_defined_id": "037205859",
  "username": "nsikorsk",
  "email": "",
  "transcript": "Oh yeah, so for starters we have come over here, we used a little help from our AI. So our original issue was if GME or GameStop traded at 4 cents in August 2020. So that was the claim made. We did some further research, I looked through Yahoo and it reset on me. But we have all the August prices here, this value is the lowest prices. So we see in August the lowest it goes down to is a dollar. So we see this is also not right. I also used just a normal chat box and it's telling me it's a dollar sixty seven. So regardless, I'm sure that the 4 cents is probably not right. According to Yahoo it was lowest at a dollar on August 3rd as we can see here. So that's the number we're going to use. So for our discovery we have GME traded at .4 cents. Our AI said the low in April is down 2.57 but we're just going to use 1 for argument's sake. The closing price did increase a little bit, we saw that. So AI is not fully wrong. Let me GME price surge to .483, accurate. Short interest peaked at 140% of flow, accurate. Melvin Capital sustained a 53% loss, we have accurate. The Melvin Capital lost 50% on its portfolio in January 2021 due to the squeeze. Acquiring a 2.75 billion capital injection which is absurd, that's an absurd capital loss. And then analyst fundamental value estimates 10 to 40 bucks and our AI says it's generally accurate. It estimates we're in this low range, maybe on the lower end closer to 10 than 40 but the range stands nonetheless. Don't need that, that's not right. Let me go down to our represent, we've already discovered, we've already done our looking around. We have our EMH test which is our efficiency market hypothesis. So we're going to analyze how the price surge to .483 for exceeding the 10 to 40 dollar fundamental value relates to the information that is publicly available kind of at the time. So let me go down, I mean they have some things in short interest around Cohen's stake but we'll get into that later. So our rational profitability is to determine if the profits were a result of systematic risk adjusted strategies based on fundamentals. So rational investing or non-systematic events even exploiting a market structure kind of anomaly or something that's not very likely to happen which is a short squeeze. So we're going to use behavioral finance concepts to explain the observed price deviation that the traditional EMH cannot account for. So let's implement a little bit. EMH violation analysis. So the GME short squeeze as we know exposed the violation of the semi-strong form of EMH as the weak form efficiency is potentially violated because the short squeeze was initiated by analyzing publicly available past market data. So the extremely high short interest and low flow to identify a technical vulnerability. So thousands of retail investors systematically profited basically by exploiting this public technical data which then suggests that prices did not fully reflect historical information in an efficient manner. So it's kind of a non-fundamental strategy to get short term returns. So weak form efficiency may be violated. Non-form efficiency or public information is clearly violated because the public information about the company's poor fundamentals then lead to the 140% short interest and the Ryan Cohen activist investment. These things were all known. So the market's inability to price kind of the short squeeze risk because it's obviously a very risky stock. They thought it was going to go bankrupt with how low it was even though it wasn't 4 cents until it was artificially triggered and then a subsequent price spike shot up to 483 which is way over the fundamental value which kind of demonstrates the catastrophic failure to efficiently incorporate all public information onto the stock. Then we have strong form efficiency or all information which is not really applicable because the event was kind of driven by publicly decimated information, not kind of inside information or insider trading or things of that nature. So then we'll go down to profitability for rational investors. So rational investors could not have systematically profited based purely on fundamental analysis because the short sellers, Melvin Capital and other short sellers, were the rational fundamental investors betting against the obviously weak company near bankruptcy as the analyst target $10 to $40 is their worth. So their losses of 53% show that a rational systematic strategy was kind of severely punished by a technical market anomaly. So gains, the immense profits were generally generated by non-rational speculation and coordination because an investor acting rationally would have sold long before the peak because based on the fundamental target value it's way below missing the bulk of the squeeze gains thus making the profit non-systematic because it relied kind of on a one-time non-repeatable event which is a retail-driven coordination effort to exploit a structural flaw. So the price should reflect fundamental value. The price surge obviously doesn't exceeding all fundamental value. And this is kind of not a normal investor behavior, not really a company value. So markets, we kind of see with trading, markets are frictionless allowing full trading at all times. Trading restrictions were implemented by brokers physically preventing trades at the peak of the volatility. This proves market frictions can and do override the smooth function of price discovery. So it's saying all these people were looking to coordinate at the same time and this is saying that things like Robinhood and other online trading websites don't let you trade when the stock proves too volatile. And then investor behavior, investors are rational and this was kind of rational is basically what it's saying. What happened? So let me go down to behavioral finance explanations for anomalies. So the squeeze anomaly is best explained by behavioral finance framework. So herd behavior is the sheer volume and speed of buying was due to thousands of retail investors acting in concert driven by kind of a social proof and centralized narrative on a Reddit forum actually. So it seems like, I actually watched a documentary about this last year where all these people on Reddit just got together and decided to all just speed buy all these stocks at the same time to drive up the price. So we have narrative bias which is the stock became a social clause giving kind of the traders a non-financial incentive to hold their buy which kind of kept the price inflated more than it was worth just because people like an underdog story is basically what it's saying. So we have framing and availability heuristic which is that the 483 price was amplified by media and social platforms like Reddit making high speculative returns seem more likely and motivating. So this kind of just furthered the more rational buying of GME. And then obviously the short squeeze risk because the market mechanism itself became the anomaly and kind of the obligation of short sellers to buy back shares was kind of exploited because no one wants to buy back these shares at such a high value. Kind of temporarily turning a fundamentally bad stock into an exponentially rising one at least for the short term. So I'm going to validate the price disconnect. Obviously the price reached 483 which is a massive disconnect from the fundamental value of 10 to 40 that we originally stated. There's a short seller failure with Melvin's capital 53% loss which kind of confirms that traditional rational strategies failed in this anomaly instance. And then regulatory action, the congressional hearings and trading restrictions confirmed the highly abnormal non-efficient nature of the event which kind of drew scrutiny to market structure itself because these people just exploited this one stock based on a Reddit post which seems a little easy to start affecting markets and creating uproar within the economy. So it's kind of crazy how much scrutiny and how they had congressional hearings based on a bunch of Reddit users all buying at once. And then we see that the EMH framework needs to evolve to integrate these anomalies. The event that GME had suggests the market structure is susceptible to crowdfunded manipulation like we were just talking about, exploiting flaws in mass communication, it could be via social media or anything, which kind of requires a hybrid model where efficiency varies over time based on market conditions, investor psychology, and available technology, social media like we talked about before. So in all, to reflect, the GME short squeeze strongly suggests that markets are not semi-strong efficient when a structural flaw, like a 140% short interest, is identified and exploited by coordinated behaviorally driven capital. So these anomalies are not evidence against the entire concept of market efficiency, but rather demonstrate that the market structure kind of does have critical points of failure that allow behavioral forces to dominate these sort of rational pricing mindsets, particularly with the advent of low cost, social media fueled retail trading like GME. Thank you and I hope this was educational.",
  "video_url": "https://www.youtube.com/watch?v=YcS1SRgZKgc"
}