{
  "student_name": "Qianyue Wang",
  "org_defined_id": "034658523",
  "username": "wang5687",
  "email": "",
  "transcript": "Hi, this is Tang and this is my session 8 assignment and in this assignment we will investigated market efficiency using the GameStop short squid event of 2020 to 2021 as a case study and in this case we will verify the accuracy of stated facts analyze price behavior rel to efficient market hypothesis predictions and eval evaluate whether market anomaly uh constitute evidence against the market efficiency or can be explained within the exist existing framework. So the first critical step is that we need to verify the statement gametop traded at 0.04 in August 2020 against the actual history data. If incorrect document the accurate figures and determine appropriate communication approach for corre correcting the professor. So here are some K timeline August 2020, September 2020, January 2021, February 2021 and present and also we have some key data points and here are the required analysis. These are all documented in the collab and now let's started with the stage one define and discover. So what is the problem? What we need to analyze this? So we want to understand if markets are really efficient. So an efficient market means prices already reflect all available information. So no one can systematically beat the market. So now GameStop GME became famous in early 2021 when small retail investors on Reddit drove its price from under 20 to over $480 in just a days. So many people claim this should markets are in rational. So in this uh assignment we will test whether this event quality is the efficient market hypothesis. So here are some key research questions. So was the statement uh GME traded at 0.04 04 in August 2020 is correct. And how did GME's price respond to K public news? And did price adjust quickly and rationally or did they overreact? The fourth question that could rational investors have made systemat have made systematic profit. Here is the bas what is em basics as I will make you better understand in plain English. E image has three form uh three forms which are weak form, semi strong and strong form and data we will use is Yahoo FMS and the timeline is August 2020 to present and K events we have mentioned in this previous uh previous uh sale and for the hypothesis we want to present either the prices in August to 2020 already reflected knowing fundamentals and five specs in January 2021 caused by social media attention. This is a begiver of uh uh action and the third one is abnormal returns and run event. So this is possible semi strong from val valuation. So let's uh represent our uh our steps. The first one is verify data accuracy. Second step is collect and clean data. The third one is to mark event dates. The fourth and five is like about build a model to learn about model normal returns and compute abnormal returns and six and seven to analyze and interpret our results and make some reflections and conclusions. So we will use pattern for data handling. Here is the charts we used. for the some specific dates we can use the data and also we will analyze Yahoo Finance to verify whether the GME traded between traded at 0.04. So from from that we can see that after verifying the Yahoo Finance data GME traded really between like 1.04 to 1.79. So closing at uh 1.67 on August 30th. So this is equals to roughly 6 to7 pre-split. So meaning that the statement that GM traded at 0.04 is inaccurate. So this is the number is completely wrong. And the fourth step we need to define the key event and make the quick charts for our analysis. We now answer the question one that the statements is incorrect. So how did Jy's price um respond to that and now we will make the use Python to analyze the data and here are some specific steps. First is rename columns join gy data flatten column index and make sure adjusted close columns exist. This is all about present data. So I will scroll down quickly. Yes. So the most important part is about the result and the charts. So from the charts we can see that before September like 2020 the GMA traded at only about1 to2 I think yeah so very low because the firm was struggling financially and after the stake event the price begin to trend upward showing that the market quickly incorporate new positive information. So we can see that after the artistic event. Yes, it's about 2020 September. Yeah. So the huge spike in January 2020 is abnormal like prices jumped far beyond any change in fundamentals. Yeah. And this is where the behavioral factors like the social media have and her behavior and formal dominated the rational valuation. And after February 2021, the price gradually declined as steep stabilized. So showing that the press eventually converted and toward more reasonable levels once like excitement faded. So this is about like how the uh audience reacted to the social media and now we will make the market model and abnormal return analysis. So this section will test whether GM prices change around each event and they are larger than would expect from normal market movement. This is all code we need to use. Let's scroll down also we will run for each event like the t test. So that that will have have better to interpret this and here is a summary. So the st from that we can test that the our chart this is also what the chart suggested the gim stop event was not a failure of all market in fishing but a temporary behavior of anomaly via social trading and structural limit overpowered rational press discovery and we I will explain that in the in the next stage validate like when you look at the P value we can see that RC board pig the econ they are not very significant like to the whole model I think so about this economic size of abnormal returns were large like especially during the January 2021 short squeeze P values above like 0.05 05 indic that all these event were not stat statically significant when tested against like random daily variation. So this means that the market's volatility was too extreme to confirm the consistent principle of normal returns and this funing suggest a temporary inefficient not a structural breakdown of image. So we can see that it's it's not like a very normal uh situation or is this very rare for the market. So for that we can interpret pre for the each event we can see that for the September 2020 stake the market adjusted normally but for the January 2021 broad news this is a overreaction but for the January 27th to 28th restriction we can see that the panics and it reflects the panic and limits to uh arbitrage. So we can see that the practice reacted far more than fundamentally justified. So we can see that information not processed inflationally which means not not all the investor in the market will get to know this information earlier and the her behavior and social media attention causes temporary like missing pricing. So still for so still no clear evidence anyone could systematically profit once trading limits risk and timing to consider. So now let's go to the evolve stage. So the goal is to apply what we learn to understand how investors and analysis and regulators can evolve in response such like market anomalies. So for the for the investors so we don't confuse popularity with value like high trading volume volume or like Chinese stocks don't guarantee subst subst sub substant of gains and the dy dy exposure like the behavioral shocks are unpredictable like passive index investing often outperform emotional timing. So I think that this for if for now like if we want to use baseline like analysis this time we are this is not work. So we will also for the investors we will be aware of like liquidity risk. There will trading platform restrict activity even profitable position can be like executed and also for the regulators like ensure fair market access trading restrictions. disproportionately affected retail traders but I think like as we if we want to reinvest there's not all we can guarantee that so improve transparency that's very normal for I think it's for all industry like also we they need to monitor like the social mediadriven volatility like price for like Reddit and Twitter X and other platforms like for I don't know like for ins or Facebook also like YouTube if you want to like upload some videos or for some like influencers they upload some video they can amplify the price distortions faster than the traditional media since like the development of nowadays social media like also for us we we need to integrate behavioral finance into valuation models like MH alone cannot explain rapid uh crowd driven. So for now for the reflection part as a beginner for the for nouns analysis we I learned that market aren't perfectly efficient like humans and technology both affects prices and now I think this is more about like behavioral economies or be finance they can this this topics or this kind of license can explain real worlds better than serial loan and image is a baseline over long periods it's mostly hold but sheltering emotions break it also data ver verification methods like small errors can ruin an argument. So critically some takeaways that for the ital form a weak form not clearly violated a semi strong form that's validated short-term reaction to the news and the strong form no proof anyone used inside info to win consisting so now I think that if still we need to have the transparency and better education a cap of an investor to avoid panic and also we we know that the whole case or whole like the market we cannot it's not easy to predict. So that's all for my session 8 assignment. Thank you for watching.",
  "video_url": "https://youtu.be/2xgjyIRgooQ"
}