{
  "student_name": "Ryan Cairo",
  "org_defined_id": "036112967",
  "username": "rcairo",
  "email": "",
  "transcript": "This is for the session nine assignments which is the cost of capital analysis. So we were to calculate the whack which is the weighted weighted average cost of capital um for Netflix in connection with the hypothetical $5 billion content investment decision. Um so we were given these parameters these market conditions the strategic content context and the required analysis. So before even starting anything I had to define and discover. So the hypothetical Netflix parameters. So we needed to make sure we knew these. Um so these were put into um the collab here. Uh we needed to know the market conditions. Um same thing here. And then we needed to know the strategic context uh for answering uh comparing Netflix cost of capital to industry uh peers for example Amazon Prime uh Disney uh and Disney. Um so then we also needed to calculate um whack capm cost of debt debt uh equity mix and tax shield effect. So basically we put all of the givens into here. And for example, the cost of equity is um the risk-free rate plus beta times um RF or RM minus RF, which is the market risk premium, which that came out to about 1 165. Um and the after tax cost of debt is uh 0.0458 04 58 which is done by taking the uh bond ratings yield which is the KD pre-tax variable and the corporate tax rate which is um 21% which is the tax rate variable and it's used by uh taking this number which equals um KD uh pre-tax times 1 minus the tax Right. Um following that you need to define WE and WD which is equity weight and debt weight current of each. Um which is done by taking total capital equals market cap plus debt uh market value and then weight equity equals market cap divided by total capital. And weight debt equals debt market value uh divided by total capital. Um and then calculating the whack, you need to take that which equals the weight equity times uh K uh which was found up here cost of equity plus weight debt times KD after tax which uh that comes out to about.1122. Um yes and then so all of that is given here. I wrote all this down. The the whack formula and its components the uh cost of equity using CAPM is is this equation here which ended up getting uh 11.65%. Or.1165. The cost of debt is KD pre-tax times 1 minus tax rate which is 4.58% or 0.0458. Um so that answers these qu this question here. Um following that the capital structure analysis understanding the debt to equity mix and its effects. Um after issuing an additional $3 billion uh dollars in debt, Netflix capital structure shifted from 92 shifted to 92.59% equity which is right here using this equation here. um and uh 74 one% debt um which is which uh resulted in a slight decrease in in whack um in in indicating a move towards uh potentially more optimal structure after issuing an additional $3 billion in debt. Um and then following that the the tax um shield effects or I'm sorry comparing comparing the Netflix cost of capital to industry peers using whack is done here. uh given these given um right here whack 8.2% for Disney's capital structure and Amazon uh Amazon's given those up here. Uh I ran this through Gemini and it came out with the this comparison. Um so Netflix's current whack versus its benchmarks. Um Netflix's current whack is above the media industry range. Uh it's higher than Disney's whack and higher than Amazon Prime's. And then the new whack um given the $3 billion uh additional debt, it's the same thing. It's above media industry average. It's higher than Disney's whack and it's higher than Amazon Prime Videos. with this could the potential problem with this could be that it's a uh for investors it's a higher risk profile as Netflix's weighted average cost of capital is consistently above the industry average um and uh equity it's an equityheavy uh capital structure um and the okay so the the tax shield effect is essentially Um the the one minus tax rate factor which in this case is uh 0.79 uh directly quantifies the tax shield benefit. Uh it shows that only 97 or 79% of the pre-tax uh interest cost is effectively borne by the company uh with the remaining 21% being offset by tax savings. um which makes debt a cheaper source of financing compared to equity where dividend payments are generally non tax deductible. Um and then finally the whack as a hurdle rate. Um the weighted average cost of capital which is whack acts as a minimum acceptable rate of return or the hurdle rate for new investments. uh projects with expected returns below the whack should be generally rejected as they would not uh generate enough to cover the company's financing costs. So that is my session nine assignments.",
  "video_url": "https://youtu.be/iuCrM_DKClE"
}