{
  "student_name": "Ethan Sleeth",
  "org_defined_id": "038097599",
  "username": "sleethe",
  "video_url": "https://youtu.be/PjDGMSv5XOc",
  "transcript": "🎥 AI Investment Memo Generator – Demo Script\nOpening (15 seconds)\"For my Session 13 project, I built an AI-powered investment memo generator.The goal was to solve a real problem: analysts and founders spend too much time writing first-pass investment memos from scratch.\"\nD — Define the Problem (20 seconds)\"In finance, investment memos are required before any deeper diligence, but they're repetitive, time-consuming, and inconsistent across teams.The problem I wanted to solve was: how can we turn raw financial inputs into a clear, professional investment memo instantly?\"\nR — Represent the Approach (25 seconds)\"My solution is an interactive workflow built in n8n that uses the OpenAI API.Users submit structured financial inputs—like revenue, growth, margins, valuation, and risks—and the AI generates a full analyst-style investment memo.\"\nI — Implement (Live Demo) (60 seconds)\"I'll show how it works.\"\n(Pause briefly)\"I start by sending a request to this webhook with basic company information.This triggers the workflow, formats the inputs, and sends them to the OpenAI model with a structured finance prompt.\"\n(Scroll to output)\"The AI then generates a professional memo with a business overview, investment thesis, valuation logic, risk assessment, and a final recommendation.\"\nV — Validate (20 seconds)\"I tested this with multiple hypothetical companies and shared the outputs with classmates.The memo changes meaningfully when I adjust growth rates, margins, or valuation assumptions, which shows the AI is reasoning from the inputs rather than returning canned responses.\"\nE — Evolve (20 seconds)\"If I continued building this, the next features would be automatically pulling comparable company multiples, exporting the memo as a PDF, and adding bull, base, and bear scenarios.\"\nR — Reflect (20 seconds)\"The biggest thing I learned is that building with AI is less about code and more about system design.Prompt structure, input clarity, and workflow reliability mattered more than adding complexity.\"\nClosing (10 seconds)\"This project works end-to-end, solves a real financial problem, and demonstrates how AI can be used as a practical tool in finance—not just a chatbot.\""
}