{
  "student_name": "Siri Surapaneni",
  "org_defined_id": "037411103",
  "username": "surapan2",
  "email": "",
  "transcript": "Today we are going to go over our 10th weekly assignment. The way we're going to approach this assignment is we're first going to explain the problem, give you my final answer, then continue on to the driver framework to guide our analysis and our process and then throughout that process we will also show the code the output and explain the mathematical and financial concepts a bit further. So the first the problem I have it restated in the define discover part of discover. The problem statement was Starbucks management needs to decide whether to approve 12 million capital exponential for a new flagship roaster. The core objective was to to determine if this 10-year project will guarantee return sufficient enough to justify the initial investment and associated and its associated risks given a WACC of 8.5%. The decision criteria was based on a few different financial metrics. That net present value being positive, their internal rate of return being greater than the WACC of 8.5%, the profitability index being greater than one, and if the discount and payback period is acceptable, less than the 10ear project life. And then here, where I won't list these all out, but here are our key inputs and assumptions, the different values we were given. The initial investment was $12 million, and so on and so on. I won't go further into that. Then the initial risk assessment was the primary risk is a revenue forecast. Market saturation years 6 to 10 and the initial ramp up year 1 are key assumptions. Therefore a sensitivity analysis on revenue is critical. So given all that pearl information from the textbook, my final answer through my analysis is to accept the project. The proposed 12 million investment in a new grocery and flagship store is financially viable and strategically sound. The project is projected to generate an MPV of 2.69 million which is positive which is what we wanted and the internal rate of return is 12.84% which is also what we wanted. This recommendation is based on the MPV like I mentioned the IRR but also the profitability index as it's 1.22 which the goal is to be greater than one. So the showing the project returns $122 and present value for every $1 invested which is a positive sign and also the discounted payback period 8.2. 21 years is under that 10year project life which is again what we wanted. So while this project is sensitive to revenue requiring only a 9.32% drop to become unprofitable unprofitable it's positive base case performance and significant non-financial strategic value provide a compelling case for acceptance. Now that I told you my final answer let's go back into my process and analysis. So the R and driver framework is represent. So the analytical model I used throughout my analysis is a 10-year pro fora free cash flow FCF model for years 0 to 10 and that was constructed with using various formulas in the code. So I'm going to explain that math and that for core formulas first. The EBIT earnings before interest in taxes is revenue minus cost of goods sold minus labor minor minor minor minor minor minor minor minor minor minor minus rent minus marketing minus appreciation. The operating cash flow is the earnings before interest in tax value times one minus tax rate plus depreciation. The after tax terminal value was based on a few other values that need to be first calculated. The book value which is initial investment minus depreciation time 10 which was zero. The gain on sale value which is a terminal value minus book value. So that was 3 million. and the tax on grain value which is the gain times tax rate which is the 3 million times 0.25 which gave us 0.75 million and the after tax terminal value which we wanted is the terminal value minus tax on grain which ended up being 2.25 25 million. Now for the free cash flow FCF series, FCF of zero is initial investment minus working capital. The FCF 1 through 1 through 9 was the OCFN part of our code. And the FCF 10 of 10 is the OCF of 10 plus after tax terminal value plus working capital recovery because that's the last year in our project timeline. Now for the other metrics calculations, the important ones I mentioned before, MPV and that's the sum of the FCT of T / 1 plus the WACC to the T power for all the years 0 to 10 the IRRa which is a discount rate and that's found using 0 equals the sum of the the MPV. The profitability index was found using the present value of future cash flows divided by initial outflow. The payback period was the time to recover the initial outflow using nominal undiscounted cash flows which I'll show in the code. And the discounted payback period was the time to recover the initial c outflow using present value discounted cash flows which was a different part of the payback period discounted payback period. And I use Python to implement my code which is the I part of driver and I used the numpy financial pandas and map plot lib libraries. At this point, I'll take you to the Google Collab and explain my code a little little bit further. So over here, you can see I have a bunch of libraries installed to help me do the mathematical and financial calculations I need for this project. And I defined all the base parameters. There's a lot of different parameters for each year and the revenues per year, the marketing costs, and so on and so on. The second part of my code was the core function to calculate the free cash flow. And here you can see all the different values being calculated and then also using the raise for cost that are constant from year one to year 10. Oops. Let's fix that. Okay. Now we calculated the earnings for interest and taxes. The formula is the same one I mentioned in my notes just in code format. Same thing with the rest of the formulas. the operating cash flow and the other formulas too. Let me scroll down. Out of the different values here. And then we have this function to calculate all the metrics. MPV, IR, profitably profitability index, and the payback period. And with the libraries I downloaded, there are specific MPV formulas and IR formulas which made the coding very easy for this project and um made it very understandable to the user. But here we have the payback periods. And here we have a table with all the numbers and formulas tagged. And then we have all the metrics printed out. And then here we have a sensitivity and scenario analysis which again always helps evolve the E and driver evolve. Always helps evolve our code and see how flexible it is to change. We have a WACC sensitivity which I'll explain this further when I show the outputs. But here's the code for that. Um, and the code is almost done. Let me scroll down a little bit. We also had a best case, base, worst case scenario, which another was another way for me to evolve my code and makes it easy for someone else to understand and also see the comparison between the different ideas. We have that again in a table. Then we also have a break even revenue analysis. Very important. it see you can see here uses the MPV for that calculation which is a common financial measurement and then let's scroll down a little bit more we also have our graph here the code for the graph so here are the tables we were talking about so let me go through this the output more deeper Okay, now that I show you the output, let's go through it. It's the base case analysis. One second. Let me first run the code again. Oh no. Yeah, it's running. Okay, we're going to run the code one time through so you can see the code run and the output. Oops. Just a quick little debug. Okay, the code's all good. Here you can see what I was talking about. I'm not sure what happened previously, but this is the code that we want. The profitability index is 1.22 years. The payback period is 5.28 years. The discount payback is 8.21 years. Those are all the values I mentioned in the beginning final answer. But here we have more information that we can really dive in deeper and analyze. The sensitivity and scenario analysis. The scenario one is a revenue downside of 20%. And that resulted in an MPV of negative over 3 million and IR of 3.3% 13% sorry and and that those both those values are lower than the MPB and IR for the base case financial metrics. And now for scenario two of a WACC sensitivity of plus or minus 2%. So with the minus 2% that gave uh WACC of over 4 mil of the 8.5% MPV at 8.5% that gave the WACCC of 2.69 mil and then for the MPV at 10.5% that gave so the plus 2% that gave only um an MPV of 1.3 million. As you can see, as MPVS are at higher percents, the WACCC's decrease and that can also be seen in this MPV profile in measuring its sensitivity to the WACCC. As you can see, the discount rate decreases as a net value increases. So now for scenario three, comparing the best, base, and worst case, the worst case is a negative over 3 mil. The base case is a 2.69 69 mil and the best case is the 8.2 mil and the IRS are 0.2 0.13 for the base case and 0.21 for the best case and then the payback is 9.56 which is very close to 10 years for the worst case and then base case 5.28 28 and best case 3.91. And then scenario four was the break even analysis and that's when the MPV equals zero and that's when the base revenues are reduced by 9.32% with the break even a revenue multiplier of 0.907. Now going back to our charts with the revenues for years 0 through 10. I just wanted to mention a few things. I mentioned all the key findings just now but this is important. Obviously, we have our normal cash flow statement with the revenue, cost of goods sold, labor, rent, utilities, marketing depreciation, earnings before interest and tax, tax, the NOAT, operating cash flow, capital expendenture, WC change, after tax, terminal value, and free cash flow. This is such an important part of financial math as all our values are shaded in one place. And as you can see in year zero, the only values here are a negative capital exponential and a negative WC change. And those values are zero up until year 10. But for year 10, the capital X venture is still zero, but the WC change is 500,000, the same value as year 1, but positive. And that's where the after tax terminal value comes in of 2.25 25 million and the free cash flow of year 10 is 4.55 million. But the rest of it doesn't really need to be mentioned that much detail. You can see here the revenue increases from 8 million to 11 million in years 2 through 5 and then decreases to 9 million in years 6 through 10. And then the other values change slightly, but I mentioned the the most important ones. But that analysis was very detailed and clear. But I'll explain it more in detail throughout the rest of my analysis. But for the validation part of the driver framework, the MPV was greater than zero. Yes, it was 2.69 million. Was the IR better bigger than the WACC? Yes. 12.84% is bigger than 8.5%. Was the payback period greater than one? Yes. Well, sorry. Was the profitability index greater than one? Yes, it was 1.22. Was the discounted payback greater less than the life? Yes, it was 8.21 years less than the 10-year life of this project. So, all the financial criteria for acceptance are met and we were able to accept our plan. Now, for the evolve, the different parts of my code, it was a very lengthy code, but it was able to give different parts and show different parts of our analysis and gave us better insight for various metrics. So one of the sections was the revenue sensitivity this project critical weakness and that's why we wanted to analyze it more because that's where this project lacked not necessarily the basic financial metrics and as you we were able to see a 20% drop in revenue is cat catastrophic resulting in negative MPV of over $3 million which is obviously not something we like to see the break even also the break even analysis confirms revenue only can only fall by 9.32% from the base case forecast before the project restories value and that means having an MPV of less than zero and that's not a lot that's not a lot of that's not a lot of margin. The WACC sensitivity showed this project is robust against changes in the discount rate. Even if the WACC rises by to 10.5% the MPV remains strong still a positive million value and that's something that is positive. The scenario comparison of the base worst and best case showed extreme volatility. The worst case scenario again with negative $3.69 million FPV is a significant loss while the best case is over $8 million and that's ex exceptionally profitable and that highlights that this project is a high-risisk high reward venture heavily dependent on meeting sales targets. Finally, for the reflection part of our dire framework, there's so many different financial concepts that are very important in this project when it comes to MPV and IRR that's used very often in my major actuarial science. That's the premise of our financial math. And that was very important and a big thing I saw applied to different context context here. And again, we're finding final investment recommendation accept the project. The quantitative rationale is the best case and analysis is strong. The project generates 2.69 million in value for shareholders and clears the 8.5% hurdle rate IR.84%. And all the primary financial metrics are positive. But now the risk assessment and mitigation. The primary risk is that this project is highly sensitive revenue. As we saw that break even point at only a 9.32% revenue reduction. The worst case scenario is severely negative. So it's very important to consider even though the values we are calculating are good values in our ranges we want. Now for the mitigation the high traffic premium location and the 300k year one marketing budget are the primary mitigation strategies. Management must be prepared to react to the year revenue of the $8 million ramp up is not met as this would be an early indicator of failure and and also the brand enhancement. This is the most significant non-financial factor. Making sure the brand diversifies and make make sure it has competitive positioning and creates a high barrier to entry destination. Also, just making sure it has a strategic fit strategic fit um and has a good long-term strategy and that's something Starbucks can improve on. And then the real options value saying this project a simple yes or no decision in reality creates real options. If successful, it could provide a blueprint for expansion. That's something that wasn't in this code that could be done in the future. In a conclusion, I mentioned it multiple times except the project because of its financial positive financial metrics. Now, I'm just going a little bit further into some of the more financial and math concepts for the cash flow calculations. I've really talked about most of this, but in incremental cash flows was the main first part of our code right here. of this part right here. So this is a really important concept. We only care about cash flows that change because we do the project. We compare the word with the roster to the world world without the roaster and the operating cash flow. As I mentioned when I was first talking about the formulas we're going to use. It's just some more information I researched here. The depreciation cash tax shield is a key part of the OCF calculation. And by having that $1.2 million depreciation expense, the company's taxable income is 1.2 million lower, meaning it saves, you know, the 1.2 million times 25% of $300,000 in taxes that otherwise would have had to paid. So that's an important financial concept. The free cash flow, I mentioned this earlier, so I won't really go into it again. the terminal value and working capital the 500k in working capital is the cash outflow at year zero to stock inventory fill cash orders and etc and equal cash inflow at year 10 when the project ends and those assets are liquidated and that's what I mentioned when I was showing you the 500 right here and the positive 5 mil for year 10 the terminal value is the 3 million s salvage value of the equipment because the equipment is really depreciation book value of zero the full three $3 million is a taxable gain and but we must pay the 25% tax on that amount of was 77 750k. So the net cash flow we receive is 2.25 million and then just other capital budgeting metrics. I mentioned all these metrics already so I'll just briefly touch on them again because that is what the premise of this project was. The MPV measures how much value a project creates or the stories. So positive MPV is what we're going to make our decision on and that's what we did. The IRRa is important because if the IR is greater than the WACC, we know that the discount rate that makes the project MPV equal to exactly zero represents the project's expected percentage of rate of return, which is why we want the IR to be greater than the WACC. Payback period, very simple metric. How long does it take to get our initial investment back? So, we want that money to be below the the period of our investment. The discounted payback period is superior version of the normal payback period and is always an important calculation because it's a better risk indicator and the profitability index if it's greater than one it shows that our present value of the investment is greater than what we're doing. So that's my analysis for the week 10 assignment. Thank you for us.",
  "video_url": "https://youtu.be/nWFn2qet0mI"
}