{
  "student_name": "Adisyn Nichols",
  "org_defined_id": "037075344",
  "username": "nicho307",
  "email": "",
  "transcript": "Hi, I'm Addison Nichols. This is my session 10 time assignment. Um, so starting off the define and discover portion, our goal is to evaluate Starbucks proposed flagship grocery and determine if the investment creates value. So how we decide on a decision? Um, we will accept it if the net present value of the project is greater than or equal to zero and the internal rate of return is greater than or equal to our weighted average cost of capital. So going over the parameters that were given um we have an initial investment of 12 million depreciated straight line over 10 years. Working capital of 500,000 deployed at launch and recovered in 10 years. Revenues of 8 million year 1, 11 million in years 2 to 5, 9 million in years 6 to 10. And then operating costs which are the cost of goods sold is 40% of revenue. Labor is 2.5 million each year. Brand utilities is8 million each year. marketing is.3 million in year 1 and then.1 million thereafter. And then our taxes are at a 25% corporate rate with a terminal value of 3 million at the end of year 10. We also have the weighted average cost of capital being the 8.5%. So it says use the firm's 8.5% weighted average cost of capital as the hurdle rate to determine whether the project creates value and then to recommend and accept or reject decisions supported by driver documentation. So moving on to our represent portion. Um first off the annual depreciation. So we're given that it's depreciated in a straight line over 10 years. So we take that investment of 12 million divide it by 10 for the 10ear horizon and we get 1.2 million each year is how it depreciates. Um so then we have this cash flow schedule mapped out. Um so looking at this it'll take our revenue, our cost of goods sold is a negative value. Our labor is a negative value. Um rent and utilities is negative. Marketing is negative. Depreciation is negative. Um and then revenue is the only positive in that group. So then that will give us our earnings before interest or tax. So then we do take out the taxes um which again are at that rate of 25% for the corporate rate. And then after those taxes we will find the net operating profit after tax. Add back the depreciation. Um and then also count that networking capital change which is only irrelevant in time zero and year 10. Um as well as that initial investment and the terminal value and then from that we will get the free cash flow. So at time zero we see the free cash flow um this graph is in millions is -12.5 million again that's because of our initial investment as well as our working capital that we deploy. Year 1 we will see 1.2 million profit. Um years 2 through 5 we see it as 2.7 million profit. Years 6 through 9 we see it $1.8 million profit. And then in year 10 it's $5.3 million profit. So these are essentially the components of the net present value calculation that we're going to use to find it. So this is our cash flow for each year as represented by the free cash flow. And then what we'll do is we'll discount that back to time zero and then compare that to the initial investment to see if this investment is worthwhile and what its net present value is. So a couple concepts to go over the net present value decision rule. Um again this is sum of all future cash flows discounted back to present day. If it's equal to zero that means a project breaks even or recoups its initial investment throughout its lifetime. In this instance it's 10 years. But if it's greater than zero it returns a profit which also means we should accept the project. The internal rate of return is the discount rate that would make the net present value equal zero. And then weighted average cost of capital as the discount rate. This assignment tells us to use weighted average cost capital as our discount rate for the net present value calculations. So this essentially is the average rate a company expects to pay to finance its assets. So we use it as our hurdle rate. Um we want to generate a higher return than this because is essentially how much it costs us to get the money to finance this. So that was the represent portion. And then moving on to the implement portion, there is Python code to go over. So quickly running through the technical part of code, we define all the different parameters. Um this um represent section will give us a different map similar to my represent portion the cash flow schedule um which was done independently from this just as a part for the validate portion which we will get to. And then we will have the evolve which is a sensitivity analysis and the visualization for the graphs. Um so we're in that implement portion right now we're going to go over the base case. So what we see is a net present value of about 3 million internal rate of return at 13.25%. A simplified payback period of 5.28 years and then a discounted payback period of 8.21 years. What these are is essentially the time it takes for us to get that initial investment back. Um so if this payback period were to be 10, that would mean our net present value is zero. It takes the entire length of the project to get back to that. Um but in this case it's shorter than the length of the project because we have a positive net present value. Um we have a profitability index of 1.24 times and then our weighted average cost of capital is again 8.5%. That is just a given. So that is going over the implement portion and our base case scenario. Moving on to the validate portion. A quick logic check is that our net present value is positive and our internal rate of return is 13.25 which is greater than our weighted average cost to capital. So that's consistent um and would indicate that those two numbers are at least consistent with each other. And then looking at our cash flow chart, this was mapped independently from this code. But we do see the free cash flow matching up. So again the 12.5 million in the first year, 1.2 in the or sorry 12.5 in the at time zero, 1.2 in the first year, 2.7 million in years 2 to 5, 1.8 in years 6 to 9, and then 5.3 in year 10. Again, this matches the other cash flow schedule that we mapped out. Um, so this indicates that everything is being calculated correctly in this block of code. So that's our validate portion. Moving on to the evolve portion. We're going to go over some sensitivity testing. Um, so there are three different scenarios we decided to test. Um, there is a scenario where revenue is down 20%. Way average cost capital is up 2% or down 2%. So what we see is that this project is pretty financially robust. Um, despite the weighted average cost of capital being up or down 2%. Being up 2% means we have a higher hurdle rate. So, we want more return, we do still see a positive net present value. And then again, we still see a positive net present value with it being down 2% cuz that would indicate a lower hurdle rate, which means we need less return for it to break even. Um, so in both of those instances, we would accept the project just at face value. in the revenue down 20%, we see that this project is very dependent on revenue. Um, our net present value is negative. So at face value, we would reject that decision. And so here's just a graph vis visualization of that. So again, we're pretty robust against the weighted average cost of capital changing, but the revenue is just a very big portion. And in this um cash flow chart that we see from the represent portion, revenue is almost the only positive input we have um besides adding back the depreciation. So it's obviously very important that we have a higher revenue um because that's how we get our cost back besides the terminal value. Um those are the two ways that we really do get money back. So with that in mind um those are different sensitivity parts and then this graph um can also go in with the implement portion but it's just a visualization of the annual free cash flows for the base case. Again we see that negative investment in at time zero and then it's pretty much just positive from there. So it's just a graphical representation. Um and then this for the sensitivity impact we see -2.75 million um net present value when the revenue is down 25% or 20%. 1.63 net present value in the millions um when the weighted average cost capital is up 2%. And then 4.64 million net present value when the weighted average cost capital is down 2%. So our final recommendation in this evolve portion with the sensitivity testing under the base case we should accept this project. However with the sensitivity testing we need to keep in mind the sales volume. The project is financially robust as we see with the weighted average cost to capital sensitivities. But with the drop in revenue it becomes a loss very quickly. This project is highly sensitive to foot traffic. So that must stay in consideration. So this project is a conditional acceptance um at face value. Yes, we should. But it also depends on our confidence level of our projected revenue. Like do we really think this is how it's going to be? Because if we're not very certain it's going to be in that ballpark, it can have a very big impact like we see in this graph. Um it can change very quickly. So moving on to the reflect portion. I chose to go over a little bit of how this could be improved like our confidence in our decision. Um so we went over the way it average cost of capital and how this ties into that present value calculations. Um so it was very insightful to see how much the revenue impacts it versus the different way average cost capitals. Um but for scenario planning we need to see like how could we compensate for less foot traffic. So strategic value. So if we have a higher terminal value, which means that we have land appreciation. Maybe this is a really desirable piece of land that could help bring our net present value up when the revenue may be lower. And then another way we could improve our confidence in this decision is to refine revenue projections and get a more accurate picture to feel more confident in the the decision. So this could look at sorry seeing how um similar businesses do in the same area. um how they how their foot traffic is and then just kind of refining our revenue projection so we can feel confident in the decision. Um but to wrap this up, our final recommendation is a conditional acceptance. Again, we need to keep in mind the sales volume, but looking at the net present value, we see a positive and then a higher internal rate of return. Again, a positive net present value of about 3 million. Um which indicates this could be a very profitable project. Um, we just have to keep in mind those different sensitivity testing and how that may impact. Thank you.",
  "video_url": "https://youtu.be/zsRkowvrlMk"
}