{
  "student_name": "Melina Marsh",
  "org_defined_id": "035647509",
  "username": "marsh86",
  "email": "",
  "transcript": "Hello, today we will be talking about video assignment number 9, using the driver framework. So to start with the final discover, our goal is to determine the appropriate discount rate or WACC for Netflix's hypothetical 5 billion dollar content investment. We need to identify all given financial parameters in the required calculations. So that includes our current WACC, WACC, or WACC after 3 billion additional debt, project-specific WACC considerations, optimal capital structure recommendation. So our given parameters are our equity, um, market cap, uh, 200 billion dollars, our beta 1.3, price Right? $450, then we have our debt, so we have our market value, um, of 13 billion dollars, new debt, 3 billion dollars, are yield at 5.8% or rating, or the BBB Plus. And we have our market- slash tax, so we have our risk-free rate, which is, um, 4.5% our market risk premium at 5.5% and our tax rate at 21%. So for represent, the equations we will use are the following. Our WACC formula, um, is given here. The WACC is the minimum return the company must earn to satisfy all investors, both equity and debt. Then we have our cost equity, or our cap them, um, given the equation. Here, the cap them is the industry standard for calculating the required rate of return on equity by linking systematic risk to the expected market return. So we have our, um, risk fee rate of 4.5% plus our beta. Or risk of 1.3 times our, um, MRP of 5.5%. Then we have our cost of debt, which equation is given here. Um, we have our interest payment, interest payments on debt, our tax deductible, creating a tax. That reduces the effect cost of debt. This makes debt financing cheaper than equity, all else equal. Um, and then we can plug in our yield of 5.8%, um, and plug in our tax rate of, um, 0.21. And then we'll- We have our capital structure weights. The weights must be based on market values because W-A-C-C is a forward-looking concept. And the market value of a security is the present value of its expected future cash flows. Equity, market value, or e is t- $200 billion dollars. Our debt market value, or d, is 13 billion. Umm, and then our total firm value, or v, is our e plus d. So our equity plus debt, equals, umm, two hundred and thirt- 2 billion dollars. So for our implement, uh, this step involves calculating the required rates of return, and then using the market based weights to calculate the WACC for both scenarios. So to start with cost of equity, we will plug in our risk-free rate of- 4.5% or equity beta of 1.3, and our market risk premium of 5.5% to get a, um, 11.65%. So after tax cost of debt, we will- uhm, plug in our 5.8% for yield, and then for our tax rate, uh, 21% or 0.21% to get approximately 4.58%. To look at Netflix's current WACC- CC Cup. Capital structure weights, or market values. Our equity is $200 billion. Our debt is $13 billion. And then the total firm value is $213 billion. So to find the weight, we do 200, seen here, divided by two hundred. 13 from our total firm value to get approximately 93.90% for its weight. And we do the same thing with debt, but plug in 13 for our 13 billion over 213 to get approximately 6.10% for its weight. And then I'll turn. Our total firm value is 100% weight. Our current WACC, we will plug in for our current to get approximately 11.21%. So our WCC, after 3 billion dollars. The total new debt will be 13 billion dollars plus 3 billion dollars equals 16 billion dollars. We assume the equity value remains constant at 200 billion dollars since the investment is debt-financed. So. We have our equity of 200 billion, our debt of 16 billion, and our total firm value of 216 billion. So we'll do the same thing. Do our 200 divided by our 216 of our total firm value to get approximately 92.559 percent weight. Then we'll do the same thing with debt, but put 16 as the numerator divided by 213 to get approximately 7.41% per our weight. Then again, for the total firm value, it is 100% for the 216 billion dollars. We assume the cost of debt remains 5.8% and the cost of equity remains 11.65%. In a real-world scenario, increasing the debt would typically increase the financial risk, potentially raising both, umm, our risk-free-in. So, for our post debt, WACC, we will look at the new one. It's the same equation. We'll just plug in the, umm, new information to get approximately 11.12%. This shows the WACC, uuuh, uuuh, drops slightly from 11.21% to 11.12% due to crater use of cheaper tax-advantaged debt. So, for our validate, the post debt, WACC of 11.12% against the current WACC. of 11.21% shows that the company has a low optimal leverage point. The cost of debt increases as leverage rises, the cost of equity increases as leverage rises due to higher financial risk. The WACC initially declines and then rises again. Clearly, marking the optimal structure at the minimum WACC point. For Evolve, Netflix must evolve its financial strategy by leveraging its BBB+, credit, reading to increase debt, lowering f- firm WACC, and by rig- rigorously using risk-adjusted WACC to ensure that content-investment decisions accurately reflect the underlying risk-return trade-offs. To reflect, I would advise- that flicks to increase leverage to lower the WACC. They should also use project-specific WACC for U.S. content in international content. Thank you.",
  "video_url": "https://www.youtube.com/watch?v=Q94U5Pu1M3c"
}