{
  "student_name": "Connor Bakota",
  "org_defined_id": "035716300",
  "username": "cbakota",
  "email": "",
  "transcript": "Hello and welcome back to management 310. Today we're going to be tackling session 8 assignment. Um today we are challenged with um we are given um the case of uh the GameStop short squeeze. Um and we are evaluating um the event timeline um key data points and then required analysis of this short squeeze. So to get right into this um on this monitor I have um all of our data that we're going to be talking about my coding um along with um just a little bit of information that I use to help you know understand this uh topic a little bit more. So um we have um the first step that we have to uh fully make is we have to understand um we have to verify the price of 0.04 um so in our assignments instruction says the first critical step that we need to know um is um whether it is 04 um for trading price. Um but as per the insiders instruction um we had to verify this historical data um points. Um the provided timeline suggested a price of 0.04 in August 2020. However, an analysis of split adjusted historical data from NASDAQ and Yahoo Finance indicates this figure is inaccurate. The stock traded in a range of approximately $1 to $1.70 during August of 2020. Um this analysis will proceed using um the verified historical data um more in depth um later on. This uh correction is crucial because it establishes the baseline for the entire event. The rally was from um roughly $1.70 to 483 not 4 cents. Um so we got this uh majority of this uh understanding from uh Wikipedia uh the GameStop short squeeze. Um this is a just a background of everything that happened with this uh short squeeze event. Um I've also watched the dumb money um movie which uh goes into deep um understanding of this um event. Uh some things are a little bit you know not to the tea. However um very uh interesting movie and talks a lot about this and it gives you a better understanding of this whole um problem. So moving forward uh we have to do an in-depth analysis. Um we have to verify other key points. So the short interest at 140%. This is correct. It is the single most important uh catalyst. This public data reported by firms like S3 partners showed that more shares were shorted than existed in the public float. This created a mechanically perfect ticking time bomb for a short squeeze. Um and the next up is the price per uh price surge to uh 483. This is correct. The uh intraday high was 483 on January 28th, 2021. Um and the Melvin Capital 53% loss. This is also correct. The hedge fund lost 53% of its value in January 2021 and required a 2.75 billion bailout from Citadel and 72. It ultimately shut down in 2022. And the final point was the anal uh analyst estimates of 10 to 40. This is a reasonable range. Uh at the time, most fundamental analysts saw GME or GameStop as a failing brick-and-mortar business, placing its value in this low range. This highlights the disconnect from the market price. Now, we're moving forward and we're going to be testing which form of market efficiency was violated. In this case, um the first one is the weak form. This form was violated. Technical analysis uh was useless. More importantly, the momentum itself became a self-fulfilling prophecy. retail traders successfully used past data um to coordinate and influence future prices, something EMH claims is impossible. Um the next up for the semi- strong form, this was massively violated. The argument for violation um was that the market price wildly diverged from all public fund fundamental data uh like the 10 to 40 value. Um the most crucial piece of public information, the 140 shortages was not correctly priced in. EMH would predict that rational arbitrageers would have already bought the stock to squeeze the shorts, finding the equilibrium. Um, however, in reality, the market ignored the fundamentals and instead a group of retail traders used the public short interest data as a weapon to create the squeeze. Um, the price did not reflect public info and it was driven by reaction to it. Um, and then finally, the strong form was also violated. So, all forms are violated. Um if the semi- strong form falls then the strong form automatically fails too. Um the price was uh the price was wrong by a rational me uh rational measure public or private. Uh finally we're going to evaluating systematic profit for rational investors. All right. For uh rational fundamental investors, um a traditional rational investor would have looked at GME's balance price uh seen in the 1040 fundamental value and either stayed away or short sold the stock at 100, 200 or 400 believing it was absurd. Um this investor would have been bankrupt. Um the new rational investor, a different rational investor could have read the public info, uh read the public settlement, uh rationally concluded that squeeze was mechanically inevitable. Um and then this investor could this investor could have systematically profited by buying into the bubble not based on the fundamentals but based on rational analysis of market mechanics and behavioral flaws. Um rationality in this case meant understanding the game being played not the company val company's values of GameStop. Now moving on to the EMH predictions um versus the observed behavior. Um an EMH prediction observed uh the GME behavior um the prices are correct and reflect fundamental data but the price hit 483 while fundamentals were a 10 to 40 range arbitrage is a is a stabilizing force however um arbitrage be became a destabilizing force in this being the short squeeze um all public is instantly priced in but the public 140% short interest data was available but the market didn't price it until a coordinator group forced it do um and then you can't beat the market. Um but uh a large coordinated group of retail traders demonst uh beat the specialized head uh hedge funds in this um idea. Uh next we're moving to the behavioral finance explanations. DMH fails here because it assumes rational um actors on the market. However, behavioral finance provides the real answers to this. So um there's different types of behavior. So the first one is herd behavior. the entire um Reddit of Wall Street Bets, which was what fueled most of uh this GameStop short squeeze um phenomenon. Uh as more people bought in, it created social proof and causing a cascade. Um the confirmation bias they used were diamond hands. Um and this narrative uh was a powerful tool to prevent people from selling, encourage them to ignore all negative information um and only focus on the goal of going to the moon. and you know squeezing the market. Um and then overconfidence uh retail traders new to the market believe they had more skill and better information than the suits on Wall Street. Um and then narrative economics. This is the most important one. The GME event or GameStop event uh was not about a stock, it was about a story. Uh it was a David and Goliath. um uh people bought GameStop not to make money but to make a statement and to punish the hedge funds um that had profited from the 2008 crash. Uh this narrative gave the event a power that no financial model could predict. Um so it kind of take took it away from a model prediction to more of you have to understand the behavior. The the analysis of these uh hurting behavior and social media influence um with uh the Reddit of Wall Street Bets, it acted as a central coordination hub. It was not decentralized um or wise crowd. It was a highly motivated, self-reinforcing herd. Um and they used memes and slogans like apes together strong and to the moon. Um they weren't just jokes. They were powerful social tools to enforce group cohesion and discourage selling. Um social media created a common knowledge game where everyone knew that everyone else was going um to hold. Um so now we're evaluating the limits of arbitrage. Fundamental risk. The rational trade was short GME at 400, but the price could stay irrational longer than the short seller could remain solvent. Um, noise trader risk. The noise traders uh were not trading on fundamentals and were actively working to punish arbitrageers. Uh, their actions were unpredictable and created massive risk in this market. Um, the imple implementation cost as the squeezes began, the cost to borrow G shares to short them became uh prohibitively expensive. Um and then the Melvin Capital is a post child for limited arbitrage. They were the rational arbitrageer uh betting against GameStop's fundamentals. They were bankrupt by noise trader risk and the inability to hold their rational um position. Um now we're assessing the market microstructure issues. Um basically the plumbing plumbing of the market broke. Um trading restrictions. Robin Hood and other uh brokers restrict the buying of GameStop. Um this was the most controversial uh controversial micro structure failure. It directly intervened in price discovery affecting pulling the the buy support from the market. Um and then the T plus2 settlement brokers like Robin Hood were required to post massive amounts of collateral to clearing house. Um due to the extreme volume and volatility they restricted buying not um not to help hedge funds but because they couldn't afford the collateral requirements. this T plus two uh settlement system was shown to be a major systematic risk as well. Um the aval systematic uh profit opportunities existed. Um yes, but the system was not a traditional one. A rational investor defined by EMH would have seen GM uh GameStop as overvalued and shorted it or stayed away. They would have lost money or missed the gains. a new rational investor, one who read Reddit, um understood squeezed me mechanics and analyzed public short interest data, um did have a systematic profit uh opportunity. This system was identify stocks with um greater than 100% short interest plus high social media settlement um and you buy and hold. This was a systematically rational response to specific game um being played even if it was irrationally detached from fundamentals. Um moving forward, the analysis of risk adjusted returns. The returns were massive, but the risk was equally massive. The sharp ratio would have been enormous for someone who bought in December and sold at the peak. However, the volatility was also infinite. The stock could fall 50% in a single day. This was not a risk-free arbitrage. It was a high-risisk, highreward gamble. Um um hedge funds were the losers in this. Um they only had fundamental data, private and expensive terminals, while the retail traders were the winners because they had public social media data and public short interest data. Um, and then the discussion of X amino versus XPost analysis. Expost the GameStop trade looks obvious. Of course, 140% short interest stock would squeeze. I would have bought and held, but at the time it was not obvious. It was an extreme high-risisk gamble. No one knew if the Reddit herd would hold, if it was a whale could would sell or if a regular would step in. A rational X anti analysis would have seen a possibility of a squeeze, but would have had extreme difficulty in timing it and assume assigning a probability to it. Um now moving forward um we can talk about active and passive management implications. Uh this event had little impact. GameStop was a small part of the index. Passive investors just rode the wave up and down. Um active uh this event was a lesson in humility. It showed that active managers who ignore new de uh new data sources and new market participants do so at their peril. It has also highlighted the extreme risk of shortselling. Um we can see uh the market efficiency of policy implications. There's more policy implications. So the gamification of trading are apps like Robin Hood using turning investing into gambling. The payment of order flow. This is how Robin Hood makes money. Is it a conflict of interest? And then the short sale transparent. Should short um positions be disclosed more quickly and clearly um we don't know. And then the settlement times, the call to move from T plus2 to T plus 0 to reduce the systematic risk that force Robin to halt buying. Um so though that's kind of like our understanding of the whole thing. Now I've made code to kind of run over this. Um we're going to be configuring the ticker of GameStop um to um S&P 500 over here. Uh it fetches our data in this subsection and then it prepares the data in this section. Um we study the event in the abnormal return calculation right here. Um we get the market model. Um for this um and then we perform the OS regression as well. Um we use our alpha as our intercept and our beta as our slope. We move to step two. we calculate abnormal returns of the event window. Um then we move forward to plotting this result uh in numerous graphs alongside everything else. Um cumulative abnormal returns, volume analysis, normalized price analysis and then we define the full range uh of data. Um and this is where we are right here. So um through our calculator and you know all the other information that we've just learned and we've uh curated into this to understand um the basic uh fundamental of this GameStop case we can now move to this. So this is um fetching the data from GameStop and S&P 500 from 2019 to 2021. It's been completed completed. The market model here is the estimation period of 2019 um as a year and the alpha is negative.4516 and the beta is 1.48. 4830 and the R squar is 0575. But however um in the event window analysis of 2020 to 2021 we see the mean daily abnormal return is at a 025314 or a 2.534 uh14%. Um the t statistic is 1.6 while the p value is 0.1. um and the p value um being greater um than zero uh 0.05 we fail or reject the null hypothesis. Thus the conclusion the abnormal returns are not significantly uh uh statistically significant in this um uh this case. So, now we're going to move forward to um the normalized stock price in this um we can see it compares GameStop and S&P 500 and you see that huge spike right there um at 2021 with the normalized stock price. It shoots up right there. Now, we're going to move forward to the uh GameStop trading volume um trading volume. So with this understanding um trading volume uh is the understanding uh of the total number of shares or contracts that are traded between buyers and sellers during a spec specific period of time typically in a single day. Um why is this important now? Well, volume is a critical piece of data because it helps analysts and traders gouge the strength or conviction between a stock's price movement. Price alone only tells you what happened while volume tells you how much participation was behind that move. So if the price moves up and the volume moves up in this case price and volume both moved up this is a strong bullish sign. It shows that many buyers are enthusiastically participating um which confirms the upward trend. If price goes down and volume goes up this is a strong bearish sign. It shows heavy selling pressure and high participation in downward moving um and confirming the bearish trend. If the price goes up and volume goes down, this is a weak bearish warning sign. This price is rising but fewer people are participating. lack of interest. Price goes down and volume goes down. This is a weak bullish sign. The price is falling but selling pressure is drying up. Um but in this case we have the first one price is um going up and volume is going up which mean is a strong bearish sign. People are not only participating in this but they're the price is also going up with this participation. So we can see that GameStop at this point in time had a very strong bullish sign. Now moving on to our cumulative abnormal um returns. We see that in this time our cumulative abnormal returns were skyrocketing at this time. Um this is not what we are expecting from this stock. You can see over here in uh earlier 2020 we weren't expecting much but 2021 it absolutely skyrockets and that kind of just goes to show with the volume is that the abnormal returns and um the volume had something to um were highly correlated um in this um market. So understanding all this we now know that we have not only um understood the market efficiency testing. Um we've also just understood the behavioral finance analysis. Um in that beginning part um we've understood the uh rational investor probability analysis um that we couldn't really predict it at the time. Um and we've also understood the theoretical implications of um you know our model of EMH versus our behavioral finance and and we made this code to help us understand the abnormal calculations of returns of abnormal returns. Um through this whole thing we've learned a lot about GameStop and we've learned about the short squeeze and how sometimes we can't really predict things in the stock market. Um especially when we don't have full understanding of our um information and data. Um and it all started with uh understanding our first critical step of verifying the price where we started. Um and then also understanding uh our ranges um or an our analyst estimates. Um going through all this we now understand a lot more about trading. We know a lot more about the short squeeze. We know about herd behavior and how behavioral sometimes can uh is a better understanding than using certain models to predict. Um, only having one view doesn't help us. We have to actually understand the full story. Um, especially when we're looking at different charts on volume, um, abnormal returns and, um, normalized stock prices. Um, we've learned a lot. Thank you so much for tuning in. Um, and that'll be it for Management 310 session 8.",
  "video_url": "https://youtu.be/Ig6ZAAIZEkQ"
}