{
  "student_name": "Silas Bowman",
  "org_defined_id": "036111483",
  "username": "bowma177",
  "email": "",
  "transcript": "Let's start. My name is Silas. All right, so and to start, the objective is to validate the financial viability of Starbucks proposed flagship roaster using a discounted cash flow DCF model and the key parameters. Silas Cameron Bowman 0 minutes 18 seconds Being the time horizon, 10 years initial outlay 12 million capital plus 500,000 working capital total rate of 8.5% lack revenue trajectory ramp up 8 million, stabilitization 11,000,000 and maturity 9 million. Silas Cameron Bowman 0 minutes 35 seconds Terminal value being 3 million treated as a fully taxable asset since or a sale since book value reaches 0 and tax rate at 25%. So the problem is we must automate the calculation of the free cash flow FCS or FCF. Silas Cameron Bowman 0 minutes 51 seconds And sensitivity metrics to determine if the project exceeds the 8.5 cost of capital. So one of the logic representative assumptions be using a Python dictionary, satisfy the parameterization requirement. Silas Cameron Bowman 1 minute 6 seconds I'll create a list of years, calculate the EBIT, calculate the NOPAT, derive free cash flow by adding back depreciation and subtracting capital expenses and adjusting working capital. Silas Cameron Bowman 1 minute 21 seconds And then design a function run model, which I'll show later that exceptional optional arguments, revenue modifier, whack override to handle the sensitivity analysis requirements and implementing these used pandas and Numpy financial automation of the code. Silas Cameron Bowman 1 minute 39 seconds And I'll put being script generated with the data frame showing line by line of financial performance and then now I will go into the actual code. Silas Cameron Bowman 2 minutes 4 seconds All right, so this time and I evaluated the financial feasibility of the proposed Starbucks flagship grocery. I just said the objective. Solace had built the dynamic Python model to calculate the net present value and the internal rate of return. Silas Cameron Bowman 2 minutes 20 seconds While also testing the revenue assumptions, so um. Silas Cameron Bowman 2 minutes 25 seconds Moving to the represented implementation phase, I structure the analysis to both be automated and flexible. So in between the the params here the params line. So establish the params dictionary by certainly inputs like. Silas Cameron Bowman 2 minutes 43 seconds The 12 million million investment labor costs and tax rates in a variables rather than a hard hard coding them. It satisfies the parameterization requirement. This makes the model easy to update if assumptions change. So then working down. Silas Cameron Bowman 3 minutes The run model here. So this is the core of the program, the run model function. This function iterates through year zero to 10 to build the cash flow schedule. Inside the loop I calculate the operating metrics revenue minus cogs. Silas Cameron Bowman 3 minutes 17 seconds Um. Silas Cameron Bowman 3 minutes 19 seconds Labor, rent and market to get our EBIEBIT and then pass this through these next lines. I paid special attention to the year 10 terminal value. Since the asset is fully depreciated, the book value of 0, the entire 3 million sale is taxable gain. The code automatically calculates tax liability. Silas Cameron Bowman 3 minutes 38 seconds And adds an after tax proceeds to the final cash flow, so. Silas Cameron Bowman 3 minutes 45 seconds Now. Silas Cameron Bowman 3 minutes 48 seconds Going to the. Silas Cameron Bowman 3 minutes 51 seconds Numpy here. Silas Cameron Bowman 3 minutes 58 seconds So next the I utilize the numpy financial. Silas Cameron Bowman 4 minutes 8 seconds Ull that U here. Silas Cameron Bowman 4 minutes 11 seconds So utilize the numpy. Silas Cameron Bowman 4 minutes 16 seconds Right here. So utilizing the numpy financial and the library to create the NPV and IRR, this removes the risk of manually formally errors in discounting and continuing on to the metrics and going past. Silas Cameron Bowman 4 minutes 32 seconds So since the standard library function for the simple payback doesn't exist, I wrote a custom logic here and it finds the exact moment the cumulative cash flow turns positive rather than estimating the year. So then executing this code. Silas Cameron Bowman 4 minutes 46 seconds You can see the base case output in the console. It confirms the logic down here. Silas Cameron Bowman 4 minutes 53 seconds So it confirms the logic of. Silas Cameron Bowman 4 minutes 58 seconds Seeing the initial 12.5 million outflow in year zero and positive cash flow generation stated starting immediately in year one. So now going into. Silas Cameron Bowman 5 minutes 11 seconds More of the evolve phase, so. Silas Cameron Bowman 5 minutes 18 seconds Going into the revenue modifier, so. Silas Cameron Bowman 5 minutes 24 seconds I ran a negative scenario by passing a revenue monitor monitor of 0.8 or 0.8. This simulates a 20% drop in sales across all years. I also tested the wax instead of you running the model at 6.5% to 10.5%. Silas Cameron Bowman 5 minutes 42 seconds And. Silas Cameron Bowman 5 minutes 44 seconds What this did allows us to see the product creates value even in a high interest rate environment. Silas Cameron Bowman 5 minutes 54 seconds So. Silas Cameron Bowman 5 minutes 56 seconds Now it's the output. Silas Cameron Bowman 5 minutes 59 seconds So finally looking at their visual output as you can see down here. Silas Cameron Bowman 6 minutes 5 seconds Here's my reflection and overall recommendation of what's going on here. So the NPV generates an NPV of 3.49 million, creating significant value, and the initial rate of return is 14.12%, which comfortably exceeds our 8.5% hurdle rate. Silas Cameron Bowman 6 minutes 22 seconds So we recover our initial investment in roughly 5.6 years. However, the sensitivity chart highlights a critical risk. The when I adjusted the whack up to 10.5%, the projected remained profitable. Silas Cameron Bowman 6 minutes 39 seconds With an NPV of 2.6 million, but when I dropped revenue by 20%, the NVB fell to 1.6 negative negative 1.6 million. So this indicates the product has high operating leverage. It is robust against interest rate and changes, but fragile regarding sales volume. Silas Cameron Bowman 6 minutes 57 seconds So the final recommendation is I recommend accepting this proposal as the base financials are strong. However, approval should be conditional on a verified market plan that ensures we meet the year 2 revenue target of 11 million as missing our sales target is the only scenario where this project fails. Silas Cameron Bowman 7 minutes 16 seconds All right. Thank you.",
  "video_url": "https://youtu.be/H1YToB0bEx4"
}