{
  "student_name": "Tirth Patel",
  "org_defined_id": "037647601",
  "username": "pate2347",
  "video_url": "https://youtu.be/EOKT785GGy0?si=IUg0RMrvx8cxHbs0",
  "transcript": "For session 13 or sorry the capstone project I have built a AI powered financial tool called the AI financial decision explainer. The goal of this project was not to analyze or just write a report but to build something that you can actually feasibly use in the um finance field. So, first of all, I'm going to go through the driver framework and then I'm going to go through the demo along with it. Um, the financial analysis, the problem I'm going to be solving for this is going to be defined in the driver phase. So, let's go on with D. Um the problem I'm going to be solving is going to be that financial an analysis often fails at decision-m stage. While analysis under an analysis understands the metrics like WCC, NVP and cash flows, non- finance decision makers often struggle to interper interpret what these numbers actually mean for the decision makers and um the stakeholders. This lacks to a miscommunication, hesitation or poor decisions made by company heads and um people who are often put in the situation of analyzing these metrics even when the underlying analysis is correct. The target for this tool is going to be for nine non-financial executives, founders, managers, and students who need a clear explanation of financial outcomes. Not raw data models, just based on numbers and other features. Um my solution is going to be a AI powered financial interpreter. Instead of calculating numbers, the tool um translates the financial senior arrows into clear decision ready explanations for the consumer to use and understand and to take action on the decisions. The user paste a financial situation. Oh, okay. Let me go through this. This is going to be the app I've made. It's interactive. Um, the user is going to be pasting a scenario such as a change in WACC or MVP and the AI is going to explain what and why this matters. The decision is going to explain what you should do and key risk and what to monitor next for you. This tool was built by Python also with steam lift for the interface and an AI an open AI's language model for reasoning which is going to help you walk through the decisions and um give you choices based on the metrics you give it. So for the implementation stage I'm going to place a let's see I'm going to give it a scenario based on that it should give us an output.\n\nOkay there we go WACC increased from 8% to 10% cash flow state the same NVP dropped from 28 2.4 4 million to 0.3 million. Should we still invest? I'm going to press the explain button\nand this is going to give us a thinking. This is going to be using open AI. And here is what the results are. What happened? Our costs of capital or the minimum return we needed went up from eight to 10%. Even though our projects cash flow and change, the higher cost means the present value of those inflows is worth less today. This is why the net present value dropped significantly from 2.4 million to roughly 0.3 million. Why it matters. NVP or net present value tells us how much value the project adds for after covering costs blah blah blah. This is basically what is going to tell us. And then here it gives us decisions that make sense based on the thing. It says that it's still positive. MVP is still positive. Project tech technically adds value can be considered. However, the margin is very thin. Now it tells us this is risky. It gives us the key metrics here. What we should watch out for and it also tells us what to monitors next. This is going to be helpful for people who are in situations where something like this actually happens. The eye generates a structured explanation and clearly breaks down what changed why financially matters in decision what decisions should be made what risks are involved and what should be going on or what should be monitored going on forward the output is not hardcoded it's generating live using AI model so if we change this from 8% to 12% it will change our data meaning this is a real life um model that can be used for every situation situation financially. To verify this actually solves the problem, I tested this tool using for real financial scenarios and shared the explanations with people who are not financial majors. Um the feedback was that explanations are much easier to understand than technical financial outputs and they help clarify whether project should move forward or not. In the evolve stage, we could potentially um update or give this a layover or a major um boost. If we were to scale this tool, the next step could be including allowing users to upload Excel models, compare multiple scenarios side by side, generate board study summaries automatically. This would easily extend it uh into tools used by startups, finance teams, or consulting firms. The ref reflection is that the biggest thing I've learned from this project is that building with AI is less about complex code and more about problem definition, problem design and iterations or iteration, sorry. Um, I would also have learned how to use real AI APIs, handle authentication quotas and debug issues that come up when shipping an actual product. For this product, I had some issues um implementing or getting OpenAI to be embedded into this so we can have a real life chatbot or like a financial advisor experience. And I was having some issues with this. It took me a bit to figure it out, but I got to it. Um it required some debugging. It required some research and it also required some help from AI to explain how I can do this or integrate OpenAI's model into my uh product. And then this was a demo of the AI financial decision explainer. This is a tool I realistically use beyond this class to help me with other financial decisions and if I should invest in something or not. Thank you for watching."
}