{
  "student_name": "Aidan Manickam",
  "org_defined_id": "034350008",
  "username": "amanick",
  "email": "",
  "transcript": "VIDEO TITLE: Session 9 – Netflix WACC DRIVER Walkthrough INTRO (0:00-0:20) - \"Hi, this is Aidan. In this video I'll walk through the Session 9 Netflix WACC assignment using the DRIVER framework.\" - \"Goal: translate investor return requirements into Netflix's corporate hurdle rate for a $5B content slate and explain how leverage shifts that hurdle.\" D — DEFINE & DISCOVER (0:20-1:00) - \"Objective: compute base WACC, post–$3B debt WACC, project-specific discount rates, peer comparison, and capital structure recommendation.\" - \"Inputs: $200B equity value, $13B debt MV, β=1.3, Rf=4.5%, MRP=5.5%, BBB+ yield 5.8%, 21% tax rate. Scenario adds $3B debt.\" - \"Critical questions: What hurdle keeps investors whole? How does leverage alter β and spreads? When should international projects use a higher rate?\" R — REPRESENT (1:00-1:45) - \"Blueprint: Inputs → component costs → market weights → base WACC → scenarios & sensitivity → recommendation.\" - \"Key formulas: r_e = Rf + β×MRP; r_d(after tax) = yield × (1-T); WACC = (E/V)r_e + (D/V)r_d(1-T).\" - \"Plan: establish base WACC, re-run with $16B debt, layer divisional betas (β=1.5 abroad), benchmark Disney/Amazon, then document validation steps.\" I — IMPLEMENT (1:45-3:00) - \"Show notebook cell: helper functions for CAPM, after-tax debt, and WACC.\" - \"Base case: weights 93.9% equity / 6.1% debt, cost of equity 11.65%, after-tax debt 4.58%, WACC about 10.7%—slightly above the 8–10% media range due to higher beta.\" - \"Post-debt scenario: assume β rises to 1.4 and debt yield to 6.3%; WACC climbs ~40 bps but project IRR 11% still clears the hurdle.\" - \"International projects: β=1.5 lifts WACC by ~70 bps, justifying tailored discount rates.\" - \"Peer benchmarking: Netflix sits above Disney's 8.2% (parks collateral) but below Amazon's 9.5% corporate hurdle.\" - \"Sensitivity: table shows each +100 bps in MRP pushes WACC ~1 point, underscoring need for regular updates.\" V — VALIDATE (3:00-3:30) - \"Confirmed weights sum to total capital, CAPM outputs align with BBB+ profile, WACC remains within plausible band, sensitivity behaves monotonically.\" - \"Documented assumptions: equity market cap held constant, spreads widen 50 bps, beta bump from deleveraging reversed.\" E — EVOLVE (3:30-3:50) - \"Connect to Sessions 2–8: markets price risk; Session 9 converts that into the company's hurdle rate, which Session 10 will use for NPV and Session 11 will stress with capital structure moves.\" - \"Takeaway: maintain a living WACC dashboard—update beta, spreads, and tax assumptions before greenlighting big content spends.\" R — REFLECT & CLOSE (3:50-4:15) - \"Key learning: WACC is the bridge from market data to CFO decisions; even small leverage or geographic changes shift the hurdle materially.\" - \"Challenges: keeping the analysis concise yet defensible, especially explaining a >10% WACC against an 8–10% industry range.\" - \"Next step: feed the base and project-specific WACCs into Session 10 capital budgeting models.\" - \"Thanks for watching.\"",
  "video_url": "https://youtu.be/lL5JLAFuvSQ"
}