{
  "student_name": "Luke Hardymon",
  "org_defined_id": "035866355",
  "username": "lhardymo",
  "video_url": "https://www.youtube.com/watch?v=2G5lFvPeaF0",
  "transcript": "0:02\nUh so today we're looking at um a case\n0:06\nstudy of Apple's $90 billion share\n0:09\nrepurchase. um we're sort of determining\n0:12\nthe buyback and sort of who benefits\n0:13\nfrom this buyback and then we're also\n0:15\nbasically comparing it um to other\n0:19\num\n0:21\nalternatives through dividends and\n0:23\nacquisitions and um R&D options and also\n0:26\nhow that affects other people and then\n0:28\nbasically seeing if this kind of creates\n0:30\nvalue or if this is more just\n0:31\ntransferring the value and the the\n0:33\ncapital among different people. So\n0:37\nhere kind of defining and discovering\n0:39\neverything setting up that um how much\n0:42\ncash um and liquidity that Apple has um\n0:46\nand then it's very high PE value of 30X\n0:49\num and then here we can just get a quick\n0:52\nkind of like what each group of\n0:54\nstakeholder kind of wants. So you can\n0:55\nsee management is sort of inivi\n0:57\nincentivized by EPS. Um and then\n1:00\ninstitutions prefer buybacks for tax\n1:02\nefficiency, a percentage ownership\n1:03\nincrease. Um and then retail often\n1:08\nprefers dividends um but also suffer\n1:11\nfrom tax drag. Um and then the employees\n1:15\nobviously the high stock price benefits\n1:17\nthe option holders that are holding at\n1:18\nthat 170 um line. Um and then here\n1:22\nrepresent I use a lot of tables. I think\n1:24\ntables kind of helped here. Um, so this\n1:27\nkind of like shows kind of a little bit\n1:29\nwhat I was talking about. Uh, so for all\n1:31\nthese scenarios, you can see the\n1:32\nbuyback, the dividend acquisition, R&D.\n1:35\nUm, you can see kind of how each person\n1:37\nkind of thinks about it. So for the CEO,\n1:39\nthey like the buyback because it\n1:40\nincreases that EPS, it increases the\n1:42\nstock price. Um, they don't really care\n1:44\nabout the dividend because there's no\n1:45\nEPS boost. Um, the acquisition um is a\n1:48\nlittle bit risky because it's kind of in\n1:50\nbetween kind of like empire building\n1:51\nversus execution risk. Um and then they\n1:54\ndon't like the R&D because this kind of\n1:56\ncrushes the short-term EPS targets. Um\n1:59\nfor the uh institutions, you can see\n2:01\nit's positive, negative, neutral,\n2:03\nnegative. Um\n2:05\nit's positive for the buyback because of\n2:07\nownership percent rises as taxfree. Um\n2:11\nit's negative for dividend because it\n2:13\ncreates immediate tax liability. It's\n2:14\nneutral for acquisition because it\n2:16\ndepends on strategic fit. Um and then\n2:18\nthe negative for R&D um because it's\n2:21\nhigh in uncertainty. Um and so you can\n2:24\nkind of see continue on for the retail\n2:26\nand bond holders. Um you can see it's\n2:29\ndefinitely um risky. There's risky\n2:32\nnegative positive things for all of\n2:34\nthem. Um and so you kind of kind of get\n2:36\nto determine what to do. Um\n2:43\nso yeah um so there's all this and then\n2:49\nonce you go into the implement stage um\n2:55\nuh I calculated sort of everything um I\n2:58\ncalculated the EPS the EPS growth the\n3:00\nshares and the net debt for all the\n3:03\ndifferent options. So you can see sort\n3:05\nof the baseline for everything. So 6.17\n3:08\nEPS, 0% EPS growth, obviously 15.5\n3:11\nshares, and then negative 55 net debt.\n3:14\nAnd that negative means there's more\n3:16\ndebt than cash. Oh, no, the negative\n3:18\nmeans there's more cash than debt. A\n3:19\npositive number means there's more debt\n3:20\nthan cash. Um, so you can see sort of\n3:24\nbuyback. Um, so looking at EPS first,\n3:27\nyou can see that acquisition has the\n3:30\nhighest EPS because they're acquiring\n3:33\nanother company. So that increases the\n3:35\nearnings per share the most. Um as well\n3:37\nas a debt payown. Um and so these are\n3:41\nall pretty similar. Obviously R&D kind\n3:43\nof as I said before kind of crushes it.\n3:45\nUm because it's more of a long-term\n3:47\nthing, not really shortterm. Um you can\n3:49\nsee the EPS then the growth. Um\n3:52\nobviously these are just percents\n3:53\ncompared to the comparing the baseline\n3:55\nEPS to the new EPS. So you can kind of\n3:57\nsee the percentages there. Obviously\n3:58\nthat negative 77% is pretty drastic. And\n4:02\nthen you can see the total amount of\n4:03\nshares now. So if you buy back,\n4:05\nbasically you're taking out shares and\n4:08\ngiving a larger piece of the pie to the\n4:09\nother people. So obviously there's going\n4:11\nto be less shares there. Um and that's\n4:14\nthe only one where it matters. All the\n4:15\nother ones just say the same. And then\n4:17\nyou can see the net debt here. Um all\n4:19\nthe other ones um increase debt. Um\n4:22\nexcept the debt payown um says the same\n4:26\nas the baseline I guess. Um and then R&D\n4:28\nand the other ones are all the same\n4:29\nbecause they're all the same. Um, for\n4:31\nvalidating to make sure I did everything\n4:32\nright, I went through each equation in\n4:34\neach specific one. So, each EPS equation\n4:36\nuses income divided by shares. The EPS\n4:38\ngrowth equation is the new EPS minus the\n4:41\nbase EPS divided by the um new EPS minus\n4:45\nbase EPS and then all that divided by\n4:46\nthe base EPS times 100. That's how you\n4:48\nget the percent. The net debt equation\n4:50\nis the total debt minus total cash.\n4:51\nAgain, negative number means there's\n4:53\nmore debt than cash. a new shares and\n4:56\nthe new shares equation is the old\n4:57\nshares minus the cash spent divided by\n4:59\nthe share price. Um so that's how you\n5:02\ncalculate all that. I validated\n5:03\neverything. It all looked pretty good.\n5:05\nUm and then for revolving kind of using\n5:07\nthis ter thinking of this term of\n5:10\ncreating value versus transferring\n5:12\nvalue. So with any of these options are\n5:13\nwe actually creating value or are we\n5:15\njust transferring value? Um basically\n5:17\nkind of the summary is that this is\n5:18\nmostly just transferring value. Um,\n5:22\nand so\n5:29\nit's something different. So you can see\n5:30\nhere for all these different kind of\n5:32\nshareholders, um, most of this is just\n5:35\nkind of transfer. Um, however, when AI\n5:38\nsort of mentioned that this is kind of\n5:39\n90% transfer, 10% creation. Um, and I\n5:43\nkind of asked it, why is it not 100%.\n5:46\nUm, what what what made you say 10%. Um,\n5:50\nand they kind of did a scenario where if\n5:52\nApple used 90 billion to invent a robot\n5:54\nthat replaced all manual labor, there\n5:56\nwould be 100% value creation because\n5:58\nthis creates a new revenue stream that\n6:00\ndid not exist before. So basically\n6:01\ncreating is like making a new re revenue\n6:04\nstream. Um, and so this buyback, which\n6:06\nis like the main proposal, it doesn't\n6:08\nreally create a new revenue stream, but\n6:10\nit kind of just optimizes\n6:13\num\n6:14\nit says the math of the existing one. um\n6:17\nsaying it makes the machine run smoother\n6:19\nbut it doesn't build a new machine. Um\n6:22\nso it's kind of creating but it's it's\n6:24\nit's more just transferring um which I\n6:26\nthought was kind of interesting. And\n6:28\nthen the last kind of main thing here is\n6:30\nthe um kind of what is a signal kind of\n6:33\nto uh the what is the kind of the\n6:35\nshort-term react the immediate reaction\n6:38\num what is it telling the market and\n6:40\nthen the long-term impact. So for each\n6:42\nof the proposals, so you can see for the\n6:43\nbuyback, um it sort of is a positive\n6:47\nsign saying we're confident and that\n6:50\nmanagement believes the stock is\n6:51\nundervalued and the safest investment is\n6:53\nthemselves. Um and the market perception\n6:55\nis that the investors love the EPS boost\n6:57\nand price floor um and the safety net it\n6:59\ncreates. And then for capital\n7:01\ndiscipline, the high flexibility, you\n7:02\ncan see it as the best discipline\n7:03\nbecause it's not a permanent commitment.\n7:05\nYou can pause it next year if recession\n7:07\nhits. Um so you can sort of see the\n7:08\nbuyback here. is kind of good for all\n7:10\nthree of these which I think is pretty\n7:12\npositive. Um where for the rest you kind\n7:15\nof see mixed and negative and low\n7:17\nflexibility um and uh kind of skeptical\n7:21\nnot great. So I definitely think buyback\n7:24\nhere if I was an analyst is probably\n7:25\ndefinitely the best option. Um\n7:29\nand so yeah and then kind of reflecting\n7:31\nI kind of want to talk about what I\n7:33\nlearned. Um I think the idea of value\n7:35\ncreation versus value transfer is very\n7:37\ninteresting. um just because like\n7:40\nstockholders, right, are maybe getting\n7:42\nmore money per their shares. Um you have\n7:46\nto look at kind of sort of the entire\n7:48\npicture. Um and kind of just see like um\n7:52\nwhere is that money coming out of and\n7:54\nkind of how it affects other things and\n7:55\nnot not just you know myself. Um and\n7:59\nthen sort of this hidden language of\n8:00\ncapital allocation. Um kind of like what\n8:03\ndoes EPS mean, right? What does a\n8:06\nbuyback mean? what does um a special\n8:09\ndividend means? R&D, what does that do\n8:11\nto short-term EPS? It's kind of things\n8:13\nlike that. Like, okay, we might know\n8:15\nlike what research and development is,\n8:18\nbut how does it affect um sort of the\n8:22\nsignals and the markets of a for a\n8:24\ncompany? Um so, I thought that was kind\n8:25\nof interesting. So, yeah, that is my uh\n8:28\nsession\n8:3011 assignment."
}