{
  "student_name": "Spencer Beebe",
  "org_defined_id": "034593722",
  "username": "beebe9",
  "email": "",
  "transcript": "Alright, welcome to my Session 10 assignment. I'm Spencer Beebe. Umm, so this week we were talking about cost of capital analysis. Uh, for this assignment, we're looking at Starbucks's proposed flagship grocery, uh, that requires $12 million upfront with operational, uh, length of 10 years, uh, 8.5 WACC and then whether to accept or reject the decision. Umm, so all the Givens here. And then we will build a. 10 year cash flow schedule calculate the MPV IR payback period and the profitability index will run sensitivity analysis for a reduced. Revenue of 20% and a plus minus of 2% for WHCC and then we will. Provide a recommendation on what they should do moving forward. So starting over here with the defining Discover stage, so you know what we're actually doing here. Umm, so this is basically what, what I just read out uh, with all the Givens here. So $12 million investment, they have $500,000 uh, outflow in year 1 umm. Revenues for each year, cost of goods, labor, rent, marketing, uh, depreciation costs, corporate tax, discount rate or WACC, which is 8.5 and then the project life 10 years. So I just laid out all of that and then the umm. Equations and formulas that we need to use so the operating cash flow, the free cash flow uh, net present value or MPV, which is the value today of all future cash flows minus outflows, uh inflows minus outflows uh, discounted using uh rate of return, usually the WACC. So then with the, if it's greater than 0, you accept, less than 0, reject uh, and then IRR uh, is the discount rate at which the project's MPV is 0. So if it's greater than the WACC, that means the project return exceeds the cost of capital. So you want to accept. If it's less than you reject uh. So basically you're looking for MPV above 0 and then the IRR above the WACC. And in that case, you're going to want to accept uh, and move. With the project. So moving on to the represent stage, so this is all the hand calculations that I did. So just making sure that, you know, we understand everything before we implement it in the Python code. So all the Givens are just substituted in here. So year one revenue 8 mil, cost of goods, 40% of that. So that's 3.2. Uh, labor is 2.5, rent 800,000 and marketing 300,000. So the total operational expense is 3.6 million. Uh, with the depreciation that's going to be 1.2 mil, umm, EBIT for year 1UH0. For year. Operating cash flows is 1.2 million free cash flows is the same with the 1.2 and then this is kind of just like a a basic cash flows timeline, so year one to year 10. It's kind of just a, you know, a rough estimate there. So they're -12 million in CapEx and then -500,000 and working capital, uh, but year one, they're operating revenues jumpstart, uh, by year 2 to 5, they're making 11,000,000 with steady operations 6 to 10, revenue drops to 9 million and then year 10, umm. It's that final operating year, so we'll be able to see all of that through the code there. Umm. But yeah, we'll move on to the implement stage. So we'll move over to Colab here. So this is the code that I generated here. So I'll just go over it here. So all the parameters, all the Givens, umm, of what was stated in the question, revenues by year, umm. All of the you know the the cost of goods that I calculated up here earlier. Umm. And then this is just all the core model functions. Discounted payback period, simple payback period, profitability index, uh, everything that was asked to be calculated in the, in the, uh, textbook there, the base case. So what they're looking at now and then what would happen if revenue drops by 20%? And then, uh, what happens if WACC increases or decreases by 2%? Uh, and then how does that affect everything else there? So it'll, it'll calculate all of that, uh, and then. It'll help us make a decision rule with the executive summary there, so we can see, you know, that we want to move forward with the project. So running the code immediately gives us the MPV, IRR, discounted payback, simple payback and the profitability index. So MPV is 3,000,000 umm. So if we go back up here. 3,000,000 is a lot bigger than 0 so it creates shareholder value which is good. The IRR is 13.25 which is greater than the 8.5% WACC. So that's also good. It the project returns exceeds in cost of capital umm. So in that aspect you definitely want to accept umm, you know the investment and and. Move forward with the project. Umm. For the discounted payback period, so that's 8.2. So that's eight years. Simple payback is five years. Umm. I just want to go here. So yeah, that's basically everything. Profitability index here. Let's just ask. Let's chat here. Just to interpret it for us a little bit. Umm. Interpret. These numbers. So a simple payback of 5.28 years means that that is how long it's going to take to recover the initial investment. Umm, discounted is 8.2 years, which is, uh, uses time of value of money adjusted cash flow. So it's much more realistic. Uh, it is longer, but that's because, umm, much of the early cash inflow isn't strong enough to overcome discounting umm. So if the project still has life well beyond eight years, it's acceptable. And then the profit profitability index of 1.2418. Compares the present value of cash flows to the upfront cost. So if it's greater than one, that shows that the project creates value. So having a 1.24 means that every $1.00 invested is one $1.24 in present value. So overall very good there. Umm, just the initial investment, you definitely want to go ahead and, and move on with that. Uh, so here's the, uh, 10 year cash flow timeline, umm, of everything. So year one, clearly not operational, Umm, but after that, uh, as you can see from years two to five, it's $11 million in revenue and then 6 to 9 or 6 to 10, excuse me, is 9 million in revenue. If you come over here. You know, this is how much they're making. Overall. Uh, so that's the FCF. So overall, $5.3 million in 10 years. Umm. So now. Uh, the revenue drops by 20%. That will cause the MPV to go to -2 million. So as we said earlier, if it's less than 0, you want to reject the proposal. IRR is 3.88, so that's much lower than the 8.5 WACC. So once again, it's just another sign to reject at that instance. Umm, this is WACC sensitivity based on the base revenues. Umm, So what would happen? Umm, and then what would happen with the revenue drop there? Here's just a graph to show the timeline, you know, in a visual aspect here. So, you know, a big loss, you know, $12 million loss. And then they, you know, increase incrementally drops down by the year 6 and then by year 10, it's back up again. So in the base case, the decision is to accept in the -20% revenue decrease you want to reject. Umm. And that's just because, you know, like we said, the MPV was less than 0 and the IR was less than the WACC. Uh, and then with the WCC plus -2 1/2 shows inverse relationship with MPV, umm. V Umm. And then I went ahead. Umm. So yeah, uh, for the wax sensitivity raising it, umm. By 2% lowers the NPV, but the project still remains positive under the base revenues. Umm. So here's just a graph to show the MPV versus the WACC or discount rate and how that affects So with an increase of 2% and the WACC umm. So it'd be like right here, uh, as you can see. The base revenue umm. Is lower. As the WACC is higher UH and then it's an inverse UH relationship. So with the. A decrease in WACC. Umm. So if it drops to six, that's going to be a higher MPV. So that's the relationship there, so. If you raise it by 2%, it still remains positive under base revenues. Umm. However, it's just not as profitable and it's it's much more volatile with if you were to you know, increase the WACC. So that's that. So now we can. Validate it. So I mean, we're just looking at what we calculated earlier. To to what you know was calculated. Here everything seems to add up. You know, our timeline was pretty, pretty spot on there. And then this just shows, you know how. How those changes will affect the decision making there? So for the Evolve section, I kind of showed you earlier, but I did another separate code here. So it kind of showed everything else from earlier except it also has this MPV versus discount rate chart that kind of shows the minus and plus 2% WACC change and how that would affect everything. Umm. So yeah, if you're looking at. You know, the base revenues there, uh, if you were to drop down WACC, umm, that would. Increase the MPV umm, which would, you know, increase the, the project uh, profitability. If you were to increase WACC, that would decrease profitability. However, umm, from this, it still shows that the project remains positive under base revenues. Umm, if you were to increase WACC. So overall, you know you want to accept the decision for the investment, but that's only if the revenue assumptions are validated and downside mitigations are in place, such as market validation, tight apex controls and contingency planning. Umm. But yeah, so moving on to the reflection stage or the review, uh, you know, the project offers solid financial potential and aligns well with the company's long term strategic and brand goals, but it also carries risk related to cost, timing and market demand. Uh, as you can see with that, if they took a 20% hit in revenue, how that would affect the project there. But overall, the best recommendation is to move forward with the investment while closely managing these risks to protect returns. So it shows, you know, strong profitability under the base case and remains attractive even when you know the WACC increases, which supports, you know, moving forward with the project. However, you know, uncertainties around costs, revenue volatility and execution risks means that the investment should proceed with careful oversights. So overall, go ahead with the with the project, they should accept it, but that's only if they're running off of the base revenues there. Um, so yeah, we built the cash flow schedule, we calculated all of that. We ran sensitivity analysis and we, you know, we provided our recommendations there. Umm, we went through all the financial concepts, the technical implementation with the Colab code, umm. You know how we integrated all the formulas there for the financial aspects, we followed the driver framework throughout the whole thing. Umm, and I, I think I explained why we would accept the deal, uh, in the base case, uh and umm, fwacc were to increase or decrease. However, if uh, revenue decreases, do not accept the deal. So yeah, I think that's going to be it. Thanks for thanks for watching.",
  "video_url": "https://youtu.be/g3l7YoEe9wE"
}