{
  "student_name": "Cody Teteak",
  "org_defined_id": "036030190",
  "username": "cteteak",
  "email": "",
  "transcript": "Hello, my name is Cody Tekk and today I'll be presenting the cost of capital analysis for our session 10 assignment. The objective of this presentation is to determine the financial viability of the proposed Starbucks grocery project. We will move through the driver framework um to arrive at a data backed recommendation on whether to accept or reject this investment. So let's begin with our define and discover phase where we outline the project parameters. We are modeling a substantial initial investment of 50 million uh alongside a working capital requirement of $5 million. On the operational side, we project $25 million in annual revenue. However, this revenue comes with significant operating costs. The cost of goods sold at $7.5 million, uh labor costs at $5 million, rented utilities at 2.5 million, uh marketing costs at 1.25 million, and uh we are looking at a 10-year depreciation period. um and assuming a terminal value of 10 million at the end of the project life. Crucially, we are applying a tax rate of 25% and a and using a WACCC um a weighted average cost of capital of 8.5% as our hurdle rate. Next, we move on to our represent phase. This uh we need to translate those parameters into a structured financial model. We constructed a detailed year-by-year incremental cash flow uh schedule spanning year 0 to year 10. This waterfall model accounts for every stage of the cash movement. It starts with the initial investment and working capital deployment and then it flows through annual revenues and operating costs to determine the EBIT. Um, we then apply taxes to derive NOAT, the net operating profit after tax. And then finally, we add back the depreciation tax shields to arrive at the project's free cash flow. Um, here is the result of that representation, the complete year-by-year cash flow schedule. So, in year zero, you see a significant CL cash outflow of55 million. This is our upfront commitment. Um, the uh $50 million uh capital expenditure plus the 5 million in working capital. Years one through nine, we see a consistent positive cash flow of roughly $7.8 $8 million annually. Um, this assumes our base case revenue holds steady. In year 10, there is a substantial jump to $22.8 million. Uh, this reflects the final year of the operations plus the recovery of our working capital and the $10 million um terminal value. Then we move on to our implement stage. Um, so now let's implement our analysis. Using those free cash flows in Starbucks WACCC of 8.5% as our hurdle rate, we calculated five key capital budgeting metrics to assess performance. The uh net present value, the internal rate of return, the discounted and simple payback periods, and the profitability index. So here are our results from that. At first glance, the project appears technically acceptable. So for our MPV, we do have a positive NPV of um 2,894,812. And since it is positive, it theoretically adds value. Then for our internal rate of return is 9.54%. This clears our 8.5% hurdle rate, uh though not by that wide of a margin. Then for our profitability index at 1.05, we are generating just over a dollar for every dollar invested. However, if you look at the payback periods, the simple payback period is over 7 years, whereas the discounted payback period is 9.7 years. This means we are barely recovering our initial investment within the project's 10-year life uh indicating significant liquid liquidity risk. Then we move on to our validate phase. Given those tight margins, we must validate our assumptions. Base cases rarely play out perfectly in a real world. First, we performed a sensitivity analysis by adjusting the revenue model. Um, we then recalculated the annual revenues with a 20% reduction across all years. We then uh recomputed the MPV and the IRR to see the impact. The results of this 20% uh revenue reduction are alarming. So, the new revenue drops to $20 million annually. Um, the NPV plummets from our positive base case to a staggering negative uh 23 million and some change. I our R R IRR then falls to uh negative.68%. So this is a massive swing. A 20% drop in revenue um decreases our MPV by over 26 million. The project shifts from profitable to highly unprofitable, destroying significant shareholder value. This confirms the project has extremely high sensitivity to revenue fluctuations. Next, we looked at uh the cost of capital. We performed a second uh second sensitivity analysis by varying the WACCC. We recalculated metrics using a WACCC of 6.5% which is a 2% decrease and a WACCC of 10.5% a 2% increase. This helps us understand our exposure to interest rate risk and market valid volatility. Um so here's what we actually found from the WACC. At 6.5% WACCC, the NPV jumps from 9.15 million. Um, so if capital is cheap, the project is very attractive because future cash flows are discounted less. Then at 10.5% WACCC, the NPV drops to -2.48 million. Um, the IRRa remains constant um across these scenarios because it is internal to the cash flows. However, the decision definitely changes. At 10.5% WACCC, our IRR of 9.54 is lower than the cost of capital, suggesting we should reject the project. This confirms that a small increase in the cost of capital can transform this from a profitable project into an unprofitable one. Now we move on to our evolve. So the recommendation based on this rigorous analysis, we move to the evolve phase to formulate our actual recommendation. Um, our executive summary is while the project is marginally profitable in the base case, it is highly sensitive to revenue risk and capital costs. Therefore, I recommend a cautious approach. When talking about strategic fit versus risk, we acknowledge that um, rosteries enhance our premium brand image and drive loyalty. However, these strategic benefits do not fully offset the identified financial risks. This project is extremely vulnerable to market demand and the cost of capital volatility. So our recommendation here is that we reject the project under the current assumptions. This extreme sensitivity to a 20% revenue reduction poses an unacceptable level of risk. The potential upside does not uh does not justify the significant downside exposure. Then we move on to our reflect phase. So our primary rationale for our rejection is that the project's high sensitivity to revenue reduction. A modest 20% drop shifts the MPV to a loss of nearly $24 million. To summarize the risk profile, the base case um marginally positive, the 2.5 million NPV, but with a very long discounted payback period of 9.7 years. The downside of that one is that both a revenue drop and a WACCC increase lead to value destruction. The next steps is that if stakeholders wish to reconsider the project, we must mitigate revenue risk. um establish minimum revenue guarantees or more conservative forecasts. Um we must re-evaluate WACC, confirm if the 8.5% accurately reflects the risk profile of this unique venture, and then we must rescope, explore options to lower the initial $50 million investment. Thank you.",
  "video_url": "https://youtu.be/paz-savwSdg"
}