{
  "student_name": "Jake Patterson",
  "org_defined_id": "037362505",
  "username": "patte269",
  "video_url": "https://youtu.be/eA-VtLVBaWM",
  "transcript": "Hi my name is Jake Patterson and this is my submission for session 11 assignment\n\nDefine:\nThe core question is whether the buyback creates more value than alternative uses of the same $90B—specifically a special dividend, debt reduction, an AI/VR acquisition, or incremental R&D. Key constraints are Apple's liquidity and its current capital structure.\n\nDiscover:\nI identified the finance tools I need: EPS mechanics, leverage effects, ROIC vs. WACC for investment decisions, and agency and signaling considerations. The key is comparing value creation to value transfer across stakeholders.\n\nRepresent:\nI built a small model with transparent inputs—share price, share count, net income, debt, ROIC assumptions—and six scenarios: baseline, buyback, dividend, debt paydown, and two reinvestment cases. Each scenario outputs EPS and Debt/Market Cap so I can see both return and risk effects.\n\nImplement:\nIn Python, each scenario is its own function.\n\nThe buyback reduces shares outstanding and recomputes EPS.\n\nDebt paydown adds interest savings to net income.\n\nAcquisition and R&D scenarios add earnings based on assumed ROIC.\nThe same structure lets me change any assumption and instantly update all outputs.\n\nValidate:\nI check that cash used never exceeds $90B and confirm expected patterns: buybacks increase EPS mechanically, debt paydown lowers leverage, and high-ROIC investments outperform buybacks when ROIC is above the cost of capital.\n\nEvolve:\nUsing the scenario toggles, I compare which stakeholders win under each option: buybacks help short-term holders and option owners; reinvestment benefits long-term equity; debt paydown favors bondholders and reduces risk. The EPS chart makes these trade-offs visible.\n\nReflect:If Apple has credible projects with ROIC above WACC, reinvestment creates the most sustainable value. If not, a smaller, disciplined buyback combined with some debt reduction is the better balance."
}