{
  "student_name": "None None",
  "org_defined_id": "037356171",
  "username": "kim4574",
  "video_url": "",
  "transcript": "All right. Hello, this is Kan and this is my management 310 assignment for um our project number three. And today I decided to make a Pythonbased um goal-based investment co-pilot, which is a financial analysis and tool designed for students and young professionals who are trying to understand their financial goals and how realistic they are and how they should structure their investments. Um, this tool uses AI reasoning, real financial math, external data, and risk profiling to provide personalized context rich guidance. And it also explains why certain recommendations make sense and not just throwing numbers at you. And so, first, young investors struggle with three main things. Oh, and I use Google Copilot for this, but um most young investors struggle with not knowing if their goal is achievable, not knowing how much return they need, and not knowing how risky or conservative that they should be. And the goalbased investment pilot addresses these concerns by calculating whether the goal is realistic, computing the real required rates of return using uh financial formulas and assessing risk tolerance as well as pulling real market data and using the AI model to explain the findings in plain English. So before I walk through the Python code, I just want to talk about the a few like main core concepts that this uh pilot also addresses. It's the first is obviously going to be the time value of money or TVM. um that is truly the backbone of financial decision-m where you should be putting your money and where when and then the tool specifically uses TVM through the future value of annuity formula and which is the monthly contribution times 1 plus the rate um to the power of the number of months over over u I mean minus one over the rate of return per month and that goes us to another concept of the required rate of return which is how much annual return the user needs on average to reach their target amount. Next is risk tolerance. Um the user's comfort level which with fluctuations or losses in their investments and that's going to vary at what stage of career you're in, how much money you're making, what the market's looking like, what the economy is looking like. That's going to change. Um, and then it also recommends an asset allocation, meaning the percentage mix of cash, bonds, and equities that you should be holding in your portfolio, which has different risk profiles and returns. So, for the Python workflow, you can see here you put in things like your current age, what time you want to retire, the monthly contribution, the target amount, time horizon, and years. Um, and it takes all of that information and uses a TVM formula to calculate the required rate of return. If the required rate of return is above 15%, the tool is going to automatically flag that goal as unrealistic. And that's a sanity check because likely you're going to be making about an average of 12% off of any portfolio that you have. And so if your goal requires or is relying on a 15% rate of return, it's probably not a good portfolio. Third, the program is going to categorize the user's risk profile. So, for example, if you're more conservative, aggressive, or even moderate, it's going to be based on like a quiz that the person takes as well as their age. And then the program is going to make an external API call to retrieve the current risk-free rate, uh, which is typically the yield on US Treasury securities. And this is going to use that external data integration that we're looking for. and it's going to calculate all of the it's going to program the program is going to package all the calculated values into a structured JSON which is then sent to the AI model. So for the AI integration portion, the Python script is going to connect to OpenA's API using a private key. And the system prompt enforces the use of Python generated numbers, plain English explanations, as well as um scenario comparisons such as what does a realistic balance investment look like, a safer, more conservative plan, and a higher risk, higher return plan. And the model is going to explain why the goal is or is not feasible. um why a certain asset allocation matches the user's risk tolerance and the pros and cons of each scenario and major trade-offs that you would be making. Um that is going to really show the what or why of a decision rather than just the what gives a stronger foundation. Uh, next you can kind of see here if you put in your age, like your goal for, you know, what you want to be investing, and it's going to use that formula and show you graphically what you could be making throughout the years. And so, um, it not only shows it graphically, but some people, especially like younger people and students, they might not really know what this means. And so having a AI integration at the bottom is going to be super useful. So you can see what would it look like if I had 100% allocation to stocks. What would it look like if I had um bonds? What about if I started earlier? These types of things are really important for people to consider, especially when they're starting to invest. And so experimenting towards the beginning and understanding the effects of each different decision is going to be really crucial moving forward. Um, next the um tool is going to incorporate several safety and trust mechanisms. So it outputs a clear disclaimer stating that the results areformational and educational. It's not, you know, true financial advice that you would have to pay money for and it automatically limits recommendations if the return uh required returns are too high and it prohibits the AI from suggesting IND individual securities. It's also going to reject AI inputs that contain unsupported financial claims and cross-check all numeric values using external external sources. So I think the big difference here with AI is that it transforms like these values just raw numbers um the static calculator into a conversational coach that can that can explain financial concepts and more accessible language and it's going to give those more robust explanations as well. Um, and just like to reiterate, I think something really important to consider is that this is going to be an educational tool that is targeted towards young professionals and students just because that's the type um that I those are the groups that I resonate with most and would find this most useful. And so um this is purely like educational. And I think the big concepts that this project kind of looks over are the time value of money, those risk tolerances, and then also stock portfolio diversification. And those are all things that are going to help you in your ultimate goal, which I think for everyone, is to have enough backing and enough for retirement to where you don't have to be worrying um about having to work into like your 70s. And so this is my project number three. I think it combined the concepts that I found most pressing into a tool that could be used for a group that I found to resonate with the most. Thank you."
}