{
  "student_name": "Kyle Sandwell",
  "org_defined_id": "035947102",
  "username": "ksandwel",
  "email": "",
  "transcript": "Hi, my name is Kyle Sandwell. Today we're doing the management 310 session 10 assignment. Um, let's go over. So, what we're trying to do is that uh we're trying to evaluate Starbucks proposed flagship bro that requires a $12 million upfront outlay. It's expected to operate for 10 years. We must use the firm's 8.5% WACC as the hurdle rate to determine whether the projects create value into recommending accepted accept rejected decision supporting by drivers documentation. Um some parameters that the initial investment is $12 million for building equipment training and it depreciated a straight line over 10 years. The working capital is 500k which is deployed at launch and recovered in 10 years or in year 10. Revenues we get 8 million in year 1, 11 million in year two to five and 9 million in year six to 10. Some operating costs that the cost of goods sold is 40% revenue. Labor is 2.5 million. Rent and utilities is 800k. Marketing is 300k in year one then 100k million 100k after taxes 25% corporate rate. Terminal value is 3 million at end of 10 year 10. Um, we're focusing our analysis on producing a transparent cash flow model, core capital budgeting metrics, sensitivity test, and an executive ready recommendation. Um, okay. So, let's head on over here. So, as you can see, we have our our objectives that we need to determine if Starbucks should invest 12 million in a new flagship roaster. The decision rule is uh if the net present value NPC is positive and the internal rate of return IRRa exceeds the 8.5% WACC then we accept some constraints is that it lasts 10 years we must account for taxes depreciation tax shields working capital recovery and terminal value. Um, here's some inputs and variables. So, year one, 8 million. Year two to five, 11 million. Year 6 to 10, 9 million. And like I said, the expenses is 40% of revenue for house sold. Labor is 2.5 million a year. Rent and utilities is 800k a year. Marketing is 300k in the first year and then 100k from years 2 to 10. Um, some tax and depreciation is that tax rate is 25%. Depreciation is a straight line for 1.2 million a year. Terminal value. Uh, the salvage is 30 million year 10. is subject to no tax as well. So to represent this the cash flow logic. So this is the diagram really we start with the uh calculate the operating income ebbit which is revenue minus cost good solds minus fixed cost minus appreciation. After that we calculate the notepad which is uh ebit time 1 minus the tax rate. Then after that we add back the appreciation because it's a non-cash expense. Then we adjust for capital. So we subtract the initial investment and changes in working capital. Then we find the terminal value by adding the aftert tax proceeds from liquidation in year 10. And after that final step is discount discount all free cash flows FCF back to year zero using WACC. Here's some variables. RT is equal to revenue in years in year T. XPT is the total operation cost is cost souls plus labor plus rent plus marketing in year T. DT is depreciation year T. Um T is the corporate tax rate. NWC's networking capital which is 500K TV is the terminal value of 3 million and then R is the WACCC of 8.5%. Here are the some equations. So the operating logic we first calculate the accounting profit before adjusting for cash. So earnings before interest in tax or EBIT is EB equals is equal to the revenue in year T minus the total operating cost minus the depreciation. And then the net operating profit after tax is the notepad is uh this earnings before interest in tax times 1 minus the year. Then accounting profit does not equal cash. We must adjust for non-cash items. The operating cash flow or OCF is equal to that NOAT plus the depreciation and the free cash flow is uh this operating cash flow minus the cap extension minus NWCT which is the NWCT using the net working capital then uh let's implement this the net present value uh we get the result is 2,691,989 and uh We accept this because it's over zero. The internal rate of return is 12.87% and we accept this because it's over that 8.5% WACC. The profitability index is 1.22. We accept this because it's over 1%. And the discount payback is around 7.8 years. So it takes around 7.8 years to pay back that discount. And then that recovers cost within project life. Then validate this. We find the revenue is 8 million. Then we see the expenses is 3.2 2 plus 2.5 plus8 plus.3 plus 1.2 is equal to 8 million. The EBIT is zero. The taxes are zero. OCF is zero because the income is OCF is zero as I said. Then you add back the uh depreciation which is 1.2 million. So it comes out 1.2 million. Then to interpret this the code output for year one OCF matches our manual calculations. I'll show you the code later. Then to evolve this uh a base case the MPV is positive for 2.53 million and IRR is 12.6%. Which is all over the uh WACC of 8.5%. Then the revenue drop it drops 20% the project creates negative value. So NPV minus 4.07 million makes it a critical risk which is not very re it's not recommended at all. in the WACC change. Good night. Even at a high risk cost of capital 10.5% the project is still positive 1.18 million implying financial safety against interest rate hikes. And then for the reflect the financial rationale the value creation um the project generates an NPV of 2.5 million. Sorry about that. The 2.5 million meaning it creates immediate shareholder value. Then returning efficiency of the IRRa of 12.6% offers a healthy 4.1% cushion above our cost of capital of 8.5%. For the WACC then capital efficiency uh with a profitability index of 1.2 for every dollar invested we generate a$120 in value. Then to reflect on this um the strategic fit of this is that the flagship location acts as a brand halo potentially driving sales and surrounding stores which this standalone model is not captured suggesting the true MPV is likely higher. Then our final verdict is to proceed with the investment but implement strict marketing milestones in year one to ensure the $8 million revenue target is met to avoid the downside revenue scenario. We go on over to our code refers to Gemini. You can see I talked about it. It helped me work through it. It showed me the code gave me some of the equations that I needed to figure out. We go into collab. I'll run this. And as you can see it ran. Here's the cash flow model. You can see makes 8 million in the first year and 11 million all these. And this is an is scenario A there's a negative 20% revenue. Not very good. Uh scenario B is 10.5% WC. And scenario B or scenario C I should say is the BCC of 6.5%. Which is $4.2 million. So yeah, that is my video.",
  "video_url": "https://www.youtube.com/watch?v=4-lvBv1SRX0"
}