{
  "student_name": "Johanna Wen",
  "org_defined_id": "037039526",
  "username": "wen196",
  "email": "",
  "transcript": "Hi, I'm Johanna Win from your uh management 310 class from to 5:20. Um, and today we're going over section 9. Uh, calculate the weighted average cost of capital, the whack, for Netflix, in connection with a hypothetical 5 billion content investment decision. Your analysis must determine current whack. Evaluate the impact of additional debt financing. uh assess project specific versus firmwide discount rates um and compare Netflix's cost of capital to industry peers. So we have you know market being 200 billion a total debt of 14 billion debt of 13 billion uh equity beta of 1.3 uh a bond rating of uh BBB plus a yield of 5.8% 50% corporate tax of 21% current stock price of $450. Uh some of the market conditions are risk-f free rate of 10year treasury 4.5% market risk premium of 5.5% market media whack range of 8 through 10%. and some of this uh strategic context of you know what's going on with the other companies. Um Disney uh capital structure has uh 70% equity 30% debt and a whack of 8.2. Um Amazon Prime Video uses Amazon corporate whack of 9.5%. Um Netflix is considering a $3 billion additional debt in issuance for content investment. And this is this is our goals for today. So before you know I I have I have the answers right here. But um whack is the weighted average cost of capital is a metric that represents a company's average cost of financing its operations through a combination of debt and equity. Uh so that really means uh having a whack of 15% means the company must pay an average of 15 uh 15 cents to source an additional $1 in capital. So the higher the percentage means the more you have to invest um in it and the more that you kind of really you don't you don't you don't get a lot out of it, the more you have to you know squeeze for that one extra dollar. Um, so the higher the whack is, the harder it is to to fund projects and stuff. So we have, you know, where's the So we have the 200 200 bill and it also you know it says, you know, how how big it is the total. Yeah. total market risk-f free rate market risk premium the beta goes here. So it's a whole bunch of you know defining what what we have calculate the cost of activity using the risk free rate the beta and the MRP um calculate you know define the calculate whack of v equals uh equity and debt um equity over v debt over v whack is this plus what's this? So if we're to arguably look at, you know, ice Gemini, help help. Um, yeah. So basically, we got this formula right here. I don't remember asking that. What What is that? Um, okay. What is this? Um, we have that. Okay. Um, scenario got the insert all the little stuff and then we have, you know, printing out, you know, results. do our recommendations and this is kind of what we have. So the current cost of equity is um 11.65%. Cost after after tax of debt is 4.58%. Um so we have a total value fees value of $213 $213 billion. So that's that's pretty that's pretty that's pretty good. But that's only not only that's actually pretty good because a billion I mean people keep forgetting that a billion dollars is a billion dollars. That's a lot of money. So 13 extra billion dollars is pretty solid. But I mean judging by you know you can do a lot with a billion dollars but the fact that you you know if you put in 200 I know that's not exactly what happened but put in 200 get back 13 extra. That's all right. That's all right. Um, we have the Netflix current of 11.2%. We have Netflix post debt which is 11.2%. Um, but the debt of weight is a bit different. So, if we look down to my to my answers, got the uh the Netflix real world is 10.21%. I just I I was curious of current current Netflix whack uh 10.21%. Uh you know the current whack is you know 11.22 and the after the $3 billion issuance should also be 11.22 um Disney is 8.2 which is less than Netflix's. So Disney is making more money or well maybe not necessarily more money because we've seen some of their movies and some of the recent movies weren't weren't too hot but they have you know a less less amount to invest you know like for that extra dollar to to to fund its projects and stuff. So um and evaluate project specific whack being 12.72% right here international content and that's a little like even a little higher. So stuff like you know international I'm assuming international content uh means like you know stuff like the Netflix's Squid Game. Squid Game was great, but we can't always, you know, guarantee, you know, its success as well as, you know, 12.72 is a lot more than, you know, 11.22. So that's it's going to be a little bit more costly to have international content. and comparing Netflix to I mean it only said uh Netflix to to Disney, but I'm going to also do it with Amazon Prime. I Amazon Prime is 9.5. Um and industry midpoint is also 9.0. So all 8.2, 9.5, 9.0. They're all a good portion less than 11.2 as well as 12.72. So it's going to be kind of cheaper over there to easier for them to invest in. uh more more shows, uh more stuff there. It's it's going to be easier for them to like it it costs less to get that one extra dollar. Um and the recommendation. So, not only did uh I asked Gemini to help me with all of this coding because I don't really know a lot. I'm not too familiar with coding a lot. like even after the whole year I I learned a little bit but it it was it was a little hard. So um Gemini helped also create this uh nice graph of you see the the whack being here the cost of equity being here and the after tax cost of debt. So we have a good nice amount that we're kind of earning. Um so we have optimate capital uh structure assessment of the current whack of 11.22% is lower than the calculated uh post. So, I don't know about that, but it's probably like, you know, extra decimals behind 22 maybe. Um, this suggests that based on purely uh this framework, that's a that's a hard word to say. um with risk premium increases, the current low debt uh structure is close to optimal or that the increase of RD and RE um due to the new debt outweighs the tax shield benefit. Um yeah, and so the recommendation is Cloud Tech would Cloud Tech should proceed with caution. I don't know about that, but um yeah, I do. But I'm I'm assuming it meant to say Netflix. The the $3 billion debt should only be issued if the content um investment generates a return significantly higher than the new whack of 8.27%. Okay. And so investment hurdle rate um it's recommending to use project specific rates. US uh content is the baseline makes sense because you know Netflix is in h uh not in Houston but in the US um and international requires a higher hurdle as we could see from over here you know 11.2 is lower than 12.72. Thank you.",
  "video_url": "https://youtu.be/wyilrzuz3xs"
}