{
  "student_name": "Dhyana Pasupu",
  "org_defined_id": "037956934",
  "username": "dpasupu",
  "email": "",
  "transcript": "Hey, my name is Diana and this is my session 9 driver analysis. So to begin my analysis, I first clarified the overall decision that Netflix faces. Um, so they're evaluating a large $5 billion content investment and the question is whether the investment creates value for the company. So to answer that I need to know the cost of capital which is the minimum return required to satisfy their lenders and their shareholders. So that's why uh determining Netflix WACC is essential. Um, and I'm also evaluating how additional borrowing changes that cost, whether certain projects require higher or lower um, discount rates, and how Netflix compares to competitors like um, like Disney or Amazon. Um, framing these questions helps ensure all the later steps and drivers stay focused. So first I identified all of the inputs needed for the analysis. So for equity I'm using CAPM which requires the risk-free rate, the market risk premium and Netflix's beta. Um and then for debt, the relevant input is the yield based on Netflix credit uh rating um adjusted for the tax benefit of interest deductibility. And to structure the WACC, I also need accurate market values for both debt and equity since market values reflect current investor expectations better than the book values. Um I also my main assumptions here clearly um such as um assuming that the new borrowing occurs at similar rates um and that data is a good measure of Netflix's systematic risk um and these assumptions are important because they they shape the accuracy of the whole calculation done. So now to dive into the actual calculation. Um these are the different financial tools that are required for like this specific assignment. Um so I use the WACC structure that blends the cost of equity and after tax cost tax cost of debt based on their market value rates. Um CPM provides the equity component and the tax adjusted debt yield completes the debt component. Um, and I also rely on the idea of the tax shield. Um, and that's lowering the effective cost of debt and um, compare Netflix's results to the typical WACC uh, range in the media industry. And so these are these um, formulas laid out. So here I start visually mapping how the components of WACCC fit together. So this is kind of like an outline of the steps essentially. So first determining um the cost of equity from CPM then calculating after tax cost of debt then finding the um market value weights based on Netflix's equity value and debt value and then finally combining everything to produce a single weighted cost of capital. Um so yeah this is the the whole structure there. Um, and I also represent I'm mapping out how Netflix's financing mix impacts the WACC. So, by organizing the market value of equity, the market value of debt, and the total capital base, um, I show how the the weights feed into the final calculation. Um so for the implementation um I use Python of course to calculate the WCC and run the scenario. So on this slide I show the prompt that I use to generate the code using JPT and let's go ahead and do a code walk through. So if I run it, you can see that it runs successfully. So basically the script here is it's calculating the new debt address to WACC after issuing the extra $3 billion and updates debt values and recalculates the weights and then recomputes the blooded cost. Um and the um the sensitivity analysis section loops through different possible market conditions and gives a new WACC for each scenario. So it helps show how like stable or unstable the company's um cost of capital is when the external conditions change. So this is all that written out. And now let's go ahead and look at the output. Um so the first output shows a Netflix's baseline capital structure um with equity making up the majority of uh financing. Uh the calculated cost of equity based on CPM is shown clearly and it reflects Netflix's exposure to market risk. Um the after tax cost of debt is noticeably lower uh which illustrates the benefit of the tax shield. And when these components are combined using their market value weights, the resulting WACC falls within the expected industry range, which tells us the calculation is reasonable. Um, and the second part of the output is showing essentially the effect of adding $3 billion in new debt. Um, so the debt weight increases while the equity weight decreases, which slightly shifts the WACC depending on how large the tax advantage is compared to um the rising financial risk. Um, and then finally, the sensitivity analysis outputs show the W shows how the WACC responds to changes in the risk-free rate. Um, the market volatility and then also beta. So, higher beta or higher risk-free rate increases the cost of capital. um here which is indicating that Netflix's WACC is moderately uh sensitive to market conditions. So now to validate my results, I first checked whether the WACC fell within the typical media industry range of 8 to 10%. And since Netflix's values were within that range, that's one sign that the model is reasonable. And I also checked each input and formula to ensure that there were no mistakes in the CPM or debt adjustments. Um and then finally the sensitivity analysis um helped confirm that the WACC responds in predictable ways when assumptions change um which indicates that the calculations were implemented correctly. Yeah. So this slide um you can see like me checking if the inputs make sense and then the second step here is the sensitivity testing. Um so in the evolution stage I I extended WACCC beyond this single project. Um so it's important to recognize it's not only used for one investment. Um it becomes a core tool for many of Netflix's strategic decisions. it it informs like project evaluation um long-term budgeting and even corporate strategy because companies need to understand how their financing cost compared to their rivals. Um it also influences how much risk Netflix can afford to take on and how it evaluates uh growth opportunities. Understanding WCC at this level helps connect financial calculations to um more like real world strategic decisions. So to reflect on this whole like process of this assignment, um what stood out to me the most uh was how many different concepts like um CPM, bond yield, tax effects, um market values um come together just to calculate one number and once everything was organized um the calculation itself wasn't too difficult, but interpreting the results required a little bit more thought. So that was like what was easier and more difficult. Um, one challenge was making sure each assumption made sense and it was clearly stated and overall if I were to do this again, I would set up my structure even earlier uh like for the assignment because having a clear framework from the start makes the implementation and validation steps more efficient. And for the assignment, I got a little bit ahead of myself with that. So to kind of wrap everything up and give a conclusion to the scenario, um Netflix's WACCC sits comfortably in the middle of the industry range, uh which means it is financially positioned similarly to major competitors. Um, issuing additional debt does affect the WACC, but not in a way that would prevent Netflix from moving um forward with an investment, especially if the project is expected to generate returns well above the um the cost of capital. So overall the results show that Netflix can continue investing in new content as long as the expected returns are greater than um it's like WACC. All right, that is all. Thank you.",
  "video_url": "https://youtu.be/-V-7djRzx_U"
}