{
  "student_name": "Lahari Bikkavilli",
  "org_defined_id": "035990933",
  "username": "lbikkavi",
  "email": "",
  "transcript": "Hi, my name is Lahari Bikavili and this is my session nine assignment. So as always, I always start off going through kind of like the basic generics of the code and walking through that a little bit and what it looks like. And then I move over to my notes that I have on the left here that kind of are for me, for me to understand the code a little bit more deeply. So starting off, obviously, of course, we're going to start with our import statements. At this point, that's pretty much routine. So we have our import statements. Moving on, I always add comments to understand like the driver. So for example, we're starting with D, so the define and discover, right? So here we have our objective, which is basic. So we're trying to estimate Netflix's current WAC, and then their WAC after $3 billion of additional debt, and project specific WACs, so U.S. versus international, what the difference would be to evaluate a hypothetical $5 billion content investment decision. Oh, sorry about that. Let's bring it back. One minute, and let me run this code to make sure it's still working all good. All right, perfect. So continuing onward, right? So we have, why is it not letting me go all the way? Okay, so then we have our key questions, right, which is going to be one through five here. It's going to be first is what is Netflix's current WAC based on market value? So you're going to see that each question we're going to break through individually and kind of go through a limit of what that question is and then a little bit about how to figure it out. So what is Netflix's current WAC? We're going to go through and figure out what that actually is based on their market values. Two, we're going to have how does issuing $3 billion of new debt change WAC and their capital structure? And this is all focusing on Netflix and their companies as a whole compared to the industry. And then the third will have, should U .S. and international content use the same discount rate? So kind of seeing, like, differences between something here versus Netflix if it was international. And then four, how does Netflix's whack compare to Disney and Amazon? So then comparing it to something that's in a similar-ish market in that sense. And then what capital structure is strategically optimal for Netflix? So given inputs, again, these are all just comments that I throw in because for me, the code, I think, at least for the way that Python originally gives it, I think it needs definitely a few, like, back and forth, kind of um kind of like um what is it prompting like ai again over and over just because i feel like in general like the the code isn't as clear so for this at least it kind of gives a little bit more like comments to understand what the code is really asking so our given input our market capitalization which is going to be represented as e is 200 billion market value of debt d is 13 billion so used over book value 14 billion as market values reflect current investor expectations our equity beta which is just going to be represented by the beta symbol is 1.3 bond yield which is kd is 5.8 percent corporate tax rate tc is 21 percent risk-free rate is rf which is 4.5 market risk premium 5.5 additional debt for investment is going to be 3 billion so then our constraints such assumptions to be elaborated in the video again this is like i put it in for me to have a note that i'm going to elaborate on it which is all going to be in my notes later on so valuation use market values for debt and equity to calculate whack weights cost of equity use the capital asset pricing model so again cap m which is a formula we used quite a while back and a few few session assignments prior to this that's not anything that's new to us and then we'll have cost of debt post insurance post assurance assume that additional three billion dollars of debt does not immediately change netflix's credit rating the bb plus or cost of debt which is 5.8 for the simplifies post insurance whack calculation capital structure assume no preferred stock or convertible securities and then project risk assume international content has higher risk higher rate on a country risk premium so that's just the define essentially breaking through what exactly we did for the driver method as a whole next we have r so refine r which is the modeling choices parameters based on the hypothetical scenario provided so market cap equity we're going to say it's 200 billion total debt market 13 billion and these are all the numbers that we wanted before so for example equity beta we know is up here 1 .3 represented by that beta and we're just listing out what are different things that we can use these different parameters for our hypothetical situation moving on we have our project-specific assumptions. So equity beta in the U.S. is equal to equity beta. So we're assuming that the U.S. content risk is approximately equal to the corporate risk. And then equity beta international is equal to 1.5. So we're assuming a higher risk for international content. So we can kind of go back to the equity beta here. For the U .S. we're assuming is 1 .3, but for international we're assuming is 1 .5. And then we have the extra country risk premium, which is 0.01. So 1% for international market risk. Then peer data, these are our competitors in the market. So we have Disney, which is obviously going to be representative of something similar to Disney Plus, and then Amazon, similar to Prime Video. And then we're going to have 8.2% and 9.5% for those both respectively. And that's going to be the end of our refine, so how we're changing the different numbers for our actual scenario. Then we have our financial calculation function. So here we're going to calculate the cost of equity using CAPM formula. Again, this is our formula, and then we're going to return that value. Then we're going to calculate after-tax cost of debt, return, calculate after-tax cost of debt, and we're going to return that value as well. And then we're going to calculate WAC again here, officially calculate WAC here, and it's going to be calculates the weighted average cost of capital, which we already know is WAC. This is a formula that we've already seen and used in prior session homeworks. Then driver implement, this is where our actual calculations come through. So we have our component costs, right? So cost of equity current is equal to the calculate cost of equity. So we're going to pass in our risk-free rate, equity beta, and market risk premium. Then cost of debt after-tax current, which is equal to the calculate after -tax cost of debt bond yield and tax rate then we have current WAC so WAC current total value current E weight current D weight current is equal to calculate WAC and then we're passing in all of these different parameters just trying to calculate what that current WAC value is and then like we said before for number three essentially each of these numbers are kind of going to go through all of our four or five questions that we had so number three what is the WAC after the three billion debt issuance is going to be the new total debt so total debt market plus additional debt. And that's going to be WAC new, total value new, E -weight new, D-weight new, calculate new. So obviously we're going to use all these new values because we're including this $3 billion debt assurance as well. And then project specific WAC, we have the U.S. project WAC. So this is using the 1 .3, I believe, for the beta value. And we're going to say assumed risk similar to current firm WAC. So WAC U .S. is equal to WAC current because we set those to both equal to each other. And then international project WAC higher risk. This is the 1.5 beta that we use here essentially passing in that equity beta international so essentially we're doing the same calculation for both but for one we're obviously going to be using a different beta value because one is going to be representative of the international market and then one is going to be representative of the U.S. market and then we have the WAC international and then calculate WAC passing our parameters. Finally for our last question we have hypothetical target WAC so Disney like 70-30 so we have the total value current e-target is going to be 0.7 times that the hypothesis or hypothetical and then our whack target depending on those numbers as well so moving forward then we're gonna have the driver which is the validate so sanity checks and output so this is where it's gonna be implement and validate the whack calculations so we have cost of equity that we're printing out when we're passing and what the actual cost of equity times a hundred to get it as a percent and then again formatted the two decimal places this is exactly what we calculated earlier but just making sure formatting is correct and all these print statements here are gonna be for formatting right because what's the point of the numbers if they're not being able to be read properly and understood in the context of the problem as well so as we see for cost equity we're gonna do the same for the after tax cost of debt and then for netflix's current whack we're gonna go through these questions again here we're gonna have the equity weight debt weight netflix netflix's current whack which is that 93.9 times 11 .65 and then whack current and then whack after three billion debt assurance debt assurance sorry that we're issuance oh my gosh that word is so difficult for me to say and that's gonna be the new equity weight um new debt weight and then whack after issuance which is the 92.59 times the 11.65 again numbers that I'm briefly skimming through the code just because for me these numbers as a whole don't really make sense until I put them into context of the actual problem so when we go through the actual summary of what this means I think it'll be a little bit more clear especially especially since these are all print statements we know that this is exactly what our summary is going to contain so I'm going through the summary I'll explain those numbers a little bit deeply so that's why for now I'm just skimming through it a bit. WAC decreases due to the tax shield effects and interest in tax deductible, lowering the overall cost. Then we have the project-specific WAC, so U.S. versus international content. U.S. content WAC assumes similar risk to current firm, which is equal to WAC U.S., again, making it into a percentage, so just formatting it properly here. International content WAC, which is higher risk because we know it's a higher beta value there. And then assumptions for international higher beta that 1.5 plus 1.1 for the country risk premium the higher international whack is a required hurdle right to compensate for added and political risk so that's essentially the hurdle that we have to again all we'll go through in a bit here for a second and then target versus current capital structure this is our scenario so hypothetical disney like 70 equity equity and 30 debt whack and then we're using that whack target formula to figure that value out then visual visualization as always for the last few homeworks i've been trying to figure out what display or what data visualization is the best way to understand this data and for this one again I thought that a line graph was the best way to go this one did take a few times prompting with AI and honestly did take me upwards of a few hours to kind of get the graph to look exactly the way I wanted it to um I was really tweaking like the legend and making sure that the points were specific and colors were different and fonts were good and everything said it was a little bit more clear for anyone that was using the graph what the graph was actually trying to represent and I do have notes on how to explain what the actual graph is so I'll just kind of skim through this for now, but it plots the WAC sensitivity to the debt-to-value or DV ratio, a proxy for leverage. Moving forward, these are just the different points we're plotting on it. So the current WAC, WAC post assurance, using that 70 -30, again, that we talked about for Disney, Disney WAC, and then where you have Amazon's WAC as well. And then WAC sensitivity to capital structure, which is leverage, debt -to-value ratio, which is that DV, weighted average cost of capital percentage. Again, so our WAC value as a whole. Then here, this is the important part. I did add a legend which i think if you sum over you can kind of see a little bit about what that legend is and what this information is as a whole and so moving on we have our drive expenditure e which is where we're actually explaining what these numbers mean so we have explaining the peer comparison and cost drivers so we're again printing out netflix's whack disney's whack and then amazon's corporate whack which is used again like i said for prime video the equivalent so for our comparison we're seeing that netflix is around 11.2 percent so they have the highest WAC which means that they're driven by a highly equity heavy capital structure about 94% equity actually because all this is going to be printed and I do know that it's going to be printed I think these are values that I'm going to come back to and skip over for now just so we can go through a little bit more in the summary but essentially we're going to do the same here for WAC as a hurdle and investment decision and then finally the driver recommendation so what I recommend moving into the actual thing before we get into that fully I will take time to go over what the code is doing big picture so as we know we're using python to estimate netflix's whack essentially and see how it changes if they take on more debt and then connect that to a 5 billion content investment decision for netflix so what i'm currently doing is i'm calculating netflix's whack and i'm using a market cap equity of 200 billion market value of debt 13 billion and a cap m value and i'm using cost of equity from my cap m formula and i have an after tax cost of debt which is a bond yield times one minus the tax rate here i'm recalculating whack after netflix issues an extra three billion dollars of debt so this is something that we did see earlier in the code where we calculated their whack and then we calculated the difference in it when we added that three billion of debt and then i'm building project specific whacks one for u.s content one for international content again for international we're assuming a higher risk of 1.5 compared to 1.3 and then i'm comparing netflix's whack to disney 8.2 and amazon 9.5 and seeing how netflix stacks up visualizing how whack changes its leverage debt value changes ending with the capital structure recommendation for netflix how much debt it reasonably should use and how it should choose its discount rates for different projects going forward so essentially what my ultimate um well i my ultimate uh sorry what i'm trying to say my ultimate recommendation for netflix is in that sense so overall it's about connecting capital structure which is the mix of debt and equity to cost of capital and then to make investment decisions like should we spend five billions on this or not like is it worth it or not and that kind of to me is the most important part right like what is the real world context of this so in terms of the session assignment that part specifically we're focusing on is this five billion dollars of extra um five sorry is this five billion dollars worth it to be spent on extra content is this an investment that's worth it or is it potential for netflix is it something that they should at least look into so two how i use the driver method i did touch on this a little bit more in the code so i'll through this. I very much structured my notebook and my collab around driver framework and my code in general. So Define and Discover, I think the big doc string that Define and Discover, it states the objective. This is the entire thing at the top that I can explain here, where at the complete top I give the objective, the given inputs, and I give the constraints and assumptions that I have. So I list what is Netflix current whack, how does 3 billion extra debt change that, US and international, do they compete, do they need different discount rates, how does Netflix compared to other things like disney plus and prime video and then what's the optimal capital structure and then i list all the given inputs as well which you can see are right here on the right side if this will highlight there right here on the right side and i also in parentheses decided to put what letter i'm going to use to abbreviate that value just so it's clearer looking back so then say all my main assumptions i'm using cap m for cost of equity and i'm assuming the three billion dollars of new debt that does not immediately change the bond yield um it shows how i did my thinking up front exactly before touching on the calculations right so how i actually understood what the assignment was before i just dived right into the assignment moving forward for refine this is under refine section which is going to be around here i lock in modeling choices right so i send values to constants like market cap equity total debt market equity beta etc this is when i actually lock in what values i'm going to throw in which is going to be seen right here the 200 billion 13 billion on the right side here essentially lock in what values i want to use just so i can be able to make these calculations as necessary and so decide how to model u.s versus international products. U.S. content uses the same beta as the firm. International content gets a higher beta of 1.5. This is all stuff that we've covered a few times now so we know this. Again, I've just added a little comment on what it is, but this is where I refine the problem into a precise model with very specific parameters and assumptions so I can move forward. Next is implement. This is where I do all the actual math, which we can see down here, all of our actual formulas. So I calculate cost of equity. So I calculate cap M, calculate after tax cost of debt calculate WAC and then I compute WAC for current Netflix the way it's standing currently I calculate it for after three billion dollars of debt I calculate it for U.S. content being equal to the firm WAC that we currently have set the market for market WAC and then I do WAC international with that higher beta value of 1.5 and then the target also so a hypothetical Disney like a 70-30 equity debt structure and so this is where all the numbers like 11.22 percent WAC now 11.13 post debt and 13.66 for risky international projects are actually computed so if i head down here to our summary as well so you're going to see cost of equity you're going to see the total value is going to come to 11.65 this is my actual whack calculations after tax cost of debt is 4.58 netflix current whack is going to be 6.10 and then or sorry the equity weight is going to be 93.9 and their debt weight is 6.10 again trying to get that equity that 70 30 equity debt structure that we were talking about earlier netflix's current whack is going to be 11.22 and then after that three three billion debt assurance we can see that their new equity weight is 92 .59 so we can see that it actually decreased their equity weight after adding that three billion of debt which makes sense and their new debt weight increased here so we see 7.41 compared to 6.10 and then this is the most important part in my opinion the whack after this issuance we're going to see is 11 .13 so even though it stayed fairly similar we can see that it did like decrease a little bit after the $3 billion debt assurance. And then I have a comment here. The WAC decreases due to the tax shield effect. Interest is tax deductible, which lowers the overall cost. Then we have project -specific WAC, which I also calculated. So U.S. content WAC, assuming similar risk to current firm, which is at 11.22, which is why this number is the same because we assumed the same WAC in general for these. Then international is going to be 13 .66. We expect this to be higher because we use a higher beta value. And so assumptions for international, higher beta, and a 1% country risk premium. And so the higher international WAC is the required hurdle to compensate for added FX and political risk. And so target versus current capital structure, this is a scenario. So moving over to the validate here, just trying to work back and forth with them. Validate under driver, I implement, I print the component cost. So this is all the numbers that we just went over, that 11.65, all those different fun stuff. So 11.65, I know we went over 4.58, things like that. So I won't bore you with going through it again. But the check is essentially that more debt, which is cheaper and tax deductible, slightly reduces WAC. A more leveraged Disney-like 70-30 structure, so we saw that a little bit later, the equity weight, new debt weight type of thing. Closer to around 9.5, which is an industry range of 8% to 10%. This acts as a check that the model behaves in a way that makes economic sense. And as we can tell that the numbers fall within our ranges, we know that it does make economic sense. Moving on to the explain section, so I personally think that E and R are the most important sections of this. but we see that in the explain section i switch from pure numbers to narrative so translate the whack numbers into plain english comparing netflix wax directly to disney so 8.2 percent for disney shows that they have cheaper capital amazon 9.5 also cheaper than netflix in terms of their capital and then we're explaining why netflix's wax is higher they have more equity heavy which means they have more expensive capital and also because they have a higher beta which is a systematic risk and then they have less diversification versus their peers right they're a lot more specific so explaining how whack becomes the hurdle rate for the 5 billion content investment we use 11.2 for normal u.s content projects use 13.7 for higher risk international projects this is the stage where i'm clearly showing i understand what the formulas actually mean for decision making so moving into our um which we can see here i will come back to the graph in general but going back to e here so we can see disney's whack is 8.2 amazon's is 9.5 for prime video and netflix is 11.2 so netflix is clearly at the highest with their whack value followed by prime video and then followed by disney and so for the final we can see the high equity capital structure about 94 equity and a relatively high beta indicating a higher systematic risk relative to the market then for disney 8.2 we see the lowest whack which we just talked about is which is mainly due to they have a significantly higher leverage so 30 debt which maximizes that tax yield and a lower overall business risk due to diversification across media parks and products so when you think about netflix for example they only have their platform netflix mainly focuses on that and that's it versus if you compare it to something like disney disney has parks they have their disney plus they have disney movies they have um disney pixar things like that a lot of different things that are connected in their business so they're a lot more diversified even amazon yes amazon has prime video but mainly they also have their actual amazon store and along with that i know that they recently started amazon grocery and amazon tvs and things like that as well so this suggests netflix capital is more expensive than most both of their major peers reinforcing the strategic need for more efficient leverage and so whack is a hurdle and investment decision so application to the hypothetical five billion content investment whack acts as the minimum required return or hurdle rate for the investment to be value to be worth it essentially and so um the whack uh excuse me so for average risk u.s content cash flow netflix should use the firm wide whack so around 11.2 for higher risk international so anything they're doing that's not in the united states they should be using the higher projected whack about 13.7 which we went over earlier and so only content project with an expected internal rate of return IRR above these project specific hurdle rates should be approved so essentially saying anything that's below this rate this IRR rate is going to we can assume that it's going to cause Netflix to lose money so for any of their new projects whether it's a new movie a new platform that they're trying to build new tv show anything of that sort should be above that value just to ensure that they're making a profit finally my driver recommendation in the final recommend block I give this where I give actionable strategies so i think personally netflix should increase their leverage gradually so from six percent um for their dv to something like 20 to 30 to lower rack towards the industry range but it must protect its bbb plus rating to avoid raising um their kd value too much so it should always use project specific and just to go back and kind of give a little more that kd is their bond yield value so i think in order to protect that bond yield to avoid raising their their bond yield value too much and to kind of protect that value they should um uh do this but protect that value it should always use project specific wax especially higher rates for international content instead of blindly using one firm wide whack for everything so just to make sure netflix is a little bit more all on the same guide and making sure that they're actually using their um making sure that they're doing the best for their company as a whole they should be assuming assuming the different whack values just to ensure that they're actually making sure that they're making a profit especially if it's something international versus u .s because in real world context, we know that Netflix has a Netflix itself in U.S., but it has different movies and content that's on India, for example, Australia and different parts of the world. So this closes the loop from data model insight, actual capital structure policy. Going back down to my recommend here, I also go through it, which essentially increased their leverage strategically. They should gradually increase its use of debt from the current 6.1% towards a moderate range of the 20 to 30 to take advantage of the tax yield and move its back closer to what the industry range value is currently. They need to maintain their credit rating, so any increase in debt must be calibrated to avoid credit downgrade. So they need to maintain that status, right? They're a very high credible place. They need to maintain that. A downgrade would raise the cost of their debt and offset the tax shield benefit that they're trying to gain in the first bullet point. And then finally, their enforced risk-adjusted discounting. This is what we just discussed. Depending on the location, they need to have a specific used WAC to ensure that they're doing the right. And then lastly, to finally just briefly go over this graph here a little bit, the graph essentially is the visual part of the integrating finance technology the graph the excess is going to be your debt to value so the dv ratio and percentage y is going to be the whack and percent which is the overall cost of capital at each leverage level i plotted a blue curve so this blue curve down the middle is going to be the hypothetical whack curve right assuming a constant ke and kd which we know is that those different values that we defined above the formula used for whack i put here but it's just the standard whack formula shows how whack changes as we gradually increase the share of debt in the capital structure. So as you can see, as you increase your WAC, you lose the debt-to -value ratio here. It gets lower here versus as you decrease it. Then the green dot is going to be the WAC post-issuant. So this is that $5 billion thing that we had here. So current DV is about 6.1. Current WAC is about 11.2. So we can see that here if we go 6 .1, 11.2. That makes sense there. And then the red dot marks WAC after the $3 billion assurance. so red dot here we can see 30 and then 9.5 there so we can see that it significantly dropped from the whack post assurance and from the current whack of 11.22 which makes sense because we see the numbers here so 9.53 is going to be less than 11.22 in that sense then um gold dot represents a disney-like capital structure and the gold dot is i'm not pulling up here for example but that we would see represents disney's which is probably gonna be a little bit higher up on the curve and then um oh sorry about that the disney's whack is supposed to be here i don't know why says gold dot that's a mistake on my part but it's supposed to be the dotted line i knew i added it in there but we can see it's very consistent kind of keeping with the 70 30 target whack there and then finally our two horizontal dash line one for disney's whack one for amazon's whack 8.2 9.5 we can see the difference here so one of these is going to be amazon's that's down here this one up here is going to be disney so we can see disney's whack is higher and so how to explain in real worlds that's what really matters right low leverage little debt um netflix whack is relatively high because it's relying mostly on equity which is very expensive as netflix carefully adds more debt up to a reasonable range whack will fall thanks to the tax shield and the fact that debt is cheaper than equity if we move something closer to disney's leverage our whack can move closer to nine to ten percent which would give so essentially we're saying that we could move our whack a little bit closer to this range and kind of get away from that 11.2 range which isn't really comfortable compared to the industry which would give netflix a lower hurdle rate and make more projects look attractive but in reality at high leverage both would increase because of default risk finally going into the summary in the real world context here um most of this we did already cover so i'm going to skim through it but we know that netflix current whack is higher than disney's and amazon's and then we know after adding it their whack drops but only by a little bit by about 0.1 there more leverage structure the 70 30 debt would bring their whack down to around 9.5 which is much more competitive and better compared to the market for the five billion dollar current investment whack acts as the minimum return netflix needs for us content we use 11 .2 as the hurdle rate for international we use that 13.7 and it's important for them to use the different rates depending on where they're putting out content um real world strategic takeaway netflix has a very expensive cost of capital than its bigger competitors which means fewer projects clear that hurdle rate it's hard to justify very large content spends unless the returns are very strong by gradually increasing leverage netflix can lower its whack make more projects financially viable and compete more effectively with their competitors, Disney and Amazon. And so at the same time, they can protect its credit ratings so not to push their borrowing costs up at all and be disciplined about the risks that they're using. So again, that's what I was talking about, making sure that they're using specific rates for different geographic locations. So overall, my analysis shows how Netflix should balance debt and equity and how to set the right hurdle rate, which decides whether a $5 billion content bet is actually worth it. So yeah, overall, this is my session nine assignment. I enjoyed this one a lot because I thought it was content that was relatable. to me as someone who uses prime video disney plus and netflix but or disney and netflix but yeah that was it and i hope you enjoyed thank you",
  "video_url": "https://youtu.be/JmUBCcm6Cxw"
}