{
  "student_name": "Noah Azevedo",
  "org_defined_id": "036596149",
  "username": "nazevedo",
  "email": "",
  "transcript": "Hi, my name is Noah and this is my work for session eight assignment, which focuses on market efficiency and behavioral finance. And uh throughout this uh assignment which focuses on the GameStop short squeeze event of 2020-2021, we will do an investigation on its market efficiency. And as the first critical step of this assignment, we will first verify the statement that GameStop traded at uh 4 cents in August 2020 and if incorrect—which it is—we will document the accurate figures and determine appropriate communication uh approach for correcting the professor, the person watching this video. So I included, as kind of a context to the problem, we have the event timeline as you can see here. We have uh key data points and we have the most important part of it, which was the required analysis. And using deep research in uh Gemini, I made it in a way that uh the required analysis was actually sections of the actual uh document that we created, the actual market efficiency uh analysis. So um I'll read that. I'll read two of those quickly and and we'll we'll continue on with the framework. So we have to verify all stated historical price data and document corrections. Test which form of market efficiency—weak, semi-weak, strong—was violated, evaluate whether rational investors could have profited systematically. And we have to compare uh efficient market hypothesis predictions to observe uh behavior while also assessing behavioral finance explanations for observed anomalies. So utilizing the driver framework, we have to first define and discover, and for this assignment, it's the most important part. So the goal here is to have a clear understanding of market efficiency uh testing problems and research design. So the core problem here is that, as I mentioned before, we're using the GameStop event and uh we're using as a real-world case study to test a famous financial problem or financial theory called the efficient market hypothesis. And to explain uh the EMH simply, it's the idea that stock prices already reflect all available information. So, if true, you can't really beat the market because there's no undervalue. Uh there's no undervalue in the stocks that you're going to buy or that you own, potentially, with the the very bold statement that the price is always, quote unquote, right. And uh first, as I mentioned before, before we actually um start the actual analysis, we have to have a data verification. And uh we discovered that that was incorrect and that after adjusting for uh GameStop's 4-for-1 stock split in 2022, the historical price in August 2020 was in the $1.85 to $2.50 range. And the other core facts that we had available are all correct, as you can see here. Now that we have actually defined, I think it's important to show you what uh Gemini has created, and I'll do that right now. So let me just bring it over here. Perfect. So uh with all the information, it started uh doing its research on multiple websites and then essentially uh developed this executive summary. And I could read over it, but what I really want to show—and I'll go over the most important parts—is uh here, the report objectives and structure. So we have, as I mentioned, section 2, 3, 4, 5, 6, 7 that all relate to the original question on the required analysis uh section of the assignment. But now I will actually go back to the Word document and uh we'll go on. So the analytical framework that we used, we used two lenses uh of competing financial theories. That was uh the EMH and behavioral finance, as you could could have seen in in the the beginning of the the document. And um we wanted to to test with one assuming investors are rational and prices reflect fundamental value, but also the idea that investors are human and not perfectly rational. So obviously there's going to be some psychological uh biases like greed, fear, and a tendency to follow the crowd, uh which is often uh mentioned or considered uh the fear of missing out, FOMO. And consequently, that can create market bubbles. Uh a market bubble that may be occurring right now and um is in the media a lot is the AI bubble, and how that will uh turn out relates directly to behavioral finance. And I thought that was an \"aha moment\" for me uh while doing this assignment. And uh to test the EMH, we must define its three forms. And the key question here is what information is reflected in the price. And then we have the three types that I mentioned before, which is weak form, semi-strong form, and uh strong form. And essentially, I think the most important ones to to mention is that weak form is all past price and volume data. Uh and uh strong form is all information, public and private. And semi-strong would then be all publicly available information, like news articles, SEC filings, and company fundamentals. And then we want to to hypothesize that the GameStop event represents a major violation of the semi-strong form of the EMH. Now we implemented. And essentially here, we used uh the method uh the capital asset pricing model, and uh which I explained in the other assignment, so I don't think I have to go into detail. But it really is uh determining a stock's expected behavior and how uh it correlates with the entire market. And uh we found uh the anomaly, and we also use tools such as uh uh yfinance found in Python to organize the data and uh run the regression model. So here this can be seen... uh... going and and you can see all that I mentioned. So everything testing on on the weak form violation, the semi-strong form violation, and uh uh the strong form violation. I think we'll we'll we'll go on to that. But you can see that, as I mentioned, uh the document did include that, the executive summary did include that. And in this case, uh the semi-strong form violation was uh—as, if I'm... if I stand corrected—did a clear violation of of what happened in the GameStop uh event. But I was getting ahead of myself. I wanted to show the actual uh uh capital asset model um pricing model. And but here we have all the the math behind it and therefore later the conclusion, which is the GameStop saga was far more than a transient market anomaly. It was a watershed event that exposed deep truths about modern market structure and theory, leaving lasting implications for investors, academics, and regulators. And this just relates to the idea that behavioral finance in this case took on a really big role, and I'll go into detail on that uh in the findings. So finding one: there's a clear violation of semi-strong uh EMH. Uh the event study show... which show massive statistically significant positive abnormal returns during the squeeze. This confirms the price surge was not driven by new positive fundamental news about the company. The price became completely unglued from its fundamental value, which analysts put at uh between $10 to $40. Therefore, the market failed to rationally incorporate public information, violating the semi-strong form, as I mentioned before. Finding two was that... why wasn't this fixed? And uh the limits to arbitrage. So the question was that if the stock was so overpriced, why didn't rational investors just short it and push the price back down? Well, that can be... uh... uh and what is short selling, actually, before I go on that? So, shorting is betting a stock will fall. So, you borrow a share today for $100, wait for the price to drop to $40, buy it back, return the share you borrowed, and pocket the $60 profit. And um... we're into how GameStop comes through this. This is a perfect example of noise trader risk, uh which is uh the risk that irrational traders uh can stay irrational longer than you can stay solvent. And then uh here we have uh in the \"evolve\" part, the application of efficiency insights to investment strategy. And overall, this just kind of relates, this last part that I I I talked about really relates to this active versus passive debate, where the GameStop event uh paradoxically supports both investment strategies. Which in the case for the passive would be um... to not use the market as a casino. And in terms of being a student studying this, uh the average person should avoid and stick to low-cost, diversified index funds. And uh the case for active investors is that the stock... the event proves the market is not always efficient. This creates huge opportunities for skilled active managers to find and exploit mispricings caused by noise traders. And as an overall reflection to what... all the information that I kind of went on about, uh the market is usually efficient, but it is vulnerable to \"black swan\" events where human psychology, amplified by modern technology—an example of this is social media—overwhelms rational price discovery. So this whole saga is a lesson in adaptive markets. It shows that finance is not just a spreadsheet. It's a complex uh human system where psychology, technology, and market structures collide. And at the end of the day, you cannot predict the future with 100% certainty. If you were able to, you wouldn't... you probably wouldn't tell anybody. So, uh yeah, this was my project. This was my work on it. Um, I think I'll just go on showing the sources, uh kind of an overview of what uh Gemini has used and what I have used consequently to to to present this. But you can see that many things were used and uh uh not necessarily copied and paste, as you can see here, but it was processed and... um oh yeah, no, this was actually... these sources were read but not used. Sorry, m- mild confusion. Thank you.",
  "video_url": "https://youtu.be/4SFa3LJpt1w"
}