{
  "student_name": "Isabella Corrales",
  "org_defined_id": "037007344",
  "username": "icorrale",
  "email": "",
  "transcript": "Hello, my name is Isabella Corrales and today we are analyzing the GameStop short squeeze from August 2020 to February 2021. So the goal is simple. Did the market act efficiently? So we will determine which forms of the efficient market hypothesis were that were broken and use the behavioral finance to explain why GME price went from a few dollars to nearly 500. Far above its fundamental value. So let's start with the facts. It says to verify that this statement is true, and if not, what is it? So. For that, um, I can go over here. So it is claimed that the GameStop was trading at just 4 cents, but that's not true. And I and if I go to the Yahoo Finance. It will show it down. If I scroll down to the right date. At 1.67 for close value, so. That is 1.67 per share at the close for August. So it's still low, but it is nowhere near zero or the four cents that it was at. It also states the same number and this on this website. So I verified that very quick timeline, which we can jump back over here. We have that the that Ryan Cohen acquires 13% stake which I did validate in this website briefly show right here is position at 12.9 stakes so which is about 9 million shares so rounded up that's 13% but just to show that I did validate that along with over here when it says that when Reddit and Wall Street bets drove the price surge up to 483 that is also confirmed here and I mean you get the just but it says that it was actually over 500 so that was a little different near 30 times the original valuation And then the short interest peaked at 140 afloat, which actually did as well say in this website, but also in this one. So that was honestly, I think easier to find than on the other. Oh yeah, it was easier to find on the other website. There we go. Approximately 140% of GameStop's public float had been sold short. So anyway, yes, all these things were verified. To go on with it, we have the aftermath that hedge fund Melvin Capital sustained a 53% loss. Um, our 10, say that analysts estimated a 10 to 40 per share, which clearly is not what happened. And that trading restrictions also happened, um, at Robinhood, which is true. So to represent this information, it's about how we are going to analyze it. And that is through the weak form, semi-strong form, and strong form. So for the weak form, prices already reflect all past price data. So to kind of implement that, we have to see if the GameStop broke the rules of that market efficiency form. So In the weak form, since prices just kept rising and people made money just by following the trends, it looks like you could take what was happening, like the past movements, and make momentum out of that because of the fact that people would jump on the trend and could predict those short-term gains that they were seeing other people get. So from that angle, it seems to violate that weak form efficiency because of the recent price trends provided those profitable signals. For semi-strong form, it's the prices reflect all public info, such as like the news and announcements. For this, I would say that the surge that happened here in January 2021 violated the semi-strong form because as down here as I was saying they just predicted the 10 to 40 but that cannot justify the actual price reaching hundreds of dollars and this jump was mainly caused by public social media which is the Reddit um and the wall street bets um different retail buying and just heavy option trading so under the semi strong The public information should actually represent or reflect the prices, but here the prices rose and fell wildly or widely with online discussions instead of actual like fundamentals. It was more of the social media aspect than actual economic sense. And then strong form. So strong form prices reflect all of the info, even like insider info. And for this, the strong form was also violated because, well, it usually is in most markets because it says that even, you know, insiders cannot earn excess profits, but In this situation, I think some early traders, option riders, and investors who could predict that retail surge made huge gains, which just, I kind of think, you know, can suggest that some people just had a good timing, like better timing advantage. But I think testing this fully would require some more of that insider private. trading data, but, you know, to go down. Okay, yeah, yeah. So that was these first two. And then Right here, evaluate whether the rational investors could have profited systematically. So I would say some did, but consistent, excuse me, but consistent low risk profits were nearly impossible. Really the early buyers and if you have the hedge funds with long or options exposure earned huge gains, ones that were in it at the beginning rather than the short sellers like the Melvin up here, which sustained that 53% loss. So this kind of shows that this systematic profit was limited because the shorting carried unlimited upgrade or upside risk. Yeah, 140% for the 140% that was there, which means that the short interest exceeded the, as you can tell, exceeded 100%, which restricts arbitrage. Arbitrage, yeah. And to go on with the fact that trading restrictions were implemented, this um made the volatility uncertain and um then with yeah then with the clearing the congressional hearings um you know had just collateral demands that just disrupted trading as well um and then the behavioral forces with the social media momentum, overpowered actual fundamentals and timing models, although some people could. So really, yeah, only the investors willing to take that extreme risk or just for some reason timed the market perfectly were able to profit. But most rational investors, sustainable like low risk gains were just not really possible. But so to compare the efficient market hypothesis prediction to observed behavior, I would say that the it is observed in the rapid, the rapid increase of the price and Just that prices, it diverse or diverged massively from the fundamentals. As you know, we already talked about the analysts thought it would be $10 to $40 versus the hundreds of dollars. So price dynamics were strongly correlated with the social media activity in retail auctions. such the volume just flows rather than the actual fundamental data. And yeah, so and then also some just academic and regulatory reports that I looked documented that those social media posts were is what caused those spikes in volume and price. So validated that thought. Excuse me. And then also the market microstructure with the constraints of the up here, the hearings, the market manipulation there. And then we have the trading restrictions here. These large just disconnects like it affected the ability to trade. So out those outcomes could have not been predicted by the EMH because they this happened in the February 2021, you know, so it was not predicted. So yeah, it predicted much smaller, more fundamentally driven values than the actual observed behavior of what happened, which was driven by more retail action and momentum, which is inconsistent with the semi strong for the EMH. And to kind of validate, I guess, why the markets did break down. So And just another term for what I was talking about is herding. And this is that the investors piled in because everyone else was buying, especially like with the Reddit and Wall Street Bets influence and you know, overconfidence could be another way to say how these early wins that people made like encouraged other people or made other people think that they could also win and they wouldn't lose any. Which, you know, is also just non-financial motives with the whole jumping on The bandwagon of to fight Wall Street, which is what the movement was on Reddit. And then, so yeah, that emotional motivation kept the price high at the 483 and even reported in a different site was above 500. So just around that 500 price, even when it really made no sense. So, Yeah. And then kind of some of the actual fundamental things with the 140%. So the GameStop had 140% of its available shares shorted, meaning that there were more shares borrowed than actually existing for trading. So. That created guaranteed buying pressure once this squeeze did start. And, you know, since this was such a miss priced stock, you know, 10 to 40, like they weren't, they didn't price that right. It became too, too risky. And these losses can be evident at the as you know, the Melvin lost 53%. And then just another thing that when the oops, you know, when there are the restrictions on buying, it shows that it showed how fragile it actually the market system actually was because with these restrictions, it couldn't really handle, the infrastructure itself couldn't really handle the volatility. So just a combined effect of behavioral forces drove prices up while the structural barriers of these restrictions kept rational investors from restoring efficiency Um, which really just, you know, it all pops. Um, but to kind of reflect, I guess, on what we learned, um, GameStop, I'd say proved that the market is usually efficient, usually just, I don't know, it was usually kind of on the lower side. But with this social media hype and the emotional investing that went into this and the structural stress, it all collided and efficiently just efficiency completely just breaks down. Yeah, I would say it's kind of just supports what some would say is a frictional market. But, you know, it works well just on it's it works okay on its regular day. But having all of that pressure, it just gave out. So I would say kind of some maybe lessons for that type of scenario would be to have more transparency around those short positions so that these short interests can not spiral 140%. Yeah, I would also say that these, these, you know, different restrictions and rules, I guess, should be reviewed to prevent brokers from having to halt trading. And yeah, definitions of these market manipulations need to be updated to include like coordinated trading and on social media platforms. So I would say just short summary of the GameStop was just a wasn't just a funny story of, wow, this, you know, social media posts made it go up, made the stock go up. It was a real test of exactly how efficient a market really can be and shows just the psychology and emotion and some market, you know, mechanics. like the market manipulation or everything when it collides, how strong and efficient is your market or is that pressure too much for it like it was with the GameStop. So yeah, because it can fall apart fast even if you've got something steady going. But yeah, definitely things to take into account. Thank you.",
  "video_url": "https://youtu.be/gqAifV0X74I"
}