{
  "student_name": "Anne Pumphrey",
  "org_defined_id": "037166275",
  "username": "apumphre",
  "email": "",
  "transcript": "Hello everyone. Um, I'm Ann Pumphrey and to start off this assignment, I needed to verify historical data for GameStop. Um, the statement GameStop traded at 4 cents in August 2020 is incorrect. While validating the historical data for August 2020 baseline, I referred to Yahoo Finance data. I found that GME was trading in the $4 to $5 range during that period rather than 4 cents. I have proceeded with my analysis using uh $4. After doing this, I need to test which form of market efficiency was violated. The first form was weak form which means that future prices cannot be predicted by analyzing past prices and technical analysis should not work. Uh this was violated because the short squeeze was largely a technical event. Traders analyzed short interest data and price volume patterns to predict that buying pressure would force a short squeeze. The fact that they successfully predicted price movement based on market structure and price movement suggests um weak form efficiency failed. The second form I tested was semi- strong form. So this means that prices instantly reflect all publicly available information. Um so GameStop violated violated this as well. Um, in January 2021, the price hit $483. Analysts using public fundamental data valued the firm at $10 to $40. The spread between $40 and $483 proves that the price was not reflecting fundamental public information. So, that form was also violated by GameStop. And then the third form I tested was strong form efficiency. Uh so this means that prices reflect all information public and private which this was violated by GameStop. Um if the market were strong form efficient the price would have been reflected um would have reflected the internal panic before the public knew the extent of their losses. Instead, the price was cascaded chaotically and new information about margin calls and liquidity issues were getting released. So then I thought about the question could rational investors have profited systematically and ultimately no. Uh this is due to borrowing costs. Uh to short the stock you must borrow it. During the squeeze, the cost to borrow GameStop shares completely skyrocketed. So that made it um it was unable for investors to have profit profited. Um looking at the behavioral finance, I found two things that stood out for GameStop. Um the first one was hurting behavior. So this means that individuals stopped acting on their own information and mimicked the actions of everyone else. And then I also found um the fear of missing out as the prices rose. Uh retail investors bought because it was rising ignoring the underlying value. Um, so after doing all of this research, I asked Google Gemini to create a code that shows the increase in both price and trading volume. And so here's the code right here. And so ultimately, the code downloads GameStop stock data, pulls a specific numbers for August 2020, and draws a chart showing both the price and spike and the volume spiked together. So here's my code and so this shows how the data gets downloaded data verification process and then it plots the data and it chooses the closing price and then chooses the trading volume and um we'll create a chart based off the information that gets downloaded.",
  "video_url": "https://youtu.be/XCfTF-2-zy0"
}