{
  "student_name": "Trevor Squire",
  "org_defined_id": "035907999",
  "username": "tsquire",
  "email": "",
  "transcript": "Okay. Hello. My name is Trevor Squire and this is my SE session 10 assignment which is on cost of capital analysis. So, um I see that what I did last time was a lot more successful than what I've been doing. So, I'm going to continue that from here on out. Um I have my assignment tab right here. I have my Gemini that I use to give me the prompt that I would use. And then I have Collab, which I plugged that Gemini prompt into Collab to give me um the code and information for the problem. Um but yeah, going to get started. Quick um summary of the situation. So I'm supposed to evaluate Starbucks's proposed flagship roaster that requests $12 million upfront outlay and is expected to operate for 10 years. um use the firm's 8.5% WACC as the hurdle rate to determine whether the project creates value and to recommend um and accept or reject decision supported by driver documentation. It gives me all the parameters and I'm supposed to focus my analysis on producing a transparent cash flow model um core capital budgeting metrics uh sensitivity test and executive ready recommendation. Honestly, I'm using the driver framework. Um, basically what I did is I took this. I went into Gemini. Um, took me a couple times to figure out like what prompt I wanted. But, um, finally got the way I wanted it. Sometimes it give me code. I didn't want code. I just want the prompt. Um, but I had to consistently ask to take the prompt and just like take the prompt and specifically say put code in between each one. This time didn't really work out, but I'm still I can still work with it. Um I mean it did. It's just it's a lot longer. I don't explain it, but I can show you. But yeah, this is the um prompt that I used and plugged it into collab. Again, took me a little bit, but I was able to kind of figure it out like how I wanted it. Um what I did is I saved this into a Google doc that I can use for later, so it's a lot easier next time. Um doesn't mean it will be, but we'll see. And then finally, I have collab, which is where I will be doing this assignment. So, I'm going to get started. Um, I'm not going to read all this because it kind of came out weird when I plugged it in. But, this is basically the task that I asked it to do. This is when I plugged um the prompt into um collab. So, I'm going to skip over that and just go straight into it. So, first to find the problem. Um so the subtask introduced the Starbucks grocery capital budgeting analysis stating its primary objective and the core um problem detering positive value um net present value greater than zero as per the rubric's defined section. Um so the Starbucks capital budgeting analysis says this aims to evaluate the financial viability of the Starbucks project. Primary objective primary objective is to determine whether this significant investment will generate sufficient returns to justify its cost and ultimately create value for Starbucks. Core problem we we seek to address is whether the project's net present value is greater than zero which is a key indicator of whether the project is expected to create positive value for the company. If it creates negative, then obviously that's going to be a very huge loss and the company would just go bankrupt or this small um kind of like it's Starbucks, but I don't know if we're looking more into like Starbucks as a whole or just like one of the little um chains, but we'll get straight into it. So define um so some par key financial parameters for Starbucks. Um this section outlines the key financial parameters essential for the capital budgeting analysis of Starbucks grocery project. First project life is 10 years. This represents duration over which the project is expected to generate cash flows and will be evaluated. Uh next is hurdle rate or your WACCC which is 8.5%. This is the weighted average cost of capital and um which is a minimum acceptable rate of return on an investment. um uses a discount rate to calculate the net present value of the project's future cash flows. Next is the initial FCF years which is year zero. We're given that at $32.5 million. Um this is the initial investment required for the project um at its inception which is year zero. Um includes all upfront costs such as property, plant and equipment is represented as a negative cash flow. Next is the depreciation which is 3.25 million per year. Uh this is the annual reduction the value of an asset over its useful life. Um next is the tax rate which is 21%. This is the corporate tax rate applied to the project's taxable income. Um it impacts the after tax operating cash flows and the tax shield generated by depreciation. Lastly is terminal cash flow um which is year 10. This is 15.5 million. This represents the cash flow generated at the end of the project's life which is year 10. Um, so next we're get into the represent part which is the methodology and cash flow structure. Um, I'm not going to read the subtax subtask because that's just what it was told to do. I'm not just going to read what it was told. I'm just going to read what um I was able to figure out. So free cash flow structure for the 10 life project life. Um, so this outlines the methodology for structuring the 10-year free cash flow um stream. this which is um detailing the initial FCF CFO the annual operating cash flows based on various revenue tiers and the terminal cash flow in year 10. So the initial um free cash flow CFO at year zero the initial outlay for the project is negative cash flow at -32.5 million. Um the annual operating um cash flows. So the OCS for each year will be calculated based on the project's profitability considering the given revenue tiers operating costs depreciation and taxes. Um these OCFs are calculated after tax and critically they account for the depreciations tax yield which reduces the taxable income. So this is the revenue tiers um and structure. So years 1 through three operating cash flows would be based on the annual revenue of 3 million. Years 4 through 6 is 3.5. Years 7 through 9 is 4 and year 10 is 4.5. So terminal cash flow year 10. So in year 10 in addition to the OCF generation from operations there will be a terminal cash flow of 15.5 million. Um this amount will be added to the OCF of year 10 to arrive at the total cash flow for the final year of the project. So then this is the code that I use to solve this problem. Um so this requires developing a full financial model which involves importing um this the name of the code numpy. um defining financial parameters, constructing your free cash flow stream, um calculating MPV, IRRa, and break even initial outlay and the printing and then printing the results. So, this took about like three or four tries to get right. Um but it kept correcting itself, which I which I thought was really cool. Um so, it defines the financial parameters. um initializes an empty list name FCF FCF stream. Um it adds the initial outlay which was year zero. Um it creates a dictionary to map the years to a corresponding revenues. So years 1 through 3, 3 million, 3 million, yada yada yada. Um loop from year one to project life project life to calculate the annual operating cash flow. This is where it starts to get a little dicey. would say starts to mess up a bit but then it fixes itself. Calculates the OCF which is your current revenue tier times 1 minus the tax rate plus depreciation per year times the tax rate. Um also the current year is the project life year. Add the terminal cash flow year. Um so it is OCF plus that terminal cash flow year 10. Um then append the calculated annual cash flow to the FCF stream list. um calculate the NPV net present value um calculate the IRR initial internal return rate I always don't know why I always saw as initial and then calculate the break even initial outlay and then print the um MPVRR break even um initial outlay um so as you can see it messed up weird at the end um and I just kept it said the previous code fail because this and this are not directly available in the module um these functions are part of this library and it needs to import this part um and use NFP.NV and NFPIRO instead. So when it does that again exact same thing um except it still comes out wrong in the end. Um and this time it said that the module was not found. This indicates that the package needs to be installed. So add a financial command in the new code to install it. So it's literally solving itself. It's figuring out what it's doing wrong. Figuring out what's doing wrong and then from there figuring out what it can change and what it can do better, which I think is really cool. So then this is the third time and I Okay, this one again failed and it's still figuring out what it's doing wrong. Um, so this in case the package needs to be installed before it can be imported in use. So it will um install the command instead of importing it. So finally last Okay, so this is the final time it did the code and it finally got it right. So um it calculates everything and then it gives me it prints the net present value which is negative 3.06 million internal rate of return is 6.82% and the break even initial outlay is 30 31 million. So this it finally got the task right and was able to print out the results and solve the problems. Um so the so that's the subtask present the NPV IRR um and then the um what was it the break even initial um so based on the financial model developed the key capital budgeting metrics for the Starbucks grocery project are net present valueg3 million so um so the decision rule a project is typically accepted if its NPV is greater g than zero. Um as this indicates project is expected to add value to the firm. Since this is in the negative, this suggests a project would not be added to the value or would not add value. Um because it's in the negative, you're going to get more loss than profit in return. IRR so a project is typically accepted if its IR is greater than the company's hurdle rate, WACC. In this case, the calculated R IRR of 6.82% is less than the hurdle rate of 8.5%. So again, that's both these are both key indicators on what we showed it should not do. So then it validates the year three operating cash flow against the spec specific $2.7 million in the rubric given. Um so now we have our cash flow validation. So the rubric states that year three um OCF is 2.7. Let's validate that against model's output. So from the stream generated by the model the free cash flow for year 3 um is 3 05 million. So our calculation for year 3 OCF which it gives me the entire um um equation they used to solve. Um so OCF is 3.052 or million. Uh so there's a discrepancy between the Rubik's stated value 2.7 million for year three OCF and the model um models calculated value of 3.052 million. Um so our model calculates the OCF based on the provided revenue tiers depreciation and tax rate resulting in a higher OCF for year three than the validation point. So this suggests either the rubric's validation point might be based on a slightly different OCF calculation or an error in the rubric itself. That's what it's saying. However, it applies the defined formula OCF. Next is um evolve evaluate. Um so this margin of safety. So the margin of safety for Starbucks project and sorry let me check my time so I make sure. Okay, I'm only 3 minutes. Perfect. Um so margin of safety for Starbucks project is assessed by comparing its key financial metrics against established benchmarks. This analysis reveals the project's robustness and its ability to withstand adverse conditions. First, first the IRR versus hurdle rate. Um, our calculated IR was 6.82%, the hurdle rate was 8.5%. So, since the um IRR is below the WACC, this indicates that the project is not expected to generate returns high enough to cover its cost of capital. A project is typically considered financially valu viable and value creating when its IRRa exceeds WACC. In this case, the project has no positive margin of safety based on the internal rate of return. So it is projected to destroy value rather than create it. Um next is the initial outlay versus the break even initial outlay. So the initial outlay is 32.5 million. The break even outlay is 31.9 million. So the actual initial investment um which is 32.5 is higher than the break even initial outlay. The break even initial outlay represents the maximum initial investment the project could sustain while still achieving a net present value of zero at the given WACC. Since the actual outlay exceeds this break even point, it reinforces the conclusion that the project as currently structured is not profitable and is not expected to generate. Wait, sorry, I don't know what that meant. Okay. Um, since the actual outlay exceeds its break even point, it reinforces the conclusion that the project as currently structured is not profitable, is not expected to generate a positive NPV. This indicates a negative margin of safety in terms of the initial investment. The project was over budget relative to what it could afford to break even. So overall this is the summary. Based on both analysis, the project exhibits no margin of safety. The IRS and WACC buying failure to meet the minimum required return and the actual initial investment surpasses the break even initial outlay indicating that the project was too expensive for the cash flows um is projected to generate. Therefore, the project is currently positioned to destroy stakeholder shareholder value. Lastly is reflect. Um so these are some recommendations. So based on comprehensive capital analysis, the project is recommended for rejection. um some justification the net present value the project's calculated net present value is negative -3 which a negative NBV indicates that project is expected to store shareholder value as a val is the present value if its future cash inflows is less than the initial investment required the IR versus I'm not going to get into it I've already explained it like three times but again your IR is less than WCC which indicates um that there will be more loss than return and then also again break even initial outlay. I'm not going to get into that already explained it. Um all the financial metrics consistently indicate that the Starbucks grocery project is not financially sound and would not create value for the company therefore should not be pursued. Um final task which is the comprehensive summary. Um so a couple like Q&A questions to ask. Does the Starbucks grocery project generate sufficient returns to justify its cost and create positive NPV? No, the project is not expected to generate sufficient returns. Calculated net present value um which is less than zero indicates I would destroy shareholder value. Should the Starbucks ro street project be accept or rejected? Project should be rejected. Again, irr is less than your WCC. You have a negative NPV. Uh all this indicates the project is not financially viable. It will not create value for the company. Um some data analysis key findings. um project viability, your net present value again was negative. Um return on investment IRR less than WCC initial investment analysis. Um again this is the initial outlay versus break even margin of safety. So the project exhibits no positive margin of safety. IR is below WACCC and the actual investment surpasses break even initial outlay and then cash flow validation discrepancy. So discrepancies noted in the validation year three operating cash flow uh model rubric stated 2.7 them all based on the provided parameters uh revenue 3 million depreciation 3.25 million tax rate 20% calculated OCF in year 3 to be 3.052 052 million500. So these are some insights or next steps. Reevaluate the project parameters. Given the consist consistent negative financial metrics, Starbucks should thoroughly re-evaluate the underlying assumptions and parameters of the roaster project particularly in initial investment costs on projected revenue to your potential seek or potentially seek ways to reduce the cost of capital WCC. Uh scenario analysis. Um so conduct again conduct a detailed scenario analysis to understand what changes in key variables like increased revenue, decrease initial outlay, lower WCC. This will be necessary for the project to become more financially viable um in order to get a NPV greater than zero IR greater than WACC. But yeah, that's pretty much it. Um, I gotta say I feel a lot better now that this is clearly a better way for me to do this assignment. Um, it definitely makes a lot easier and I'm using more collab and just relying on Gemini to create my um rubric. Um, yeah. No, this this one was um not that bad. Um, again, I had struggle a bit to plug the code into the middle of this entire thing and it fixed itself which I'm really happy about. um it noticed mistakes and it kept um doing different ways to fix those mistakes. Um but I did have to fight it to put the code in the middle like this. It would like do all of this and then the code just be at the very end which I want to um incorporate the code in the middle so I can explain it as I go. But yeah, that's pretty much it. Um I'm going to end this off as I have like 30 seconds. Uh, thank you so much and hope you have a great rest of your",
  "video_url": "https://www.youtube.com/watch?v=hLxAUghZZsE\nPart 1\nhttps://www.youtube.com/watch?v=CK6o009HOOA\nPart 2"
}