{
  "student_name": "Michelle Cheng",
  "org_defined_id": "037286470",
  "username": "cheng754",
  "email": "",
  "transcript": "Hello, my name is Michelle and today I will be presenting a capital budgeting analysis for Starbucks, a um proposed flagship roaster. Using the driver framework, I have evaluated whether this $12 million investment creates shareholder value. So starting with define and discover, we identified our core objective, which is to determine if the project's future cash flows justify the upfront cost using an 8.5 hurdle rate. Um key parameters include a $12 million initial layout depreciated over 10 years and working capital requires of $500,000 and a fluctuating revenue stream that peaks in year 2 through 5. We are also accounting for a 25% tax rate and a $3 million terminal value in year 10. Um moving to representing phase I mapped out a logic for a free cash flow to firm model to get an accurate valuation we cannot just look at net net income we need unlevered free cash flow. So my logic flow is as follows. The first one being calculate the EBITA DA by subtracting the cost of goods sold, labor, rent and marketing from revenue. Um the next being subtract depreciation to get EBIT and apply taxes to find NOPAT which is um net operating profit after tax. And then finally we add back the depreciation since it's a non-cash expense and adjust for capital expenditure and working capital changes to arrive at our um investable cash flow. So moving on to phase three which is implement I utilized Python and this allows for dynamic modeling and instance sensitivity testing compared to a static Excel sheet. So let's walk through the code here. We've created a class called project analysis and as you can see l parized all the assumptions. cost of goods sold at 40% and the tax rate at 25%. And the specific revenue tiers in this section here, you can see the code And the specific revenue tiers in this section here, you can see the code automatically contra constructs a 10-year schedule. It calculates the tax shields and specifically handles the bookend event. um the outflow of cash in year zero and recovery of working capital plus the terminal value in year 10. So when we execute the code it instantly generates um the cash flow schedule and calculates our key metrics which is um the NPV IRR and the payback period using numpy financial library. Then moving on to our next phase which is the value uh the validate phase. So we inspect the output. Here we have year zero correctly show a negative $12.5 million outflow and year 10 shows a significant spike due to asset um asset sale and working capital recovery. So the math holds up. Now we evolve the model and stress test our assumptions. So l've ran a sensitive analysis for two scenarios. Scenario A being revenue dropping pain dropping by 20% across the board. Um scenario B being the whack fluctuating between 6.5% and 10.5%. So as you can see in the bar chart um even if the discount rate raises to 10.5% The NPV remains positive. However, the red bar shows us that the 20% drop in revenue is our biggest risk. It significantly compresses our value through though it typically remains above break even. And lastly, we have reflect and recommendations. Um, finally we make reflect to um make a management recommendation based on the base case. The project yields a positive NPV of let's say from our code which is $2.5 million and an irr of 12%. Which site which sits comfortably above the 8.5% cost of capital and so our which is my recommendation is to accept the project financially. It covers its costs and adds shareholder value. Strategically, as a flagship roastery, it serves as a marketing vehicle that likely drives the halo sale to other stores, which is basically a benefit, not even capture in this conservative model. However, management must monitor fixed cost because labor and rent are high. Um, a drop in revenue has a magnified impact on cash flow. And for that, that's basically all of my driver analysis. And thank you for listening.",
  "video_url": "https://youtu.be/aCtMIZaoSqM?feature=shared"
}