{
  "student_name": "Caleb Piekarski",
  "org_defined_id": "037218585",
  "username": "cpiekars",
  "video_url": "https://www.youtube.com/watch?v=LuAfxeBl8ok",
  "transcript": "00:00:03\nSo today I'm going to be going over the section six assignment for comprehensive business uh evaluation. So just looking at the assignment overview um this is going to be part of my define discover stage and this assignment which I have in this document over here. So basically the goal of um all this is to determine a fair acquisition price for Panera Bread um in a potential KKR le financial buyer transaction um while understanding how that value differs from strategic buyers. So just the buyer focus the KKR\n\n00:00:46\nfinancial buyer versus the strategic buyers. So just looking at some key information that was given to us um in the problem um Panera generates 900 million in EBITDA with a 15% margin. Uh the net their net income is about 400 million uh dollars with 2,100 stores roughly and their digital sales are to represent 50% of their revenue. Looking into some of their growth drivers, they're having 500 new stores over five years with a digital mix increasing towards 70% and dinner and catering expansion\n\n00:01:33\num with early international growth. And then looking into market context, the industry WACC is roughly 9% with the industry uh PE as 22X um with the president deals being 12 to 15 EBITDA. So just looking at some key questions that we can um ask ourselves which uh would be what is Panera worth on a standalone basis? how much can a financial buyer pay and how much more can a strategic buyer justify. So moving on to the next stage in the driver format which is uh represent we're going to be um\n\n00:02:20\nusing the three valuation methods um one being the discounted cash flow the DCF which its primary method is to estimate uh intrinsic value and run under downside uh base and upside scenarios. And looking at uh the next one being trading comparables which market phase valuation using EB ITDA multiplies and PE references and the last one be uh president transactions which are control based valuation using historical um deal multiples and just looking at run multiple scenarios. Um, we're going to be running downside\n\n00:03:04\nbase case upside and then also use results to recommend a bid strategy. So, moving on to the implement stage, which is where I'm going to be showing the code, which is in Python here. Um, just going to run over the code here real quickly. Um we have import pendas as pd and import numpy as np. So looking at this right here we have all our variables defined um given in the problem statement. So these are just our core assumptions. This right here starting ebita uh in millions and then net income with\n\n00:03:46\nyears. uh the DCF assumptions, the growth scenarios. Uh here we have the market multiples and the strategic uh synergies. And right here we have the DCF function um using uh EBITDA start and growth and then um returning PBFC plus PV terminal. And for the next part of the code, we're going to run DCF scenarios. Um, going down to trading comps, another part in the code with precedent transactions being right here. And the strategic buyer valuation down here. And all these right here are just um print statements\n\n00:04:38\nthat makes it easy for the user to understand what is being told here. But um down here this is the information that matters given to us from the coding and all the equations. We have the DCF valuation enterprise value with the downside being about 10 uh 151.68 68 million. Uh the base case is 11 or 1160.44 million and the upside being 12 um 36.81 million. And then going down here, looking at the trading comps, we have uh 12 EBITDA as 10800 million, 13.5 EBITDA as 12150 million, and 15 EB ITDA as 13 um 500\n\n00:05:30\nmillion. Same deal down here, the president transactions. Uh the enterprise value being 10 800 million. uh 12150 million 13500 million both the same as you can see and then the strategic buyer valuation um just scenario implied you've seen base EV plus.5 billion synergies and base EV plus 1 billion synergies uh looking at uh the millions 11 560.44 million and 12 uh 60.44 44 million. >> So just looking at some key takeaways from all this um all these equations and numbers, the standalone intrinsic value\n\n00:06:20\nis roughly 11.06 billion EV. The financial buyer KKR lockway price is roughly 13 uh 0 billion EV and the strategic buyers could justify up to 14 billion EV. So uh the recommended KKR bid range would be roughly 12 to 12.5 billion EV. So after looking at the code going down here we're going to be looking at the next stage in the driver framework which is validate. Uh just going to be explaining the difference uh the differences between the buyers. Uh so the first one being the financial buyer\n\n00:06:58\num which they relies on cash flows, leverage and operations. They cannot rely on uncertain synergies and must protect IR and downside risk. And the maximum rational price is 13 billion uh EV. And looking at the strategic buyer uh which can capture synergies um digital scale uh procurement savings and store overlap. And looking at the synergy value would be.5 to1 billion. And the strategic evaluation ceiling would be 13.5 to 14 billion EV. going to the next stage which is evolve and looking at um\n\n00:07:43\njust showing running the sensitivity analysis which would be um this model would show WACC versus terminal growth uh which shows different WCC assumptions and different terminal growth rates and then um just observing the valuation is most sensitive to cost of capital aggressive assumptions still don't justify extreme prices And the bid strategy uh looking at here based on sensitivity and competitive dynamics uh the opening bid would be about 12 billion EV comfortable comfortable range being 12\n\n00:08:18\nto 12.5 billion EV and the walkway price being 13 uh billion EV. So looking at the last stage and the driver framework being reflect we can take away that DCF provides intrinsic value anchor comps and presidents keep valuation realistic strategic buyers can buy more but take more risk financial buyers win by discipline not overpaying and then just final takeaway Panera is a high quality asset and value creation for KKR comes from ex execution not paying for synergies. So um basically in short Panera is a strong\n\n00:09:00\nasset or asset but not a transformational one. And for KKR value creation comes from operational execution uh not over pain for synergies that belong to strategic buyers."
}