{
  "student_name": "Aiden Rittenhouse",
  "org_defined_id": "037138232",
  "username": "aritten",
  "email": "",
  "transcript": "All right, looks like I'm recording it again. Uh, this is the session nine assignment. Um, my first uh take did not have audio finish the whole thing. So, uh, this is the session N assignment. U, we're supposed to calculate the whack for Netflix and whack is weighted average cost of capital for Netflix in connection with the hypothetical $5 billion content investment decision. Um, our analysis must determine current whack, evaluate the impact of additional debt financing, assess project specific versus firmwide discount rates, and compare Netflix's cost of capital to the industry peers Amazon and Disney. Um, so here are our financial parameters, uh, 200 billion market capitalization. Our total debt is 14 billion. Our actual debt market value is 13 billion. Our equity bid is 1.3%. Our bond rating, corporate tax rate, uh, current stock price amount for the whack. our market conditions. Um, and here's strategic content context uh about Disney, how much debt they have compared to our whack. Um, Amazon Prime videos uh uses Amazon corporate whack of 9.5% and Netflix is considering $3 billion on additional bet issuance for content investment. Um, so we're going to calculate Netflix's current whack, determine the whack after the $3 billion debt issuance, evaluate project specific whack, US content versus international content, uh, what's risky, what's not risky, if it's worth it or not worth it. Uh, compare Netflix whack to Disney, and explain the differences. Uh, recommend optimal capital structure strategy. Um, so this is the WAC formula. Um, so we're going to figure out the cost of equity for Netflix. We're going to put in the risk-free rate, the equity beta, the market risk premium. Um, we're going to get current cost equity of 11.65%. And then we're going to calculate the cost of the debt, which is 4.58%. And then we put all that stuff into this, and we're going to get our whack current of 11.22% for Netflix, uh, the weighted average cost. You know what I mean when I say whack. Um, so then we have that $3 billion debt issuance. Um so that debt is going to go into our cost of debt and increase that. Um then we have to like go into our market value of the debt uh which is going to be 16 billion now instead of 13 billion. We're adding on that three. Um there's not going to be change in the market value equity or anything. And then our new weighted debt is going to be 7.4%. Now um then we're going to we adjust the equity. um we plugged into the formulas and stuff. Uh new cost equity is 11.73. And then we're going to calculate our new whack um which is going to be 11.2%. So our whack actually decreased slightly from 11.22 to 11.2. Not a big change but still a change. Um so this occurs before the tax shield benefit of adding cheaper debt and weighs a small increase in the cost of equity. Um so now we have our project specific specific whack international and non- international. Um so the 11.2 is a firmwide discount rate and is appropriate for projects with an average risk profile similar to Netflix's current business. Um however project specific discount should be used when a project's risk profile differs significantly from the firm's average. Um the US content is going to be a lower risk while the international content is going to be a higher risk. um investing in established proven US content may carry lower business risk than average and this project should be discounted at a rate less than 11.2%. And then international content should be at a rate higher than 11.2% because there's more risk. Um so our evaluation uh uses single firmwide whack for all the projects leads to a suboptimal capital budgeting. Um rejecting good projects, lowrisisk projects like the US content uh may be incorrectly rejected because the 11.2% 2% hurdle rate uh is too high for the risk profile. Uh and then accepting bad projects. Um uh high-risisk projects like the international content may be incorrectly accepted because the 11.2% hurdle rate is too low for the risk profile. Um a project specific rate often delivered by finding the whack of a comparable pure play company for a specific market risk is superior. And then we're going to compare our whack to our industry peers of Disney and then also Amazon Prime. Um, so Netflix has a whack of 11.2% which we calculated after the $3 billion debt increase. Uh, and our debt to value is going to go from 6.1 to 7.4%. So the higher cost equity due to the beta of 1.3 is a minimal debt tax shield. And then Disney has their whack at 8.2% but that's because their debt to value is 30%. So they have more debt than uh Netflix does. uh the lower whack uh like I stated earlier is due to the cheaper debt and lower uh beta it's more diversified so they don't have to worry so much about their debt uh cuz they have the parks and they have the linear TV shows the channels and stuff outside of the streaming that Netflix just has and then Amazon Prime they have the 9.5% whack and uh they have the same thing they have a diverse business and its core business is uh likely lower risk than just pure streaming like Netflix So the business risk uh Netflix is a nearly pure play streaming company making its revenue and stock price more sensitive to changes in the streaming market and competition resulting in a higher equity beta of 1.3 and therefore a higher cost of equity compared to diversified peers like Disney and Amazon. Uh the financial risk Disney has made has a significantly higher debt waiting of 30% than Netflix is 6.1 or 7.4 after we calculated with the 3 billion. Uh since debt is cheaper than equity, uh a higher debt proportion substantially lowers the overall whack for Disney. Netflix's equity heavy structure drives up its whack. So optimal capital structure strategy uh Netflix should continue to increase its proportion of debt finances to benefit from the tax shield and reduce its overall whack. Uh the move to issue $3 billion in debt was strategically sound as it reduced the whack by 02 and provided funding for the content investment. The key trade-off theory concept is that WAC will decline as debt is added until the increased financial risk outweighs the debt tax shield. Excuse me. Key strategic actions target a higher debt to value ratio. Uh moving closer to Disney's capital structure at 30% is likely too aggressive because uh Netflix isn't as spread out as Disney. They don't have the certain different things. Uh but a debt to value ratio 15 to 20% range would likely minimize their whack uh without further like putting them toward bankruptcy and too much debt. Um they'll monitor their credit rating um maintaining a good investment rating uh is crucial to keep the cost of debt low and future debt issuances should be carefully managed to invoice an increase in uh RD align content funding. Uh, the proposed debt issuance provides a cheaper funding source for the $5 billion content investment than issuing equity would. Netflix should continue to use debt for large recurring content investments as long as the whack continues to fall. So, we want to lower that whack, increase the debt, and then take on more projects uh that aren't as risky or could be more risky.",
  "video_url": "https://youtu.be/8aGt8NPS-j0"
}