{
  "student_name": "Sam Eichstadt",
  "org_defined_id": "035801901",
  "username": "seichsta",
  "email": "",
  "transcript": "Hello, my name is Sam Eichsted and this is my session 10 assignment for capital budget. So to start off, I came up with this driver framework. So first we'll start off with the the D to find the problem. Starbucks is considering a flagship roastery requiring a $12 million initial investment plus $500,000 in working capital. The project will operate for 10 years and must meet or exceed the firm's 8.5% weighted average cost of capital to justify. Investment leadership needs clarity on these following questions. So if it generates positive economic value, aligns strategically with Starbucks, brand expansion carries the risks that could materially impact the financial performance and our task is to evaluate this. Decision using the full capital budgeting methods including net present value, IRR payback and sensitivity risks. So first we're going to move to the research and gather data step. So the facts we were given is the initial investment is $12 million. They use a straight line depreciation method over 10 years, so it's $1.2 million a year of depreciation. The working capital is $500,000 at launch and fully recovered in year 10. The revenues are for year one, $8 million, years 2 to 5, $11 million and year 6 to. Ten $9 million. The cost of goods sold are 40% of revenue. Labor is 2 1/2 million dollars annually. Rent and utilities is 800,000 annually. Marketing is 300K in year one and $100,000 every year after. The corporate tax rate is 25%. Terminal value is $3,000,000 in year 10. Discount rate is 8.5%, which is the weighted average cost of capital. So yeah. We'll move to my kinda um. Work that I did to find out these answers. So first I went in and I made the year zero to 10 incremental cash flow schedule that includes revenue, operating cost, depreciation, tax, Shields, taxes, working capital changes and terminal value. So here you can see year zero to 10, the revenues, year zero, we don't have revenue because we're just starting year one, it's that $8 million, years 2 to 5, $11 million each year and then six to 10 like we said earlier, $9 million each year. So the cogs fluctuate based off of the revenue, so it's 40% of the revenue. So year one is 3.2 million, years two to six is 4.4 million and year 6 to 10 is $3.6 million. Labor is just 2.5 every year, rent and utilities $800,000 a year marketing. 300,000 first year and 100,000 every year after that. Depreciation $1.2 million a year. Earnings before income taxes or interest in taxes. Sorry year 10 because. We haven't paid any interest. Years 2 to year five, we pay 2 million or we have $2,000,000 of earnings before interest and taxes. Year 6 through year 10, we have $800,000 in EBIT. Yeah. So then taxes, we pay $500,000 from year two to year 5 and then $200,000 every year after that. Tax shields 30% each year. We'll change in working capital. Doesn't change too much. Starts out as $500,000 after in year 0, but then we recover it all by year 10. Capital expenditures, it's just that $12 million at the beginning. Terminal value is $3,000,000. That's what we have left at the end. Free cash flow at the beginning we have negative 12.5 million cause that's we're paying $300,000 a year one that we're gaining and then by year 10 we get up to $4.6 million in free cash flow. So yeah, so just some key kind of formulas here. Tax shield is depreciation times the tax rate. Year one EBIT is 0. This essentially means we just break even year one. And yeah, so. Let's move on to the next. I had ChatGPT create me. Actually, sorry, I had Jen and I. Well, we'll go here first. So I had ChatGPT kind of build me a model for free cash flow per year over the years. You can see here it significantly jumps from year zero to year one. It then increases again slightly less on year two, and then it plateaus until around year five and then it drops a little bit and then plateaus again, shooting up at the last year. And then net present value versus weighted average cost of capital is a decrease, a linear negative. Relationship. You can see it starts at around $4.7 million for the net present value, and then by the end it's around 1.7. OK, so the base case results that we got using the 8.5% weighted average cost of capital net present value of 8.5% is $3.02 million. The IRR is 13.25%. The simple payback of this would be around 5.28 years. Discounted payback would be around 8.21 years. Profitability index is 1.24, so it's positive. That's good then. So the IRR is above Starbucks's weighted average cost of capital of 8.5%. So 13.25 is above 8.5, so NPV is positive by about $3,000,000. This means the project creates value and clears the hurdle rate. Revenue of 20% using the 8.5% weighted average cost capital. The net present value is negative $2.75 million. IRR is 3.88%. This shows the project is very sensitive to revenue. A 20% revenue drop turns a good project into a value destroying 1. We did average cost of capital plus or minus 2%. So I I just did. So 6.5% is that 8.5% minus the 2%. This shows the low end and net present value would be 4.64% and at the high end. Of weighted average cost capital at 10.5% would have a net present value of 1.63%. So even though it fluctuates, we are always positive. So it will just have a thinner margin on the higher cost of capital. So next we'll move on to this Python code that I created. I didn't create, but I asked Gemini to help me create, so put it in here. Run it and we'll see what it comes up with. Just give it a second here. OK, so this tells me net present value is -277,000, IRR is 8.13%. Payback period. We'll never make our money back. The simple payback period is 7.11 years. Sorry, that was a discounted payback period is infinite amount of years because yeah, then simple payback period is 7.11 years. Profitability will be profitable in 0.98 years, so we'll go down here. This is the cash flow schedule. I'm not gonna read it all, but you can look at it here. Next sensitivity analysis on impact on NPV slash IRR. So the base case, the net present value would be negative 277,000 IRR of 8.13% if revenue dropped. 20% net present value would be -6.457 million with IRR negative .63%. If the weighted average cost of capital was 6.5%, we'd be profitable by $1.336 million. If it went up 2%, we'd be down $1.672 million. Here's a chart that shows its sensitivity to revenue and weighted average cost of capital changes.",
  "video_url": "https://youtu.be/KqcRDBtzEPI\n\n\nSorry for the late submission - the place i was at for thanksgiving break didn't have WIFI."
}