{
  "student_name": "Brianna Miller",
  "org_defined_id": "036177508",
  "username": "mill3280",
  "email": "",
  "transcript": "Good afternoon. My name is Bri and today we're going to be tackling a crucial decision for Starbucks and that's evaluating the $12 million investment in a new flagship roster. So, our core challenge as mandated by the assignment is to answer the one question of does this 10-year project create value for Starbucks? We're going to be using the firm's 8.5% WACC as our absolute hurdle rate. So crucially our entire process is built around driver framework which is define and discover, represent, implement, validate, um evolve and reflect. This ensures transparency and discipline from start to finish which is key to meeting the technical and conceptual requirements of the analysis. So in define and discover, this is what the critical gate of our assignment is. We establish the variables that we feed into our model. So, as you can see on the screen, I've categorized the inputs and provided the prompt. So, the hurdle rate is the WACC of 8.5%. That is the opportunity cost of our capital. So, our project must earn more than this rate. The initial investment is $12 million. So, our main capeex is occurring at year 0. The working capital is $500,000 which is required upfront. The year zero outflow in fully recovered year 10 inflow. Depreciation is $1.2 million per year which is calculated straight line over a 10-year life. And then the terminal value is $3 million which is the pre-tax salvage value in year 10. So we've successfully parameterized these variables in the Python script. And then this is fundamental to the technical implication as it is running scenarios and updates extremely easily. So that is just kind of foreshadowing into the work that we did here today. We used Google Gemini to help us create code in which we could implement into Python which would give us our variables. So in the represent which is the financial blueprint we move from inputs to the mathematical blueprint. So to achieve the whole um picture we correctly model the incremental cash flows. So our calculation centers on finding the FCF. So we apply the 25% tax rate and we make two critical adjustments. So these are the formulas that are listed here which are going to be solved later on. Um, for the depreciation tax shield, we don't just calculate the NOPAT. We add back the $1.2 million in depreciation. That's essential because depreciation is non-cash expense. So adding it back captures the tax shield benefit it provides. Then we have the terminal value, which is the salivage value. So since this asset is fully depreciated in year 10, book value of zero, the entire $3 million sale is a taxable gain. We correctly calculate the after tax value and then finally we combine these flows which is in the year 10 recovery of $500,000 working capital. This detailed approach ensures every dollar is accounted for. Now when it comes time to implement these are some of the base case results that we got from Google Collab. So we ran the model from end to end as required and I integrated the financial logic with the Python script. So this model runs, generates the cash flow and automatically calculates our metrics. So I can also show over in here if it'll let me. This is what the whole book looks like. First, I installed a missing library in Collab to ensure that my code could be fully accurate. Um I put in all of these variables and it performed many many calculations for me in executions gave the base case results. Um it made this graph for me of sensitivity analysts the revenue down. So yeah in the validate stage these are the core results that we have here which is the MPV the IRRa the profit profitability index uh the discounted payback and yeah so the result is plus 5,800 5 million 834,179. So our NPV decision is simple. If the NPV is greater than zero, we accept. So this project creates 5.83 million in wealth. The result for the IRRa is 17.6%. The return is more than double the 8.5 WACC. This project is highly profitable. The profitability index is 1.45. So that means for every $1 we invest, we get $1.45 back in present value, which is a very strong PI. The discounted payback is five years. So this project quickly recoups its capital outlay on a discounted basis. So these are shown in the sensitivity analysis right here. It created a bar chart for us to help better picture this. But the financial data strongly suggests that accepting the project but to provide a comprehensive managerial conclusion. We're going to stress test these results which is what we did in the evolve stage. In the evolve stage where we use our parameterized code to perform sensitivity analysis fulfilling the requirement of the integration of finance and technology. We simulated a worstcase scenario where revenue is reduced by 20% across all of the years which is shown right there. The metric would be the base case is plus 5.83 million and then with revenue down 20% that would be 1.8 million minus 1.8 million. The IRRa for the base case was 17.6 six but if it's minus 20% it would be the 7.5 which is below the WACC. So the interpretation of this is the project is highly volume sensitive. So if we miss our revenue targets by just 20% the IRRa falls below WACC and the project suddenly destroys the value. So this highlights the high risk associated with the high revenue figures in years two through five. In scenario B, we shifted it to the WACC increase to 10.5%. The WACC is 6.5% and then if it was increased to 10.5% that would be a plus 4.52 million for the NPV result. So the interpretation of this is that if the project is increased incredibly robust to the interest rate risk. So if Starbucks WACCC spiked to 10.5% the NPV remains positive at 4.5 million the high internal rate of return provides significant safety margin here. So then that gets us to just some reflection. In the reflect stage, we synthesize our data with an executive ready recommendation of based on this Starbucks should be accepted with their flagship grocery. So the supporting rationale would be that the financial value the base case positive MPVF plus 5.83 million is the primary driver. The project is financially sound and it exceeds the hurdle rate significantly. There's a strategic fit which is the qualitative factor. We must remember the brand implications. A flagship roaster is more than a simple coffee shop. It's a powerful brand building um vehicle. So this experiential value while unquantified in the NPV strongly supports the financial decision with risk management. We know that the project is volume sensitive. So mitigation strategies must focus on rigorously controlling the $12 million capeex and ensuring marketing efforts are sufficient to achieve the high revenue targets in the first half of the project's life. So in summary, the disciplined execution of driver framework from accurately calculating the depreciation tax shield to performing datadriven sensitivity analysis leads to the clear managerial conclusion of Starbucks flagship roaster is financially sound value creating investment that should proceed provided the critical revenue assumptions are carefully managed. So thank you very much.",
  "video_url": "https://youtu.be/F9H5LVXfqMI"
}