{
  "student_name": "Scott Robbins",
  "org_defined_id": "034079527",
  "username": "robbin55",
  "email": "",
  "transcript": "Alright, so, section 9 was the cost of capital W-A-C-C. And W-A-C-C is the weighted average cost of capital. So, who went through, um, I mean, it gave us the formula for it. Let's The Section 6 Assignment. Calculate the weighted average of cost capital for Netflix in connection with hypothetical 5 billion content investments. So, it gives us everything. Total debt, the debt, the market value, everything. Corporate tax, current stock price, risk. And then, this, It's, this, this needs Amazon's and Netflix to flip the debt and, the weighted average, W-A-C-C for each. Umm. Let's see. So, I had Netflix, uh, Gemini helped me do the, this so we, it would, to calculate the W-A-C-C. I also had, uhh, make a, chart showing what it was. So, as we go through the R, cost of equity. It gives us the cost of equity, which is 11. and 0.65% after tax cost of debt is 4.58% and then we do the calculated the market values, the debt weight. So, the equity weight is 93.9% and then the debt weight is 6.10%. Calculate the current W-A-C-C. The current W-A-C-C is 11.22% based on all the values that, ,these time it gave us. The new terms. New W-A-C-C. 11.14%. Okay, so how does that compare to Netflix compared to Disney and everything else? Umm, ,is high. There's really a cost. Okay, so now we can go back to the code. And, where's my first code I made? So, the first code says the current calculation. It gives us everything that I showed from Gemini. And then, project specific W-A-C-C assessment should not be- the 11.2 you should not be used for all projects. Lower risk. Needs to lower discount rate. Okay. And it just gives us everything. It tells us what we should do. Now, if we go back to this one, I kinda like this one a little better. Cause it kinda gives us a chart, a breakdown, of what the equity in the debt is. And, Yeah. Yeah. And it shows the curve, the hypothetical curve, and the Netflix current, Netflix were posed in Disney. So, action, Netflix should strategically increase its debt ratio. Rational. I mean, you guys can read that, but, I mean, from everything we talked in class, we really talked about, how it would have be affected, in the construction world. So, that was my driver. Mmm. Yeah, that should be everything.",
  "video_url": "https://youtu.be/W7wW3o4i5Jc"
}