{
  "student_name": "Ryan Date",
  "org_defined_id": "037312318",
  "username": "rdate",
  "email": "",
  "transcript": "My name is Ryan Dotte and this is my session 9 assignment. Um, we're just gonna hop right into things with the Define and Discover portion of driver analysis. So the objective here is to calculate Netflix current and post insurance. Turn. It's WACC to guide a $5 billion content investment decision. Um, assess whether a firm wide or project specific discount rate is appropriate and compare the cost of capital to peers, such as Disney and Amazon, um, and recommend an op- the more capital structure strategy. So looking at the parameters and the values and parameters, we have the market cap at $200 billion on the market value of the debt at $13 million, the tax rate at 21%, the risk free rate, and at 4.5%, the market risk minimum at 5.5%, the beta at 1.3, and the cost of debt for pre-tax and BBB plus at 5.8% . looking at the capital structure weights, umm, for at least currently, umm, it is 93.9% for the equity weight and the debt weight is 6.1%. So moving on to represent, umm, we're gonna look at the numbers. Using the W-A-C-C formula, we're able to calculate the current W-A-C-C is around 11.2%. Umm, in the new weights, the equity is 92% and the debt is 16 over 216, 7.4%. Umm, a soon-called- loss of debt increases slightly due to leverage. Umm, and new pre-tax debt costs of around 6.1%. And that'll give you a post-debt W-A-C-C of around 11.5%, 11.15%, pardon. For the implement stage. Umm, with the help of AI, I was able to generate Python code that does the following. Umm, it uses C-A-P-M to compute the cost of equity. Umm, and computes after-tax cost of debt. Umm, it calculates the current capital structure. The new capital structure after 3 billion dollars of debt. Umm, and it computes the current W-A-C-C, the post issuance W-A-C-C, the U.S. Content Project W-A-C-C, and the International Content Project W-A-C-C. And to take a look at my pi- thon notebook in Google Colab for the Netflix W-A-C-C calculations. Umm, you have at the beginning the input parameters, so the market values, umm, market financial assumptions, and the cost of debt assumptions. Alongside the- the project specific adders. Umm, and then it calculates the cost of equity, the after-tax cost of debt here, umm, the W-A-C-C formula, the current Netflix W-A-C-C. The W-A-C-C, after the $3 billion debt is- umm, the project specific W-A-C-C, and it prints the outputs clearly at the end. Umm, moving on to our next stage of driver, is verify. Umm, we want to compare it to- Disney and Amazon. Umm, or compare the W-A-C-C's. Umm, Netflix has a W-A-C-C of 11.2%, and it has a high equity proportion, high beta, and a lower diversification of the others. Disney, on the other hand, has an 8.2%. Umm, which is the smallest W-A-C-C, and a large diversified revenue base, more stable cash flows, and lower beta. Amazon Prime, er, Amazon Prime Video, 9.5%, somewhere in the middle, and uses corporate W-A-C-C, supported by diversified, global operations, and a stronger credit. So, now looking at why Netflix W-A-C-C is higher. Umm, first off, the high beta, right, the 1.3, as compared to the round one that Disney has. Umm, how do you rely on equity, also? 6% or 94% compared to Disney's 70%. Umm, and a smaller, less diversified business model when you look at compared to the umm, much more diverse Disney. Umm, the large diversified revenue base that they have. And, additionally, there is a more volatile earnings profile for Netflix. Uhh, to sort of start wrapping things up here, we want to move on to the Evolve stage of driver. Umm, and look at the optimal capital structure strategy. Umm, Netflix is under le- umm, relative to peers. Disney, 30% debt in Netflix at 6% currently. Umm, so increasing debt modestly can lower WACC via tax shield without materially endangering, uhh, credit quality. A target debt weight of 15 to 20%. Uhh, ehh, would move Netflix closer to industry norms, reduce WACC towards about 10% and preserve strategic flexibility. For the $5 billion content investment, umm, fund at least $3 billion with debt, as proposed, but consider an additional one to- $2 billion debt capacity if investment timing requires . Umm, then for the project discount rate guidance, uhh, for U.S. content, use 10.5 to 11.5%. For international content, use 12% to 13% depending on country mix. Umm, and do not use firm-wide WACC for international projects to the elevated risk. And a strategic reflection for all that, Netflix should gradually shift toward a broader, slightly more leverage streaming media financial profile, improving cost of capital while maintaining operation. So some things up here with the reflect stage of driver, the final R, uh, Netflix current WACC is 11.2% decreasing to 11.15% of new debt with project specific ranges. Uh, rates. It's ranging from 11 to 13%. And Netflix should adopt a more balanced capital structure with 15 to, uh, 20% debt to strengthening competitiveness against Disney and other companies like Amazon while optimizing financing for major content investment. Thank you. Keep.",
  "video_url": "https://youtu.be/SwR7toNI0sc"
}