{
  "student_name": "Vladimir Cruz",
  "org_defined_id": "025515744",
  "username": "cruz22",
  "email": "",
  "transcript": "Evening professor. So in this session I'm going to be talking about a little bit of the market efficiency for GameStop. Um I did notice here that we had to confirm that it traded at 4 cents in August 2020. But if we come to Yahoo Finance, we can actually confirm that in August of 2020 it was It ended right around a dollar at the lowest and $167 or excuse me $1.79 at the highest. So it was a it was definitely not 4 cents. It was considerably higher uh per share of course. Now part of the market efficiency uh I remember from our session in class it has to do with how the market reacts to uh outside influences. So, for example, GameStop once Ryan Cohen, the Chewy founder, announced that he had acquired a large stake, relatively large stake, you can actually see what the market did. So if we go to where we were in August of 2020, we can see that it was you had about 469 million shares that were traded within that month uh as low as a dollar as high as $1.79. But if we move one month forward to September, we can see that the prices increased as high as $1 more or as low as $147 per share with the total number of shares traded in September at over 1 billion. So what happened there? Well, Ryan Cohen had announced uh that he was going to be uh acquiring a large stake. So, what that automatically triggered in some stockholders and um financial managers is that well, you have the owner of Chewy acquiring a large stake. So, there's going to be some turnaround that's going to happen at GameStop. GameStop, there's going to be something that's going to be um, you know, there's going to be like a surge of of uh of this sort of influence. And with that sort of influence, he was going to sort of project um, kind of like a commercialization of GameStop online the same way Chewy uh has grown over the past couple years. So you can see in September 2020, over a billion shares traded. And then if we move forward to um October, we can see that there's over 400 million shares and and there's there's over 400 million more shares traded following. And this number just increases month except for here after month after month. we get to a a cap where in just one month from December 2020 to January 2021, one month later, it was trading as low as $4.75 to almost overnight $8125 per share. Now again, this all happened and this is sort of this is a kind of explanation as to the market efficiency and whether uh this is something that could happen. Well, it did happen. But I also have to ask myself if this market efficiency was violated or not. And I don't think it was. Um, from what I read, you know, about the efficient market hypothesis is that um or or I should say maybe the behavior finance explanations. You know, again, this could be in part because many people thought that GameStop was going to be uh a complete change or a complete turnaround until we get to about February where GameStop and from what I understand here after having done some research, Robin Hood sort of stopped and tanked the not only the shares but the amount of shares that were able to be traded in. So there was not any um there was not any progress to be made after a certain point. Now for number three, I did like this because part of financial management is to guide your investors into making good decisions and steer them away from the bad decisions. Well, I think that investors could have profited uh systematically right around this point here. If for example, you know that the stock was going to increase in price month after month, year after year, obviously you want to hold on to it. But something like this almost reminds me of Bitcoin. You know, when you want to quit while you're ahead. Well, this is probably what I would have done. I would have steered my investors towards purchasing. And once I noticed and they would have purchased right around here, November, uh, excuse me, September, October, November, when the price is starting to increase a dollar per share, uh, month after month, in in September, you're at $147, $2.79. In October, you're at $2.28, $3.97, excuse me. And the number of shares have increased incredibly from see 1 billion to 1.4 billion. So that could have been a signal to have purchased a large amount of shares or a very low price. Once you see this steep climb, I would have told my investors, you need to sell. While you're ahead, make the money, sell it. Why? Because that's the purpose of of like day traders. So yes, to analyze that specific one in terms of the market efficiency and not only to recognize how it changed almost overnight within the matter of few months, but to see how much investors could have made if they locked in prices, you know, September, October, November when the price was 2,3 a share up to $81 a share. there. That is a monumental prophet. Uh and after having read a little bit, that's what some did here.",
  "video_url": "https://youtu.be/yibtmUUQQjE"
}