{
  "student_name": "Arjun Suresh",
  "org_defined_id": "037585093",
  "username": "sures111",
  "video_url": "https://www.youtube.com/watch?v=oJEO_5GMutg",
  "transcript": "Okay. So, today we're doing uh WV 11, I\nbelieve, um corporate decisions and\nincentives. And we're going to analyze\nthings like EPS and how that changes and\nhow leverage changes uh through a set of\ndifferent scenarios with different\ncorporate decisions and how those\nincentives play out at the human level.\nSo, first thing we want to look at is\nthe actual prompt. Um,\nso Apple has this 165 cash um\nliquid\num and in their investments and then\nthey have 100 billion that they're going\nto generate. Uh because Apple's quite a\nbig company uh they're not very risky in\nterms of that sense. They're very\nstable. Um, so there's a share price, a\nPE ratio, a dividend yield, and some\nshares outstanding, and then the balance\nsheet. They give us a quick thing.\nPretty much what you'd expect from a\ncompany like this. A lot of debt, but\nalso a lot of free cash. Um, I assume\nbecause of tax implications and that\nkind of thing. Um, and then the proposal\nis the 90 billion buyback of stock. So\nthat'll increase your EPS because you\nhave\na lot of earnings, the same earnings\nreally, but then less shares. And then\nthe alternatives are the special\ndividend in AI acquisition, debt\nreduction, and R&D.\nSo let's define and discover. So our\nobjective is we want to determine if the\nrepurchase creates value or shifts\nwealth and then compare it to probable\nalternatives. Our scope is uh sorry uh\nthat's for my I meant to type Apple over\nthe year. Um and we want to analyze the\nimpact on the shareholders not Netflix\nApple. So then we have a couple\nconstraints. Uh liquidity is one. Um you\ncan't spend more money than you have.\nMarket cap's also an issue because if\nyou uh spend too much with a large\nportion of the market, your plan won't\nwork because things will change as you\naffect the market. Um it's sort of a\ncyclical sort of thing like that. And\nthen agency is basically the idea that\nokay this can be done but are the people\nrunning the show will they want to do\nit? Will the CEO want to do it? Will\nmanagers want to do it? Will the board\nwant to do it? Will shareholders, bond\nholders want to do it? Um so we need to\nget enough people on the same page to\nwhere that can be sort of a sensible\ndecision. And then our data is the share\nprice, the shares outstanding, and the\ndebt. Um, a couple more from the prompt,\nbut generally that's what's important.\nOur success metric would be an ROE\ncomparison. So basically,\nis our return off the equity going to be\nbetter from our shifting around or are\nwe just sort of doing the same thing and\njust calling it a name? And then um our\nbenchmark will be uh those things and\nother alternatives.\nIn terms of represent um\nright now we have net cash the\nstakeholders are the CEO and employees\nuh who have options\nand then the problem with the status quo\nis we have a lot of equity out there\nright now and that means our ROE isn't\ngoing to look as good. So option one is\nwe can do the buyback which will lower\nour cash but also lower our share count\nand then basically the CEO will have\nmore money because\nit's worth more and then the bond\nholders will have a little less of a\ncash cushion but I'll talk about that\nlater. Um and then option two is the\ndividend basically will lose some cash\nand then the stock price will drop by\nthat dividend amount because we valued\nit out with actual money. um people who\nhave it have immediate yield uh but\nemployees will lose out because their\nvalue is going down and there's also no\nEPS support which is uh one of our\nprimary goals here. So in terms of the\nimplement stage, here's a summary of my\ncode. Basically, if we go through with\nthe 90 billion buyback, then the EPS\nwill rise to 6.37.\nUh there's less cash and there's uh\nretail will make some and then the bond\nholders will or sorry, I'm thinking of\nthe other options. Option two was a\nbuyback. Um no, sorry, option one is the\nbuyback. Option two is the um the\nspecial dividend which gives retail a\nbonus. Option three, uh I didn't really\nseriously consider this one. I used it\nmore as a benchmark, but it's basically\nyou pay off your debts.\nUm that's the safest option in the one.\nAnd then in terms of ROE,\nwe get much much more on our equity\nreduction. Now that is somewhat\nartificial because we are just sort of\nchanging numbers there instead of having\nsome crazy change in value but uh\nscarcity itself does have value in uh we\nshould we should be wary of that. Okay.\nNow I'll take a look at my code here. So\nwe have the inputs here. We do basic\ncalculations for the market cap uh our\nnet income our EPS and the equity book\nvalue.\nAnd then basically we just\nuh\nfigure out numbers of shares, numbers of\ncash portions, things like that. And\nthen we print them out. So\num sensitivity analysis a little later.\nSo that's very basic algebra. It's not\nvery complicated. We can move to verify\nwhich is let's make sure we're same\nhere.\nThe math says 7% EPS increase, which is\namazing. Uh, that's high impact and more\nexciting in terms of a boring dividend.\nIn terms of incentives, management loves\nthat because um\nthat helps keep the stock options for\nemployees profitable because uh we've\nincreased the actual value of the stock.\nSo, um, the 170 is a less of a\npercentage discount, which is good for\nthe company. Uh, and you kind of realize\nthe bond holders are safe regardless if\nApple spends this or not. They generate\na h 100red billion a year. Um, they're\nnever going to be gone. They're not\ngoing to go in debt in the next 20\nyears. Um, they're like literally one of\nthe biggest companies in the world. I\nwould be extremely surprised if anything\nlike that happened. And then in terms of\nthe market, um, what do you want to\nsignal to the market? Dividend is, hey,\nwe're out of steam. Here's some money.Buyback says, \"Hey, we have value. We're\na real company. You want to invest withus,\" which is generally what we want\nother people to think. So, the market\ngenerally is going to reward uh the\nbuyback signal.\nterms of evolve I said um it compares\nthe interest rate and the earnings per\nshare for the buyback EPS and then uh\nwhat if we keep our cash and invested.\nSo 4.4% is where it breaks even um\nthat might seem low\nbut there's two things to consider.\nNumber one,\nyou can get 4% at pretty pretty\nguaranteed, but not quite. And also,\nyour cash tend to be locked up in bonds\nif you want that. Um,\nversus the buyback EPS will do that, but\nit'll also improve your metrics, um,\nwhich is very important. So that sort of\nthing is also important. Uh we can move\nand look at the code real quick.\nOkay. So we have our assumptions and\nthen we just change what the interest\nrates might be and then know we\ncalculate\nuh how much money you're going to be\nmaking and then we make a graph off of\nit. So,\noh yeah, also here here are the options.\nUm,\noops.\nThe actual options. I realized I didn't\nshow those earlier, but basically\num\nsetup\nor h I guess I have to scroll down to\nsee the options, but option one is\nbuyback, option two is the dividend. uh\nyou can see things like yield and the\nimportant parts reduce your debt. Um\nand then over here that we've generated\na graph for this. So\nthat's very helpful.\nOkay. So I think we're ready to uh make\na verdict, a decision sort of. I'm going\nto say you should do the buyback. um you\nare getting some material growth because\nyour EPS is increasing by 7% which is\nvery very significant. That gives\namazing shareholder value. Um the bond\nholders don't really care because you're\nstable no matter what. So they're not\nthey're not nearly as affected\nnegatively as the shareholders are\naffected positively. And then the\nsensitivity analysis shows us the\nbuyback is better unless uh your cash\ngets this higher interest rate, but also\num it it would be locked up in that\nscenario. So your EPS wouldn't be quite\nas good. And then the third is that um\nwe're we're still quite safe. This is\nwhat I was talking about with bond\nholders. Okay, you have a little bit of\ndebt, but you have still have way more\ncash. You're generating hundreds of\nbillions. Uh you could be in like triple\nthe amount of debt. And I don't think it\nwould make the bond holders even\nnervous.\nSo now let's reflect. Um basically\nfinancial engineering the concept of\nlike\nmaybe manipulating is a strong word but\nmanipulating how you look to seem better\nboosts our EPS targets. But remember we\nhaven't actually made more\nlike stuff. Apple didn't make more\nphones. they're just boosting their own\nmetrics and um doing that. And then keep\nin mind our typical agency conflict is\nmanagement versus um management in the\nsense of stockholders and the CEO tends\nto have a large amount of stock\nand then we have uh bond holders value\nsafety. Um so in this case the buyback\nhas almost no punishment in terms of\nsafety. So that's the easiest decision\nfor management to make and also it\nboosts them. And then uh there's still a\nmarket risk. Okay, our PE ratio may not\nstay constant. Um if the market for some\nreason overreacts to us spending much\nmoney, our valuation could uh drop,which is bad."
}