{
  "student_name": "Tanmayi Sharat",
  "org_defined_id": "035964608",
  "username": "tsharat",
  "email": "",
  "transcript": "Starbucks Roastery Investment: Capital Budgeting Presentation Script This script provides the professional narrative for the video presentation, covering all DRIVER stages, code segments, metric results, and the final strategic recommendation. 1. Introduction & DRIVER Framework Summary This presentation covers the capital budgeting analysis for Starbucks' proposed flagship roastery—a $12 million, 10-year investment. Our goal is to determine if this project creates value using the firm's $8.5\\%$ WACC as the hurdle rate. This analysis rigorously followed the DRIVER framework in two main loops: Loop 1 (D, R, I, V-Basic): Focused on defining parameters, building the core cash flow model, calculating the baseline metrics, and performing required basic sensitivity tests. Loop 2 (V-Advanced, E, R): Focused on advanced sensitivity (Heatmap, Tornado Chart), strategic recommendation, and final synthesis. 2. DRIVER Stage 1: Define & Represent Define & Discover (D): We parameterized the key inputs: Initial Investment at $12 million, $8.5\\%$ WACC, $25\\%$ tax rate, $40\\%$ COGS, and the specific 10-year revenue schedule (e.g., $8 million in Year 1, $11 million in Years 2-5). Represent (R): The objective here was to establish the Free Cash Flow (FCF) formula and the five core capital budgeting metrics: Net Present Value (NPV), Internal Rate of Return (IRR), Discounted Payback Period, Simple Payback Period, and Profitability Index. This parameterized setup ensures transparency and model flexibility. 3. DRIVER Stage 2: Implementation & Baseline FCF Implementation (I): The core of the model is calculating Operating Cash Flow (OCF) using the formula: $\\text{OCF} = (\\text{Revenue} - \\text{OpEx}) \\cdot (1 - T_c) + (\\text{Depreciation} \\cdot T_c)$. The Year 0 Outlay is $-\\$12.5$ million (investment plus working capital). Annual straight-line depreciation is $\\mathbf{\\$1.2}$ million. In Year 10, we correctly include the terminal cash flows, resulting in a large FCF spike of $5.3 million (OCF + Terminal Value + Working Capital Recovery). (Reference: Incremental Cash Flow Schedule (Base Case) output - see Image 1: FCF Schedule) Baseline Capital Budgeting Metrics (WACC = 8.5%): NPV: $\\mathbf{\\$3,022,515}$ (Positive) IRR: $\\mathbf{13.25\\%}$ (Greater than 8.5% WACC) Discounted Payback: $\\mathbf{8.21}$ years Based on the NPV decision rule ($\\text{NPV} > 0$), the initial recommendation is a clear ACCEPT. 4. DRIVER Stage 3: Validation (V) & Risk Assessment Validation (V): Since the $\\text{NPV}$ is positive, we tested the project's fragility under adverse conditions. Scenarios A & B (Basic Sensitivity): Scenario WACC NPV Result IRR Result Conclusion Baseline 8.5% $+\\$3.02$ Million 13.25% ACCEPT (High Margin) Scenario A (Rev -20%) 8.5% $-\\$2.75$ Million 3.88% REJECT (Breaks down) Scenario B (WACC +2%) 10.5% $+\\$1.63$ Million - ACCEPT (Lower Margin) Tornado Analysis (Advanced Sensitivity): To rank our risks, we conducted a Tornado Analysis, which summarizes the drivers' impact on NPV: Revenue Down 20% is the single greatest risk, causing a $\\mathbf{-\\$5.77}$ million swing from the high scenario. COGS $+5$ percentage points is the second greatest negative driver, reducing value by $-\\$2.4$ million. (Reference: Tornado View – NPV Sensitivity by Driver - see Image 2: Tornado Chart) Conclusion from Validation: The project is highly sensitive to the revenue forecast and the operating cost (COGS) ratio. This uncertainty requires careful attention. 5. DRIVER Stage 4: Evolve & Reflect Evolve (E - Strategic Recommendation): The high risk revealed in the validation stage means we must attach a condition to the acceptance. While the roastery provides significant intangible benefits (brand image, market signaling), these cannot outweigh financial loss. Reflect (R - Final Conclusion): Visualization Insights: NPV Heatmap: Visually confirms that if revenue drops to $80\\%$ (the bottom row), the project is severely value-destroying, regardless of the WACC. Cumulative Discounted FCF Plot: Shows that value accumulation is slow, crossing the zero line (Discounted Payback) only late in Year 8, confirming that high revenue years later in the life are vital. Final Conclusion & Recommendation: The project should be ACCEPTED WITH RESERVATIONS. The $\\text{NPV}$ is positive, but the extreme sensitivity to revenue requires management to ensure that sales performance does not drop below $\\mathbf{90\\%}$ of the forecast in the initial years. Failure to meet this revenue threshold would necessitate immediate risk mitigation to manage costs and preserve the project's value.",
  "video_url": "https://www.youtube.com/watch?v=ZKkITOhuHuI"
}