{
  "student_name": "Siri Surapaneni",
  "org_defined_id": "037411103",
  "username": "surapan2",
  "video_url": "https://youtu.be/6X9pTQ_AQhE",
  "transcript": "0:00\nToday we are going to go over the\n0:02\ncapstone project. We only had one rule\n0:05\nand that was to create an AI powered\n0:06\nfinancial innovation. So I'm going to go\n0:08\nover what I did, show you it in use, and\n0:10\nexplain why it's important and actually\n0:12\nimpactful. So first going over what I\n0:15\nwanted to create. I wanted to create an\n0:17\napp that accomplishes being an AI\n0:19\nfinancing simulator, which is an\n0:21\ninteractive decision tool that helps\n0:24\nfounders visualize a true long-term cost\n0:26\nof capital across debt, venture equity,\n0:29\nand venue based financing. And what the\n0:33\napp does is it models a five-year exit\n0:35\nscenario to expose a hidden cost value\n0:38\ndilution using an automatic logic engine\n0:41\nto recommend the optimal financing path\n0:43\nbased on the user specific growth\n0:44\nmetrics.\n0:46\nSo, I used Replet to create this tool. I\n0:49\ninputed the Python code, which isn't\n0:51\nreally the point of this assignment to\n0:52\ngo over this, but I inputed the Python\n0:55\ncode and exported the website. And I'll\n0:57\nshow you that here. So, it's an AI\n1:00\npowered financing scenario simulator.\n1:02\nBut specifically, again, I wanted to\n1:03\nvisualize the cost of capital, debt\n1:05\nversus equity versus the RB.\n1:09\nSo here you see on the left hand side\n1:11\nthere's different company metrics as\n1:13\nthis is something founders would use to\n1:15\nsupplement their learning and it says it\n1:18\nhas an option for the current annual\n1:20\nrevenue which is for this case 2 million\n1:25\nand then the projected growth which\n1:27\nright now is at 30%. And then the\n1:30\ncapital needed which is right now at 1\n1:31\nmillion and the financing assumptions\n1:34\nwhich is one the interest rate as you\n1:35\ncan see it's 8% here and then the\n1:37\nlong-term and years which we have five\n1:39\nyears here which you can also increase\n1:42\nand then that'll also change the chart\n1:47\nyears amount let's go back to five years\n1:49\nthough and then the post money valuation\n1:52\nwe have this value right here and the\n1:54\nexpected exit multiple times re revenue\n1:58\nand so so on and so on. We have RBF\n2:00\nrevenue share and the RBF repayment cap\n2:03\ntimes investment which is 1.5.\n2:06\nThose are just input in inputs that\n2:08\ndifferent founders can obviously input\n2:09\ndifferent values into.\n2:11\nAnd here with the current values in our\n2:14\ntest scenario, we see here the cost of\n2:16\ndebt which is the total interest is a\n2:19\nlittle bit over 200,000 and the cost of\n2:21\nequity which is the dilution value is\n2:23\nlike 4.5 mil and the cost of the RBF\n2:26\nwhich is the premium is around the\n2:29\n175,000 range. And of course to have a\n2:33\ngood analysis a nice visual component is\n2:35\nalways nice. So in the app, we also\n2:37\ncoded in a chart that shows the year\n2:41\ncompared to the amount in annual cash\n2:45\noutflows. And the light blue here is\n2:47\ndebt payments. As you can see when you\n2:48\nhover over it, you can see year one the\n2:50\ndebt payment is around $243,000.\n2:55\nAnd then dark blue is the same thing but\n2:57\nfor the RBF payments. So the final\n3:01\nfinancial analyst assessment was\n3:05\nwe had the recommendation of the debt or\n3:06\nRVF and the analysis said based on the\n3:09\n30% growth rate we put selling equity\n3:12\namount means giving up a massive portion\n3:14\nof future exit value the cost of equity\n3:16\nis approximately\n3:18\n4.5 million whereas the cost of debt is\n3:21\nonly a little bit over 200,000\n3:24\nbut that was just the example scenario.\n3:26\nYou can increase it and I'll show you\n3:28\nwhat that does. As you can see,\n3:29\nincreasing the growth rate rapidly\n3:31\nincreases the cost of equity, but only\n3:33\ndoing that does not change the cost of\n3:36\ndebt. Bring that down lower again. The\n3:38\nlong-term interest rate normally won't\n3:40\nchange fluctuate that much, but it will\n3:43\nslightly change the values. Long-term\n3:46\nyears will change, the debt values,\n3:50\nand so on and so on. But I'm going to go\n3:52\nover a couple questions to just explain\n3:55\nwhy I did this and why it's important.\n3:57\nOne, does it work? Yes, it does. As I\n3:59\nshowed, you can numbers change through\n4:03\nthe different inputs. The app runs\n4:04\nwithout crashing and calculates real\n4:06\namortization and valuation math, not\n4:09\njust random numbers and again\n4:11\ndynamically updates itself. Does anyone\n4:13\ncare? Yes, I think this tool will be\n4:15\nvery useful for founders because\n4:17\nfounders often choose cheap equity over\n4:19\ndebt because they fear monthly payments.\n4:22\nThis tool visually proves that equity is\n4:24\nactually the most expensive option for\n4:26\nhigh growth companies costing 4.5 mil\n4:29\nversus the 216K in the demo example.\n4:33\nDid you ship? Yes, the co code is\n4:35\ndeployed on replet and as you can see it\n4:36\nwas on that the website I showed and the\n4:39\ninterface is interactive with the\n4:40\nsliders and inputs and it produces a\n4:42\nlive visualization and recommendation\n4:44\ninstantly. And what did I learn through\n4:46\nthis process? I learned the hardest part\n4:48\nof building with AI isn't the coding\n4:50\nwhich any libraries like streamlight can\n4:54\nhandle which is the library I used in\n4:55\nthe replet but correctly modeling the\n4:58\nfinancial logic is where the person\n5:00\ncomes in and where I come in and that's\n5:01\nwhat I learned through all of the weekly\n5:03\nprojects. So the AI has a good data to\n5:05\nanalyze and I also learned how to deploy\n5:07\na Python script to the web in minutes.\n5:10\nAnd also I wanted to take a step back\n5:11\nand just explain why I chose this as my\n5:13\nproject because I want to be future\n5:16\nfinancial adviser and my primary goal\n5:19\nwould be to help my clients understand\n5:20\nthe long-term impact of their decisions\n5:22\ntoday. And this is a simple tool that\n5:24\nvisualizes the hidden opportunity cost\n5:26\nof equity versus debt which is a very\n5:29\nprominent concept in financial math. and\n5:31\nI'm practicing exa exactly what I plan\n5:33\nto do in my career to simplify complex\n5:36\nfinancial trade-offs to help people make\n5:37\nsmarter wealth building moves which is\n5:40\nwhat this shows. Thank you so much"
}