{
  "student_name": "Daran Ebadi",
  "org_defined_id": "036201910",
  "username": "debadi",
  "email": "",
  "transcript": "Hi, this is Don and I'm going to be going to walk through my um capital budgeting analysis for Starbucks with proposed flagship roaster. Um Starbucks is proposed flagship roaster. I'm going to use Python to build the cash flow model, compute the NPV and the other metrics and then I'm going to connect those results back to my strategy in the corporate finance analytics of the stuff. And so in the define stage, the goal is going to be super specific. Should Starbucks invest 12 million in a new flagship roaster that operates for 10 years using an 8.5% weighted average cost of capital as the hurdle rate and a good decision uh good decision rule here is the standard MPV rule. So if the project MPV at Starbucks weighted average cost capital is positive the project creates value and in principle should be accepted as long as it fits the brand and risk profile. And so in the top of the first cell here in collab um in top of the first cell here in collab I'm going to translate the problem into code um by just um hard coding the key assumptions. So 12 million initial CA capital index um uh 12 million initial capex 500k of working capital straight line depreciation schedule over 10 years the 8.5% weighted average cost of capital which I'm going to refer to as whack from now on and the revenue path that the case gives me which is 8 million in year 1 in years 2 to 5 and 9 in year 6 to 10 and so I'm going to define the cost structure as well cost of goods sold at 40% of revenue labor at 2.5 million per year rent and utilities to 800,000 per year and marketing starting at 300,000 in year 1 and 100,000 um thereafter. And so I'm going to focus on what I actually need to compute in the next section here. So for capital budgeting that means in incremental free cash flow cash flows from year zero through year 10 and the standard metrics built off those cash flows. So conceptually each year I want revenue minus operating cost minus depreciation equals earning before interest in taxes. Then I'm gonna apply the 25% tax rate to get NOPAD and then add depreciation back to get my operating cash flow adjusting for working capital and at the end the 3 million ter terminal value plus the recovery of working capital. And so I'm also going to decide on some modeling conventions up front. I'm going to treat the 3 million terminal value as an after tax terminal cash flow. And I'm only going to apply taxes when um earnings before interest tax is positive and ignore loss carrybacks which keeps this project consistent with a lot of um other classroom capital budgeting setups. And so all of that is reflected in the parameters um in cell one. And so later I can change a signal assumption um a single assumption like whether that's the weight average cost capital or the revenue and the whole model is going to be up is going to update. And so represent is where I'm going to design the model before I run it. Um and so I'm going to define um I define the build cash flows function which is the core of the model. On the screen you can see the function signature takes a weighted average cost capital the revenue and the marketing dictionaries and a revenue scaler. And that revenue scaler is what lets me run sensitivity scenarios like revenue minus 20% without actually rewriting rewriting the whole model. Um, and so inside the loop from year 0 to year 10, I'm just going to be cing computing the revenue, cost of goods sold, uh, labor, rent, and marketing, and depreciation at $1.2 million per year. Um, and then I'm going to calculate the earnings before interest and taxes, apply the 25% tax only when that is positive, and then I'm going to get the notepad. Um, and then I add depreciation back to get the operating cash flow. And so for year zero, I'm going to subtract the $12 million capeex and the $500 $500,000 working capital. And so for year 10, I'm going to add the operating cash flow, the recovery working capital, and the 3 million terminal value. And so for the years in between, free cash flow is just going to be the operating cash flow. And so lastly, I'm going to discount each year's free cash flow um at the weighted average cost of capital and keep running totals of um cumulative and cumulative discounted cash flows. And the function is going to return a full data frame of revenue, cost, appreciation, taxes, and free cash flows. Um all laid out yearbyear. Um and here you can see on the screen, these are going to be the data frame column names. Um, and you can see in the column names that this is going to be completely transparent. You know, if a manager wants to see exactly how I got from revenue to free cash flow in any year, it's totally traceable through my steps shown. Um, and now in cell three, I'm going to be moving to the implement. Um, I call build_cash_flows with the base weighted average cost capital of 8.5%. Store those cash flows. And then I'm just going to compute, you know, the key capital budgeting metrics. NPV, you know, I'm going to sum the discount and free cash flows. IRR using a bisection based compute IR function. Uh simple payback and discounted payback using the compute payback period function. And then the probability index is the ratio of the present value of inflows to the initial outlay. And so if we scroll down to my printed results, um we're going to get MPV is going to be positive 3 million here. Um NPV is going to be positive 3 million. Our IR is going to be around 13.25% which is comfortably above the 8.5% weighted average cost of capital. Um a simple payback of about 5.3 years, discounted payback about 8.2 years and a profitability index of about 1.24. Um and so the cash flow table below is just going to confirm confirm the story. a large initial outflow of 12.5 million in year zero including the working capital and then annual annual operating free cash flows in the 1.2 to $2.7 million range and then a larger final year cash flow when I'm going to add the terminal value in the working capital recovery. Um so then lastly I'm just going to check my work. I'm going to check my work here and validate. Um so first the direction of magnitude passed the smell test. You know, if a brand is Starbucks roaster that costs 12 million and generates 8 to 11 million in revenue annually, the reasonable cost structure should produce positive free cash flow. An an IR in the low teens versus an 8.5% weighted average cost capital is plausible and the payback around the middle um middle of the project life also feels super consistent. And so I'm going to move to this structured sensitivity analysis over here in cell 4. Um so in scenario A, a revenue is reduced by 20%. I'm going to reuse the same functions for build cash flows, but I'm going to call it revenue scaler and I'm going to label that 0.8. And that's going to keep the entire logic identical and only changes revenue. And so in that downside case, the NP flips to about negative 3.2 million and the IR drops to about 3.2%. So the project is quite sensitive to topline performance. If the, you know, the roast three significantly underperforms the revenue forecast, it's going to destroy the value. Um and so in Evolve, I'm just going to take the analysis one step further and make it a little more decision friendly for managers and um those ahead. And that's where the plots in cell five are going to come in. The first chart is going to be a bar chart of annual free cash flows. Um you can see the big negative bar in year zero and relatively flat positive pattern over the life of the project and then the spike in year 10 when the terminal value and working capital recovery hit. And so the second chart is going to be the NPV versus the weighted weighted average cost of capital sensitivity curve. And on the x- axis I'm going to sweep weighted average cost capital from 4% to 14%. On the y it's going to be the MPV for each discount rate. And that line's going to slope downwards crossing zero some somewhere between 13 and 14% which aligns with the IRRa that we computed numerically. Um and for managers this you know connects directly to capital structure discussions. If the financing decision pushes its weight average cost capital too high, marginal projects like this one will start to lose their appeal and value. And so lastly, I'm just going to build a small comparison data frame that's going to report MPV and IR for the base case. And for um the revenue around 20% case side by side and so it's going to highlight the revenue risk is much bigger driver of value uh destruction than modest changes in the weighted average cost of capital. Um and so putting it together uh my recommendation is to accept the project conditional and strong confidence in the revenue plan and execution. Um the project creates value under base assumptions and remains attractive across a reasonable weighted average cost of capital range. Um it also serves Starbucks brand and strategic positioning. So um that's what I have and thank you so much for watching.",
  "video_url": "https://youtu.be/sg0qbeLU0-Q"
}