{
  "student_name": "Anushka Wayse",
  "org_defined_id": "037494252",
  "username": "wayse",
  "email": "",
  "transcript": "1. D - Define & Discover This stage focuses on clearly understanding the capital budgeting decision, validating the project parameters, and defining the strategic scope of the investment analysis. Problem: Starbucks is evaluating a strategic \"Flagship Roastery\" project requiring a substantial $12 million upfront capital outlay and a $500,000 working capital injection. To assess the economic viability of this 10-year project, we must determine if the generated Free Cash Flows (FCF) provide a return exceeding the firm's Weighted Average Cost of Capital (WACC) of 8.5%. The analysis must determine if the project creates shareholder value (positive NPV) or if the funds should be deployed elsewhere. Goal: The objective is to build a transparent, dynamic Python-based cash-flow model to calculate NPV, IRR, and Payback Period, providing a data-backed \"Accept\" or \"Reject\" recommendation that accounts for both financial metrics and sensitivity to revenue volatility. Fact Verification - Important First Step: A common analytical error in capital budgeting is mismanaging the timing of cash flows, particularly Working Capital and Terminal Value. We must explicitly verify that the $500,000 Working Capital is an outflow at Year 0 and a recapture (inflow) at Year 10. Additionally, we must confirm that the $3 million Terminal Value is treated as a taxable cash inflow at the end of the project life, distinct from the depreciation schedule. Hypothesis: Given the high initial investment ($12M) relative to the Year 1 revenue ($8M), the project will likely have a long payback period. However, the surge in revenue during Years 2-5 ($11M) should drive the NPV positive, provided that operating costs (specifically the fixed labor and rent) do not erode the margin too heavily. The project will likely be highly sensitive to revenue fluctuations due to the high fixed cost structure (high operating leverage). Action: Confirm the tax treatment of the asset. Since the $12M is depreciated straight-line over 10 years, the Book Value at Year 10 will be $0. Consequently, the entire $3M Terminal Value will be treated as a taxable gain (Recapture). Communication Plan: If the Net Present Value (NPV) is marginally positive but the Internal Rate of Return (IRR) is close to the WACC (8.5%), the recommendation must rely heavily on the strategic \"Flagship\" branding benefits rather than pure financial arbitrage. Key Questions to Answer: Does the project generate a positive Net Present Value (NPV) using the 8.5% hurdle rate? How long does it take to recover the initial $12.5M cash outlay (Discounted Payback Period)? How does the reduction of revenue in Years 6-10 impact the total value creation? If revenue misses projections by 20%, does the project destroy value (turn NPV negative)? Is the project robust enough to survive a 2% increase in the cost of capital (WACC)? 2. R - Represent (The Plan) This stage outlines the analytical and technical steps required to construct the cash flow model and compute the core capital budgeting metrics. Core Formula & Methodology The analysis will be centered on calculating the Incremental Free Cash Flow (FCF) for each year and discounting it back to the present value to find the Net Present Value (NPV). Annual Straight-Line Depreciation: Depreciation = Initial Investment / Project life Operating Cash Flow (OCF): OCF = (Revenues − COGS − Operating Costs − Depreciation) × (1 − t) + Depreciation Free Cash Flow (FCF): Free Cash Flow = Operating Cash Flow − Capital Expenditure − ΔNet WorkingCapital + Terminal Cash Flow Net Present Value (NPV): Net Present Value = t=1 ∑ N​ (1 + Weighted AVerage Cost of Capital) Free Cash Flow at Time − Initial Outlay N = Number of Periods (N=10) Analytical Process (Steps) The process will be conducted in a sequential, calculated manner, leveraging a Python function to parameterize the assumptions: Step 1: Model Setup and Constant Calculation (Depreciation) Define all project parameters (Investment, Weighted Average Cost of Capital, Tax Rate, Revenues, Costs) as variables in Python. Calculate the constant annual depreciation. Step 2: Incremental Cash Flow Schedule Construction Create a loop for Years 1 through 10. Inside the loop, dynamically calculate: Revenues, COGS, Total Operating Costs (excluding depreciation), Depreciation, Taxable Income (EBIT), Taxes, and Free Cash Flow. Special Cash Flows: Year 0: Calculate total initial outlay = −Investment−Net Working Capital. Year 10: Add the Non-Operating Terminal Cash Flows: Recovery of Net Working Capital and Terminal Value (after tax on the salvage gain). Since the Book Value is $0, the entire $3M is a taxable gain. Step 3: Core Metric Calculation (Base Case) Use the Free Cash Flow array and the Base Weighted Average Cost of Capital (8.5%) to compute the NPV, IRR, Discounted Payback, and Profitability Index (PI). Step 4: Sensitivity Analysis Implementation Create parameterized functions to re-run Step 2 and 3 for the two required scenarios: Scenario A: Revenue multiplier set to 0.8 (20% reduction). Scenario B: WACC set to 6.5% and 10.5%. Summarize the impact on NPV and IRR. 3. I - Implement (The Analysis & Code) The model was implemented using Python's numpy-financial (Python Library (Numeric Python - Financial)) library to execute the cash flow projections and metric calculations. The base case uses the Weighted Average Cost of Capital of 8.5% and 100% of the projected revenues. Base Case Incremental Cash Flow Schedule Year Revenue Op. Costs Depreciation EBT Taxes Net Income OCF ΔWC/TV Project CF Base Case Capital Budgeting Metrics (WACC = 8.5%) Metric Value Hurdle / Target Recommendation Net Present Value (NPV) $3,022,514.85 > $0 Accept Internal Rate of Return (IRR) 13.25% > 8.50% Accept Profitability Index (PI) 1.347 > 1.0 Accept Simple Payback Period 0.56 Years <10 Years N/A Discounted Payback Period 0.52 Years <10 Years N/A Conclusion: All three primary value metrics (NPV, IRR, PI) indicate that the roastery project should be accepted, as it is projected to create over $3.0 million in value for Starbucks. 4. V - Validate (Accuracy and Sense Check) This stage verifies the computed results against established financial rules and tests the robustness of the valuation using the implemented scenarios. Sensitivity Analysis Summary The model was subjected to the two required sensitivity tests. Scenario WACC Rev Multiplier NPV Impact ($M) IRR Impact (%) Recommendation Base Case 8.50% 1.00 3.02 13.25% ACCEPT A: Revenue -20% 8.50% 0.80 -2.75 3.88% REJECT B: WACC +2% 10.50% 1.00 1.63 13.25% ACCEPT B: WACC -2% 6.50% 1.00$= 4.64 13.25% ACCEPT Interpretation of Risk Revenue Volatility (CRITICAL RISK): The project is highly vulnerable to underperforming sales due to high operating leverage (high fixed costs relative to revenue). A 20% reduction in revenue (Scenario A) causes the NPV to become significantly negative (-$2.75 Million) and the IRR (3.88%) to fall far below the 8.5% hurdle rate. This finding suggests the revenue forecast is the single greatest financial risk to project viability. WACC Robustness (LOW RISK): The project's value is robust to changes in the cost of capital. Even if the WACC increases by 200bps to 10.5%, the NPV remains positive at $1.63 million. 5. E - Evolve (Critique and Next Steps) This stage critiques the static assumptions used in the implemented model and suggests technical and analytical improvements for a more refined analysis. Technical Critique: Payback Period Error A critical error was found in the model's computation of the Payback Periods. The cash flow schedule shows an initial outlay of -$12.5 Million and a Year 1 cash flow of +$1.2 Million. A payback period of 0.52 years is mathematically incorrect. The actual simple payback period should be closer to 5.2 years. This indicates a likely logic error in how the cumulative cash flow was tracked in the underlying code, and the metric should be disregarded for the final recommendation. Analytical Critique of Assumptions Terminal Value Tax Treatment: The model correctly assumes the entire $3M Terminal Value is a taxable gain because the Book Value = 0. However, in a real scenario, the Terminal Value should reflect the after-tax sale of the asset and the present value of continued operations (a perpetuity), which would likely add more value than a fixed $3M sale price. Depreciation Method: The model uses straight-line depreciation. The Modified Accelerated Cost Recovery System is typically used for tax purposes, which accelerates depreciation and creates a larger tax shield in the early years. This would increase the early-year Free Cash Flow, resulting in a higher NPV and a faster discounted payback. Next Steps for Deeper Analysis The immediate next step is to rigorously stress-test the project's viability around the critical risk identified: revenue shortfall. Management should determine the break-even annual revenue level required to achieve NPV = 0, giving them a clear financial floor target for the first five years of operation. 6. R - Reflect (Key Takeaways) This final stage synthesizes the financial and strategic findings into core lessons learned and the definitive executive recommendation. Executive Recommendation The Starbucks Roastery project is financially attractive, creates significant shareholder value in the base case, and is strategically essential for brand premiumization. Recommendation: ACCEPT the Investment Key Takeaways for Management Value Creation and Return Buffer: The project is sound, with an IRR of 13.25% that provides a strong 4.75% buffer over the 8.5% WACC. The PI of 1.347 confirms that the project is capital-efficient. Revenue Performance is the Single Greatest Risk: The project is dangerously susceptible to market underperformance. The sensitivity test showed that a 20% drop in revenue makes the project value-destroying (NPV < 0). Marketing and operational excellence must be executed flawlessly, especially in the first five years, to achieve the $11M revenue target. Strategic Rationale Validates Risk: The investment is justified not only by the positive NPV but also by its role as a strategic brand asset. The Roastery serves as a high-visibility marketing platform that reinforces Starbucks luxury segment, justifying premium pricing and driving traffic to its overall ecosystem. This strategic benefit further strengthens the acceptance decision despite the revenue sensitivity. Mitigation Strategy: Starbucks must implement a robust monitoring system, focusing on early-year revenue and expense control. If sales trajectories indicate a potential 20% shortfall, management must be ready to quickly cut variable costs or deploy targeted marketing to pull the project back to the break-even point.",
  "video_url": "https://youtu.be/ppQG8nMvmkI"
}