{
  "student_name": "Benjamin Engels",
  "org_defined_id": "037980105",
  "username": "bmengels",
  "email": "",
  "transcript": "Okay, good evening everyone. Alright, so for this week's assignment session, nine assignment, we are required, uh, five bolt points, one calculate Netflix's current WACC, two-determined WACC, WACC after $3 billion debit, uh, insurance, or issuance, excuse me, uh, three evaluate project specific, WACC , four compare Netflix's WACC to Disney, and explain the difference. And then five recommend optimal capital structural strategy. So for this assignment I used, uh, again, once again, Google GEMI. So, um, starting off here, we have, uh, the, so we're again using the driver method. So, obviously the D is defined and discovered. So we have our, our given, uh, parameters here. And we're gonna use the W-A-C-C formula, which you can see here, um, below illustrated, uh, here at Google GEMI. So this is the, uh, the discover in, uh, the D of driver. We're defining using this formula. Um, our, as a research interview, so, um, this is the formula, again, that we will be- using, uh, to discover W-A-C-C, and then, uh, the I identify and implement. So using those given values, we're going to calculate Netflix's current W-A-C-C. Uh, so here, we plug in using, uh, uhh, uhh, uhh, uhh, uhh, we're going to be using, in this case, uhh, it's going to be C-A-P-M, uhh, which is what is shown here, and then we use, uhh, we determine the market value, weights , uhh, and then calculate the after-tax- cost of dev, dev it. So, with all these values that we come up here with here, we're able to, uhh, then determine the, uhh, W-A-C-C, which for Netflix's current percentage, comes out to be 11. 0.21%. So, that's also number one. Umm, part two, determine the W-A-C-C after $3 billion debt, uhh, issuance. Umm, so we go through here, we, again, put in the weights, and, umm, we now calculate, we have- the new debit weight, which is 7.41%, uhh, and then we plug that back into here, and we still get , uhh, the new one of 11.12. So, it goes from 11.21 to 11.12. So, that's all number two. So, we evaluate it then. Umm, and so, we just go through here, and we have some explanation as to why, umm, obviously, international compared to the U.S. So, we have U.S. content, uhh, which illustrates how it made the uhh, the lower market risk, and then international content, which inherently might be higher, a lot of uhh, political instability there, and then uhh, it gives, obviously, we see a recommendation there, and uhh, uhh, uhh, what happens if W-A-C-C is too high versus too low. Uhh, part D, or 4 here, uhh, this is question 4, so we compare it to Disney, compare Netflix to Disney, and so again we use, uhh, Disney's W-A-C-C. And this is E.2, so it's a couple points lower than Netflix. Umm, the cost of debt is like a lower for Disney. Umm, which is honestly surprising to me. Umm, and then we have, uhh, the cost of equity. Which is important value to think about here. Umm, and then the risk profile. Which is higher growth for Netflix. Lower risk for Disney. So that's four. And then, uhh, these are the differences as to why. So we have one system. Vanic risk. Two capital structure and three credit profile. Ummm, and then last part E, umm, number five. Uh, recommended, umm, strategy moving forward. So for Netflix. Increase its debt. Umm, moderately. Umm, seeing how its Disney is slower and is able to compete better. Umm, target, you know, have a target range, umm, that the capital ratio. So 15 to 20%. Umm, and then we have our h- here to finish out driver. As you can see here, we have our analysis and everything that we just went through. Umm, so, thank you all so much for watching. This has been driver method of session 9 assignment. Thank you.",
  "video_url": "https://www.loom.com/share/13a9fdd94d66492ca24999d378f77d66"
}