{
  "student_name": "None None",
  "org_defined_id": "038073978",
  "username": "lbthang",
  "video_url": "",
  "transcript": "0:01\nHi guys, my name is Law and for today's\n0:04\nvideo and assignment we are on mini\n0:06\nproject 3 build building an uh advanced\n0:10\nAI finance tool using any platform such\n0:14\nas like NN and\n0:18\nso basically a platform of our choice.\n0:21\nSo my AI agent tool that I built for\n0:23\nthis assignment is to give you guys an\n0:25\noverview is um it is simple and useful,\n0:30\neasy to use. So my AI agent is um\n0:35\nsomething similar to stock valuation.\n0:38\nIt's mainly meant for day traders. So I\n0:42\nbuilt an AI agent that helps you um make\n0:45\ndecision on whether you want to trade or\n0:47\nnot on a certain stock.\n0:51\nSo basically it gives you put in you put\n0:54\nin a u a ticker symbol a stock and it\n0:58\ngives you feedback whether you should\n1:00\nlike trade or not. So it basically gives\n1:02\nyou like suggestion.\n1:04\nSo basically like a market analyzer for\n1:07\nyou.\n1:10\nThis is my um workflow.\n1:15\nThis is an overview of my a my AI agent.\n1:20\nSo to keep things short, um so starting\n1:23\noff um we're going to start\n1:27\nI'm going to communicate. We're going to\n1:28\ncommunicate through um Telegram,\n1:32\nmeaning that we're going to send a\n1:34\nticker\n1:36\nsymbol over Telegram and we'll get the\n1:40\nanalysis back through Telegram. as you\n1:43\nguys can see here at the end as well.\n1:46\nAnd then basically the way the I the AI\n1:50\nagent is going to help us um\n1:54\ngenerate trades is through two different\n1:57\npoints here.\n1:59\nUm so the first is the the one minute\n2:02\ncandlestick and the 15 minute and the\n2:06\none hour uh 1 hour candlestick data. So\n2:10\nall we're going to do is take the last\n2:12\n100 minutes um the last 115 and then the\n2:15\nlast 100 hours and then once we have all\n2:18\nthat we're going to combine it with um\n2:21\nrecent stock um news articles for the\n2:24\npast day and this way we can get a\n2:27\ncomplete view of both any technical past\n2:31\num technical indicators as well as like\n2:36\nsmall events that could be happening\n2:39\nregarding according to that one slack\n2:40\nthat you choose to look up. So after all\n2:44\nthat's done is we're going to clean up\n2:46\nall this data and this AI message model\n2:49\nas well. We're going to all clean it up\n2:51\nand then we're going to um\n2:56\nmerge merge the two data sources and\n2:59\nthen we're going to aggregate it and\n3:01\nthen send it over to an an AI agent\n3:04\nwhich is going to help us form the final\n3:07\ntrade opinion.\n3:10\nAnd again, everything is data focused.\n3:14\nSo there's no um bias at all. So all\n3:17\nit's doing here is it's going to look at\n3:19\nall the prices of every minute, hour and\n3:21\n15 minutes.\n3:23\nAnd it will be able\n3:26\nto see the volume levels as well. And\n3:30\nbasically it's going to c calculate it\n3:33\non its own um indicators that it sees\n3:36\nhere.\n3:39\nAnd then finally we're going to be able\n3:40\nto see the outside opinion through um\n3:44\nnews sentiment. And from there we will\n3:48\nform a final opinion that we can view in\n3:51\ntelegram and decide whether we want to\n3:54\ntrade take the trade or not here. So for\n3:57\nexample, if we go to Telegram. So I've\n3:59\nalready did an example of Tesla. So if\n4:02\nwe do\n4:04\nApple\n4:07\nand execute work, it's going to run\n4:08\nthrough here. Run through. And then it's\n4:11\nthe AI is going to look through the\n4:13\narticles here. And then it will once\n4:15\nit's done, it will merge into one\n4:19\nhere. We just it takes a little bit of\n4:23\ntime. There we go.\n4:28\nDoes that\n4:39\nboom you get a notification send your\n4:41\nworkflow executed succfully and you go\n4:44\non telegram and it will tell you here.\n4:47\nSo basically it's recommend uh\n4:49\nrecommendations to buy the entry price\n4:52\nof six\n4:55\n269 and 269 stop loss here and there's\n4:58\nyour exit and\n5:01\nyour hold and exit decision as well is\n5:04\nto hold. So basically,\n5:09\nso basically um this tool is for any\n5:11\nbusy student or part-time investor who\n5:15\nwants to um stay informed without the\n5:18\nhaving to read bunch of articles about a\n5:20\nstock the recent stocks. And the good\n5:24\nthing is that it doesn't make um\n5:26\ndecisions for you. It just bas it gives\n5:28\nyou um the expert context to make a\n5:31\nsmarter decision for yourself and\n5:33whether you want to make the trade or"
}