{
  "student_name": "Carson Parmer",
  "org_defined_id": "036732462",
  "username": "cjparmer",
  "video_url": "https://youtu.be/RnHQjq7_ZFw",
  "transcript": "Um, and the video here, uh, this is our session 13 or capstone project for, um, this class here. And what I decided to do, I know and all of this it says, what you might build, just ideas, um, stuff like that. Um but what I'm going to do is more for construction base. So what I did was I used uh Google Google Colab and made a, um, script that will calculate concrete, price of concrete, um, overhead, percent that you want to make on it. So if I want to make 15%, if I want to make 20%, whatever I want to make, this will calculate everything for me. So all I'll have to do is type in uh word for or a numbers. So like this first one here it says, \"Enter the length of the area in feet.\" So if I can type that in real fast, it'll spit out a numbers for me and I can just keep typing in every everything it asks for. Um you've got in the thing here, um, someone who someone who specifically would use this is foremen on a job site, um, superintendents on a job site, concrete, uh subcontractors, um, anything actual, you know what I mean. So, uh, I showed it to my foreman, and he said it was great. He said it would work perfectly for anything that they want to do. Um, and I will show you how it works. So the first thing it asks for is enter the length. So we'll say 16 ft. Uh the width of it. We'll just do 16 by 16 uh, slab that we're going to pour. Um, how how enter the depth of your concrete. We're going to pour 6-inch concrete, also known as heavy-duty concrete. Cost per yard. Uh most concrete around here is $125 per yard of concrete. Uh square feet of formwork required. So that it does take a little bit of calculations. But we'll just say we're going to do um, 30 square feet of uh formwork. Formwork's weird because if you have a 1-foot board that's a 2x6, you've only really got 5 and a half um inches by a foot, and you've got to kind of just calculate on how that works. Uh cost per square foot of formwork, we'll say $125. Uh the crew cost per crew cost per cubic yard of concrete poured. So we'll say that is 500 bucks. Crew cost of per square foot of formwork, we'll do another 500 bucks there. Overhead on the project. Let's say it's $3500. Uh desired profit percentage. We'll say we want to make 15%. So then this will spit out everything for me, calculate everything for me. Um and it's saying for 16 by 16 slab, you need to charge $28,994. So as you can see, um everything listed out here. Concrete formwork, crew overhead, profit estimates. 16 by 16 with the depth of 6 in. You'll need approximately 4.74 yards cubic cubic yards of concrete. So like when I showed my foreman, or foreman, we typed all this in, he's like, \"That's perfect. You can just add or um order 5 yards of concrete. You don't have to do the math or anything like that. It'll do all that for you.\" Concrete material cost. Um 4.74 at $125 per cubic yard is this much, $592. Material cost, $3750. Uh that is probably a little high, but it's close. Um and concrete crew cost. So those are my actual finishers, the people placing the concrete, everything like that. Um $2370.37. Formwork crew cost is $15,000. So that's saying that the carpenters that are pour uh placing the formwork for the concrete is $15,000. Uh I said my overhead is 3500. So you've got to be able to add in prices for Anybody in your office that's also in charge of this project. Um the people that are above the foreman, you got to be able to pay the foreman because none of this is included in the foreman. And then I'm going to add 15% profit on top of that for the owner of the company or any plus minus in the project. And that's when it goes uh total project cost including profit is $28,994. Um The only hard thing about this project or about me using this was um I understand Colab very well. Um I could add how to calculate square foot of formwork that we're putting in there, but I didn't know how Colab would take it. I tried it once or twice, and I couldn't figure out um really how to understand that. So what I did differently was um I can just add I can just do it uh on a calculator pretty fast. I understand how to get square foot um pretty easily. Um thanks for watching this capstone project and I uh hope you understand it. I hope it works out. Like I said, I've showed people and everybody that I thought that I've showed is um it worked really well.\""
}