{
  "student_name": "Ivy Fu",
  "org_defined_id": "034845705",
  "username": "fu450",
  "email": "",
  "transcript": "Hi, my name is Evie and today we're going to talk about the ne Netflix WACCC assignment. So um for the define and discover our objective is to determine Netflix weight average cost of capital to guide a 5B content investment decision. So there are a couple questions here like what is the Netflix current WACC? Um, how will a three billion new debit new dabbed in insurance affect capital structure in WACC? Should project specific WCC differ for US and international content? How does Netflix compared to Disney and other industrial peers? We have a couple key data um like market cap is 200 billions, market debit value is 13 billion, beta is 1.3, risk-f free rate is 4.5%, market risk premium is 5.5%, bond yield is 5.8%, tax rate is 21%. Pure WACC like Disney is 8.2%, 2% Amazon is 9.5% and industry is about 8 to n uh 8 to 10%. for the represent part. So our plan is to use the CAP CAPM for cost of liquidity and we'll compute the after tax cost of depth apply market value weights for debit and liquidity in WACCC formula. We'll recalculate weights after adding 3B depth to measure structural impact. We'll adjust project specific discounts rates and we'll compare to Disney and Amazon for competitive context. So our expected outcome is a slight reduction in WACC from new depth due to the tax shield but still above peers because of tax because of Netflix higher liquidity risk and concentrated revenue model. And let's kind of look into um the Google collab. So here we have um the code that I generate from Google Gina AI and after we run it we will get this data with the Netflix current WACCC and a Netflix WACCC after the 3 billion depth. Okay. So there are two different sets of percentage and I've copied them right here for easier references. Now let's let's kind of validate the data. So there's a slight drop in WACC but it's understandable because adding a bit of DAB lowers the cost slightly because of tax benefit and we can compare it to Disney and Amazon but first we can compare to our own data. So Netflix with 11.22% is higher WCC since it depends more on liquidity and has higher business risk. And this one after the 3 billion dab of 11.13%. Uh with a slightly reduction so with a slightly reduction from added leverage but still higher than peers. And then when we compare to Disney with 8.2 oh when we compare to Disney with 8.2% uh we can see that it's lower WCC because it has many business lines and steady cash flows. And if we compare to Amazon with 9.5% we'll see that it's lower WCC reflecting um diversified operation strong cash flow and lower perceived risk cuz you can see here if we compare to the WACC or even after the three billion depth they are all higher than the Disney's percentage and Amazon percentage here. So yeah, compared to those um Disney tend to have the lower WACCC and so does the Amazon tend to have the lower WACCC. Now if we compare to real life data um I found a website it's called group focus. So if you see here um right now it's saying 11.88%. And if we look here our current WACC of 11.22 22 is close to group focus report of well this one at that time is 11.86 86 but not 88. So it's close and showing that our model is reasonable with the hypothetical hypothetical numbers. So it's a close and to summarize these the results make sense financially. A little more depth helps reduce costs but not enough to close the gap with peers. If Netflix add too much depth, it could hurt its credit rating and make borrowing more expensive later to evolve. So in the future, the analyzis can be imported by updating Netflix data beta after adding new depth which will give a more accurate picture of how leverage affect the cost of liquidity. It will also be helpful to test different interest rates and depth scenarios to see how WACC changes under various conditions for international projects. The WACCC would be adjusted slightly higher to account for additional risk in foreign markets. So all in all, a moderate increase in depth around 10 to 12% of total capital seems optimal. It reduced the cost of capital slightly while keeping the financial risk under control and preserving flexibility for future investments. For our last part, uh reflect. So by validating the results, we can confirm that the ACC numbers were reasonable and align with economic logic because here we um comp compare with the real life data. It's very it's relatively close. So it makes sense. And this process also shows that minimizing WACC is not just about lowering a number, but it's about balancing the cost reduction with financial flexibility, credit strength, and the ability to continue investing in content growth. So, that was all of them. Thank you for watching.",
  "video_url": "https://youtu.be/8NLQWZn4xko?si=Z4Ywe3Fiakae0lW_"
}