{
  "student_name": "Abdulrahman Ali",
  "org_defined_id": "037005845",
  "username": "ali243",
  "video_url": "https://www.loom.com/share/a3201cdab07c4558895ec1bec2350934",
  "transcript": "0:01 Hey everyone, how are you doing? So I'm Dr. Rahman Ali, and today we're supposed to be building a AI-powered financial innovation, alright?\n0:08 Section 1, the only brief unit is we built something to track this out of the financial problem, using an AI-language model.\n0:14 All this is for me to know what we're allowed to do. Or we're not doing the requirements and all the other stuff and anything else, but I'm just telling you guys exactly what we have to do.\n0:24 Alright? So, let's actually get started and explain to you guys what I did. So, why try it? So, I chose to do a simple business profit and expense calculation, because I want a few businesses and this is an easy way for me to actually use something to- I talk about.\n0:37 It has a graph, um, so let's say, for example, I don't want a phone store. Umm, this, at the end of the day, I- at the end of the day, I will go and I will look at how much money I need.\n0:49 Let's start with, add income. So I made $4,000. $88 from counting bills, which is like paying people's bills. I made $2,700 and $998 for services, which is repairs.\n1:03 I can also take- exactly what it is. And I also made $1,807 from ssssss. . From what it's called, from sales, which is selling phones.\n1:17 Alright? And the first one's $4,088, which is for betting bills, alright? So, we total income today. It was made, it was $8,693.\n1:27 However, I would have to add expense. Why? Because today it was rent and tour app was $2,500. So, I'm gonna come here, and then- Alright, rent.\n1:37 Rent was today. This is the one I usually pay rent on the 40s, so I wrote rent for shop. And then here, bam, I didn't expect- rent, so it's done with my total expense, alright?\n1:52 Now, for us, also, in another sense, I paid my electricity bill. Was it around 100? Like, thirty-five dollars and eighty-eight cents.\n2:00 So, what did I pay today for? Was utilities electricity? Alright? So, Ben, another expense today was I did a payroll.\n2:09 I had to pay my work in $180. So, payroll, $180. Alright? Another expense is the- The bills that I pay are not actually billed.\n2:19 Most of that is not profit. So, we automatically exclude that from the profits. So, we made $4088. What we'll do is we'll take $4088 as an expense and we'll not count it as a- profit.\n2:30 So, $4088 as other expenses, which is bills. So, bam. So, our total expenses to- It was $7,503,88. Our total income was $8,693.\n2:46 Our report was showed that I made a net profit. I love it. Of $998, $989.00 and 12 cents with a 11.4% margin.\n2:55 This sells out a lot, but it's pretty good if you're making $184.00 a day. But this helps you, Understand that, hey, you don't actually make $8.00 a day.\n3:05 You make this much. Because you have to include that. You have red to pay for. You have other stuff. You have payroll.\n3:10 You have utilities. Alright. And this kind of explains to you what, So, this here tells me what my income is.\n3:15 My income is 7.7% of it is sales. And 32.2% is repairs, services. and my expenses for shorts is coming out of the cash outflow is 53.1% of the other expenses, which is, I mentioned that was the, uh, uh, uh, pair of all the utilities.\n3:33 I mean, this is the bills, I'm sorry, payroll is $48,000, 12.7% and it runs 32.5%. We'll see you $20,000. And the dashboard is kind of just telling you, kind of like an overall view of what happened and how many suggestions you had today and that.\n3:48 So this is kind of like, this is- I chose to build from whatever the session 13, um, the build AI powered.\n3:55 Um, this is what I chose to build. I think this is going to actually help me. I will actually be using this in the future.\n3:59 It helps me calculate and organize how much money is coming in my store and how much money is going out in my store.\n4:05 And thank you guys very much for watching me and umm, I think I will have to learn a lot from this one.\n4:09 I think this will actually help me a lot in my future. Businesses. Everyone have a wonderful day and I hope you guys will see you guys next year.4:17 Yeah. Yeah."
}