{
  "student_name": "Kevin Sales",
  "org_defined_id": "033940131",
  "username": "kfsales",
  "email": "",
  "transcript": "All right, good afternoon. Uh, welcome to my analysis for Netflix. In this presentation, I walk through how to evaluate Netflix's 5 billion capital investment using the weighted average cost of capital. I'm applying the driver framework to structure the analysis from beginning to end, defining the problem, collecting inputs, mapping formulas, and I'm going to be implementing calculations again utilizing Python through Google Collab. I will be validating results and connecting everything to a broader corporate strategy. All of these inputs and requirements directly from the section 9 materials. So quick overview of the project is that this slide is be um just the basis for what I would need to cover. The goal here is to complete Nexus's weighted average cost of capital and analyze how it changes under different conditions. Using the driver structure keeps everything organized and ensures I don't skip any analytical steps and will calculate the cost of equity through CAPM. The at the tax cost of debt based on Netflix's bond yield and the market value ways of depth inequality equity. The results will then be used for project validation and peer comparison. So the driver framework so essentially as you know that this will be structured the entire analysis and define u will be clarifying the investment decision is facing discover will be compiling numeric numerical inputs from the assignment represent will be visual maps of the formulas and logic implement will be the utilization of python to comput capm at the tax debt cost capital structure weights and etc. validate checks would be to ensure that the results that we are getting make sense and evolve essentially just links calculation to a strategy that Netflix could potentially utilize and reflect would just essentially be summarizing what I have learned from this analysis. So in define we articulate what Netflix is deciding. So the company's planning a $5 billion content investment and the key question is whether the project's expected return exceeds Netflix cost of capital. If the return is below WACC, shareholders lose value. If above, the company creates value in this step. Also identifies secondary questions which how much debt affects WACC whether international projects need different discount rates and how Netflix's cost capital cost compared to rivals like Disney and Netflix. So in the discover stage I collected all required inputs from the section assignment. Netflix equity value is 200 billion. It depth trades at a market value of 13 billion. Its equity beta is 1.3 and its bond yield of 5.8% is based on um the corporate tax rate and the corporate tax rate is 21%. The risk-f free rate is 4.5%. The market risk is premium at 5.5% and for context Disney's WACC is 8.2% and Amazon is 9.5. And these are essentially going to be the numbers which be a foundation for all my calculations that you see from here on out. So in this slide basically just represents how the inputs will be combined. And WACC requires three components. the cost of equity, the advertise cost of debt, the market value weights of each. TAPM gives us the cost of equity while the bond yield is going to be what is going to be utilized to give us a pre-tax cost of debt which must then be adjusted for a tax shield. After mapping these relationships, the full WACCC formula is ready to apply. So in the represent of the formula sheet, we're going to see all the formulas in one place. CAPM is used for the cost of equity. The cost of debt is adjusted for taxes. The capital structure ways are based on market values and these formulas will just allow us to compute WACC precisely and they will also guide how we implement the calculations into Python. So now in implement I started by setting up the core inputs in Python. This cell defines and place equity and debt market values and essentially the corporate tax rates betas for the United States and international projects. the market assumptions for the risk-f free rate and market risk premium. I also define the pre-tax cost debt based on 5.8% bond yield and this just mirrors the discover stage but in color form. So everything is now essentially ready for calculation. So now in this cell I calculate the base WACC. I first compute total firm value and then the equity and debt weights using CAPM with a beta of 1.3. I find that the cost of equity to be 11.65%. The advertise cost of equity is 4.58. Plugging both the WACC formula with their weights gives the current WACCC of about 8.38%. And this is Netflix's hurdle rate before any extra debt is added. So now in the implement stage, so on this slide, I'm showing how Netflix walk changes after issuing an additional 3 billion of debt. As you can see in the bar chart, the WACC increases from about 8.38% to 8.53%. And even though the debt is generally cheaper than equity, adding more leverage increases the company's financial risk, which ultimately raises the blended cost of capital devilization makes this easier to see. And the left bar represents Nexus's current WACC and the right bar reflects the new capital structure with higher debt. The slight upward movement in WACC reinforces a key concept. Leverage can reduce the cost of capital up to a point but eventually the increased risk starts pushing WACC back upward. So now implement project specific WACC. So this slide highlights how risk varies between Netflix's US content investments and international projects. So the bar chart clearly shows the difference between the United States um content WACCC is lower because it uses the regular corporate beta of 1.3 but the international projects face more uncertainty including currency risk, local regulation, political instability and weaker legal protection. So I increased the beta to 1.5 and as a result the WACC rises noticeably. This chart makes this contracts easier to understand. International content requires Netflix to demand a higher expected return before greenlighting this projects and in turn reflecting the increased risks profile. So now this slide uses a peer comparison par chart to put Netflix's walk into context. As the graphic shows, Disney has the lowest 3 ACC at around 8.2% reflecting a more stable and diversified business model. Netflix sits in the middle roughly 8.38% which makes sense because it just carries more risk than than Disney but it is still more focus than Amazon. Amazon's WAC has the highest of about 9.5% and this is just due to it being driven by a wide range of operations and you know this just brings a higher corporate risk and this chart just helps illustrate how Netflix based the competitive landscape not the lowest cost capital not the highest but positioned right between two major industry players and you know it just makes sense why Amazon is a little um it's just the way it is because Amazon you know a lot of people use Amazon Prime for shopping you you know, uh there are some shows that come on Amazon Prime that are people are into and focus into, but that's just not the main use for um Amazon. So now in the validate check stage, I test whether the output passes common sense checks because equity values in low teens are typically for a are typical for a streaming/media stock a 4.5% through 5% after tax cost is reasonable. the equity and debt way sum to 100% and increasing leverage leads to a slightly higher WACC consistent with theory. So raising beta for international projects also raises their WACC. All this tells me is that the numbers are just are not just mathematically correct but they just make sense overall. So and the evolve step connects WACC to real corporate decisions. So Netflix uses WACC to decide which content and infrastructure projects clear the hurdle rate. It also uses WACC when considering whether to borrow more or issue equity and when weighing the risk of expanding to new regions. By comparing his WACC, Disney to Disney and Amazon, Netflix can see whether it's capital cost or competitive. Ultimately, WCACCC is a strategic compass that links investor expectations with management choices. So reflection. So the biggest part of this challenge wasn't plugging numbers into formulas. It was really understanding what those inputs represents. Beta isn't just a factor. It's the market's verdict of how risky Netflix is. And the bond yield tells us that how creditors price Netflix's chance of default. The tax rate explains why firms often like using that up to a point. And putting this together, I now see that WACC as a bridge between what financial markets demand and what companies decide to do. And in conclusion, Netflix's current walk is about 8.38% and taking an additional $3 billion nudges it to up to 8.53%. The international projects deserve a higher discount rate than United States projects because of their risk profile relative to Disney and Amazon. Netflix sits in the middle in terms of cost capital which fits in the business model and risk. In the next step, this WACC will serve as a discount rate in the MPV analysis and connecting the cost the capital directly to project violation and capital budgeting decisions. Thank you so much and I hope you enjoyed",
  "video_url": "https://youtu.be/IM_LZGkSqMY"
}