{
  "student_name": "None None",
  "org_defined_id": "033541051",
  "username": "sevillaj",
  "video_url": "",
  "transcript": "SLIDE 1 — TITLE \nHey everyone! Today I'm going to walk you through my AI Financial Advisor project. This isn't just another calculator that spits out numbers. This is a tool that actually understands context, explains complex concepts, and provides personalized insights. The key difference here is that it answers the \"why\" behind financial decisions, not just the \"what.\"\n\n SLIDE 2 — THE PROBLEM \nSo here's the problem we're solving. Most financial tools out there just do basic math. You put in some numbers, and you get numbers back out. But real financial decisions aren't just about math. People ask questions like \"I have ten thousand dollars to invest, where do I even start?\" or \"What does P/E ratio actually mean?\" or \"Should I pay off my debt first or start investing?\" These kinds of questions need context. They need explanation. They need personalized advice. And that's exactly what this AI does. \n\nSLIDE 3 — THE SOLUTION \n\nLet me break down how this application is structured. The app has five main components that work together. First, there's the AI Chat Advisor. This is the brain of the whole application. You can have natural conversations about any financial topic, and it responds like a knowledgeable advisor would. Second, there's the Financial Profile System. The app stores and remembers your income, your expenses, your savings, your debt, your age, your risk tolerance, and your financial goals. All of this context is what makes the AI responses truly personalized to your situation. Third, there's the Market Data Panel. The AI actually fetches real-time market information like S&P 500 levels, Federal Reserve interest rates, and current inflation data. It uses all of this in its analysis when answering your questions. Fourth, there's the Scenario Builder. This lets you create and compare different financial strategies visually with charts and projections. And fifth, there's the Concept Explainer. This is like an AI tutor that breaks down complex financial terms into simple, easy-to-understand language. \n\nSLIDE 4 — ADVANCED AI CAPABILITIES \nNow, the assignment required at least two advanced AI capabilities. I've actually implemented several of them. The first one is External Data Integration. The AI doesn't just work with static knowledge. It actually pulls in current market data, interest rates, and economic indicators from the internet. So when you ask something like \"Is now a good time to invest?\", it considers what's happening in the market right now. The second capability is Multi-Step Reasoning with Context. When you chat with the AI, it doesn't just answer your question in isolation. It considers your full financial profile, your conversation history, current market conditions, and your stated goals and risk tolerance. All of these factors come together to create truly personalized responses. The third capability is Structured Outputs. The AI returns structured JSON data that includes the response, the sources behind it, a confidence level, and a flag that indicates whether you should consult a professional. This makes the outputs more reliable and useful. The fourth capability is Memory and State. Your financial profile persists across sessions. The AI knows your situation and tailors every single response accordingly. A recommendation for a twenty-five-year-old aggressive investor looks completely different from one for a fifty-five-year-old conservative saver. And the fifth capability is Guardrails and Safety. Every response includes appropriate disclaimers. The AI flags when topics require professional advice. It never recommends specific stocks to buy. This is what responsible AI design looks like. \n\nSLIDE 5 — LIVE DEMO HIGHLIGHTS \nLet me walk you through how the actual application works in practice. First-time users go through a guided profile setup where you enter your monthly income and expenses, your savings and debt, your age, your financial goals, your risk tolerance, and your investment time horizon. This takes about two minutes and powers all of the personalization. Once you complete the setup, you land on the Dashboard. Here you see your Financial Health Score, which is a zero to one hundred score based on your savings rate, emergency fund coverage, and debt-to-income ratio. You also see live market data the AI has fetched. The Chat Interface is where the real magic happens. You can ask anything about your finances in plain English. Questions like \"How should I allocate my emergency fund?\" or \"I just got a five thousand dollar bonus, what should I do with it?\" The AI responds with personalized advice, cites its reasoning, and includes relevant disclaimers. The Scenario Builder lets you compare different strategies. You can create a Conservative Investment approach versus an Aggressive Growth approach and see projected outcomes over ten, twenty, or thirty years with visual charts. And the Concept Explainer is your financial education tool. Search for any term and get a simple definition, a practical example with real numbers, an explanation of why it matters, and a memorable analogy. \n\nSLIDE 6 — CONCLUSION \nSo to wrap everything up, this AI Financial Advisor goes well beyond simple calculations. It understands your unique situation. It explains the \"why\" behind financial concepts and recommendations. And it provides insights that are personalized to you. Whether you're asking about retirement planning, trying to understand a new financial concept, or comparing investment strategies, this tool meets you where you are and speaks in plain English. That's the real power of using AI as the brain of a financial tool. It's not just about crunching numbers. It's about actually helping people make better financial decisions with confidence. Thanks so much for watching!"
}