{
  "student_name": "Maanasa Gogula",
  "org_defined_id": "037442697",
  "username": "sgogula",
  "email": "",
  "transcript": "Hi, my name is Manisa and today my task is to analyze Netflix weighted average cost of capital by one calculating the current uh WACC based on provided financial parameters and market conditions and then recalculating WACC after a hypothetical 3 billion additional debt issuance. And then my third task is to discuss the project specific WACC for you US versus international content and 5 million content and the fourth one is to compare Netflix WACCC to Disney's investment. So first I decided to calculate the current WACC the WACC using the provided financial parameters and market conditions. This involves calculating the cost of equity using CAPM and then the after cost cost of debt then weighing them by their respective market values and in the capital structure. So to calculate Netflix WACCC I needed to determine the risk-free rate the market risk premium Netflix equity beta Netflix corporate tax rate Netflix current share price number of outstanding shares current market value of Netflix total debt and the cost of debt. So I put all of those values into a code cell and then I calculated the cost of equity which was 0.1 using the CAPM formula and then I calculated the after tax cost of debt which was 0.0474 474 using the provided cost of debt and corporate tax rate. And then I calculated the market value of equity which was $198 trillion by multiplying the current share price by the number of outstanding shares. And then I calculated the total market value of capital by summing the calculated market value of equity and the defined market value of debt which was 213 trillion. And the next step is to calculate the weight of equity and the weight of debt by dividing the respective market values by the total market value of capital. And for that weight of equity, I got 0.9296 and weight of debt, I got 0.704. And then I calculated the WACC using the formula of weight of equity time cost of equity plus weight of debt time cost of debt after tax. And I got the answer as 0.0963. So now I decided to calculate that with additional debt. So I applied the same formulas and I got the new market value of debt as 18 trillion. The new weight of equity as 0.9167 the new weight of debt as 0.0833 and the new WACC after the 3 billion additional debt is 0.0956. Then I discussed the concept of project specific WACC for US versus international content and explained why it might differ from firmwide WACCC and what factors could influence this con um this change. So basically pers I considered the cost concept of project specific WACC and it differs from the uh firmwide WACC and a project uh specific WACC tailor the cost of capital to the specific risk and financing characteristics of each individual project leading to more accurate investment decisions. And the reasons for differences is basically the market risk, uh, political risk, economic stability, regulatory environment, availability of local financing and capital markets, currency risk, and legal and contractual risks. And the specific factors influencing these decisions for US content uh projects is the lower political and economic risk, developed capital markets, standardized regulatory environments, and mature market dynamics. And for international content projects is the higher country risk premium, foreign exchange risk for fragmented capital markets, local content quotas and censorship, cultural specificity and audience preferences and tax regulations. And then I considered project specific WACC can improve investment decisions and by using that Netflix by using project specific WACC Netflix can make more informed and value maximizing investment decisions. And this will allow the company to accurately assess project viability, optimize capital allocation, improve strategic planning and enhance accountability and using project specific WACC provides a more granular and precise tool for capital budgeting ensuring that Netflix invests wisely across its diverse portfolio of content initiatives globally. And then I compared the WACC of Netflix to its industry peers and I got the answers as Disney's WACC as 0.082 082 and Amazon's as 0.095. So when I compare this with and after my analysis, my recommendation is that Netflix should aim to finance a substantial portion if not all of the 5 billion content investment through new debt issuance. The precise amount should be determined by a detailed analysis of potential credit rating impacts and the market's appetite for Netflix debt. And it's crucial to monitor the impact on credit ratings and debt covenants to ensure financial flexibility is maintained. This approach leverages the lower after tax cost of debt to reduce the company's overall WCC thereby increasing firm value and pro improving the attractiveness of future content investments which carefully manages financial risk. And this is the best uh strategy because it directly addresses the slightly elevated WACCC compared to its peers and capitalizes on the benefits of financial leverage shown in our calculation without immediately pushing Netflix into unmanageable financial risk profile. And the goal of this is to move Netflix closer to its optimal data structure optimal capital structure where the benefits of cheaper debt are maximized without incurring excessive cost of financial distress. Thank you. So that is my analysis and thank you.",
  "video_url": "https://youtu.be/NsyuxfyOKRU"
}