{
  "student_name": "Caleb Brunton",
  "org_defined_id": "034423095",
  "username": "cbrunton",
  "video_url": "https://www.youtube.com/watch?v=DOcw7R3qkok",
  "transcript": "This is my video submission for session 11. Um, today I'll be walking through a one-year capital allocation analysis for Apple. Um, we evaluate a proposed $90 billion buyback and four alternative uses of the same cash, a special dividend, a strategic AI/VR acquisition, debt reduction, and expanded R&D. I'll show the baseline snapshot, the scenario math, stakeholder outcomes, the visual checks, and then my recommendation. Um starting with define um the objective here is to determine whether Apple's proposed $90 billion repurchase creates long-term shareholder value relative to alternative uses of cash. We measure value by EPS ownership concentration leverage net debt and stakeholder impact. The scope is one is a one-year analysis using only the assignment inputs. Um share prices held a constant $185 unless they otherwise buybacks execute evenly across the year. um everything here and everything here is parameterized so assumptions can be changed you know later in the case that you need to but um moving on to discover to look at kind of the baseline that we're dealing with uh share price $185 shares outstanding is 15.5 billion equity market value is 2867 billion total debt is 110 billion cash investments is 165 billion net debt 0 billion um annual free cash was 100 billion assumed net income is 120 billion and then the baseline EPS was 7.74 per share the key stakeholders were burkshire halfway at 6% CEO at 0194% typical retail investor was uh very small employ and then um employee options was $170 strike and then intrinsic value of $15. So this is our starting point for and this is what we start for start with here for this uh assignment. But moving on to represent the plan here is to build a unified parameterized model to compute for each scenario um new share account EPS after the action net debt um leverage ratio and stakeholder percentage changes um there's a lot of different scenarios buyback uh $6 special dividend acquisition u debt reduction and R&D investment and then from there we we then compare results in a stakeholder outcome table and and produce two sensitivity charge for buybacks, EPS versus buyback size and leverage versus buyback size. But that kind of sets up the code in the plan running the code. You can see the outputs down here organized neatly. So looking at the uh output here I can see the repurchase math and result um we retire shares equal to buyback amount divided by share price. So that's about um $90 billion divided by um 185 that reduces shares standing from 15.5 billion to 15.01 billion. Um so here in the output you can see the cash used is um 90 billion. The ending cash is 75 uh billion. Ending debt is uh 110 billion. Net debt is uh 35 billion. And then shares outstanding is 58.01 billion. EPS under scenario is $7.99 per share. And then the equity market value using that $185 price is 2777.5 billion. That makes our our leverage ratio about 3.81%. And as a note um that's funded with cash only. EPS increases mechanic bid because you know because the denominator which would be that number of shares is is with falling. Um but looking at the uh other table here you can see is a uh consolidated stakeholder outcome table across all five capital uses um looking all the headline headline numbers here. Looking at EPS before and then EPS after. The baseline is 7.74 before and then 7.74 after. Buyback 7.74 and then to and moves to 7.99. The dividend is 7.74 doesn't move at all. Goes to 7.74. Acquisition is 7.74 and then 821 which is an increase of 6%. uh debt reduction is $7.74 and then moves up to 793 and then R&D investment is 774 and then down to 194 because the $90 billion is expensed in year one. So when it comes to ownership buybacks slightly raise per shares percent uh from six from 6% to 6.19% and other scenarios keep ownership shares shares stable. Now net debt and no for net debt and leverage scenarios that spend cash without paying down debt or buyback dividend acquisition R&D push net debt positive rough roughly 35 to$ 38 billion debt reduction is the outlier leverage drops from 3.69% to point uh 69% and then interest savings about interest savings of about um3.6 billion dollar shows up and these are uh directional outcomes and all economic all match economic intuition and and kind of all pass the sanity checks that I developed to kind of double check the kind of work I did but looking specifically at these charts the bar chart uh we use I use this bar chart to show which scenario gives the highest EPS acquisition tops out assuming ROIC equals 8% um buyback back in debt reduction give moderate EPS lifts dividend is neutral and R&D plummet is shortterm looking at the the sensitivity chart this line shows EPS versus buyback size from $0 to20 billion you can see here that EPS rises smoothly and predictably um with no model instability but looking at the uh this other sensitivity chart this chart this chart shows leverage increasing as buyback size grows u which kind of tells an important story that incremental EPS gains um come with incremental leverage increases and lower cash buffers. Um but that's what I have here for the implement section. Moving to validate um I I I validated the model that I built by checking a v a variety of things I did in the arithmetic um and in some of the story logic. The market cap is um $185 times 15.5 billion which was 2867.5 7 01 billion buyback math yield shares of 15.01 billion EPS is 799 uh 799 net debt is 35 billion which is all consistent with the math sens sensitivity charts show um behavior that makes sense and no negative shares or impossible leverage uh values appear. So the model does seem numerically stable with the context that we're dealing with and tells coherent kind of mathematical story. Um and that's what also some AI models that I used indicated to me as I was kind of testing and and validating some of the work I did. Um but moving on to evolve. Um there's some key sensitivity notes here um that that are kind of important. Buyback size. Specifically when it comes to buyback size, larger buybacks increase EPS but also increase leverage and reduce liquidity at very large sizes gains are mechanical not transformational. Um the uh acquisition ROIC um specifically acquisition only beats other options if ROIC is meaningfully above cost of capital. If it drops from 8% to 5% or lower, if it drops from 8% or to 5% or lower, um acquisition become be can become uh value destructive in this kind of context. Um and then looking at um R&D, uh it looks terrible in year one for EPS, but if long-term uplift is sizable, say 8 to 10%, it can dominate over time. Short run EPS under understates R&D value. So the best choice kind of depends on the perspective of the board at the time and kind of the the horizon of the company and where it's at at the time and risk appetite specifically of the board. So there's a lot of different personal contextes contexts that can change the situation. But lastly moving on to reflect. Um this whole assignment kind of showed me that capital allocation is about trade-offs. Numbers alone don't really pick a single right answer which makes sense and it's consistent with some of the previous assignments that we've done in this class and it's something I've learned every more every single assignment uh buybacks mechanically boost EPS and reward continuing shareholders but reduce liquidity and raise leverage shifting risk towards um bond holders which does make sense something I never really thought about but it does make sense kind of in retrospect um something else I also thought about is R&D strategically attractive for long-term growth but kills near-term DPS, which makes sense, but I think if I was in that position, I think R&D would be more valuable to me if I was on the board in this kind of situation. But for this specific situation, my recommendation based on on all the information would be a risk for the my recommendation for a kind of risk aware board specifically would be to prioritize debt reduction as the most um as the kind of best option, the most robust risk adjusted option using billion dollar today. Um, unless management can demonstrate a high confidence acquisition with an ROIC or a long-term R&D plan with well- definfined multi-year returns, buybacks are attractive to shareholders but should be conservatively should be sized conservatively given the liquidity trade-offs. But this uh assignment as I mean as all the other assignments give me a lot more insight on some of these really in-depth decisions that some of these board members have to make um regarding how to spend their money and what exactly to be invested in."
}