{
  "student_name": "Ethan Mendonca",
  "org_defined_id": "037327547",
  "username": "emendon",
  "email": "",
  "transcript": "Hello, my name is Ethan Mendonsa and this is the uh session 10 assignment for the uh management 31000 class. So for the first uh for the driver analysis, the first discover I make sure to write the goal and essentially to frame the problem identify all the necessary financial components. And to do this I ask the AI to act as a senior corporate financial analysis and tell him what the the main the assignment overview essentially which is the initial investment, the working capital, revenues, all of that stuff. And before I write any of the code and build the spreadsheet, I really wanted to calculate the the year zero. What two items must be calculated? The years 1 to 10, which is the operating cash flows, as well as the year 10 terminal cash flow. And so here it gives me the initial problem statement, the outline for the discover part. So essentially year zero is the initial overlay. And so the main two the main components of cash outflows will be net capital expenditure, capex. This is $12 million for the rosary itself and you know I need to confirm all of the depreciation basis of the assets as well as all the side cost such as shipping, installation and site preparation. Initially I also need to calculate the initial investment in networking capital as a grocery cannot operate without obviously a stock of inventory such as beans, cups, tables, shares obviously registers, cash and this initial investment is the increase in current assets like in inventory and receivables minus the increase in current liabilities like accounts payable required to get the project running. Hence the total cash flow in year 0 is the sum of these two flows. Next in year 1 to 10 the operating cash flows is equal to the earnings before interest and taxes times 1 minus the interest rate plus depreciation. This is also known as notepad. To calculate this um the incremental line items that are required for each of the 10 years are the revenues which is the new sales generated only by the rosary and then the oper operation costs which include the cost of good goods sold and the selling general and ad administrative costs. These costs include labor, utilities, uh property taxes and so on. Additionally um the depreciation of all the groceries itself as well as taxes as well as a depreciation amount which is never real cash flow. One final critical component for the years 1 to 10, you you must also project the annual change in N the net the NWC which is the uh so on so forth as well as uh the additional investment in NWC the cash outflow for that year. Next for year 10 the terminal nonoperating cash flow in the final year the total cash flow is the sum of year 10 OCF plus the terminal cash flow the terminal terminal non-operating portion you asked about is composed of the three distinct items which is the salvage value the tax on sale asset this is the tax effect from the sale and recapture of the net working capital and this will help us to outline essentially the problem statement for our for our um for the assignment. Next is the represent and essentially here I want to represent my the code in a timeline. So the main prompt for this is you know I want to create a representation and the cash flow structure for the 10-year timeline. So the year zero, year 1 to 10, year 10 which is a terminal and also ask it so does this representation currently ma map all the varying cash flow depreciation tax fields and terminal value components needed for an accurate net present value analysis using an 8 8.5% WACCC and so obviously it answers my question where my logic is correcting what are the missing components so the main corrects of my logic is year zero the OCF formula the terminal value formula and the year 10 flow. However, the main problem that I currently have is that the annual and MWC changes of years 1 to 9. My current plan shows a working capital outflow in year zero and a working capital inflow and recovery in year 10. However, the problem is as revenues grow, the roaster must invest more cash into NWC to support those higher sales. Hence, the free cash flow is equal to the OCF minus the change in NWC. This helps me create a more a more um corrected cash flow timeline. As we can see, year zero is the same, year 10 is the same. However, year 1 to 9 is a new formula which is the FCF equals OCF minus NWC. And so later on I asked it to help me to create the the capital budgeting model. However, I did have some problems in essentially running the code as for some reason I was getting a lot of attribute errors in terms of um the uh the numpy as MP the uh numpy. Financial as it was no longer needed as it's actually already considered in the numpy um uh library. And so here we can see the the code. So in the implement stage essentially we're calculating the FCF, NPB, IR, payback and PI values. Run the sensitivity analysis and generate all of the visualizations. So first is the key parameters obviously just laying them all out which is the all the initial investments the revenue schedule for year 0 to 10 the operating cost parameters. Next is the self-contained financial functions to remove dependency and this essentially we calculate the MPV IRR value. Um and next we do the core function which is our cash flow model. This is the main point in our assignment which is the cost of capital analysis. Create this cash flow um these uh cash flow um projects. And so here we first build the operating cash flow the OCF which includes revenue operating cost appreciation EBIT NOPAD operating cash flow and next we build the free cash flow which is important as as I said before the free cash flow is equal to OCF minus NWC hence the final free cash flow which is the bottom line as we can see it's equal to the operating cash flow plus so on so forth next is the helper function This helps to calculate the payback periods uh as well as the simple and discounted payback along with the core function which is calculate all of the metrics which are the MP all of the previous metrics MPV IRRa payback periods and so on. Next, this helps us visualize the function as we will see later on. And so this is the the main code. This helps to visualize all of the analysis and then the main and the story of the analysis. So it's better if we look at the data itself. So here obviously we're running the base calculation based on the WCC of 8.5%. And here you can see the revenues, the cost of goods sold, labor, rent, utilities and market depreciation for all the years as well as all of these EBIT EBIT values taxes as well as the investment outlay and the free cash flow. So here we can see the base the base case key metrics which is obviously 2.2,698,000 IR value of 12.84% the payback period of 5.28 discounted payback period of 8.21 profitability index of 1.215 here we can see the running sensitivity analysis. So scenario A revenue reduced by 20% the new MPV changes and the new IR changes. Scenario where the WACCC value is increased or decreased by 2%. Here we can see an a very big increase in the MPV values almost a 50% decrease if 10.5% if it's plus two and a two times increase if it's minus two. And so here the executive recommendation is to accept the project as the project is expected to create a shareholder value with a positive net present value of of so and so forth and the IR of 12.84% obviously exceeds WCC value of 8.5%. And the PI of 1.215 is obviously greater than one. However, the key risks is the project is highly sensitive to revenue as a 20% revenue reduction makes the project value destructive where the NPC val MPV value uh goes negative as we can see here in this scenario. However, the project's positive MPV is a robust 2% WCC increase still yielding and a profit. So here obviously we can see the initial year zero of the of the um 12.5 million initial investment. However, over time as the years go go on there is a constant revenue uh a free cash flow increase which will at the end pay off all of this debt. Here is the chart for the sensitivity to WCC values essentially showcasing these three values. And as we can see as the WC the weighted average cost of capital increases the net present value decreases. And so what does this mean in terms of the rest of the driver analysis right? So here in my validate section and the main goal here is to check obvious obviously to check the results and here it helps me to check and ask to check the results and how reasonable the inputs are. And it goes on to say that it the project is obviously financial acceptable but of high risk which we have discussed as if the revenue decreases by 20% that just completely destroys the NPV values and the most critical assumptions uh to challenge is obviously the evidence whether the 20% drop will be there how high is the operating leverage the operating fixed costs will they increase in the future? future the salvage value if in case things don't work out is it still be able to make a profit also a lot of extra checks are needed such as the revenue break even analysis fixed cost sensitivity salvage salvage value sensitivity combined stress test and so to evolve this this uh project analysis to broader to a broader like sort of definition it's really important to um really fit into the bar capital allocated the strategy. And so it's really important to think of Starbucks investments as three buggers which is the core business, the technology which is growth and efficiency as well as the strategic and brand uh the roster. And it's really important to adapt the financial framework. So for example, for a standard for roll out real estate, it would be like this. For a technology project, it would be like this. And so hence before I even do the analysis, I really need to essentially outline what is the type of analysis that I'm doing. Is it for a real estate type of uh project? Is that what the project is? Is the project more technology based such as new apps such as a new type of coffee roaster, a new type of business model or is it a you know or is it a strategic and brand sort of um project and that also changes as different as for example changing the logo of a brand can completely change how uh the brand is viewed. And so in my reflection, I think the biggest problem is you obviously understanding the difference between MPV versus brand strategy as well as the the importance of systematic modeling. This is because the back of the envelope analysis that I've been doing can be dangerously misleading as it doesn't accurately provide me a good picture of value creation. The depreciation tax yield, you know, obviously the project had 1.2 2 million in annual depreciation at 25% tax rate and all of this is good. However, it really ultimately the process shows that the value isn't just revenue minus costs. Obviously, it's never that values created by the complex system of cash flows, operating cash flows. uh and only by systematically modeling all the impacts of the taxes, the operation cash flows, the brand image, the grocery uh depreciation, can we get a really true picture of the value and this really combines this driver framework together. Thank you.",
  "video_url": "https://youtu.be/9BErBxrlzUk"
}