{
  "student_name": "Emily Snyder",
  "org_defined_id": "034555036",
  "username": "snyde325",
  "email": "",
  "transcript": "Snider and this is my um assignment for the week. So to start off I put everything in Gemini for it to create a Python code that answers the assignment. Use the kiss pencil and driver method to make it super easy to understand and teach to someone with little financial knowledge. So I did that and I got the Python code and we will just dive right into our session 9 assignment. But our goal is to calculate Netflix's weighted average of capital. So the WAC and visualize its change as leverage increases so as debt increases. And the WACC is the average cost of all this money weighted by how much of each source the company uses. It's the minimum return a company must earn on new projects to satisfy all its investors, both the stockholders and bond holders. And to calculate it on the WAC, you'll do the weighted a the weighted the weight of equity times the cost of equity plus the weight of debt time cost of debt time 1 minus the tax rate. And then the cost of debt um the R with the subscript of D. So that is the after tax cost of borrowing. So debt is cheaper because the interest paid is tax deductive creating a tax shield and the after tax the r subscript d equals r subscript d * 1 - t and then the tax shield is interest payments um that reduce taxes lowering effective debt cost. And then also um why minus tax rate? Um we use this for debt because interest payments are taxdeductible making tax technically cheaper. Um here's just the WACCC formula. It just shows that we use the market value of equity, market value of debt, um cost of equity, pre-tax, cost of debt, corporate tax rate, um and those components as well. And then um the blend of all sources of capital is the WAC and it's the company's money as coming from two places. So it'll come from equity and debt. And then equity is the money from investors who buy it stock. So it's stockholders and then the debt is money from lenders that it has to pay back. So that's the bond holders. Each source has a cost. So the cost of equity is the return stockholders expect and the cost of debt is the interest it pays to lenders. Just like break down the formula a little bit more. Okay. So our data is basically from this assignment. Well, it is from this assignment um in the book. So equity values would be the market value of equity which is E is $200 billion. Equity beta is 1.3. debt values. So the market value of debt is 13 billion while the cost of debt is 5.8% for the bond yield and then market values which is the risk-free rate is 4.5% the market risk premium is 5.5% and then our other is the corporate tax rate at 21% and that is all over here. Um our plan for this is to create variables for all the numbers above. Um create a function to calculate the cost of equity using um CAPM. Create a main function to calculate WAC WACC and then calculate the new WACC after um $3 billion in debt and then run sensitivity analysis by calculating WACC for debt levels between zero and hundred billion and then plot the results. So going forward, like I said, I use Gemini to ask me for the code and then it came out with this first one which is up here and we can dive more into this. So as you can see it just like calculates everything and also the second one I put it into Gemini again to um give me another Python code but it has the um sensitivity plot. So, I'm going to be going off this one because it's the same thing. Um, so starting off is I made sure it defined its um functions using the kiss principle. So, we would calculate the cost of equity. I'll actually make this um a little bit bigger for you to see everything and me to see everything as well. Okay, so cost of equity. So, we're like I said, we're going to be using the risk-free rate beta market risk premium. Um, and the function will be the risk-free rate plus beta time market risk premium. And then it will turn that value. And then we're going to calculate the weighted average cost of capital. So, the wcc and that's going to take our total values and weights which is over here. Um, so the value of equity and debt and then the weighted equity and the weighted debt um which be right here. and it's going to put that all together in one formula. And we went over the formula a little bit earlier. Next, it's going to um use our our assignment data, the ones that I just mentioned above in the represent function, represent section of our driver method. So the market conditions, our parameters with the equity current and our current debt beta, um tax, um and uh cost of debt as well, and then um we're going to solve for our calculated cost of equity. Um, this is like the variables it uses. The risk-f free rate, beta, market risk, premium, um, the WACC for the current. These are all the var variables we just went over. And it's going to calculate the WACC after $3 billion additional debt in um, issuance. Um, so it's going to use the new debt and then the current debt plus three, the new WACC. It's going to use all these variables like we just talked about. And then we're going to make our sensitivity analysis and make a visual um part as well graph. So it's going to define our ranges. So 0 to 100 billion and then um it's going to loop for each debt level and then we're going to generate the plot and plot our data um add markers for current and new WAC WACC and it's going to plot everything. So, here are my results. I got um the cost of equity being 11.665% and the current WACCC being 11.22% and then the new WACC after $3 billion in debt is 11.13%. So, going on to our sensitivity plot um analysis. So this is the WACC versus the debt leverage. So this visualizes how Netflix's overall cost of funding, so the WACC changes as the amount of debt the company holds increases. So I have this little chart over here with like the different components. So the X axis is our total debt in billions and this just represents the leverage or debt in Netflix's capital structure. The y ais is the wacc in percent and this represents the cost of capital um which is like the hurdle rate for the new investments. Um the red line is downward sloping. So this just shows the calculated wacc for each level of debt. Um the blue dashed line in this t is the current wacc at um 11.22% which we just um calculated up here. and it shows the current fixed hurdle rate Netflix is operating under. So why does this WACCC decrease? So um decrease in WACCC as debt is added is due to the powerful effect of the debt tax shield. So debt is cheaper than equity. So the cost of debt being 5.8% is lower than the cost of equity at 11.65%. So by replacing expensive equity with cheaper debt, the average cost just will fall naturally. And then the tax shield. So interest payments on debt are taxdeductible, meaning they reduce the company's taxable income. So this deduction is the tax shield. And the after tax cost of debt is 5.8% times 1 minus 0.21 21 and which is about 4.58% for the tax shield deduction. Oh, sorry for the after tax cost of debt. Um, also this is also just because Netflix is utilizing more of their lowcost tax shield funding source and its overall WACC me um mechanically just declines in general. Okay, so oh sorry I also forgot to run the code but I swear it works. I'll show you. Okay. Yeah, here it ran. Same output. I just wanted to show you that it ran. Um, so this chart just provides um just strong evidence for also recommending a capital structure strategy. So the current position Netflix sits relatively high on the curve. So low debt and high WA WACC. My recommendation is like since the line continues to slope downward, Netflix should consider increasing its debt load. So this action would shift the company further to the right on the X axis. Lowering its WACC moving down the Y ais and a lower WACCC makes more investment projects profitable thus increasing shareholder value. Um some limitations of this plot is a simplification be of like cuz I used the kiss principle um because it assumes that the cost of equity and the cost of debt remains constant but in the real world Netflix adds too much debt. So as risk increases the chance of bankrupt bankruptcy increases and then as um costs rise lenders will demand a higher interest rate. So your um cost of debt will go up and shareholders will rem will demand a higher return. So the cost of equity goes up as well. Then in a more advanced model, the line would probably eventually curve upward indicating the cost of financial distress um outweighs the tax shield benefit. So the optimal capital structure is the point at the bottom of the curve and the lowest possible WCC. And then my chart just suggests Netflix has not reached the bottom point yet. So um does this all make sense in the end? Yes. Um so by adding $3 billion in debt, the WACC decreased slightly from 11.22% to 11.13%. This is because we were adding more of a cheaper source of financing, so debt, which benefits from the tax shield. And then the general plot just shows a red line sloping downward as debt increases. Um this just confirms um adding more tax advantaged debt lowers the company's overall weighted average cost of capital. And then um evolving. So my code just uses a from YWACC. Um but what if there was an international context? So the project is riskier than the average Netflix project. um we could use like a higher beta so 1.5 instead of 1.3 in the calculated cost of equity function so this will result in a higher WACCC which will become the hurdle rate that the project must beat and then comparing to Disney so Disney's WACC is 8.2% which is much lower than Netflix's 11.22% 22%. Um, why my code just shows the inputs and it's likely due to different different capital structure. So, Disney just uses more debt, so 30% than Netflix, which is approximately um 6.1%. There's also different risks involved. So, Disney is likely seen as a less risky company. So, it probably has a lower beta and a lower cost of debt and a better bonding rate. And then also my code shows that that adding some debt lowers the WACC and suggest Netflix's optimal strategy might be to increase its debt load moving it closer to peers like Disney. And then like I said um the firm's 11.22% WACC is appropriate for projects with average risk. So for a riskier project like untested international content, a higher beta such as like 1.5 should be substituted in CAPM formula resulting in a higher project specific WACC hurdle rate. Um also for like a safer project like renewing US content a lower beta might be more appropriate. And then again comparing to Disney. So Disney's is 8.2% 2% of for the WACC which is lower than Netflix is at 11.22 um difference is explained through risk profile. So Disney lower beta um than Netflix because they're more diverse and less volatile capital structure. Disney uses more leverage so 30% debt while Netflix is 6.1% debt taking greater advantage of the tax shield. Um and then based on results, Netflix is underleveraged. The WACCC decrease when adding debt and the sensitiv sensitivity plot um will continue downward. And then the optimal strategy is to increase the debt like I said before towards the industry average or Disney's level to further lower the WACCC and maximize firm volume. um stopping only when the risk of financial distress or the bankruptcy costs outweigh the tax shield benefit. And then lastly, reflecting. So we just translated the academic formulas from the WACC and the CAPM into simple reasonable Python functions which we use throughout the code. And then we learned that the WACC is just a set of building blocks that uses cost of equity, cost of debt, and their weights. Um we can now change any variable like the tax rate or the beta and instantly see its impact on the company's cost of capital. And then this anal analysts um analysis sorry reveals that Netflix's cost of capital is highly dependent on the equity risk beta being 1.3 and its conservative capital structure which is low debt usage. And then the calculated WACCC of 11.22% 22% serves as the essential hurdle rate for its $5 billion content investment. And then by strategically increasing debt, Netflix can reduce its WACC, making more projects, value creating, and improving its competitive standing relative to Disney and its other com um peers as well. But thank you for listening. That was my session nine assignment.",
  "video_url": "https://youtu.be/ketmmjhsCtA"
}