{
  "student_name": "Ramon Randolph",
  "org_defined_id": "036002798",
  "username": "randol15",
  "email": "",
  "transcript": "All right, for today's assignment, we were supposed to calculate the weighted average cost of capital for Netflix and determine whether their investment of 5 billion was a good idea or and whether they should take uh 3 billion more in debt. Um, so all of the weighted average cost of capital is is for is how much our debt is for our equity like debt over equity. That's the matrix and it's just how much it costs for us to get one more dollar of investment funds for the company. So essentially how good that ratio is. Um so we started with the driver framework and so our core decision is to evaluate Netflix whack weighted average cost capital and assess how that 3 billion in new debt affects the financing strategy for the 5 billion investment. Our key questions are what what is the current what is the current whack? What's Netflix what's Netflix's whack after adding that 3 billion? Should Netflix use project specific whack for domestic versus international content? How does Netflix compare to Disney and the media industry for that percentage? And then what capital structure minimizes Slack without raising excessively. So the data we already have is our market cap of 200 billion, our debt value of 13 billion, our beta of 1.3, our risk-free rate 4 4.5% that's the bond rate. uh market rate 5.5% pre-tax debt is 5.8 tax rate is 21%. Um so for the represent section of this of this uh driver framework we have all of our necessary uh inputs to calculate whack. Um and so for the cost of equity that be our risk-f free rate plus our beta times the market risk premium. So that's 11.65 cost of debt is the bond rating from the better beers better business bureau uh times our yield. So that's our after tax after tax plus of debt and that's the uh yield times 1 minus the tax rate. So our that is um 4.58%. Capital structure uh we have 200 billion in equity 13 billion in debt and so the weighted average of equity is 93.9% weighted average of debt 6.1%. and host that 3 billion debt. The weighted average of debt is 7.4% weighted average of equity is 92.6%. And our international project risk premium is 2%. So for our implement section of this code, we have our code. We have our code right here. Um, so like I said before, we have our rates and we're just going through the implement section. Um, calculating the current equity and the post equity cost of equity and that current and post debt. Um, and this is our cost of debt after. Um, so the current whack is the value of equity and debt. current um value of equity and debt current. So equity current times or weight of equity current times equity current and weight of debt current times debt uh after and then we have uh the weight for this whack post. You have the weight of equity current times or weight of equity post times debt post equity post and then the weight of debt post times debt after um and so for the current whack we have 11.2% 11.22% um the post equity we have 11 the postwack we have 11.13%. the US project to whack is 11 22%. And uh the international project is 13.22%. And down here we have those as graphs. So here's the current whack versus our post and here's US versus international. And this is just a graph of whack over the debt ratio. So right about now we're current we're sitting around right here and after we'd be sitting around here. So that's our implement stage. Um and after that we go into the verify. So to verify this I just uh analyzed it against the data that we were given for our other uh companies. So for Disney and for Amazon and so the what we see from the analysis is that the effect of the debt on the weighted average cost is marginal. So since Netflix is so equity heavy, the debt or the whack barely drops uh and so that means that we can do a lot more with debt financing and so we're probably underleveraged in this uh circumstance uh as compared to Disney which has a significantly lower weighted average cost of capital and has a much more balanced uh capital structure. So Disney is 70% equity and 30% debt and is very diversified which allows them to uh have like less risk and therefore less weighted average cost of capital since their beta is lower. Um and for Amazon, Amazon is also within that average but is much lower than uh much lower than Netflix but it's higher than Disney's which means that they have a greater reliance on equity funding and it has a broader risk profile but even then compared to uh what we see at Netflix with that very high skew towards equity we need it means that we need to have a very different approach to our current market. Um so essentially what we need to do after that is our evolve stage. And so for the ideal uh ideal circumstances for Netflix, we definitely want to make sure going back to this first uh these first couple questions. We've answered these first two and now we're answering this third one. The problem that Netflix faces is that they use the same um they use the same risk factor for all of their for all of their investments. And so when we look at this the difference between these two uh these two investments we see that international content has a much higher risk and so we shouldn't be using the same uh we shouldn't be using the same data to calculate that which means that we need to use different ones for each of those. So the lower whack on the US market tells us that we're doing a much better job at capturing that market value and actually using our expertise than we are in the international market and it leads to us having a better valuation there and improving our stock price. But for that international market, we do need to have that extra bit of funding to actually make up for our potential losses. So for the reflect part, one thing that I noticed was that the beta did remain the same. And from what I understand, the 3 billion in that financing would raise the beta a little bit. Um, so it should be a little bit different, but assuming that beta does increase, that is a much more efficient financing tool for Netflix. um especially since the equity that they're using is so risky and it raises their uh whack so high. Having that debt would make it so much easier for them, especially since it's t tax deductible and you get those benefits. Um and international content should still use a premium adjusted rate due to country specific risk. Like I said, we're not capturing that outside market as well as we are our internal market. Um, and then the other risk that we face is going too heavy on debt financing. Um, so our ideal ratio would be somewhere around Disney which has a similar platform going through uh media and has a 7030 split. So that would be around the idea for Netflix. Um, thank you. I've hopeed you learned a little bit about average cost of capital for this.",
  "video_url": "https://youtu.be/TKhnLZwTINg?si=2degoBVobZ9Xwxsc"
}