{
  "student_name": "Kevin Sales",
  "org_defined_id": "033940131",
  "username": "kfsales",
  "video_url": "https://www.youtube.com/watch?v=S0kZbWneMks",
  "transcript": "All right. Hello everyone. My name is\nKevin Sales and today I'm demoing the AI\nfinancial negotiation and risk assistant\nI built entirely inside N. So this is a\nmockup. It's a functioning negotiation\nrisk and financial decision engine that\nanalyzes real scenarios, calculates\nexpected values, give recommendations,\nand logs everything for future\nimprovement. And this tool essentially\nexists to help real people make\nfinancial decisions. And that's the lens\nI'll show it through. So again, why did\nI build this? So every week people ask\nthe same questions. Should I take this\noffer or that one? Is this loan worth\nit? Is renting smarter than mine? How do\nI counter offer without sounding pushy?\nWhat's the risk here? Um, so I wanted a\nsystem that instantly breaks down risk,\nexpected value, upside, and downside for\nany decision. And not only that, I\nwanted practice. So I added automatic\nroleplay and Google Sheets logging to\ntrack my negotiation progress. So inside\nnit the system starts with a message\ntrigger. Every time I type something the\nAI agent uh processes it using a\ncarefully designed JS structure that\nforces it to calculate expected value\nrisk score risk level recommended action\nexplanation scenario classification\nmode. So this determines whether it's in\nan analysis mode or roleplay mode. And I\nthen pass the structured output through\na small layer uh JavaScript baser that\nensures that the AI output is valid and\nclean. And\nand I can go ahead and demonstrate that\nfor a second. So when I enter into my\ncode in JavaScript, you can see that\nexactly what I inputed. And what this\ncode essentially does is just ensure\nthat the um Google sheet is taking from\nthe AI agent and it's ensuring that\nthere's always an output when required\nand if there not an input it can\nautomatically detect that and pass it\nthrough. So\nonce I was able to set that up I was\nable to start practicing with real case\nscenarios. So, for example, here we have\none of my prepared questions\nwhere the AI is going to be working\nthrough to calculate the option A\nexpected value, the option B expected\nvalue, the upside difference, risk\nscore, risk level, recommended counter\noffer, and here's the key. Essentially,\nit's going to automatically be logged\ninto my Google sheet. So, I'm not just\ngetting a one-time answer. I'm building\nmy own database of negotiating scenarios\nover time. And as you can see once I\ninputed it and it went through and\nthrough the agent we can now go to my\nGoogle sheet. So here's the example that\nI recently just now put in. So here\nmarks the time stamp which is today the\n12th of um the 14th of December and it\nmarks a user question. It's going to\nmark an assistant answer. It's going to\noutput a risk score. It's going to\ndetermine the risk level. the\nrecommended action, rationale, scenario\ntype, mode, and the options and the\ndifference. So, quickly going through\nthis, we can see that this is the\nquestion. So, this is the question that\nwe inputed. So, I got $71,000 with no\nbonus versus $67,000 500 with a 12%\nbonus that historically pays 80%. So,\nwhich has the expected value? So, here's\nwhat the system outputed out. So offer A\nis guaranteed 71,000 salary, but option\nB has a base salary of 67,500\nwith a 12% bonus paid 80% of the time.\nAnd the expected bonus for offer B is\n67,500\nand you times that by the 12% and you\ntimes that by the um chances of um\nyou're getting it and you can see that\nit's 6,480.\nSo adding base offers B expected value\nis in total when combined with the bonus\nis actually 739 73,980.\nSo therefore offer B has a higher\nexpected value by 19 by 1,980. So again\nif you don't want to read through all\nthis you can quickly um go to the right\nside and you can actually see what uh\nwhat it recommended right off the bat.\nSo option B offers a higher expected\ntotal composition and you can quickly\ntake a look at the numbers here. Option\nA is 71,000. Option B total is at 73,000\nand it lets you know that the difference\nbetween those two numbers was 1,980. So\nthat's very useful when determining um\nwhen taking a job offer or comparing\npackages. So I can then also follow up\non this and I can continue this\nseamlessly by asking it to switch to\nroleplay mode. So, for example, here if\nI were to ask it to switch to roleplay\nmode and that it is is now my AI agent\nis now the HR manager and it needs to\nrespond to my contra offer of 73,000.\nSo, let's go ahead and input that in.\nAnd the system automatically will change\ninto roleplay mode and it's going to\nkeep track of my previous analysis. And\nnow it's going to be behaving like a HR\nmanager. And essentially, this shows\nthat the assistant understands context\nmodes and conversation flow. And it's\nnot just a calculator. So, as you can\nsee when we go back to the sheet, so\nit's switching to roleplay mode, and it\nsays here, for example, is the assistant\nanswer. So,\nand this is responding to our counter\noffer of 72,000. And it's going to say,\"Thank you for the counter offer of\n72,000. We appreciate your interest in\nthe position of value and skills are\nbringing while our initial offer was at\n725. I will take this request to the\nhiring committee for consideration. We\nwant to ensure to find the best\ncompensation package that is fair and\ncompetitive and we'll get back to you as\nsoon as possible. In the meantime,\nplease let me know if you have any otherquestions or concerns.\" So, right off\nthe bat, you know, this this question is\nsomething that's typically asked by new\nhires or not new hires, but new um\nstudents seeking employment that they\nare to ask for a higher um salary and is\nexpected. So, as you can see, the risk\nscore was zero and the risk level is set\nto low. And it says recommended option.\nIt says wait for HR's response after\nsubmitting a reasonable counter offer.\nThe rationale counter offers close to\noriginal offer are often considered, but\nfinal approval depends on the budget and\ncompany policy.\nAnd as you see here, let you know that\nit's only um when looking at the bigger\npicture, you're only asking about $500\nmore. So, it makes sense why this was um\nrated as a low-level um ask. So, oops.\nSo, yeah, that's one just one of the\nmany things that my um AI agent could\ndo. So now we can also test a different\num financial example and we can test a\ndifferent financial domain just to show\nthat this AI is not a onetrick pony. So\nnow we're going to be switching over\nfrom um salary composation to actually\nrent compensation. This is this is the\nquestion that's going to be asked.\nShould I rent for $1,400 a month or buy\na $220,000\ncondo at 5.8% compare expected cost over\nfive years? So, let's go ahead and input\nthat out. And it's going to go ahead and\nchange back to an analysis mode. And\nit's going to essentially calculate the\n5-year rent cost, calculate um mortgage\ninterest plus taxes. It's going to\noutput expected values, assign the risk\nlevel, and it's going to give a\nrecommended uh financial action, and\neverything again gets logged back to the\nsheets. And essentially, now I'm\nbuilding a long-term data sheet that\nhelps me recognize patterns in good and\nbad housing um decisions. So now here we\ngo. Here's our question and here's what\nit here's what it told us to do. But if\nwe don't not trying to read all of this,\nwe can quickly go over to the rationale\nand say buying builds equity which\noffsets cost while renting is pure\nexpense. Mortgage interest adds cost but\nequity reduces net outflow making buying\nless expensive over five years.\nSo as you can see here, so here's the\nrecommended action. So if you plan to\nstay in the condo for at least 5 years\nand can afford the init initial cost,\nbuying is likely better financially.\nConsider personal factors like\nflexibility and matrix risks. And as you\ncan see here,\nit gives you the difference. So here's\nthe expected value if you were renting\nand here's actually the expected value\nif you were buying the condo. And you\ncan see there's actually a significant\ndifference here of $25,140.\nSo, an individual thinks they're saving\nmoney by renting could actually be\nswayed to the other direction of buying\na condo as uh $25,140\nis not pocket change. So, that's just\nanother again useful trick that my AI\nagent could do. And now again, we're\ngoing to be testing this um we're going\nto be testing this in a different\nscenario. And in this scenario, we're\ngoing to be switching from renting to a\nlending scenario. So, I should ask,\nshould I take a 7.2% 2% car loan for 60\nmonths or a 9.1% loan with a 100 1,500\nrebate. So again, it's switching to\nanalysis mode. And again, this is going\nto calculate the total repayment. It's\ngoing to subtract the rebate from loan\nB. It's going to pair the expected value\nand it's going to flag down um it's\ngoing to flag downside risk and it's\ngoing to suggest the financially\ndominant option. And once again, it's\ngoing to log everything into my Google\nsheet. And essentially, this tool is\ngoing to be effective and it's going to\nreplace what people use Google search\nfor. And it actually gives people\nindividualized answers and not just\ngeneric ones.\nAnd now here we go. Here's what it what\nit responded to when we asked it, should\nI take a 7.2% car loan for 60 months or\na 9.1%\nloan for a with a 1500. So if we skip\nover here again, we look at the\nrecommended action. provide car price to\nanalyze fully generalize. Generally, if\nthe rebate value outweighs added\ninterest, choose 9.1%, otherwise choose\num 7.2%. So again, since we weren't able\nto provide enough information, it gave a\ngeneral answer, but we could always\nfollow this up with um specific numbers.\nBut as you can see here, there's just\nthis is again one of the main things\nthat my AI agent can do. We went from\ntalking about salary compensation to\nrenting, whether one should rent or buy\nand now we're deciding whether one\nshould take a loan and what different\ntype of loan they should be able to take\nor what they should be doing with um\ntheir scenarios. So here again we have\nanother different scenario and this is\nmore related to construction management\nas I am a construction management major.\nSo, I thought this tool would be very\nuseful for students like myself to um\njust help them with day-to-day basis.\nSo, now again, we're switching from car\nloans to um a bid scenario. So, this is\nmore construction management related and\nmore specific to my career. So, again,\nwe're going to place our default\nquestion here. So, if I bid $480,000 on\na project, there's a 30% chance I lose\nmoney and a 10% chance of going over by\n50,000. Should I bid $500,000 instead?\nSo, okay, this is a very uh\nstraightforward question, but again,\nwe're going to let the AI agent do the\nthinking here, and it's going to\nestimate expected profit. It's going to\nadjust for u probability, weighted risk.\nIt's going to highlight worst case\nscenario outcomes, recommend a bid\nstrategy, and it's going to again log\nthe result as always. And like I\nmentioned before, this is extremely\nuseful in construction, contracting, and\nbusiness decision- making. So, now that\nthe answer has been um Oh.\nAll right. So,\nso here we go. We ran into\nwe ran into a code. And you know, this\nis something that's expected because um\nthis is something that expected because\nit is running through a variety of\ndifferent scenarios. But we're going to\ngo ahead and quickly factory or quickly\nu troubleshoot this and I'll be back.\nAll right, I figured out um what the\nissue was after stress testing it. I\num came to the conclusion that the code\nunfortunately could not\nread complex. So if you go back to my\ncode right here. So this is a quick site\ntrack. But as you can see the code\nunfortunately at the at the time before\nthat it would never return. It never\nalways returned one item and it wasn't\nable to handle complex questions like I\njust answered or I just handed it to it\nbecause usually I just give it simple\nquestions. It should I should I switch\nrole play and as soon as I gave it a\ncomplex question it um it bugged out.\nBut with the help of NA and NI, I was\nable to get this problem fixed. So\nagain, so let's retry that question\nagain. So if we\nand just to show you that I didn't\nmanually input it in. Here we go. So if\nI lose um $480,000,\nno, if I bid $480,000 on a project,\nthere's 30% chance I lose money and a\n10% chance of going over by 50,000.\nShould I bid 500 instead? So now when we\ninput it, we should get a response.\nAnd okay, here you go. And as you can\nsee here, it inputed a better response\nnow. So I got the machine working again\nor the AI working again. So again, we go\nthrough the quick answer recommended\naction. So, bid 480,000 if you accept a\nmoderate risk for a lower expected cost.\nBid 500,000 if you prefer to avoid risk\nand accept a slightly higher cost. So,\nthe 48,000 bid carries a 40% combined\nchance of loss or cost overrun, but\nsaves 9,000 in expected cost compared to\n500,000 which is risk-free. So, again,\nthis is another useful tool that\nconstruction managers students like\nmyself could utilize in the everyday\nworld. And overall, it's just a very\ndynamic and versatile tool that can be\nutilized. And it matters because it\nturns complicated emotional financial\nquestions into code structured\ndatadriven insight. And it works across\num a variety of different domains like I\nalready showcased salary negotiation,\nhousing decisions, loans, investments,\nand even further down like business bids\nand anything involving risk and expected\nvalue. And every run builds a permanent\nknowledge base via Google Sheets. And\nwhat I learned is essentially how to\ndesign an AI agent that allows output\nstructured um using any type of script.\nAnd I learned how to automate workflows\nwith NAT. I learned how to build\ninterpretable financial analysis. I\nlearned how to um ensure that AI output\nsafely and log and analyze real user\ndata. And I built something that people\nactually want to use. And most\nimportantly, I learned how to shape and\nnot theorize.\nSo this my AI financial negotiation risk\nassistant and a tool that helps real\npeople make better decisions with um\nconfidence. Thank you and I hope you\nenjoyed and I hope you found this veryuseful. Thank you."
}