{
  "student_name": "Anvitha Mandhadi",
  "org_defined_id": "036568738",
  "username": "amandhad",
  "email": "",
  "transcript": "In this walkthrough, I'm going to explain how I use the driver framework to calculate Netflix weighted average cost of capital aka whack. And we're going to analyze the impact of additional debt financing and evaluate project specific hurdle rates and build a whack sensitivity model. So as I scroll through the code, I will explain each major step, the reasoning behind this calculations and how the finance concepts connect to the Python implementation. So firstly we have define and discover of the drummer framework and here we're looking at the different parameters. So I start the define and discover stages by identifying all the financial inputs for the assignment. So we're given the risk-free rate of 4.5% the market rate premium of 5.5% the Netflix equity beta of 1.3 and the BBB plus debt yield of 5.8%. 8% and these allow us to calculate the cost of equity and the cost of debt. I also use the market value of equity at $200 billion and the market value of debt at three $13 billion. Using the market values is the correct approach for whack because market values reflect the investor expectations and the true opportunity cost of capital. So next we just to preface these input sets the foundation for building the capital structure and computing Netflix's current whack. Next we go into implement. So the functions that we're doing are capm cost of debt whack and hammada. And so here we have our functions. And so here I'm moving on to the implementing implement stage. And so I'm going to define the core financial functions using the simple kiss methodology. And so the function cost of equity or calculate cost of equity sorry uses the capital asset pricing model. So this is cap m. So this is where the cost of equity equals the risk-free rate plus beta times the market risk premium. The function calculate after tax cost of debt applies the tax yield and it multiplies the pre-tax cost of the debt by one minus tax rate. The function calculate whack which is right here. This calculates the after tax cost of debt and applies this to the tax shield multiplying the pre-tax cost by debt by one minus their tax rate. The function calculate whack uses the standard whack formula and this combines the weights of debt and the equity with the respective costs. And finally, we have the unlever beta. And this uses the hammada equation to remove the effect of leverage from the equity beta. And it also allows me to correctly leverage the beta after the Netflix Netflix increases its debt. So these functions form the backbone of quantitative analysis. So talking a little bit about the current whack calculation, I think in this section, I calculate Netflix's current whack. And so I start by computing the after tax cost of debt and the cost of equity using CAP M. And then I calculate the market value of weights for equity and debt based on Netflix's capital culture. With these inputs, I apply the WAC formula to determine Netflix's firmwide hurdle rate before issuing new debt. And so this gives me the baseline cost of capital that Netflix must exceed to generate value. And so next going to post issuance of whack. So this is the plus $3 billion of debt. And here's where I analyze the impact of the issuing of the $3 billion. Just take a second to orient myself and make sure that I'm on the right track. So here I'm doing all of the W calculations. Okay, perfect. Postitions of black. Yep. Right here. So here I analyze the impact of issuing $3 billion of new debt which increases the total debt from 13 billion to 16 billion. And so I update the capital structure weights, unlever the original beta and then relev it using the new debt to equity ratio. And this step is necessary in changing leverage effects the risk borne by equity holders. So for this relevered beta I calculate the new cost of equity and then I compute the updated whack. And this directly answers the question of how additional leverage affects Netflix's cost of capital. So in this case whack decreases slightly due to tax shield benefit of debt. Next we go ahead and just print the statements. And so here I clearly list display all of the key um excuse me there's a bug running around but essentially here I display all of the key results. First I print the current equity and debt weights, the cost of equity, the after tax cost of debt, the current whack and below that I print the updated capital structure, the relevered beta, the new cost of equity, the post issuance whack. And presenting the numbers in this way makes it easier to compare the two scenarios side by side and see how leverage influences both cost of equity and the overall cost of capital. So for this section, I go ahead and calculate project specific hurdle rates. So for US continental investments, I assume the project risk is similar to Netflix's core business. So I retain the original beta of 1.3. For international content, I assume a higher systematic risk because foreign markets have uncertaintity. There's currency fluctuations and regulatory differences as well. So I modeled this by increasing beta to 1.5. After applying CAPM to both of the betas, I compute the project specific whack for each category. And so this shows that Netflix should be should apply a higher hurdle rate for international content than domestic content which reflects the higher level of risk. Now talking about sensitivity. So this is the wax sensitivity to leverage. This is the sensitivity loop. So in this section we can see that whack this section creates the whack sensitivity analysis. So I vary the debt weight from 0% to 60% in increments of 5%. So for each capital structure I relever the beta compute a new cost of equity and calculate corresponding whack. So this allows us to see how cost of capital changes Netflix as changes as Netflix adjusts its leverage. And the results show that moderate leverage lowers whack due to the tax shield but excessive leverage pushes whack back up as equity risk expands. And so this satisfies the requirements to integrate finance and technology through a leverage sensitivity model. Now looking at our output, this is where we have our formatted table. So I format the sensitivity results into a clean table for easy interpretation. And this table can be moved into a PowerPoint slide or a report, but I thought this was a great way just for you to see how WAC behaves across different leverage levels. Um and so this is the end of the implementation portion of the analysis. So in general to conclude this code implements every required component of this assignment. We compute the current whack, the post issuance whack, the US and international project specific whack values, a full whack analysis, and it uses both CAPM model and the hammada equation. And so the key insight is that Netflix's current whack is higher than both Disney and Amazon. is because Netflix operates in a both concentrated and more volatile bis in a more volatile business with fewer diversification and benefits and things of that nature. So moderate leverage improves this back due to the tax shield, but excessive leverage raises the cost of equity significantly. So, my recommendation is for Netflix to use a balanced and moderate level of debt financing, especially when performing, especially when pursuing content investments with strong expected returns that maintains financial flexibility while still capturing the benefits of the tax shield. Thank you for listening.",
  "video_url": "https://www.youtube.com/watch?v=YIeAmUvbous"
}