{
  "student_name": "Michael Gjorseski",
  "org_defined_id": "036015839",
  "username": "mgjorses",
  "email": "",
  "transcript": "Hi there. So, this is my session 10 assignment. So, um for the session 10 assignment, the overview or the assignment overview is evaluating a hypothetical capital investment for Starbucks, a new rosary, uh and flagship store requiring a $12 million initial investment. Uh our analysis must employ the capital budgeting techniques including uh net present value or NPV internal rate of return IRR payback period and sensitivity analysis to determine project uh viability and provide an investment recommendation. Our parameters are the initial investment of $12 million which is used for the building the equipment and the training of the employees. Our project life of 10 years our location is a premium downtown location with high foot traffic. Our discount rate of Starbucks and our weighted average cost of capital is 8.5%. Our revenue projections are in year one $8 million which this is our ramp up period. Years 2 through five are $11 million annually. So each of those years and the years 6 through 10 is $9 million annually. This is when we hit our market saturation. This means that we're approved. We're kind of a um approved uh industry approved product. And yeah, and so our operating costs are cost of goods sold, which are 40% of the revenue, labor, which is 2.5 million annually, rent and utilities, which is 800,000 annually, marketing, which is $300,000 in year 1, and then $100,000 from year 2 through 10. Our additional assumptions are the terminal value of 3 million um corporate tax rate of 25%. Uh depreciation straight line over 10 years excuse me working capital requirement is 500,000 and there are all of our required analysis. So that was our define and discover. So moving on our represent we're going to uh implement a 10-year prooma cash flow model in Python and it also gave me one in Excel. So I'll show both those and they are they are the same. Uh we'll calculate the base case the capital budgeting. We'll calculate all the metrics using the 8.5 weighted average cost of capital. We'll conduct a comprehensive scenario uh and sensitivity analysis including the best, worse, and base cases. Uh our sensitivity and a break even revenue analysis. We'll show the key results to communicate the profit uh the project's profit and return profile. verify the accuracy and logic consistency of calculations and then evolve. So to start our implementing we built um a 10-year operating cash flow model. The calculation is uh um earning before uh uh interest and taxes equals revenue minus cost of goods sold minus labor minus rent minus marketing minus depreciation. So, kind of just your revenue minus all your expenses expenses before your um interest and before your taxes. And your operating uh free cash flows is um that number that we just found times 1 minus the tax rates tax rate plus depreciation. And then the depreciation tax yield is depreciation times the tax rate. So this um explicitly is included in the calculation. Um the 300,000 per year. So 1.2 * 25% is where you find it. And that number obviously changes when it moves to $100,000. Um, so here going out of this is what Excel gave me just straight through the years, revenue, EBIT, uh, FCFS, the terminal events, and then the project uh, total project cash flows. And then if you move over to Python, that shows that it runs. This just kind of gives me everything. It gives all our numbers. tax rate, WACC, project life, terminal values, labor cost, rent, utilities, um just kind of everything. And it makes the Python to do it all. Uh types out all the columns that we just showed, revenue, EBIT, all this stuff. And then it has a few extra lines, but yeah, this shows that it runs and all the numbers are consistent with the Excel that um Collab gave me. So, this is what we have to show that from the Python. and it has everything there kind of gives a good breakdown. It makes a very good table I would say for Python. I like the hash lines and everything. Yeah. So that's what it gave me. And then moving on from there, um this is this link is just the Google sheet that I just showed. And then the using the cash cash flow above and the 8.5 ACC. Um we calculated the metrics of the net present value is um I'm going to go through all these and then I'm going to show the calculations through Gemini. The net present value or the MPV is 2,816,74. So the rule is to accept the NPV if it's greater than zero. So this project is acceptable. We would accept it because it's greater than it's obviously 2.8 million over zero. Um the internal rate of return uh you would accept this if the IR is greater than WACC. So since 12.6 6 is greater than 8.5. This is acceptable. The payback period is 5.28 years. Um and then the discounted payback period is 8.19 years. The profitability index is 1.22. So the rule here is if the PI the profitability index is greater than one for every $1 invest invested, the project returns 1.1 or 1.1 $1.225 in present value. So that means you would it's acceptable. Um, so for every $1 you get $125 or 20 $123 in return. So then I'm going to go back before I move on and um show this through. So yeah, so this is where it um to find these numbers for the uh NPV, it found the present values first of all them which it calculated through this and then it summed up all the present values to get the total present values and then it subtracted it from the initial uh initial investment and it says here that the MPV equals the total present value of inflows minus the initial investment. So it's the 15.19 million minus the 12.5 million equals the 2.6 million. So that's where the NPV comes from. the internal rate of return um says it requires a financial calculator, but we just need to solve for R. So, it's a negative 12.5 million plus the um 1.2 million over. So, this is just kind of for the yearbyear. This shows the true annual percent. Um and that's where you get the 12.84, which is greater than our WACC. And then the payback period discounted uh add up all the cash flows by the year until we cover the cost. So this is showing after year five we are still $500,000 short. So in year six the project generates uh 1.8 million. So we take a fraction of that which gives us the extra.28 years. So the payback period is the 5 years that is needed and the plus 28 years that you need to cover the extra $500,000. The discounted payback period add up the present values from the calculation. Um at the end of year eight we're still $185,000 short. Uh so in year 9 we generate a discount uh value of 863,000. So the 185 divided by 863 is an extra 2 point or 0.21 years. So it's the 8 plus the 21 which is 8.21 years. And then the profitability index is the total uh total present value of future inflows divided by the initial investment um which is the 15.19 million from the the present value of future inflows divided by 12.5 which gives you the 1. It's here it says 1.225 or two 1.215 on the other one it says 1.225. So yeah and then that's where those all come from. And then moving on, here's our scenario analysis. Um, our worst case, best case is a 20, our worst case is a 20% decline in revenue. The best case is a 20 20% increased uh revenue increase. So, we find that the project is highly sensitive to a um a 20% drop in sales or uh highly sensitive revenue. A 20% uh drop in sales is not just bad. It's value destroying resulting in a negative MPV of 3.1 million. So, this table right here is what it was given to me. So the best case is 0% revenue modifier which results in a a net present value of 2.8 million which is what we talked about. The resulting IRRa is 2.6 or 12.6. The worst case if you if the revenue drops by 20% results in a net present value of negative uh $3 million resulting in IRRa internal uh return rate of 5% just over in the best case if the revenue increases by 20% the net present value is 8.7 million and the IRRa is 18.25. 25%. And then the WACCC sensitivity just checks to see how the base uh base case NPV changes if the discount rate is wrong. So the discount rate that we use the base is 8.5% the NPV is the 2 point 2 2.8 8 million that we tal about and then if if that drops by 2% to 6.5% then that present value uh raises to 4.1 million and then uh if it drops to 10 or if it increases to 10.5% so up 2% then the NPV um drops down to 1.6 6 million. So this project is minorly moderately sensitive to interest rate. Even if the WACCC rises by 200 point basis which is 2% to 10.5 the project remains uh financially viable with the positive net present value. And then to validate this uh the check the IR check discounting the base case cash flows at the calculated IRRa yields a net present value of 0% or 0 confirming the calculation is correct. uh break even check applying a negative 5.2 2 revenue modifier the model and discounting uh at 8.5 weight uh average cost of capital yields a net present value of zero confirming the break even point and then our logical check is just all of our metrics are pretty consistent NPV is greater than zero IR is greater than our weighted average cost of uh capital our PI is greater than one all the payback periods are calcul uh calculated correctly correctly as the discounted payback is greater than the undiscounted payback and then to evolve this um the Fina, we would accept the investment recommendation. The project is um financially viable and should be accepted. Uh the base case is robust, demonstrating a strong positive results uh across all key metrics. So we can just calculate all our metrics like we we can to evolve this. We can do what we did before and check other numbers to put them to just kind of put them in and see what would happen. Um but yeah, just looking at all our numbers, our value creation, the project uh generates a positive MPV of 2.8 million. The hurdle rate of uh of the IR of 12.6% exceeds the 8.5%. And the efficiency, the PI of 1.225 indicates a 22% uh 22.5% return in present value terms of every dollar invested. And yeah, just to reflect, the $12 million Rosary project is a strong strategic and financial investment. We recommend or I recommend that uh Starbucks management accepts the project based on all of the calculations that we shown throughout this presentation and throughout this video. So yeah, and uh in the end they made a good investment or they should make a good investment. They made a good uh they found a good investment to make and they should go into the business and do a financial and outreach. Starbucks should do their outbreak. So yeah, thank you very much.",
  "video_url": "https://app.screencastify.com/watch/924KIe0AucdLfcQtEoYi?checkOrg=6f011b1b-d4b6-4119-b7c9-d036b6594800"
}