{
  "student_name": "None None",
  "org_defined_id": "035845246",
  "username": "jyoungwo",
  "video_url": "",
  "transcript": "Hi everybody, my name is Jacob and today we're going to go through my mini project 3 where we're building an a advanced AI finance tool using the driver framework. Um I built a tool helping to go through asset allocation um in the case of like potentially buying a house in 5 years or looking at if you have enough money in a period of time, how much you're going to have to allocate into certain investment strategies in order to make enough money. So I built it in N8N using a workflow simulation just to kind of build it out and understand it just a little bit more. So it builds out and it showcases to you exactly what you need to allocate to each specific different detail in order to hit your initial investment goal and that total goal amount over that timeline. And I also on my second what go through actually built in a risk tolerance. So we're going to execute it. We're going to work through it. The first step actually which I built into it is an investment calculator form. So you type in each of your investable investments. So let's say you want to initially invest $10,000 and you want $100,000 in let's say 10 years and you can choose your risk tolerance. So the first time I went through I didn't really have this. I assumed it was moderate but as people are going to be differently allocating things. I built it out into three different strategies. Let's say we're going to be conservative. We don't really want to have a lot of risk with our money. You just click calculate investment plan and it runs it through. So, it's going to calculate your average annual returns. It's going to pull in your CPI rate from some external data analysis and then it's going to run through an AI model. It's going to code that out and then nearing the end, it's going to synthesize it out into a little bit of an easy way for anybody to look at it. So, we're just going to wait 1 second for it to come through. Shouldn't take very long. Perfect. And then it executes successfully right over here. And it breaks down everything in a pretty easy to understand manner. So you have your four input variables over here. Says you're going to need an average annual return of almost 26% to hit that goal in 10 years, which is pretty high. So it recommends an aggressive alternative asset strategy, hedge funds, private equity, venture capital, commodities, and real invest uh real estate investment. That's just simply because this is a pretty impossible investment strategy angle. Maybe if you said for 20 years, it would be a lot more possible. It recommends everything. And it also understands that this investment strategy and these things are not always how it works. So there's going to be differences in the world every single year. And you have to understand that maybe sometimes investments aren't going to work the way they chose. So I just ran it one more time. Going to showcase to you the difference in it and how it works a little bit differently. So we invested in a moderate strategy over a 25-year period of time just to see kind of how it's going to work out and showcase. Wait one second one more time just for it to pull out.\nYeah. And then right here it shows you only need a 9.65% annual return rate and you can balance that out with some stocks, some bonds and some real estate investments. Then also in this case keep some cash because cash is a good liquid investment. You can keep it for a long period of time. And then it just recommends everything pretty easily how it works. Um using some CPI inflation rate data. Um it just really provides a lot of information and detail of how you can invest to make sure you're making that investment goal at the end. That's all I have for this project. It was really interesting to work through using some AI and working through it. And that's all I have. So, thank you."
}