{
  "student_name": "Christine Shong",
  "org_defined_id": "036250202",
  "username": "shongc",
  "email": "",
  "transcript": "Hello, my name is Christine Chong, and this is my section 10 assignment. So first, we have the assignment overview. It is evaluate Starbucks' proposed flagship roastery that requires a $12 million upfront outlay and is expected to operate for 10 years. Use the firm's 8.5% walk as the hurdle rate to determine whether the project creates value and to recommend and accept or reject decisions supported by the driver documentation. And these are the following parameters, project parameters that have been listed for this assignment that are given to us. First, we have the initial investment of $12 million, which includes the building equipment training with a depreciated straight line for over 10 years, a working capital of $500,000 deployed at launch and recovered in year 10. Then we have revenues at $8 million in year 1, $11 million in years 2-5, and $9 million in years 6-10. Operating costs of cost of goods sold at 40% of revenue, labor at $2.5 million, rent and utilities at $0.8 million, and marketing at $0.3 million in year 1, then $0.1 million thereafter. Finally, we have taxes at 25% corporate rate, a terminal value of $3 million at end of year 10. Our goal is to focus our analysis on producing a transparent cash flow model, core capital budgeting metric sensitivity test, and an executive recommendation. So, to sum it up, Starbucks is considering a significant $12 million upfront investment for a project with a 10-year lifespan. My goal was to determine if this project creates value using the firm's 8 .5% WACC walk as a hurdle rate. I used the driver framework to guide my analysis from definition to final recommendation. And I'm going to hint at my code for a bit. In the lines, starting from run scenario, I began the define and discover stage. the critical inputs of um inputs um of the data that was given to us um which are like the initial investment working capital tax rate walk and terminal value and we already know this the years and so forth um in the loop through time and then down here calculating metrics we have the cash outflows of a 12 million initial investment plus a 500k in working capital and operation revenues fluctuate starting at 8 million peaking at 11 million and settling at 9 million and the hurdle is that we are discounting everything at 8.5 percent now to represent the stage i mapped this project as a timeline in python i represented this using a loop that iterates from year zero to year 10 in year zero we can see um um year zero it captures our immediate cash outflows while years one to ten i use conditional logic like an if else statement to handle the changing revenue and marketing costs over time then we have the terminal year which is crucially in year 10 i should we capture the release of working capital and the three million terminal value now going back to the implement stage this is basically the implement stage a helper function to calculate IRR since we are keeping it simple without installing we use standard approximation method suitable for this course um these are the sensitivity based cases um uh revenue reduced by 20 percent and walk plus two percent walk minus two percent sensitivity um so um i calculated the ebit and notepad net operating profit after tax for every single year i added back depreciation to arrive at true free cash flows finally i used a standard iterative approach to solve for irr and a summation loop for npv ensuring i didn't rely on complex external libraries that might break now once i'm running this code it shows me a lot of data um in the validate stage i ran the base case in the mpv the project yields a positive mpv the base case a positive mpv of 3.02 million which is clearly above our And then we have the IRR, the internal rate of return, which is 13.25%, which is clearly above our 8.5% cost of capital. For the payback, we recover our initial investment in roughly 5.28 years since we can't count the decimal. So it will be around like five years and three months. Now to the sensitivity analysis of our evolve stage. As we can see, the sensitivities that we have here. However, a good analyst doesn't stop at the base case. So we have evolved the model to test for any risk mitigations and sensitivities for our assignment. So, for the WACC sensitivity, walk sensitivity, even if interest rate rises, as we have, so the first one is, we have revenue reduced by 20%, walk plus 2%, walk minus 2%, and, yeah. So for the walk sensitivity, even if interest rates rise and walk jumps to 10 .5%, the project remains positive. For the revenue risk, I ran a stress test reducing revenue by 20%, but looking at the revenue minus 20%. As you can see, this scenario significantly reduces MPV and turns it negative, which then indicates the project is highly sensitive to consumer demand, unlike the other sensitivity ratios that we see scenarios here. and um here you lastly we could see like our recommendation um and to reflect and show you my recommendation for the for for here we see that our decision is to accept this recommendation and that is our recommendation to accept the project for the financials the project clears the hurdle rate with a healthy margin of safety in the base case and strategic fit as a flagship grocery this supports the premium brand image of starbucks which likely has intangible benefits that not not captured in the spreadsheet and the caveat management must close closely monitor foot traffic as my sensitivity analysis showed a like 20 drop in revenue puts the project at risk however given the strong base case and strategic value it is a risk worth taking. Thank you.",
  "video_url": "https://youtu.be/ge8CD_U6SPY"
}