{
  "student_name": "None None",
  "org_defined_id": "037412563",
  "username": "ctirador",
  "video_url": "",
  "transcript": "For this mini project, we're to build a\nmore advanced AI finance tool. So for\nthis project, I used Google AI studio.\nSo for the discover stage, what\nfinancial decision needs explanation,\nnot just a calculation. So an investment\nanalysis that goes beyond numbers using\nNPV. So for the represent stage, how can\nAI make this smarter? the AI can give\nyou an analysis and explain whether to\ninvest or not by explaining the numbers\nand what they mean. So for the implement\nstage, I went ahead and implemented this\ninto Google AI studio.\nAnd as we can see here, we can edit a\nscenario with initial investment,\nworking capital, the discount rate, and\nthe sensitivity. Well, this is added\nlater, the project life, and then the\nsalvage value. And then here you can\ndescribe the cash flows naturally. So I\nhave years 1 to two 8 millions a year.\n$8 million a year. Uh years 3 to 7 $15\nmillion a year. Uh and then years 8 to\n10 $12 million a year.\nSo here uh if we run an analysis\nuh we can see here actually\nuh wait\nwe can see here uh that the net present\nvalue is 22,637,185\nwith internal rate of return of 19.37%.\nAnd then the recommendation is accept.\nAnd here we can see the cash flow\nprojection projections per year on a\nlittle uh graph. And then for the AI\ninvestment decision. So it tells you the\ncharge point network expansion which is\nuh the project what the project is\ncalled is recommended for acceptance as\nit is robustly creates uh shareholder\nvalue with a strong net present value of\n$22,637,185\nand a rapid uh I added this the payback\nperiod later on and then it clearly\nexceeds our cost of capital generating\nreturns significantly above our walk.\nThis positive NPV confirms substantial\nvalue creation and an efficient uh\ncapital recovery for the organization.\nSo here we can see the um cash flows\nand for the validate stage I went ahead\nand put those same cash flows into a net\npresent value calculator and as we can\nsee here uh the 22,637,185\nuh is the same from\nuh the app. So we can validate it and\nsay that the calculations are correct.\nSo for the evolve stage, what would make\nthe AI more useful? Something that would\nmake the AI more useful is by adding a\nway to see the payback period on the\ninvestment. Uh so that's it uh what I\nwas talking about earlier. So here we\nhave a payback period of 4.5 years and\nit also adds it to the AI investment\ndecision\nuh and a rapid uh 4.5 year payback\nperiod. So it also not only adds it to\nthe results here but also the decision\nuh analysis here by the AI. So reflect\nwhat's different uh about building with\nAI as a component. Building with AI\nhelps with being able to make your ideas\ninto reality. For example, I wouldn't be\nable to create an app this quickly with\nan without an AI's help. This allows me\nto brainstorm ideas and create them with\nthe help of AI. So for loop two, I made\nit so if you put in a project life of 0\nyears to tell you that there was an\nerror and that it must be a positive\nnumber. Also made it so it can recognize\nvalues like 0.11 in the discount rate\nbox as percentages.\nSo if we go back here to edit scenario,\nI already put it as 0.11 even though see\nhere it says percentage. Sometimes um\npeople can um incorrectly put the data\nbut here it'll be able to recognize the\n0.11\nand then if we change the value of the\nproject life to zero\nit gives up an error saying project life\nmust be a positive number. So if we\nchange that back to 10\nthen it should work.\nYep, it looks looks about correct. So\nfor loop three, I went ahead ahead and\nadded a sensitivity analysis scenario or\nYeah. And so uh there's a pessimistic\nthe base case which is the original\ninputs and then the optimistic uh if you\ngo back to the edit scenario we you're\nable to uh add a sensitivity variance.\nSo for this example I put 10%.\nAnd if we run the analysis,\nuh we'll be able to see\nthe NPV for each scenario. Uh so for the\npessimistic, we have an NPV of 10\nmillion, but you still accept the\ndecision because here it says the\nrecommendation based on MPV is greater\nthan zero. Since 10 million is greater\nthan zero, you still accept. And then\noptimistic is $34 million. obviously is\ngoing to be accept too since you're\ngoing to be accepting the base case. So,\nuh if there is a variance of 10% then\nyou would 100% uh accept the uh\ninvestment.\nSo that is all for uh this app and thankyou."
}