{
  "student_name": "Kulpreet Singh",
  "org_defined_id": "035817975",
  "username": "sing1099",
  "video_url": "https://youtu.be/kI4wCyfhoi8",
  "transcript": "0:01\nHello. Um, so today I have for our\n0:06\ncapstone project, I've made a PC part\n0:10\npicker companion.\n0:12\nSo\n0:14\nthe the problem that I'm trying to solve\n0:17\nhere is for new time PC builders. I\n0:21\nremember when I built my first PC, it\n0:23\nwas around uh um I think 2019. I was a\n0:28\nfreshman in high school.\n0:30\nAnd for my birthday, my parents let me\n0:32\nbuild my first PC. And uh building up to\n0:36\nthat, um I had to do a lot of research\n0:39\nonline. Had to watch a lot of YouTube\n0:42\nvideos. Um and it it's uh honestly a\n0:45\nprocess to really like actually\n0:47\nunderstand PC building. You can go into\n0:50\nit blindly and it isn't really that hard\n0:52\num to actually do the building process,\n0:55\nbut understanding what parts you need is\n0:59\nuh kind of difficult, especially for\n1:01\nsomeone that's just starting out. So,\n1:06\num\n1:07\nyou know, like you have to know like\n1:12\nwhat CPU fits in what motherboard cuz\n1:15\nthere are only two brands of the CPU. So\n1:18\nCPU is probably the easier part, but\n1:20\nfinding the right motherboard and also\n1:23\nknowing like what motherboard is right\n1:26\nfor you because there there's beginner\n1:28\nones, there's like decent like middle\n1:31\nground ones and there's like really\n1:32\nhigh-end motherboards you can use. Like\n1:34\nif you need 16 gigs of DDR4 or 32 gigs\n1:38\nand then also like a lot of people try\n1:41\nto cheap out on the power supply. So\n1:43\njust um you know just knowing that is\n1:49\nreally good for a beginner like with a\n1:52\nlot of the times like most people just\n1:53\ngive up and buy a pre-built because it\n1:56\njust the the entry seems so intimidating\n2:00\nto a lot of people especially when\n2:02\nstarting out.\n2:04\nSo the solution is this. I made a PC\n2:08\npart picker.\n2:10\nUm it's not just a list of parts. It's a\n2:12\nguide to um help beginners walk through\n2:16\nthe process without really much of a\n2:19\nheadache.\n2:20\nSo right here when I go in\n2:24\num I can use static data which isn't\n2:29\nthat just gives you like a rough idea\n2:31\nbut I'm going to use the live data mode.\n2:33\nUm this system will check your current\n2:36\num market prices and also tell you if\n2:38\nit's a good buy or not. So, we go in\n2:41\nhere, start our build. So, a lot of uh\n2:45\nPCs aren't just for gaming. Um, some\n2:47\npeople buy it to do video editing, and\n2:52\nsome people have jobs or just like to do\n2:55\nCAD modeling and 3D modeling. So,\n2:57\nknowing what you want to get is really\n3:00\nimportant, too. Um, I think everyone\n3:03\nknows what they're going to really use\n3:04\nit for. Um, so out of these three\n3:07\noptions, it tells you which one is good\n3:11\nfor which. And\n3:13\nfor our example, I will use the the CAD\n3:17\nand 3D modeling option.\n3:20\nAnd then we're on to the pricing. Um,\n3:24\nyou can pick up uh pick your budget. Um,\n3:28\nso with the current prices,\n3:31\nuh, 800 to a,000 is\n3:36\nyou'll get a decent, you can run\n3:37\nanything at 1080p.\n3:40\nUm,\n3:43\nthe best budget for a PC is around the\n3:46\n12 to,600 mark. After that, it's just\n3:51\nhow much more do you really really need?\n3:53\nUm,\n3:55\nso this app will just do that for you.\n3:58\nYou just have to know what price range\n4:00\nyou want to stay in. So for our\n4:02\npurposes, I will use the sweet spot. And\n4:05\nthen it generates a list for me. So this\n4:09\nis my total up top.\n4:12\nAnd this is again, it says optimized for\n4:14\nCAD and 3D modeling at a mid-budget. And\n4:16\nit's the live mode.\n4:18\nSo for our CPU, it chose the i714700\n4:23\nK. Um, so it shows us the price and it\n4:26\nshows us if it's a good deal or a bad\n4:28\ndeal. So, and then after giving me this,\n4:32\nI can click search deal and it goes on\n4:36\nGoogle shopping and I can go through\n4:38\nthis and find uh exactly what I need and\n4:42\nwhere I can go get it.\n4:45\nIt did the same thing for everything\n4:46\nelse. And then we can see here um\n4:50\nRAM is really really high right now and\n4:55\nit's not going to go down just because\n4:58\nof the amount of AI data centers that\n5:00\nare being built. Um but it's going to\n5:03\nstay market high but that's just\n5:08\nthat's going to be the new normal in a\n5:10\nfew few months honestly. But yeah, you\n5:14\ncan go here and\n5:16\nyeah, like any of these all these kits\n5:19\nwere really really cheap a couple months\n5:20\nago, but now they're pretty expensive.\n5:22\nBut just uh knowing that, you know, you\n5:26\ncan be more more smart with how the way\n5:28\nyou buy it. So you know that the brand\n5:31\nprices are high like across the board.\n5:33\nYou can just try to you know find better\n5:37\noptions and just be more just try to\n5:40\nsearch around more to find a good deal.\n5:44\nBut yeah, it's just a market high. It's\n5:46\nreally hard. But yeah, it gives\n5:48\neverything you'll need. Um yeah, the RTX\n5:52\n4070 would be great and it just gives\n5:54\nyou the right parts to choose. It gives\n5:56\nyou the um the brand also, so it's just\n6:01\neasy for you to just type this in or\n6:03\njust use the find deal and just go in\n6:06\nand do everything.\n6:08\nAnd then it also gives you some red\n6:10\nflags like don't buy a cheap power\n6:14\nsupply.\n6:15\nUm try to avoid cheap SSDs.\n6:21\nUm again, it's like some websites to\n6:24\navoid. And then also like just little\n6:27\ntips like don't don't daisy chain the\n6:30\nthe GPU cables.\n6:32\nUh just stuff that will help you along\n6:34\nthe building part of it. But this more\n6:37\nis um based on just knowing what parts\n6:41\nto get and just getting a rough idea\n6:43\nbefore you start getting into the\n6:46\nbuilding part. I think this this works\n6:48\nreally well for that first time PC\n6:50\nbuilder that just needs a rough idea.\n6:53\nthere there's a lot of options and\n6:55\nopinions online and this just goes off\n6:58\nof what's the best deal. Um like online\n7:02\npeople are hating on Intel\n7:05\num right now just cuz it's overpriced\n7:08\nbut people hating on it has actually\n7:11\ndropped the price a lot down. So you can\n7:15\nget Intel CPUs for pretty cheap than uh\n7:18\nwhat they used to be. It used to be the\n7:19\nother way around that people didn't want\n7:21\nAMD CPUs and only wanted Intel, but now\n7:24\nit's like the market's kind of flipped\n7:27\nand AMD's kind of selling more,\n7:29\nespecially to the consumers. But yeah,\n7:33\njust because of that the it it\n7:35\nrecognizes that the price has dropped\n7:37\nand that's why it gave us the right\n7:38\nmotherboard for the Intel chips. So\n7:41\nyeah, this is um honestly wish I had\n7:44\nthis. Um, for me it was just doing like\n7:48\num a lot of useless research just\n7:51\ngetting a lot of people's different\n7:52\nopinions\n7:54\nand uh yeah it's just the PC building\n7:59\nlike stage is always different for like\n8:02\nwhen I back in 2019 there was a lot of\n8:05\nproblems with finding GPUs. Um, that was\n8:09\nlike during the crypto phase and finding\n8:12\nlike anything new was really hard\n8:14\nbecause people are doing crypto mining.\n8:16\nBut now like the GPU prices have kind of\n8:19\ngone back to normal and there's not\n8:21\nreally a shortage. Now there's a a RAM\n8:23\nproblem. So it's just different. That's\n8:26\nwhy just having a tool like this can\n8:29\nhelp. And now we have the RAM issues.\n8:31\nUm, and then this RAM issue is actually\n8:34\ngoing to cause the GPUs to go up. But\n8:38\nyeah, it's just it's just different\n8:40\nstages every I feel like every like\n8:43\ngeneration that tries to build a PC\n8:46\nespecially feel like generation is kind\n8:49\nof not the right term but I think every\n8:52\nlike three to four years there's a\n8:53\ndifferent generation of PC builders have\n8:55\nlike kind of gone through the same thing\n8:58\nand they know like they know how to find\n9:01\nthe best deals.\n9:04All right. Thank you."
}