{
  "student_name": "Benjamin Engels",
  "org_defined_id": "037980105",
  "username": "bmengels",
  "video_url": "https://www.loom.com/share/437c9b65db94444fae5228b726658850",
  "transcript": "0:01 Good evening. Okay, and this is Simon, we are looking, um, this is Section, or Session 12 Business evaluation of financial modeling.\n0:11 So, starting off, we are looking at and error-brand's valuation for KKR. Right? So, we have using the driver method, which is what we've been using all semester.\n0:21 Starting off with our D. So, that's the divine and discover. So, we have, um, some goals here. So, our defining moment, um, you know, our value planner for KKR's LBO.\n0:31 Um, so we- We have our define. We have our discover. So, we want to analyze, um, panor, uh, panor, uh, panor, excuse me, panor.\n0:40 Yeah, like, for example, the rollermer, their W.A.C.C. uhm, Industry P.E. And then the plan- plan. So, using, obviously, Python and having that be, uhm, our main source of, uh, information show that.\n0:57 So, we're looking at our R, which is our represent. So, we use, uh, Python and, uh, we're able to, uh, calculate the rate.\n1:05 We input our inputs, you know, of our revenue growth from the information in the session. To get our revenue growth, our E-V-I-T-E-D-A margin, our W-A-C-C, and their terminal growth rate.\n1:15 So, we have a scenario here. We have, uh, the information here, as you can see. We have a base case upside and downside.\n1:23 Umm, we have some synergy scenarios here. And then the I, so this is the actual, uh, Python monoling. So, we have our DCF here.\n1:34 So, that is discounted cash flow. Uh. Five year operating projections. So, we show that, uh, we show our free cash flow, cash flow, our WACC justification or terminal value, valuation of that.\n1:47 So, um, and it was a go down. And I'll show you, I'm break down the Python method. This is. Thank you.\n1:52 Just the driver method. Um, so then we have par B and C of those, uh, respectively. Um. Okay, uh, after that, we have a valentate, so step four.\n2:04 Um, so we have, uh, this information here. We're able to see that. Our valuation for partner bread. Um, so our WCC versus terminal growth.\n2:12 Um, as we go down, step five is evolve. Um, step five in the driver method is E. So, uh, we have a couple, like, our strategy of- how using our- our DCF base case, uhm, I haven't been in our strategic valuation unless there's a clear path, uhm, to, uhm, unless there's, yeah, a clear path to high synergies\n2:37 exist. Um, key. He points to negotiate and talk about, and then our finally, ours to reflect, uhm, so conclusion and learning, uhm, this is a process, uhm, that we have there.\n2:52 And then as we scroll down, this is, uh, broken down, impl- And I'll see in the implementation detail of through Python, so our DCF, so we have our projections, uhm, operating FCF, WCC justification and valuation summary.\n3:08 So you're able to see those for here, uhm, kind of what they mean, and then- and as we get to step B here, we have our peers, uh, set in multiples, and then, uhm, our president transaction analysis, analysis here.\n3:22 Um, as we go down, then again, as past the I, in driver, we go down to- of date. So then we take that information, plug it in, we see our base, um, case EV should be highlighted in the Middle East, um, and then the final recommendation that we receive, um, is, you know, We have our DCF.\n3:44 Nounside base and Upside EV. We have our trading comps, uh, precedent transactions, strategic buyer, and synergies included in that, um, a recommended bid range, and then a rationale.\n3:55 So, um, overall, um, it's a great tool for the- determining what Panera Road should do, and this works. It allows for a great decision as we scroll back up here.\n4:07 Um, so, our final statement, uh, reiterate the recommended bid emphasized in the balance between a competitive offer and KKR's financial discipline.\n4:16 Um, Come on. Obviously, that's the final statement. Um, so Panera Bread has a couple options here of what they could do.\n4:23 Um, so, the recommended bid range, the distinct line van showing the recommended final bid price. So, Panera would just have to be, um, you honest, you know, notice where that KKR, or KKR, excuse me.\n4:37 Um, and just have that show that on this pricing. Um, using Python, which we calculated the VCF. Um, we're able to use that and, And, uh, have that work for us as we look through these different scenarios.4:52 So, that is Panera Breads Verilization for KKR. Thank you so much for watching."
}