{
  "student_name": "Lucas Case",
  "org_defined_id": "037512866",
  "username": "case47",
  "email": "",
  "transcript": "Hello, my name is Lucas Casease and for today's week N assignment, we're going to be going into cost of the cost of capital analysis. So, we're going to be looking at cost of equity, cost and debt. And specifically, we're going to be comparing Netflix, Disney, and Amazon Prime, which is a subset of just Amazon as corporate entity. Uh so first here some hypothetical parameters we're going to be working with for Netflix's finances. Uh market capitalization of 200 billion. Uh total debt its book value being 14 billion. The market value of its debt being 13 billion. Its equity beta being 1.3 it having a BBB plus bond rating with a yield of 5.8%. a corporate tax rate of 21% and its turn its current stock price is $450. And then just as a whole, the market conditions right now in this hypothetical world, we have a risk-free rate of a 10-year Treasury being 4 and a.5%, market risk premium is 5 and a half% and the average media industry WACCC range, which we're going to talk about in a second, is 8 to 10%. And then again, I said we're going to be comparing Disney, Amazon Prime, and Netflix. Disney's capital structures, 70% equity, 30% debt with a WACC of 8.2%. And Amazon Prime's video, as I said, we'll use Amazon's corporate WACC of 9 and a half%. And we're going to look at a scenario into how Netflix's WACC changes with a three billion additional debt issuance for content investment. So overall, again, just to clarify, we're going to be calculating the weighted average cost of capital for Netflix uh in connection with a hypothetical $5 billion content investment decision. Uh so we're going to uh determine the current weighted average cost of capital and then we're going to evaluate the impact of the additional $3 billion debt financing and then overall we're going to uh assess project specific weighted average cost of capital uh compared to firmwide and then we're going to compare net's cost of capital to the peers as I mentioned. So just some key terms before we get into the nitty-gritty. Uh weighted average cost capital is a financial metric that represents average rate of return a company expects to pay to finance its assets. Um so it takes into account all sources of capital including like long-term debt and its use as a discount rate to determine the present value of a company's expected future cash flows. Um so in an investment context WACC serves as the minimum acceptable rate of return for a project to be considered value adding and if an expected return is lower than the WACC uh kind of suggest that the project isn't won't generate sufficient returns to cover the cost. So some key aspects of uh determining WACC are cost of equity which can be determined using either two models we've used previously one being capital asset pricing model and the other being the dividend discount model and then the other is cost of debt which could either be pre-tax or post tax and then we wait the equity and we wait the debt. Um, so weight of equity, it's the market value of a company's equity divided by the total market value of its financing. And then weight of debt is the market's value of a company's debt divided by the total market value of its financing. Um, so these are all components of the weighted average cost of capital. So knowing that, I used Python to calculate Netflix's cost of equity. uh which again led into calculating its weighted average cost of capital. So you'll see it here I used the CAPM and Netflix's risk-free weight was 4 and a.5% the market risk premium was 5 and a half% and it had a beta of 1 or an equity beta of 1.3 and that led to its cost of equity being 11.38%. Um, and all in all, before the additional debt financing that we'll be looking at next, Netflix's weighted average cost of capital was 10.77%. Which was, if you'll remember, higher than Netflix's of 9.5 and Disney's of N of 8.2, which we'll be analyzing the the comparison there at the end of the presentation. So now to assess the impact of additional debt on Netflix's capital structure and cost of capital, we're going to incorporate that uh $3 billion debt issuance into the existing market value of Netflix's debt. And this change will alter uh the capital structure weights that is the proportion of equity and debt which will uh obviously consequently lead to an necessary recalculation of weighted average cost of capital. So our new capital structure uh the weights so the new capital structure weight of equity is 90.67%. which if you recall, if you'll recall, Disney's was 70%. And the new weight of debt is 9.33%. And if you recall, Disney's was 30%. So knowing that Netflix's new weighted average cost of capital is 10.66%. So you'll note that with additional debt financing, the weighted average cost of capital decreased. Moving on now, we're going to talk about companywide versus project specific weighted average cost of capital. So companywide, which is what uh Amazon Prime is under in this scenario, using Amazon's weighted average cost of capital, it just uh represents the average cost capital for all of the firm's assets and projects. Um this is very useful for overall firm valuation but in reality different projects within the same company have varying levels of risk. So it's not entirely uh the best way of looking at weighted average cost capital for different projects within the whole company. So now uh project specific wait addresses this limitation by tailoring the discount rate to the specific risk to the specific risk of an individual project. So products with higher risk profiles uh than a company's average risk profile. uh you should use uh the higher project specific WACC to reflect the increased risk and you'll be wanting to demand a greater return and it's vice versa for lower risk projects. So now for Netflix specifically we're going to talk about how project specific weighted average cost of capital can be different for international verse United States based projects. Um one key difference here is obviously content prefaces. You can look at tel nollas for like South American markets. Um European markets have varying sports interests. So maybe like rugby based shows or even cricket for like Asian and Indian markets. And then there's obviously like K-pop dramas for again an Asian market and then the US market. Uh movies in general could be pretty broad, but the US market might be more football focused or like uh internationally you've got Canada in the US could be hockey. Uh another difference that impacts the Project Pacific WACC is political environments. So for example on your screen I included a picture of the United States in Europe. um in mind I had like the strictness of like content restrictions. In Europe it's uh typically much much tighter content restrictions. So Netflix may have a project that would have a higher WACCC in Europe just because of the content restrictions. And then lastly currency just currency uh transferring between currencies can just increase risk in general. So overall, uh, US content would likely have lower project specific WACCC's and internationally there would likely be higher project specific WACCC's. So now moving on to our comparisons, Netflix verse Disney, Netflix had a weighted average cost of capital of 10.66% after our additional debt financing uh, compared to Disney's of 8.2%. 2%. Some of the reasons these are different is I think purely because of the business model. Netflix is purely streaming. Uh Disney has a whole franchise. They have Disney Plus. They have movies coming out. They have shows they come out with. They have all the theme parks, the Disney cruise line. Um another reason is just the overall risk. This is kind of tied into the business model. There's a lot of competition for Netflix and the streaming industry. and uh their 90% investment being with uh they have a higher cost of equity uh compared to Disney being that established brand with lots of revenue streams and uh they used more debt financing than Netflix as well. If you remember Disney's was 70 to 30 equity to debt financing and Netflix's was about approximately 90 to 10. Uh moving on to compare Netflix versus Amazon Prime Video which uses Amazon corporates's weighted average cost of capital. Again, Netflix had 10.66% and Amazon's is 9.5%. So Amazon's is slightly higher than Disney's but still less than Netflix's. Again, the the reason it's lower than Netflix's is similar to Disney, the business model. Netflix relies purely on streaming whereas Amazon has all this stuff. There's Amazon Web obviously, Amazon Prime for shipping and the like and then you have Amazon Prime Video obviously again overall risk it's much higher uh for Netflix compared to Amazon Prime Video because Amazon is using Amazon corporates. Um I believe if we had looked into Amazon Prime Videos project specific weighted average cost of capital it would be higher than Amazon corporate and more in line with Netflix's because both are in the streaming industry which has lots of prop uh competition but since we're using Amazon corporates uh you're using you know the big stable name of the growthoriented tech giant that is Amazon. So in conclusion, uh my recommendation to Netflix is to increase debt financing and utilize project Pacific weighted average cost of capital. Uh the reason we want to increase debt financing is first off the benefits of debt financing, it's typically cheaper than equity due to the lower risk profile it has for investments. Uh that is the fixed payments and the seniority and liquidation. It also has a tax shield uh tax deductibility that comes from tax deductibility of interest payments. And then equity financing you have it doesn't carry the same fixed payment obligations or bankruptcy risk as debt, but it's generally more expensive because the higher risk uh that equity investors have to take on and the lack of a tax shield. So ultimately I recommend that Netflix should increase debt financing to minimize their weighted average cost of capital and have a tax shield. Um although they may always have a higher weighted average cost of capital compared to their competitors that we mentioned in Disney and Amazon just because the other two have so much more diversification and stability. Um, however, if they leverage their debt strategically, they can bridge some of this gap by providing a cheaper source of financing. And then I believe debt financing works for Netflix because they have such cash flow stability because they have their monthly uh revenue from all of their subscribers. And then if you look at our year like our current market, there are very high interest rates right now. So that would make debt more attractive. And then again, Netflix should utilize project specific weighted average cost of capital because it accurately reflects the varying risk profiles of different content in different regions and ensure more optimal capital allocation for these uh local versus international projects. Um that is all. I hope you enjoyed the presentation and learned a lot. Thank you.",
  "video_url": "https://www.youtube.com/watch?v=WWoiGURVsUU"
}