{
  "student_name": "Sri Pinnamaraju",
  "org_defined_id": "036238865",
  "username": "spinnam",
  "email": "",
  "transcript": "Hi everyone, my name is Shri. Today I'm going to be going over assignment number eight, testing market efficiency analysis. So today we're going to be using the GameStop short squeeze case study and we are going to go through the driver method. So define and discover, represent, implement, validate, evolve and reflect. So this is our define and discover stage where I have to make sure what I'm analyzing for this assignment. We're basically supposed to figure out how to test the efficiency of the market during the GameStop short squeeze. So one thing that we want to do is we want to start verifying some facts. For example, one statement that is claimed is that GameStop was traded at 0.04 cents in August 2020. So that's wrong. The real price was actually between $4 and $5. And we need to make sure that this is correct information because this is important because the market efficiency is all about how about how markets react to real information. I also checked the short interest. This is how a lot of people were betting against the stock and that was confirmed by analysts um basically to estimate GameStop's fair value. So by doing this I made sure that all of our important parts of our analysis and our data were accurate. This is a summary of what I mentioned beforehand showing that yes my professor there is a telling my professor that there is a slight discrepancy in the data. GameStop did not trade for4 cents in August. It actually uh traded for around $4 and $5 during that month. and the stock would go up and down. I think the lowest it was valuated for was in April. But making sure that we know that the stock was traded at $4 and $5 is going to be really important because that is a much higher value than what was stated before. This is our represent stage and we're going to be looking at our abnormal return calculation. We're also going to look at our normal return interpretation. So, the normal return interpretation represents how GameStop would typically move if the market had no special news or interactions. The abnormal return is a return that car that captures the market's reaction to new special information. We're also going to look at the car interpretation and that is going to be the cumulative abnormal return. and um that can help us see if a market has a semi- strong inefficiency or not. Next, we're going to be also looking into our behavioral explanation, whether stuff is happening because of overconfidence, hurting mentality, or attention bias. Moving on to our represent. This is a mini timeline and I wanted to organize what should have happened if the efficient market um was actually like supposed to occur and this is important because the efficient market hypothesis says that prices should reflect all available information. So from August to December 2020 GameStop behaved normally but then a big investor bought a stake and the price rose a little bit which is exactly what we would expect. But in January after in January 2021, social media basically um helped uh explode GameStop's stock. So like Reddit communities convinced a lot of different people to um invest in the stock at the same time. And this actually caused the stock to jump up to $483, which is way higher than anything justified by any like finance fundamental like uh equations. And I wanted to put this out here because this really helped me clearly separate the rational part which is this representation of what has happened um from the price movement from the irrational part. So the rational part is where we see in January and um then we see that after late January people stopped like investing in the stock and then prices started to kind of go back to how it should have behaved in the beginning. Next we're going to be moving on to our implementation. So we're going to be going and looking at our collab. This collab is going to be a little bit long. Um, at first I created a collab with all of these different types of code blocks. As you can see, we have one that's putting out um a car around event uh graph. And then we have a volume of attention proxies graph. Then we have another huge code block. And this is going to be showing us the same exact types of graphs, but it's actually going to be using GameStop stocks. So it could be a little bit more of a exact representation of what we're going to be seeing related to the GameStop uh you know GameStop stocks. Um and as you can see we can see that there's movement along um a similar date compared to these other graphs. Uh and we also have our daily abnormal returns around this um you know Reddit short squeeze. And then we also have a part of a code that is there to validate our um findings. You know, looking at um their statistical test, an economic significance test, a bootstrap robustness test, and a persistence uh test because those are all important to look at to see what is actually happening in this market. So that is a quick little overview and now we're going to go back into our um slides and I'm going to go um explain the code by segmentation. So in the implement stage, I use Python to run an event study. It has a standard um like finance. Um I'm using the standard method of finance that we learned in class to test how markets are going to react to a specific event. So I loaded um you know the necessary like Python libraries for data and math and plotting like numpy and my event window is uh 10 days before and after the actual like squeeze and the event window lets me zoom into the exact moments where the market might have behaved unusually. Right? So next we are going to be going and looking at loading our simulation and price data. So I loaded the price data. I calculate my daily returns and the returns are going to be showing how much the stock changed each day which is really useful for analysis rather than just looking at all of the prices. Uh for example, you know, if a stock is going from $10 to $11, that means there's 11 I mean sorry a 10% return. And this helps me uh catch those big reactions around the GameStop um event. And as you can see, we have our exact Python code right here on our example code snippet to that correlates with our section of code. Next, we are going to estimate our normal returns. Um, our estimated normal returns uh should have looked like nothing unusual was happening and uh by computing this specific uh you know property we are going to have a baseline of comparison. So then I calculated our abnormal returns which is the difference between the actual return and the normal return. And the abnormal return is going to be telling us if the market reacted in a weird way based on certain events. Right? So next uh I wanted to compute our car. Um so I basically uh long short or like long for car is the cumulative abnormal returns. And this is going to be an addition like it adds up all of the abnormal returns over time. And it's really useful because it shows whether the impact of this squeeze um fades quickly. And um if it fades quickly, that's what an efficient market should do. And um we'll also be able to see using CAR whether this event or effect sticks around for multiple days. So then after that I graphed everything. So the actual returns, expected returns, our abnormal returns, and our car values. And this visual is going to help us spot the unusual patterns a bit more clearly than just looking at numbers. Next up, we have um sections 9 and 10 of the code. And that is basically I added a vertical line marking the event day. So it could be easier to see when the squeeze happened and when value started going up and down. So then for my output, I printed out some summary statistics to understand how strong or weak the reaction was and together with all of these 10 different sections of code. Um it serves as the technical part of my event study and um this is another uh part of my implementation. These are all of the outputs of our graphs. So the car graph which is shown to the top left is using um data and this graph is basically showing GameStop data during the short squeeze and you can see that our car rises triply around January 25th and 28th. So that's going to be telling us that there are huge abnormal returns during that um time. And as you can see, then you see that um the car drops uh significantly lower. So that's a little bit of the market kind of going back to its normal um area. And what you're going to see is GameStop had like massive abnormal returns from our normal expectations, but then it later declines and that shows that the market corrected that weird jump so with that overreaction. So that means that this inefficiency in the market was shortlived. So now another thing that we have is our volume and intention proxies graph. So the blue line is showing our trading activity. So that's technically our turnover. And the orange line is our social media attention. So that's going to be like all the Reddit activity that's kind of boosting up people to come and um want to buy this type of stock. All right. So both spike very high on the day that this squeeze happened. So what we can learn from this is the price surge was driven by social media hype and like heavy trading. So not by like the fundamental um you know practices of why stocks usually jump up. So this is actually um reflects different behavioral patterns in finance. So some of these are called hurting and fear of missing out and attention spikes and the increased attention from people um because of the social media interaction directly contributed to the abnormal returns. So now I'm going to move on to our validation part and what we're going to do is I want to go down and tell you why we did all of these different types of validation. So we have statistical economic significance bootstrap robustness test and a persistence check. So the first test checks whether the abnormal returns are statistically different from zero and my p value is around 28 which is not that significant but that means the abnormal return returns could just be a little bit of noise but um this noise is actually like consistent with the market efficiency. Um but next up we want to look at our economic significance test. So even though our statistics weren't that strong, the economic impact was huge. The car after the event was around it says around 246 uh% which is way bigger than any normal trading costs. So that basically means that economically games price movement was very unusual and was very like potentially inefficient. the effect was big even if it's not statistically showing that it was that big. Next, the bootstrap robustness test. The bootstrap test checks whether the effect is stable across many random samples. So, the confidence interval like includes zero, which means that abnormal returns may not be too reliable. So, the effect is not strong statistically or robust across samples. But now we're going to check our persistence check. So the last five days of the event window was a negative 54. And what I want to talk about that is this means that the market corrected itself very quickly after the squeeze. When the market reverse is like this, it usually means that the inefficiency was temporary. And you're actually going to see that through our graphs. So basically our final takeaway is putting all the tests together. You can see that GameStop actually showed a temporary market eff inefficiency. So that means prices were actually driven up by social media hype and people wanting to hop on to buying the game stock. And um as you can see the market actually eventually corrected itself. So statistically the results weren't wrong. The economic effect was really big and you can see that through the number and the high jumps in the graphs. And this is exactly why we need to actually look at the whole picture of finance and in the marketplace because sometimes it is true that behavioral effects actually will take over the fundamentals of finance and change the marketplace in a short period of time. So now we're going to move on to our evolve stage. So today we're going to be looking at what this game uh stop uh case study kind of like what it taught me about the market. So it taught me that information today spreads really differently. It doesn't come just from financial analysts or even news channels. I know people on Tik Tok who make um videos about like trading certain stocks um me figuring out like where to telling you where to invest based on certain companies. And I know platforms like Reddit are pretty popular where people go up and talk. Twitter is also really popular. So that can actually change a lot of um prices super quickly. And sometimes markets with a lot of social media influence tend to actually be more emotionally um driven rather than like efficient. So basically understanding that emotional part of finance can actually help us predict what stocks are going to be more vi volatile or actually more unpredictable. So I mentioned this here. So what GameStop demonstrated so online communities like Reddit and Tik Tok can really drive markets to be less efficient or even more efficient. Basically these platforms help identify which markets are going to be um vulnerable to sentiment driven stocks. So we have um sometimes we also have extreme short interest created in like price distortations. So that basically means that um sometimes the liquidity increases pricing accuracy. So this highlights when structural factors are um like drive mispricing. So then we have behavioral amplification. So sometimes behavioral factors overtake that rational valuation during that squeeze and you can see that because markets with strong social amplification like social media um platforms show mispricing. So, this idea that emotions and social media can really drive the stock market can help professionals evaluate when behavioral um differences can be um seen, used, or exploited. So, next up, I also wanted to relate to how this GameStop uh case study can relate to all of our different types of sessions. So, we have um our session seven stock markets. This Gamestock um case study illustrates us how GameStop shows how fast prices can disconnect from reality. Right? In corporate finance session 8, we can see that um companies might actually choose to issue stock when prices are like unusually high. And then in capital budgeting, which is session nine, we can see that um sometimes volatile markets can distort the cost of capital. So firms have to adjust cost of capital for both the fundamental and behavioral volatility of a stock. And session 11 which is valuation. Um basically we figured out that analysts must be really cautious during these hype driven periods because they can change pretty quickly. So on to my results. All right. So what we learned? I learned that um psychology is a really big part of everything even in finance. So even though GameStop experienced a really um short-term mispricing, the prices actually did eventually go back to normal once like people stopped getting so interested in it and they were like, \"Oh, wait. This is actually like not something that I should be investing in.\" But I did want to mention that this behavioral like dynamic of like FOMO, fear of missing out and hurting and like the short squeezes are basically creating temporarily temporary inefficiencies, right? Um and next thing I want to say is the social sentiment and online coordination. Um so basically this is really big because behavioral um decisions in finance can really change a marketplace. So behavioral um influences can create temporary market inefficiencies. So that is exactly what I learned from this GameStop case. And um what I want to do now is I kind of want to talk about you know markets are mostly efficient but you have to like look around and figure out what you want to invest in. So, I wanted to um put this part of the assignment just because I think passively investing can usually work, but the GameStop squeeze shows us that short-term inefficiencies can happen and hype and behavior can take over. So, both using the EHM and um behavioral finance together gives you a better picture of when prices are going to flow fundamentally and when they're going to break away. So the overall market efficiency works on an average but not all the time. So that's why I think you should combine both of the method methods to kind of get an average and have a good blend of what you're investing in. So overall I wanted to say that this game market case study is not a universal rule but it is based on a specific type of context. Um it is a context of different efficiencies that varies based on people and how they're investing, liquidity, short selling constraints and the speed and quality of information. Also behavioral loops, you know, and so understanding all of these different factors are going to help you make a better um financial decision across um valuation, corporate finance, capital budgeting, and even trading strategy. And in summary, markets are efficient most of the time but not all the time, you know. Uh so in effective investors need to respect the market pricing and stay alert for high quality and repeatable inefficiencies um uh like post earnings drift or behavioral overreactions. So overall one thing I want to mention is the GameStop uh event shows that markets are mostly efficient but not perfect. So prices usually um reflect information quickly, but during the short freeze, the hype and social media temporarily pushed um GameStop far away from the fundamentals. So my analysis shows that large abnormal returns that aren't statistically stable eventually reverse, meaning that the inefficiency is short-lived. So this case highlights how EMH and behavioral finance work together and how they explain real markets. So GameStop short squeeze represents a temporary breakdown of semi- strong efficiency, right? So prices did not immediately reflect all of the public information, they were kind of distorted by social media attention um and like short selling like friction. But however um once the trading restrictions started to set in, the market corrected itself and then it restored to long-term efficiency. So this event basically supports the view that markets are mostly efficient but very vulnerable to behavioral and structural shock. So to verify the stated facts anal analysize the price behavior relative to efficient market hypothesis predictions um what we're going to say is this was a temporary breakdown of a semi-strong efficiency and markets are mostly efficient but they are vulnerable to behavioral and structural shocks. Thank you.",
  "video_url": "https://youtu.be/kk5SNoqrLxw"
}