{
  "student_name": "Ryan McNamara",
  "org_defined_id": "037202820",
  "username": "mcnama34",
  "video_url": "https://youtu.be/FhyD1HgF18Y",
  "transcript": "I'm Ryan McNamera and today I'm going to be presenting my 310 capstone project. So for my capstone I decided to do a market translator. And so what this market translator is is it's basically going to take a it uses an AI uh database in order to help uh new traders and um analyst um answer their questions um about the stock market. So, um, what I did was I used this app called, uh, replplit.com in order to make the, uh, app itself. And this is what we ended up with. So, it's kind of formatted like a uh, newspaper almost. So, you've got your new, your articles up here, over here on the side, and then in the middle you have your um, uh, just like your prices for the day. Um, so we have right now the S&P 500, the NASDAQ, um, Bitcoin, and another index. Um, these are all customizable depending on, uh, your preferences, which I think is pretty cool. Um, and then we have as well our stories for the day um, to help us kind of get a grasp on what might be going on. But the really important part, the main event of this site is down here. at our uh anal our AI analyst. So what the AI analyst is help me meant to help us do is to um try to determine what trends are um and what they're what's happening and explain it to us in just simple words that anybody can understand. So, this really comes for somebody that's sitting at a desk and is not doing this professionally, but is able to understand exactly what's going on because they have this uh specific program. So, uh now we're just going to we're going to demonstrate how it works. So, we're going to start with this prompt at the top. This works with any prompt, not just these ones that are here, but it's easy if we're going to start if we start with just something of an example. And what's nice is it's a continue um it's a continued conversation. So you're not just limited to one response. And that was actually one of the iterations I had to go through when developing this program was making it so it wasn't just one question at a time and that you could actually build onto each different uh prompt if there were ones that were linked together. Um this whole source is actually sourced through chat GBT using those um OpenAI keys that um the API keys so that you can link this into an actual um AI source instead of hard- coding responses because we don't want to use that. We want to have something that is organic every single time we use the program. So um this is the prompt we're going to start off with. we say price is rising and then dropping steeply and it's going to kind of explain what that means for us. So, um it's telling us this is a very volatile market and then when price break spikes quickly and then crashes means that buyers are taking profits and selling. Um and this is a and this is an area that we should be caut cautious if we're just getting into this because we it's very unpredictable and we don't know what's going on. Um it's Yeah. So it's very very helpful. Um but we can also use our own prompt and not just something that's there. So we can ask it to describe\n\nwhat is happening when is moving up.\n\nSo it's going to break it down for us. So, um, it says that our timing, it varies on our times, but on higher time frames like our daily and our weekly, um, it's going to give us more reliable signals. So, um, let's see if we can, uh, we'll go dive a little bit more into this if it it is moving up on the hourly chart.\nSo it says that upward it tells us exactly what the upward movement means. Um so it means that it's indicating buying pressure and that it's greater than selling pressure meaning that more people are buying and then that we're in a positive direction and we're going to continue to see that uptrend which is really cool. So yeah, that's kind of the the brains and the big main uh the centerpiece of this site is that uh trend decoder, but overall our market translator is really what we're going to be using for everything. So and at the bottom here we have another uh different article and this is going to be also customizable. Right now it is set to tech um to try to give us an insight on that industry because we know it's doing very well right now. As we can see that sector is doing is done 12% so far this year. Um so yeah thank you very much. This is my market decoder and or market translator trend decoder. Have a good one."
}