{
  "student_name": "Caleb Piekarski",
  "org_defined_id": "037218585",
  "username": "cpiekars",
  "video_url": "https://www.youtube.com/watch?v=7V0nTUwz274",
  "transcript": "00:00:03\nOkay. So, today I'm going to be going over the assess or section uh six assignment of the session 11 which is the corporate financial decision analysis. So, just going over the assignment overview. Um all this right here is going to be part of the define and discover stage of the driver framework which I'm going to be going over in this Google Docs worksheet. So, so just discovering the information given company snapshot cash and investments uh for $165 billion. The annual free cash flow is $100 billion.\n\n00:00:42\nThe debt is $110 billion. Shares outstanding 15.5 billion. Share price $185. uh PE30 EPS $6.17 uh income which is about 95.6 billion and the dividend yield is 0.5%. The buyback proposal is 90 billion over one year at $185 per share. Market cap is about $185 times $15.5 billion which is equal to 2.8 8 um 67 trillion. The buyback is about 3.1% of market cap not 10%. So some stakeholders Birkshshire 6% owner CEO 3 million shares retail investors average 100 shares employees options at $17 strike bond holders\n\n00:01:39\nexposed to leverage and uh liquidity shifts. uh alternatives to buy back $6 special dividends 90 90 billion debt payown strategic AI VR acquisition incremental R&D and then key theories to apply the EPS mechanics agency problems signaling theory capital structure and cost of capital and value creation versus value transfer so going down to the represent stage of the driver framework we're going to be looking over the model structure of what we're looking at here which is looking at just the inputs, the buyback size,\n\n00:02:15\nshare price, net income, cash and debt levels, and the alternative scenario toggles, uh, dividend debt payown, MNA, R&D. Some core calculations we're going to be looking at is shares repurchased, new shares outstanding, EPS, implied share price, net cash, ownership changes for stakeholder groups, option value changes for employees, leverage ratios, net cash or net debt, and these are just the equations for that. So implementing this going be looking at uh the buyback calculations. So shares\n\n00:02:51\nwe purchased, it's going to be 486.5 million. The new shares outstanding 15.0135 billion. EPS increases from 6.17 to 6.37 EPS creation uh plus 3.2% implied price of constant PE $190.99 share price increase plus $6 market cap mostly is unchanged as buyback shift capital structure not enterprise value. Uh the net cash before would be 55 billion. Net cash after would be 35 billion. Um company becomes net debt. So some stakeholder impacts retail shareholders of 100 shares value gain $600 slight ownership boost no tax spent\n\n00:03:42\nuntil sale. um just institutional holders example Birkshshire ownership percent rises EPS accredation improves headline metrics uh and then the concern would be reduced liquidity uh and higher leverage the executive CO3 million shares would be plus 18 million in market to market value buyback increases option delta short-term compensation metrics and then the clear entry incentives toward buybacks Then for the employees option to $170 buyback lifts stock price further in the money and meaningful wealth increase and\n\n00:04:22\nthen the bond holders net cash turns negative credit risk increases worse off under buyback relative to debt reduction. So just validating all this just recalculate EPS under all scenarios. Uh cross check leverage assess economic value creation scenario comparison and consistency with theory making sure everything is staying consistent and then going into the E stage of the driver framework uh evolve. Um the full $90 billion buyback overleverages Apple unnecessarily. Moderating the buyback lowers risk uh\n\n00:05:00\npreserves cash. Optionally R&D and strategic M&A have potential for real value creation but require governance guard rails. Uh debt reduction improves long-term stability but offers less benefit to equity holders. The optimal plan blends shareholder return for strategic strategic investment and then reduce buyback to 45 to 60 billion. Allocate 20 to 30 billion to AIVR or silicon innovation R&D. Maintain net cash position rather than going net debt. Adjust share price sensitivity of PE multiple compresses.\n\n00:05:40\nuh incorporate potential operating improvements with uh from new investments and then looking at our reflection from key takeaways from this uh the buyback increases EPS but does not materially create enterprise value most benefits occurr shareholders and executives bond holders are harmed agency considerations are meaningful management and sensitives are aligned with buybacks not long-term strategy Apple risks excessive leverage for marginal short-term financial optics. Uh true value creation requires\n\n00:06:14\ninvesting in high ROIC opportunities not purely distributing cash and best recommendation to be a balanced capital allocation strategy combining a smaller buyback strategic investment in maintaining Apple's historic financial flexibility. So just the final recommendation down here would be to not execute execute the full 90 uh billion buyback. Instead purchase a phase 40 to 60 billion p repurchase repaired with 20 to 30 billion in strategic investment AI silicon AR VR uh while preserving a net\n\n00:06:49\ncash buffer and safeguarding bond holder interests. And that is all I have."
}