{
  "student_name": "Gurpreet Multani",
  "org_defined_id": "036767359",
  "username": "gmultan",
  "email": "",
  "transcript": "So for session eight's assignment, we have to investigate market efficiency using GameStop short squeeze events from 2020 to 2021 as a case study. We use all these event timelines from August, September, January, February, and the present post using a Yahoo Finance that we tried to incorporate into some of the codes over here. And so first off, we do the GameStop trade at 4 cents in August 2020. According to uh Yahoo Finance data that we pulled, the minimum closing price in August 2020 would be $14. The maximum closing price would be $167. The average closing price would be $120. Over here they provided a visual graph as well. And then uh some event timeline notes on the key dates. We see um basically first trading day on from on January 27th with the closing price would be uh $86.88 at the height of the Reddit squeeze February when congressional hearings began it's $56.25 25 September 2020 at 13% stake with Brian Cohen that acquires $1.91 and uh the near bankruptcy level will be $14. Over here they provided another graph as well. Now over here we estimate the market efficiency the uh abnormal return abnormal return I think that is it says it over here actually provides us exactly what uh that stands for. Yep. abnormal return and then um cumulative abnormal return as well for the C and the return under market model calculates everything right here. So the alpha results are 011730 the beta will be 1.603 603. That means that on average, GameStop earned about 1.17% per day. Independent of the market, it moves about 1.6 times more aggressively than the S&P 500. As you can see, uh shows all the regression results as well. A sample of abnormal returns for the first five days of January. These numbers are basically used later to compute expected returns and the abnormal returns as well. So the final cumulative normal return at the end of event window would be 1.7385. That's the final one. And then the peak at the peak it reached about 3.24 here as it states GameStop shows large abnormal returns and then C that picked around 3.24 that basically means that GameStop's community of abnormal performance during the peak of the squeeze was more than three times greater than what the market model actually predicted. And then um over here we had done a fact check with like summarizing everything and then we do uh now we're calculating the significance of all these baseline volumes. We're calculating the volumes for GameStop profitability and everything else mentioned. So the baseline volume from November to December 2020 would be 39 million 39.3 million shares. We'll just break that number down and uh sum it up. And the peak volume from January to February of 2021 is 788.6 million shares. So the volume multiplier would be 20.1 times the average daily volume. Well, it's a 20 times increase in volume and it's extreme and cannot be explained by fundamentals. So, the behav behavior is consistent with hurting, fear of missing out, social mediadriven coordination, overconfidence and narrative driven trading. All of these fall under behavioral finance and not the uh EMH over here just summarized everything else. So the limits to uh let's see if we can find it. See if I can find it. Okay. Boom. The limits to arbitrage and micro structure notes basically talks about the squeeze persisted longer than EMH would predict because rational traders faced extreme barriers. Short interest was over 140%. But borrow fees were very high. Short sellers faced a limited loss risk. Robin Hood restricted buying. Circuit breakers repeatedly halted trading. Order flow was massively imbalanced as well. These all limit these are all limits to arbitraries that prevented informed traders from correcting mispricing. Then you got rational investor profitability. So um could a rational investor have made systematic profits? X ante would show no predictable signal, extreme volatality and high risk of catastrophic losses. And so this means there was no easy systematic strategy for an investor to earn abnormal returns with good risk adjusted performance. Basically there was no safe strategy to profit consistently. Then the expost after the squeeze basically saying uh some traders made huge gains but only by taking the lottery level risk. Therefore, the event does not show a repeatable violation of EMH. Then over here, you have the EMH versus behavioral finance where the EMH holds market absorbed new uh info quickly and prices were corrected shortly after the peak. And where the EMA breaks is where uh extreme deviation from fundamentals, persistent abnormal returns, and mass behavioral hurting. The behavioral finance explains why investors acted irrationally, why prices were overshot, why the squeeze spiraled out of control, why the arbitrage couldn't fix it quickly. the GM and the GameStop event shows both efficient information information processing and behaviorally driven mispricing as well. So for the final conclusion for all of this basically is that the 4 cents price claim was proven false. GameStop traded between $14 and $167. They experienced massive abnormal returns and a C peak of 3.24. The volume surged by 20 times showing extreme hurting. Behavioral biases and social media were central to the squeeze. Limits to arbitraries prevented early correction. Abnormal returns were not significant. So, EMH couldn't be formally rejected. But the behaviorally the market was clearly inefficient. So overall, the events highlight a market where information processed quickly, but human behavior overpowered the fundamentals, creating one of the clearest examples of temporary market inefficiency in modern history. And yeah, so here are just the rest of the results. I told it to summarize everything else. Basically all that we talked about the key event prices, market model parameters, the t statistic and the p value. Yeah, that is all. Pretty simple. Got it done.",
  "video_url": "https://www.youtube.com/watch?v=gtVqoP_jls0"
}