{
  "student_name": "Anushka Wayse",
  "org_defined_id": "037494252",
  "username": "wayse",
  "email": "",
  "transcript": "Hello, this is my session 8 assignment for Management 310, so I'm going to go ahead and start with the driver method, and the first thing is to find and discover. So just to give a quick overview of the actual problem, so the primary goal is to investigate the market efficiency using GameStop, GM8, GME, short squeeze event that have transferred from 2020 to 2021 as a case study. The analysis must determine which form of the Fish and Market Hypothesis, EMH, if any, was violated, and whether the observed price behavior can be explained by traditional frameworks or requires behavioral finance concepts. And during this stage, it focuses on clearly understanding the problem, verifying the initial facts, and defining the main goal and scope of the analysis. So our goal is to produce a rigorous data-driven analysis that assesses the GME event's implications for the EMH and provides a balanced comparison between the efficient market hypothesis predictions and behavioral finance explanations. So just a quick fact verification as our first step. So the initial claim is that GME traded at $0.04 in August of 2020, and it must be verified against actual historical data. This is a critical prerequisite before proceeding with any analysis. Our hypothesis is that the stated price of $0.04 is likely incorrect given the stock had a price of around $4 to $6 in August 2020. Our action is to find the actual closing price for GME in August of 2020 and our communication plan, if incorrect, the accurate figures and a professional correction approach must be documented. So, some of the key questions to answer is, was the price of 4 cents in August 2020 accurate? If not, what was the correct price? And then, from which market efficiency, weak, semi-strong, or strong, was violated by the GME event? Could rational investors have systematically profited from this event, and what does this imply about the predictability of returns? Next, how did behavioral finance biases, like hurting or anchoring, explain the observed price anomalies? And let's see what theoretical and policy implications for active versus passive management and market regulation. So moving on to the represent part, which is the plan. So this stage outlines the analytical and technical steps required to address the key questions and achieve the assessment goals. The core formula and methodology for this is the analysis will be centered on the advanced study methodology to test for abnormal returns, which is crucial for evaluating market efficiency. The abnormal return formula is this. Abnormal return equals the actual return minus expected return. The capital asset pricing model, CAPM, will be used to estimate the expected return. The expected return using the CAPM model is as follows, risk-free rate plus beta times the market return minus the risk-free rate. Now for our analytical process. The process will be conducted in a sequential data-driven manner. Step 1 to get the data, so data acquisition and verification. Acquire historical daily stock price and volume data for GME. and relevant market index. For example, the S&P 500. Step two, weak form efficiency test, which is the price patterns. So to analyze the GME price movement before this, we should identify any exploitable and non-random patterns. In addition, to calculate abnormal returns, which are ARs and cumulative abnormal returns cars and around the key event dates. For example, Ryan Cohen's investment announcement January 2021 where there was a surge and using the CAPM framework. And text for statistical significance around the ARs in cars and the existence of statistically significant ARs suggestion of violation of a weak form efficiency. Step three is to form a semi-strong form efficiency test, which is the public information, to compare the speed of the price adjustment to major public news against the event timeline. The massive price surge, despite fundamental analysis estimates of $10 to $40 per share, suggests a market reaction beyond the public fundamental value, potentially violating semi-strong form efficiency. Step four, the strong form efficiency test, which is the provider and insider information. So, analyze the data points show interest peaked at 140% of flow and resulting hedge fund losses. For example, Melvin Capital sustained a a 53% loss. Evaluate whether insiders-regulators could have profited systematically based on the non-public knowledge of extreme short-selling position, though this is difficult to prove empirically. Step five, the behavior finance analysis. Identify and analyze the specific behavior biases, hurting behavior, the Wall Street Bats influence, social media influence, and the loss aversion. amongst the short sellers and forced to cover. Discuss the limits to arbitrage. Why the price disconnect from fundamentals persisted. In step six, the rational profitability and theoretical implications. So I'm going to evaluate the high-risk and non-systematic nature of the profit opportunities to assess if they were a truly systematic or rational investor focusing on x-ante versus x-post analysis. Synthesize the findings to compare the EMS framework with the behavioral finance explanation. And then the technical requirements for this, we're going to use Python as the platform aka Google Call Lab for analysis and their visualization, not aka Google CoalLab, but that's what we're going to put our code into, Google CoalLab. And then our deliverables are an exebutable code for all calculations and clear visualizations of abnormal returns in the event timeline. So the next step is to acquire the GME historical price data and verify the 4 cent claim from August 2020. So use the tools available to search for the historical stock price of GameSock GME in August 2020 to verify the game. Our third step is to implement the analysis and the code. So our goal here is to execute the code, the core events, study, calculations, and build empirical analysis required to test the efficient market hypothesis. And our action we're going to be taking is to build an integrated model using Python to perform data acquisition, data estimation, and abnormal return calculations and visualizations of the results. So the critical first step to do is a fact, verification, and correction. The initial claim is that GME traded at 4 cents in August 2020 is that it's incorrect. Our correction is the actual split-off adjusted closing price for GME in August 2020 was a range approximately of $1.04 to $1.67. And our methodology is all subsequent calculations will use accurate historical price data. So now I'm going to go ahead and go to our co-lab before we continue. So I sent our first three steps into Gemini, and Gemini went ahead and gave me some code and also a market efficiency analysis of GameStop. So here we have the code Gemini had sent. So the first part of this code is to define the stock that we want, to create the variable to hold the stock's ticker symbol, so the ticker symbol for our stock will be GME. We'll also implement YFinanceLibrary as well. Part 2 is our critical first step. we need to check the price in august of 2020 and what our claim was and checking and a cute in a clear and human readable way and a clear conclusion as well then part three to verify other clear event data as well peak price from the event timeline And then for the code's analysis, fetching data for GME, as we defined before as the game stock price. So analysis for August 2020, the lowest price GME traded at in August 2020 is $1. Conclusion is that the statement that GME traded up for cents is incorrect, the actual low is around $1. In the analysis for the 2021 squeeze, the highest pace that GMU traded at during the January-February 2021 squeeze was $120.75. This peak occurred on 2021-1-28, January 28, 2021. And in conclusion, the statement, the price surge to $483 is accurate. Google Call Lab also gave required analysis for it. And the forms of market efficiency as well as an evaluation and comparison and assessment. But we're going to go over that. So here we also have the financial analysis and calculations. The analysis uses the capital asset pricing model, Kappa M, to calculate the market adjusted abnormal return for the event window. So the Kappa M formula is abnormal return, which equals the GME actual return, minus the risk-free return, plus GME risk level, times the market risk reward. Our data inputs are the estimation period, market proxy, which is where we're going to use the S&P 500, and the risk-free rate as well. which is an assumed average of 0.1% over the period, as well as the beta estimation. The beta is estimated from the pre-event estimation period to represent GMAE's systematic risk and the normal market returns. So here we have that same formula that Collab used. so i just created some tables to make this more more visually makes sense so the metric the value which is the hypothetical result and the interpretation so the gme the beta 1.7 so gme was at was 70 percent more volatile than the market even before the squeeze this is just at high business risk typically of troubled small-cap retailer to our abnormal return calculation the code calculates the expected return and the abnormal return for the peak event window of january 11th 2001 to february 1st 2001 so we have the same formula that we used before. So we have January 13th, 2021, with GMU return, expected return, and abnormal return as well calculated. January 27th, 2021, we have the same. And February 1st, which is the post-restrictions. Here we see a very high decrease in all of these percentages. Now, cumulative abnormal return, we don't have one for these, but for the actual abnormal return, we have a cumulative of 300%. Now, just an analytical interpretation of all of these equations and all of these findings. So, weak form, the car of over 300% is statistically significant. This huge return was driven by the price momentum and past trading volume, indicating that the past price information was not efficiently reflected. And the violation, violated. The price surged to $483 while fundamental analysis public information suggests a value of only $10-$40. The massive divergence shows that the market ignored public fundamental news. The trading restrictions implemented by Robinhood at the peak created information asymmetry an advantage for those who could still trade, potentially allowing for some uninformed parties to profit in a way that suggests a breakdown of fair access to information. So this one's just likely violated. Now for behavioral finance analysis. The failure of EMH requires an explanation from the behavioral finance. The first explanation is trading and social media influence. The massive increase in retail trading volume directly corresponds to the positive abnormal returns, indicating that the returns were not based on fundamentals but on coordinated collective action driven by social media. Limits to Arborage The cumulative abnormal return persisted for weeks because the short seller's losses created an asset substitution problem, forcing them to take excessive risks, while rational arbitrators could not correct the price because the capital required was too high due to noise trader risk. In addition, we have rational investor profitability analysis. So, before the fact, a rational investor was purely based on fundamentals and would have shorted the stock. However, due to the unqualified risk of the short squeeze, systematic profit was not available. The required margin and volatility made it an irrational bet for a systematic investor. So, after the fact, while some individuals profited immensely, the opportunity was non-systematic and high risk. It was a successful speculative bet on an anonymity, not a failure of the EMH, in the sense that an average systematic investor could easily and repeatedly profit. Now, after all our code and all our analysis, we can move on to the validate portion. This stage checks the analysis for accurate and logical consistency. For statistical validation, so after calculating the abnormal return and cumulative abnormal return, to perform a t-test to confirm that the observed abnormal return is statistically significant. If the p-value is below the significance level, then the reserves are robust and support the conclusion that abnormal returns occurred. For a logical check as well, the observed phenomenon is an asset substitution problem and a limit to arbitrary issues. Asset substitution, so essentially short sellers were facing huge losses and had incentive to take on more risk. Limits? Rational institution investors knew that GME was overvalued but couldn't exploit the inefficiency because of the high cost and risk of taking a short position due to the high possibility of a short squeeze. This validates why the price anomaly persisted. In addition, a benchmarking compared to the calculated abnormal returns to similar historical short squeeze to ensure the magnitude of the results is plausible for such an extreme of market event. Next, evolve. The stage critiques, the analysis, and to just how it could be improved by using alternative models or broader perspectives. So the CAPN limitation critique. So the event relies on the CAPN as single factor model. CAPN assumes that beta is the only risk that matters. So, in order to evolve this and try to get better for next time, to use a multi-factor model like the Framer-French 3 model with a five-factor model to calculate the expected returns more robustly, GME, being a small-cap value stock at the time, is highly susceptible to these other risk factors, making a multi-factor model superior for empirical accuracy. Another is modeling behavioral biases. The analysis should move beyond merely identifying biases to potentially modeling them. Evolution. Incorporated a variable for social medias into the abnormal routine calculation to directly quantify the influence of hurting behavior on the price changes. And lastly, the policy implications that then expose a market microstructure's issues. In order to evolve from this, to discuss the role of payment for order flow and the collateral requirement for brokerage cleaning houses, which reject direct cause of the trading restrictions imposed by Robinhood. This moves the analysis from purely academic to a practical policy discussion. There are some reflections and key takeaways that I took away. This is also the final stage that synthesizes the findings into core lessons learned. The first key takeaway was that the efficient market hypothesis is plausible in extremes. The DME event provides strong evidence against strict forms of the efficient market hypothesis. The violation of a semi-strong efficiency was the most pronounced. as the price became completely disconnected from all publicly available fundamental information. My second key takeaway was that the limits to arbitrage is real. The short squeeze demonstrated that even when stock is clearly mispriced, irrational professional investors may be unable to correct it due to limits of arbitrage, namely the risk of margin calls and capital constraints. Furthermore, the last few takeaways that I took was the power of social coordination. The event highlighted a new reality that retail investors, when coordinate, can act as a massive force, creating behavioral anomalies in systematic scale, thus redefining the market risk in an age of social media. Thank you!",
  "video_url": "https://youtu.be/00s5H11ArbA"
}