{
  "student_name": "Connor Kubly",
  "org_defined_id": "035977730",
  "username": "ckubly",
  "email": "",
  "transcript": "So to start off the 10th assignment, um I let it know that I am an accounting student doing an analysis over cost of uh capital analysis. Uh I told it to please act as a finance professional with a good understanding of Python. Apply the KISS or keep it simple stupid principle to the code. So I just let it know the overview uh that was in the book, the project parameters. So basically where I wanted to go with this with this analysis. Um all the information that I needed like the tax rate, the operating costs, so COGS, uh uh revenue, labor, uh rent, utilities, just all like those basic accounting expenses, uh revenues, uh working capital, um the initial investment, um and then basically the analysis requirements. So basically everything that I needed done uh for this analysis. and I told it to please present this information as if I was giving a presentation uh to my boss. So to start things off just with the executive summary. So my recommendation is to approve uh the flagship roaster project um because it is financially viable. It exceeds the 8 and a half% cost of capital threshold generating substantial value while offering strategic branding benefits. The net net present value is about 5.59 million which is positive value creation. The IRR the internal rate of return is 16.6% which is well above the 8.5% hurdle. Uh the payback period is about 5.4 years. And just a strategic note that I added um this project acts as a halo asset. Basically a halo asset is just a product that boosts uh a company's branding in a positive way. So likely boosting brand equity beyond the direct cash flows uh modeled here. So to start things off, um I created the 10-year um just cash flow uh schedule. So you can see year z year zero for the year that we acquired the asset to the year 10. Um you can see all the revenue, COGS, depreciation, tax, um operating cash flows, weighted costs, um and then finally the financial cash flows. So you can see this is the uh the 10-year uh cash flow timeline that I created and some analysis that I added. So there's a year one dip and uh but the cash flow is positive but lower about about 1.2 mil due to higher uh marketing spending uh 300,000 versus 100 uh,000 and lower initial lower initial revenue of 8 million. The peak performance um are years two through five right here. Um and this is the sweet spot of the project where revenue hits 11 million generating 2.7 million in annual free cash flows. Uh the terminal boost year is year 10. You can see this uh this boost of revenue. And this large spike in year 10 uh 4 or it's it's around 455 million uh comes from selling the assets uh which is about net 2.25 million and recovering the initial working capital of uh 500,000. you can see where it was taken out and you can see that we we recovered it back in year 10. Um, and so the sensitivity which is this right chart uh that I created uh the orange bar confirms that the revenue is the critical risk factor. If revenue drops 20% the project net present value turns negative of about negative 3.08 million destroying value. Changes in interest rates or the uh weighted average weighted average cost of capital affect value but do not break the project's viability. Uh so the net present value is about 2.69 million. So if we want to accept uh if it's greater than zero so accept internal rate of return is about 12.84% and then accept if it's greater than 8.5%. So we we want to accept that. And this 8.5% is the weighted average cost of capital. Uh the simple payback period of 5.3 years and this is kind of a metric of liquidity risk recovered in year six. The discounted uh payback period 8.2 years which is about 8.2 years is a metric of liquidity of uh risk also and you can see this is recovered um in year 9. And finally the profitability index or the PI is a 1.22 and we want to accept this if if this is greater than 1.0. So obviously we want to accept this. So for a metric breakdown here the net present value is about 2.69 million and this is the direct value added to the Starbucks shareholders. So this is uh us doing this uh timeline using uh Starbucks uh WACCC. Uh so this is the direct value added to Starbucks shareholders. Since it is positive, the project is financially sound. The initial rate of return is about 12.84%. Uh so this project creates returns well above the 8.5% cost of capital. We have a safety margin of roughly about 4.3% before the project destroys value. The simple payback uh which is 5.3 years. Um so ignoring the time value of money, we get our 12.5 million nominal dollars back uh early in year six and the discounted payback of about 8.2 two years. When we account for the 8 and a half% cost of capital, it takes longer to break even in value terms. We cross the threshold in year 9. This indicates the project is a longerterm play, relying on steady cash flows in the later years to generate true economic profit. And finally, the profitability index 1.22. So basically, for every $1 we invest, we generate about $122 in present value. So this suggests efficient use of capital. So for the sensitivity and risk assessment, so I st so right here I put we stress tested the model to see what happens if things go wrong. So first we did a revenue shock of about 20% decrease. So if customers don't show up and revenue is 20% lower than the projected net present value is about600,100. Uh the initial rate of return is about 7.5% and so the risk is high and this is the most critical variable. If revenue drops significantly, the project destroys value. However, the original initial rate of return 7.5% is still close to our weighted average cost of capital, meaning it's not a catastrophic loss, just an inefficient use of capital. Uh so cost of capital volatility, so about a plus or minus 2% weighted average cost of capital. So the lower WACCC 6 and a.5% uh net present value rises to 7.44 44 million and a higher WACCC 10 and a half% uh NPV actually drops to 4.04 million. So even in a high interest rate environment 10 and a half% the project remains comfortably profitable. And finally my final recommendation uh is to accept the project. So for my rationale my rationale the financials the project clears a hurdle rate with a healthy safety with a healthy safety margin. It can withstand a weighted average cost of capital increase of over 8% before becoming unprofitable. For sensitivity, while a 20% revenue drop uh turns the net present value negative, this is a drastic scenario. Break even analysis analysis suggests we only need to achieve roughly 85 to 90% of our revenue targets to break even. And finally, strategy. A flagship roastery uh is not just about coffee sales. It acts as a marketing hub that elevates the brand image, likely supporting sales in standard stores. And finally, all my collab uh my collab notebook uh showing all my uh Python code to help me come up with all uh uh the timelines and the uh sensitivity analysis for the net present value impact. Um we can see this is kind of like the input parameters, the revenues year through 10. Uh the marketing, the fixed operating costs which are annual that you can see right here. It's recognizing that it's a straight line depreciation. right here it's building the actual cash flow schedule calculating the operations taxes uh year 10 adjustments u it's converting to data frame for uh the nice viewing so it's putting it all into that schedule for me so and number three it's calculating the metrics right here uh converting the financial cash flows column to a list for calculations you can see so it's uh converting that column uh to where so it displays all the answers right here it's kind of creating like the visualization for it to make it look nice. Uh the sensitivity analysis, these are all the um formulas for the sensitivity analysis that I showed you. And then finally uh scenario B, which are the weighted average cost of uh capital changes.",
  "video_url": "https://www.youtube.com/watch?v=6idNJ01-5jI"
}