{
  "student_name": "Max Vogt",
  "org_defined_id": "035680961",
  "username": "vogt14",
  "email": "",
  "transcript": "Okay, so for this assignment, we are going to investigate the GME short squeeze from 2020 to 2021. So for our defined discover, our primary objective is to investigate the GME short squeeze from 2020 to 2021 to test the validity of efficient market hypothesis and evaluate the role of behavioral finance in explaining the observed price behavior. Our key question is which form of market efficiency was violated and could a rational investor have systematically profited after adjusting for risk? And our information, we have GameStop traded at $0.04 in August 2022, which actually is false. According to Google Finance, GameStop traded at $1.04 in August 2022 up to $1.67 by the end of August. And this is using split adjusted data from a split app in the future. So realistically, it'd be higher, but we're using this for the rest of the assignment. So my represent stage, we are going to investigate the GME stock. We'll use CAPM to calculate the daily abnormal returns. The estimation window will be used to run an estimate on GME's risk against the S&P 500, then calculate the average returns and find the cumulative abnormal returns, which will be the main evidence of the market inefficiency. We will then analyze the behavioral factors to find the persistent mispricing in the context of limits to arbitrage and hurting behavior arbitrage. So, for daily return, it's going to measure the stock price change from one day to the next with percentage gains or losses using return on day, price at the end of day T, and price at the end of the previous day. We have CAPM expected returns to estimate what return a stock should have been based on risk, and that will be using expected return, risk-free rate, sensitivity to market, and market return. Then we have Abnormal Return, which will show actual daily returns differing from the expected, which uses actual daily return and expected daily return from the Kappa model to get that. Then we are also using Cumulative Abnormal Return, which adds up abnormal returns across event windows, and we will be using Abnormal Return on each day, and then Start and End of the event window will also be used. So to implement this, I made a code using Gemini. I implemented it into Colab to find the beta estimation, the car calculation, and then a t-test for statistical significance. So right here I have it. So the first part where it's going to load tools such as Y-Finance in order to get the stock data. It uses Pandas for handling data and NumPy for math and stats models to run the CAPM regression. And then it defines the time frames estimation window, which is where the model learns the GME's normal behavior, which is also the period for testing. And then it will download GME's price history and the S&P 500's market index for the time period. And then it will convert daily prices into percentage returns and give us the data that we need. So, when we run this, it gives us our beta estimation, our AR and CAR calculations, and our validation. So, from this, we get a beta estimation of 1.6024, which indicates that GME was already 1.6 times more volatile than the overall stock market before the main shortage squeeze event. And this is a key risk factor. And then we have the CAR value of 347.78%, which means during the two-month period, GME's price increased 347.78%, more than what we expected. This shows its severe market anomaly. We then have a t-stat of 7.51, meaning the car is many standard deviations away from zero. From this we can conclude that the car is overwhelmingly significant and cannot be justified by conventional CAPM risk factors. So, to validate this, like I said, we're going to use the t-stat of 7.51, which is extremely high, which means the car is statistically significant, and then the rest of the calculations are correct based on the equations listed in the represent stage. And then we can move on to evolve. so the car three hundred forty seven point seventy eight proofs any strong form the image violation the market failed to rationally process public information surrounding the extreme short an activist investment this was sustained by the hero finance factors mostly coordinated and hurting mostly coordinated hurting by retail traders which exploited the limits to arbitrage this demonstrates that systematic risk adjusted profitability was not available for those who try to restore efficiency so basically that the uh... The numbers that were presented are way off from what was expected and none of these models could really predict it because it is such a gap. Something else would be hurting by retail traders completely exploited this and completely passed the models that we were given. So then with the for the reflects we could use this message methods for other Like strange patterns in the market just to see if they could have been predicted or even like try to predict them But it's also the main idea is kind of that You can't predict the market all the time and there are some calculations some things that the calculations won't show Like your cap and pricing and stuff like that will not be able to show it and that's like the market can be extremely affected by hurting behavior and it can overwhelm conventional trading so basically like people can just there there are factors that can completely change the market that can overwhelm like the usual conventional trading strategies and just conventional estimations and value and stuff like that so this whole thing really just shows that based on the prices of the stock throughout that it kind of shows that none of our models could predict it And it was kind of just caused by hurting my retail investors. And it's really just kind of a bit of an anomaly in the stock market. So yeah, that's all.",
  "video_url": "https://www.youtube.com/watch?v=DBwtyW_99TA"
}