{
  "student_name": "Abha Gupta",
  "org_defined_id": "037604525",
  "username": "gupt1107",
  "video_url": "https://youtu.be/KuA14sZy7UM",
  "transcript": "Hi, my name is Aba and this is my session 11 assignment for management 310. Um, so for this assignment, essentially I was using the driverbased framework um to do a to look into Apple's hypothetical 90 billion share repurchase program. So, I'll walk through each stage of driver framework while demonstrating how my Python model evaluates um Apple's capital allocation choices. I'll make sure to reference certain sections of my code throughout the presentation and also interpret some of the tables and charts and then conclude with a recommendation grounded in value creation, stakeholder incentives, and financial theory. So before I start going into my code and my evaluation, I just wanted to preface that I did use um an AI chatbot to help make sure my code was as efficient as possible and hit all the requirements um in the assignment. So I just started off by importing all my Python libraries. And then for um the PD library, I set all the graphs and charts I'm making to just two decimal points so it's easy to understand. So I began with the define and discover stage. So the central decision of Apple faces is whether deploying $90 billion of its available 165 billion in cash towards a buyback program creates a meaningful value um relative to alternative use of capital. such as issuing a special dividend, making an AI or BR acquisition, reducing debt, or scaling R&D.\n\nApple scales at um or Apple trades at $185 per share with a PE ratio of 30 and has a 15.5 billion shares outstanding, giving it a large market capitalization and substantial free cash flow of roughly hundred billion annually. Stakeholders include Birkshshire Hathway with a 6% ownership stake, the CEO with 3 million shares, retail investors holding around 100 shares each, employees with stock options at $170 strike price, and bond bond holders with an exposure to Apple's $110 billion debt load. All these facts are incorporated directly into the baseline state of my model right over here in this area right here. This these upper areas over here basically outline the overall data class of the company state and then this one the compute derived metrics where there the values the variables are assigned and then here the variables are initialized with the values. This also ensures that my model begins from a realistic and transparent financial depiction of Apple. Since driver requires that divide and discover occur before any coding or analysis, establishing this foundation is essential. Now moving into the represent stage, I construct the architecture of the model before executing any calculations. So again I define a data class called company state which stores Apple's financial and stakeholder attributes. This structure keeps the model organized and allows each scenario to modify Apple's state in a controlled way.\n\nI also build the core computation function called compute derived metrics which calculates EPS implied share price um market capitalization oop sorry market capitalization leverage ratios and stakeholder values. Its EPS calculation is pretty straightforward shown right over here. And the implied share price uses a constant PE um assumption which is shown right here which is just the EPS times the state um PE ratio. This representation ensures that any change in EPS feeds directly into valuation enabling a consistent comparison across all scenarios. Since the assignment requires quantifying stakeholder outcome, the function also computes um the Birkshar's holdings, the CEO's share value, and the retail value, and the employee um option value down over here. With this structure fully mopped, I proceeded to the implement stage. In the implement stage, I began coding um in the buyback scenario, Apple repurchase shares using um this shares reper variable which takes the effective buyback and divides it by the average buyback price. And then using this new this new state shares outstanding variable subtracts it from the shares reaper um to reduce shares outstanding. The shrink the this shrinks the share count and increases EPS mechanically without increasing Apple's underlying profitability. The dividend scenario simply pays out cash shown right here which is the new state cash. Um oops\n\nwhich is the new state cash um subtracting the dividend per share times the share outstanding. The acquisition scenario models true value creation by increasing netcome net income. The debt the debt reduction scenario implements interest savings. And then the R&D um scenario models multi-year compounding of innovationdriven income growth. And just to show it again, here's the acquisition scenario, here's the debt reduction scenario, and here's the R&D scenario.\n\nBy implementing these scenarios, I run the full model um in this run all scenarios function that I made which produces um at the bottom over here a comparative table and in the evolve stage I also generate a second table showing the effects of alternate alternative assumptions. Um the table displayed in the notebook titled the scenario um comparison just shows the different types of scenarios and then shows the all the different metrics which can be calculated such as the EPS, the implied share price, the market cap, net debt, debt to market cap, net depth to market cap and then the birkshare v value, CEO value, retail value and then the employee option intrinsic. Then over here the alternative um the alternative assumptions table is shown as well.\n\nThe alternative scenario is shown over here. Um\n\nit lists the EPS the implied share price and the debt to market cap for each scenario. In the baseline, the EPS is approximately 6.17 and the implied share price remains at $185 and the reduction in share count on the numerator stays constant um as well. The implied share price increases to $189.63 because EPS is multiplied by the PE ratio in the buyback area. The debt to market cap ratio remains at 04 because the buyback draws from cash not debt. The special dividend scenario mirrors the baseline. EPS and share price remain unchanged at 6.17 and $185, illustrating that dividends do not increase earning power or valuation. They simply transfer cash to shareholders. The acquisition scenario stands out. EPS increases to 6.86 86 and the implied share price rises about to $25.90.\n\nThis increase occurs because net income rises through ROIC driven returns reflecting genuine value creation. Debttomarket cap falls slightly to 0.03 because the acquisition increases market cap more than it reduces cash. And then the debt reduction it increases EPS to 6.35 through interest savings raising the implied share price to 19050. More importantly the debt to market cap falls dramatically from 04 to 01. This outcome clearly demonstrates how deleveraging creates credit stability and lowers risk for bond holders. And then finally in the R&D scenario it produces the highest EPS in the analysis at 8.25 25 with an implied share price of 24757. This scenario represents long-term innovation compounding showing that significant R&D investment can produce outcomes far superior to buybacks if executed effectively. Now directly beneath the table, the EPS bar chart visualizes these differences. Um the chart immediately shows the hierarchy of EPS outcomes. The R&D scenario towers above the others at 8.25 25 acquisition follows the debt reduction buyback with dividends and baseline tied at the bottom. This chart effectively communicates to executives how each capital allocation decision shapes earning power. It highlights a critical insight buybacks while boosting EPFS in the short term are outperformed by scenarios that invest in a long-term growth or financial strengthening. The visual therefore makes the trade-off between short-term optics and long-term value creation very clear. Now moving to the validate stage. I check whether the model behaves according to um the financial theory. The buyback scenario correctly right over\n\nright over here. The buyback scenario correctly increases EPS through share reduction rather than high profitability. The dividend scenario keeps EPS constant. The acquisition and R&D scenario raises net income and consequently EPS demonstrating real value creation. The debt reduction scenario lowers the leverage ratio significantly aligning the bond holder preferences and strengthening Apple's financial profile. The table and chart both reinforce these expected relationships confronting model validity.\n\nIn the evolve stage, the example whatif table shown right here reflects scenario sensitivity testing you testing that is done using this run custom scenarios function. This stage demonstrates how adjusting buyback size, acquisition ROIC or R&D uplift changes outcomes. Um for example, in the displayed output, the acquisition scenario yields a notably higher share price and EPS because the ROIC assumption is raised to 12%.\nFinally, in the reflect stage, I interpret all outputs holistically and deliver my final recommendations. The results show that buybacks provide a modest EPS uplift but do not create economic value. They merely redistribute value to remain shareholders remaining shareholders. The acquisition and R&D scenarios meaningfully increase net income, share price, and strategic capability, demonstrating genuine value creation. Debt reduction significantly improves leverage and bond holder security. R&D is the top performing scenario in terms of long-term earnings power, but it carries execution risk. Given these outcomes, my recommendation is that Apple should not allocate the entire $90 billions to buybacks. A blended strategy, moderate ongoing buybacks paired with increased R&D and a selective strategic acquisitions along with measured debt reduction best balances stakeholder incentives, mitigates agency issues, enhances long-term strategic positioning, and supports sustainable value creation. This recommendation aligns with the scenario analysis, the theoretical underpinnings of corporate finance and Apple's brand identity as a company driven by innovation rather than pure financial engineering. Thank you."
}