{
  "student_name": "Priya Gaddam",
  "org_defined_id": "037145385",
  "username": "gaddam10",
  "email": "",
  "transcript": "Today we'll be investigating the GameStop stock and looking at the event during 2020 and 2021 as a case study for testing the efficient market hypothesis and evaluating behavioral finance explanations. And we're going to be using the driver framework to look at this analysis. And I use Gemini to um create the code and the outline, but I validated the outputs and the analysis myself. So first define and discover. So the main objective for this analysis is to determine which forms of market efficiency were violated by the game stock um price surge and the crash as well. And so to anal and so to figure this out, we're going to be using the EMH and behavioral finance concepts. So first we have to verify a fact. We were given this fact to verify. GameStop traded at 4 cents in August 2020. So, we have to verify that. And through research, we figured out that this result is incorrect. And historical data in August 2020 shows that the GameStop stock was trading in the range of a dollar 4 cents to $167. and the closing price on the 31st of August was $167. So, we're going to document this discrepancy in the data section of the final report and state the accurate price range. And the source that I use for this was Yahoo Finance. And it's important to um correct this fact since the initial stock price as the baseline for measuring abnormal results. So, here's just a quick event timeline. So in August 2020, we can see that GME nears bankruptcy levels. And this is relevant to EMH because this establishes the fundamental value baseline of $10 to $40 in our analyst range, but it could also be potentially lower. And then in September 2020, um Ryan Cohen acquires a 13% stake. And this public information is used to test semi- strong EMH. And then in January 2021, uh this was a peak period for testing abnormal returns and identifying behavioral biases. And then in the peak of January 2021, the short interest peaked at 140%. And this is a key market microstructure anomaly. And then again, this there was also trading restrictions in trading apps such as Robin Hood. And this shows limits to arbitrage and market microstructure failure. And then in February 2021, there were congressional hearings to talk about policy implications and regulatory responses due to market surges and then falls. Now the represent stage. So we're going to be looking at an analytical methodology, an event study. And we're going to use this methodology to quantify market inefficiency by calculating abnormal results. abnormal returns. And so first, the estimation window is going to be August 2019 to August 2020. And we're using this time frame to estimate normal GME risk for the beta. And then the event window, so when everything was going on, we're going to be looking at September 2020 to March 21st, 2021. And this is the entire period where the stock was rising and everyone was investing. And the model we're going to be using is the CAPM model. And this model, we're going to use this to require to um calculate expected returns. And just real quick, here's the formula for that. And so the AR t is the abnormal return and the cumulative abnormal return will be the primary measure of sustained market inefficiency. So the plan to test this is we're going to be looking at the EMH form, the core test, the expected GME finding, and we'll be looking at any violations as well. And so the weak form, we're going to be testing if C is significantly non zero following the initial surge of the stock. And we expect to see that the rapid non-trendbased surge and crash strongly suggest past prices had no predictive power. And there is a violation here because the systematic pattern was not reflected in the price history until the massive spike. And then the next form semi- strong um we're testing if the AR is non zero after public events such as the common sake and the news about the interest surge. And so our expected finding is that the price search far beyond fundamental analyst estimates for a sustained period based on public short interest data and social media shatter. So yes, there was also violation for this one because public information was misinterpreted um leading to massive sustained mispricing since there was a lot of misinformation being spread around since a lot of people were talking about it. Next, the strong form. We're going to be testing if hedge funds or insiders profited or avoided losses systematically. And so our expected finding um Melbourne Capital sustained a 53% loss and their system prevented their insider knowledge of short capacity or risk from generating profit. And there could be a violation here um if any group fails to profit from private info. And the violation here is due to misconstructure limits and not any information asymmetry. So now the implementation stage. So to this stage will involve data retrieval and statistical modeling using Python. And so the first step data retrieval and preparation we use the Yahoo Finance library to download GME and a market index and adjusted close prices for the required windows. and we'll be calculating log returns for both of these assets and then second event study execution beta estimation. So we're going to be running calculations to find alpha and beta and then the ar and c calculation. We'll apply the estimated alpha and betas to the event window to calculate um er ar and c. And then statistical testing. The core test is checking if the C at the peak um the end of January 2021 is statistically different from zero. And to do this, we're going to be using a t test. And then we'll look at the standard deviation of AR from the estimation period for this standard error calculation. So here's the code. The first step was to download everything and to make sure the code was set up. So it had the library of data that we were going to use from Yahoo Finance. And just to make sure that everything is verified. So we can see here that setup data fetch and price verification. So here are parameters. We entered the start date and then the end date. And then fetch data. We downloaded the data from Yahoo Finance. And then just cleaning up that data as well. And so we run that. We'll have downloaded all the data. And then event two is the actual calculations. So, we're going to um define our event date, so when it first started and then like all the different surges of the stock and then our parameters and then here are some equations to find the alpha and betas before the event, during, all that. And then here are some more um calculations and just data um inputs. And then we also have a graph here just to show how it changed over time the C. And so when we run the code we have these this is our results. So we can see that in September 21st we had an alpha of about.15 and then a beta of -23. And we can see how that changed over time. So over time the alpha slowly decreased while the beta increased. And um we can see how the C at first it was negative and then it went up and then it went down again in January. And this is just like after one day. So we can see how even though it's just one day the values changed a lot. And then the mean AR at first it was negative then it went up and then went down again. And the C um it went up in January and then down again a day later. And so here's the graph that just shows the changes in the C over these time periods. So we can see how it decreased but then increased in January. And so based on the C values, we can come to a conclusion to reject our null hypothesis. And so in September 21st, there was significant inefficiency. So the price was significantly lower than the expected price showing a negative market reaction or like continued pressure on the stock. And then there was also an inefficiency again in January except this time it was much higher. So the price was massively and significantly higher than the expected price precisely where the short squeeze peaked and this is a severe violation of the semi- strong EMH and then in the day after this there was also extreme efficiency and so despite a slight drop from the 27th the market remained severely mispriced with the car being overwhelmingly positive and the t stat being highly significant. So our final conclusion for our calculated values, all three event windows show a statistically significant abnormal return as the absolute value of the T car is much greater than the critical value of two. And this means that the GME event provides strong quantitative evidence that the semi-rong form of the efficient market hypothesis was violated during periods of high volatility and confirming the need for a behavioral finance explanation. So basically it can't be explained that well using mathematical equations and we'd have to look at more of the events surrounding this um time and we have to look at what was going on during in society. So our behavioral finance analysis we can look at behavioral biases and the primary driver was hurting fueled by the availability heristic. So, social media attention. If you're on social media and you saw that the stock price is increasing, this would motivate you and others to invest in the stock as well to obtain some of the benefits and additionally intense overconfidence by retail traders and their collective ability. The initial short interest data served as an anchor for the narrative. Um there were also limits to the arbitrage and this is the key EMH defense. So rational arbitrators knew that GME was overpriced but they couldn't systematically profit because of um variables like the noise trader risk and implementation cost/market microructure. Additionally, with rational investor probability um and X anti no rational investor could have predicted the exact timing, scale or duration of the squeeze. So profitability was not systematic since it happened all of a sudden and no one really expected it to happen. And then expost the astronomical returns were a result of taking on extreme non-diversifiable risk and the volatility was so high that any positive risk adjusted return for the peak buying period would be extremely low. suggesting that profits were largely compensation for taking massive risk and not exploiting a predictable arbitrage. So some theoretical implications um violation of the EMH. This large statistically significant cumulative abnormal return found during the GME event um demonstrates a clear violation of the semi- strong form of EMH and the market price was sustained far above its intrinsic value despite all relevant information. um such as um social media since it's all public information. And so just to um review, the behavioral drivers that caused this were hurting. And so investors collectively followed the actions of the group to achieve a shared goal. um the availability horistic viral social media coverage caused investors to overestimate the profitability or the probability of continued exponential returns and then limits to arbitrage. So rational investors could not correct the mispricing due to high noise trader risk and market microructure issues. So now evolve the shift and theoretical framework. So, EMH versus behavioral finance framework. The GME event highlights that markets are efficient most of the time but can exhibit periods of extreme pathological inefficiency. And so, the price surge violates semi- strong form because public information has led to a sustained non-fundamental price bubble. And the better explanation for this scenario would be the behavioral finance framework which accommodates persistent mispricing when limits to arbitrage are binding. And so finally reflect um practical and policy consequences active versus passive management. This event provides anecdotal evidence supporting active management um in particular the trend following and momentum strategies driven by sentiment but only for those with an extremely high risk tolerance. For the majority of capital, GME confirms that attempting to chase these anomalies um is likely to lead to losses supporting the long-term viability of passive index investing. And additionally, policy implications. The event exposed critical vulnerabilities in market infrastructure, particularly the settlement speed and the opaque nature of short interest in darkpool trading. And so policy discussions now center on increasing transparency and potentially speeding up settlement times to prevent such dramatic and disruptive failures of market liquidity. This is my GME market efficiency analysis using the driver framework. Thank you.",
  "video_url": "https://youtu.be/oBpzKzNN3EQ"
}