{
  "student_name": "Clara Weinzapfel",
  "org_defined_id": "036170079",
  "username": "cweinza",
  "email": "",
  "transcript": "Hello my name is Clara Weinzapfel, and today I'm going to be going over the session 9 assignment. So I started in the textbook and read through the assignment and then I copy and pasted it into Google Gemini where I asked it to give me a Python code. I then copy and pasted the Python code into Google Collab. This presentation outlines the weighted average cost of capital or WACC analysis for Netflix tied to a hypothetical $5 billion content investment. We have followed the required driver framework which I asked Google Gemini to do and then the initial define and discover stage established the goal calculate WACC compare it to peers and recommend an optimal capital structure. We determined the inputs such as the $200 billion market cap 1.3 equity beta and 21% tax rate for the implementation phase. As you can see in this section here and the parameter section and then moving on to implementation. The analysis moves into the implementation stage using the Python script shown here. We walk through the code blocks in order. So section one the script starts by defining all the necessary financial inputs. These include the market values for equity and debt which is going to be right here as I kind of just went through the beta 1.3 and the cost figures like the risk free rate and the pre-tax bond yield of 0.058. Next, the two key components of WACC are calculated. First is the cost of equity in this line here. This uses the capital asset pricing model CAPM. The risk-free rate 4.5%. Plus the risk premium 5.5% scaled by the beta 1.3 gives a cost of equity of 9.65%. And then the after tax cost of debt right here. This demonstrates the tax shield effect. The pre-tax cost of 5.8% is reduced by the 21% corporate tax rate resulting in an after tax cost of 4.58%. This is significantly cheaper than equity. Then moving on to section three WACC calculation function. This section defines the core logic. The function here takes the component costs and market values, determines the capital structure weights and then computes the WACC using the standard formula. This ensures a technical implementation is correct. And then moving on to section four which is the required analysis execution. The script now executes the two primary required calculations. So first is the current WACC. Using the current market values the calculated current WACC is 8.04%. This WACC is the hurdle rate for all average risk projects at Netflix. And then second is the WACC after $3 billion debt issuance. We model the $3 billion additional debt in this. This increases the total debt to $16 billion. the WACC is recalculated and drops to 7.95%. This is because the company is utilizing a higher proportion of cheaper debt. And then we move on to evaluate and recommend the quantitative results from the code now lead to this stage. So you can see here in this section is the summary output and It outlines all of that here and all of the values that I talked about are put into this section here. So the firm YW WACC at 8.04% is a starting point. We must access it if it is appropriate for all projects. for US content. If the risk is similar to the firm's average, the 8.04% WACC is suitable. For international content, which often carries higher operational and political risk, a project specific WACC must be used. The adjusted rate would be higher than 8.04% to ensure the investment is properly compensated for the higher risk. So that is evaluation one and for evaluation two is the peer comparison. So we compare Netflix's costs of capital to its peers. Netflix current WACC 8.04% is within the industry range which is between 8 and 10% and slightly below Disney's which is 8.2%. The explanation for the difference lies in the capital structure analysis. Netflix is highly equity financed meaning its WACC is dominated by the high cost of equity which is six which is 9.65%. Disney has 30% debt. Netflix's low leverage limits the power of the tax shield which is the tax deductibility of interest expense. And then for evaluation three, optimal capital structure strategy. Based on the analysis, a recommendation for the optimal capital structure is required. The reduction in WACC from 8.04 to 7.95 after the new debt proves that increasing leverage is beneficial. The recommendation is that Netflix should continue to increase its debt utilization toward the peer average. for example, 15% to 25% debt weight. This will continue to lower the WACC, making it easier for the company to clear the hurdle rate and accept more value, creating content projects, thereby maximizing shareholder wealth. And then now on to generalize and reflect. The final stage of driver involves this. So we generalize that WACC is the foundation for corporate capital budgeting decisions. A sound WACC calculation is necessary for accurate NPV analysis. We reflect that Netflix's financing strategy is currently overly conservative. The ability to issue $3 billion in debt without a significant change in the cost of debt suggests they have substantial capacity to take on more leverage and optimize their capital structure for a lower overall cost. Thank you. And then just to finish off, I'm going to do a walk through of the output from the Google Collab Python code. So first is the WACC calculation summary where the cost of equity is 11.65% and the after tech tax cost of debt is 4 58%. Then moving on to the current WACC analysis, the debt weight is 6.10%, the equity weight is 93.9% and then the current WACC would be 11.22%. And then lastly, the WACC after the $3 billion debt issuance. So we see that the new debt weight is 7.41%. The new equity weight is 92.59% and then the new WACC is 11.3 11.13%. And it tells us that the impact is that the WA CC decreases by 0.09 percentage points. So that concludes the Python code and the session 9 assignment.",
  "video_url": "https://www.youtube.com/watch?v=eLVuTFCvoMY"
}