{
  "student_name": "Sophia Solomon",
  "org_defined_id": "035754030",
  "username": "solomo24",
  "email": "",
  "transcript": "Hi, my name is Sophia Solomon, and this is my session 10 assignment, Capital Budgeting and Investment Decisions. So to begin with an overview from the textbook, it said, Evaluate Starbucks' proposed flagship roastery that requires a $12 million upfront outlay and is expected to operate for 10 years. Use the firm's 8.5 WAC as the huddle rate to determine whether the project creates value and to recommend and accept or reject decisions supported by the driver documentation. So to go over some of the parameters, we have an initial investment of $12 million, a working capital of $500 ,000 deployed at a launch and recovered in year 10, revenues are $8 million in year 1, $11 million in years 2 -5, and $9 million in years 6-10. Our operating costs is COGS 40% of revenue, labor $2 .5 million, rent and utilities $0.8 million, marketing $0.3 million in year one, and then $0.1 million thereafter. Our taxes are 25% corporate rate, a terminal value of $3 million at the end of year 10. So for our financial analysis requirements, it gave us the four different requirements, so I'm going to be walking through those now. So to begin, it asks us to build a zero to 10 incremental cash flow schedule that includes revenue, operating costs, depreciation, tax yields, taxes, working capital changes, and terminal value. So with the help of Google AI and Google Gemini, I have created this. So the first step was to calculate the annual earnings before interest and taxes EBIT. So it gives us year one. The date's kind of messed up, but it's supposed to be five through, I believe, nine and then 10 through the end of the year. So it has our revenue, our COGS, which is the 40% of revenue as listed earlier, our labor, rent and utilities, marketing, depreciation, and then it gives us our EBIT amounts. From there, in year two, we can calculate the annual operating cash flow, the OCF. Again, the dates got messed up, but one and then five through nine and 10 through 12. We took our EBIT from the following step with our tax rate. we multiplied those together, subtracted to get the EAT, the depreciation, and then the OCF value is there as well. For step for three, we can calculate the free cash flow. Same thing for the years, but we have zero, one, nine through nine and 10, and then 10 through 12. So it works through that to give us our free cash flow values. And then the 10 year straight line depreciation years, zero through 10, we have our initial outlay, our change in NWC, our OCF terminal values, free cash flow present value factor and then our present value so now in here again um again with the help of google gemini we have the operating cash flow calculations for years one through ten and that is how it was calculated there and then for step two um calculate the net present value irr discounted payback period simple payback period and profitability index using the starbucks SWAC, we can calculate the new net present value, which is the sum of present values of all free cash flows. So we use this formula right here. When we do that, we get this value of about 1.6 million. So we can see that this is going to generate a return greater than the 8.5% hurdle rate. So then we can calculate the IRR, the internal rate of return, which is the discount rate that makes the project's net present value equal to zero. So in this case, it is an 11.23% which is greater than the WAC of 8.5 making this project acceptable. Now for step three we're going to run the sensitivity analysis for a revenue reduced by 20% and b a WAC of plus or minus 2% and then we're going to summarize this impact on the net present value and the IRR. So as we can see in this table again from Google Gemini we can test the sensitivity that it changes in the hurdle rates and the average annual revenue from years two through five. So the results show that the project is highly sensitive to revenue and a 10% decrease is expected revenue across two to 10 years causes the NPV to become negative. So this shows that the project's success is very dependent on hitting its sales targets. For number four, we provide a recommendation that weighs financial results, strategic fit, brand implications, and key project risks. So this Starbucks flagship grocery project is a high risk, high reward project. So for our financial results, it's very financially attractive underneath the calculations we made earlier of the NPV around 3.2 million and IRR which is 13.31 as listed it was very as stated earlier it was a lot higher than our hurdle rate at 8.5 percent and then the PI of 1.25 return so it's about a dollar and 25 cents in present value for every $1 invested. So for our key project risks, the revenue volatility is the sensitivity analysis shows a 20% drop in revenue would result in a massive negative NPR and IRR less than 1%. So the projected high revenues are the single largest risk factor. In addition, there's a long payback period. It would take about 7.71 years in long for a 10-year project, meaning Starbucks won't recover its capital on a discounted basis until the end of the project's life so for strategic fit it's a third place strategy which offers a premium experimental and high margin environment that differentiates the brand from competitors and then finally brand implication is the roastery enhances the luxury and artisanal perception of starbucks which supports pricing power across the entire retail network and providing a platform for innovation so the final recommendation is to accept the project but with contingency planning so although the financial metrics are excellent in the base case the extreme sensitivity to revenue dictates a cautious approach the project should be accepted primarily because of its strong strategic fit and positive brand implications with support the high revenue assumptions management must prioritize strategies to mitigate the high revenue risk which could be establishing pre-opening marketing for the first years of sales, implementing aggressive cost controls, different measures, and then finally integrating the roastery into the global supply chain to maximize its operational efficiency. Thank you.",
  "video_url": "https://youtu.be/7PU4aiczj8M"
}