{
  "student_name": "Disha Rathod",
  "org_defined_id": "037279221",
  "username": "rathod3",
  "email": "",
  "transcript": "(Speaker 1) Hi, so this is my session 8 assignment. So for session 8 assignments, so the overview is that we want to investigate market efficiency using the GameStop short squeeze event of 2020 -2021 as a case study, verify the accuracy of state of facts, analyze price behavior relative to efficient market hypothesis predictions, and evaluate whether market anomalies constitute evidence against market efficiency or can be explained within existing frameworks. So for the first define and discover stage, so this stage focuses on understanding the problem, making sure facts are correct, and we want to find the main goal and the scope of the analysis. So the primary goal is to investigate market efficiency using the GameStop short squeeze as a case study. So this analysis must determine which form of the efficient market hypothesis was violated and whether the observed price behavior can be explained by traditional frameworks or requires behavioral finance concepts. The objective is to produce a rigorous data -driven analysis. (Speaker 1) that assesses the GME events implications for the Efficient Market Hypothesis and provides a balanced comparison between Efficient Market Hypothesis predictions and behavioral finance explanations. So for fact verifications, so The claims says that GME traded at $0 .04 in August 2020 and we should probably verify this as this is a critical prerequisite before proceeding with any analysis. So the stated price is $0 .04 and it's mostly wrong because in 2020 there was a it was a price of four to six dollars. So what we did is that we found the actual closing price for GME in 2020 through some research and And because of this... since this was incorrect, the accurate figures and a professional correction approach must be documented within the code and everything. So, key questions to answer. (Speaker 1) So, was the price of .4 cents in August 2020 accurate? And it's not accurate. It was between $46. And we'll answer that later on as well. And which foreign market efficiency, weak, semi -strong, or strong, was violated by the GME event? Could rational investors have systematically profited from this event? (Speaker 1) And what does this imply by the predictability of returns? And how do behavioral finance biases, like hurting or angering, explain the observed price anomalies? And what are the theoretical and policy implications for active versus passive management and market regulation? the first step. The second is represent, which is the plan. So this stage defines the analytical and technical steps required to address the key questions and achieve the assignment goals. (Speaker 1) So we'll be using important formulas and methodologies. So this analysis will be centered on the event study methodology to test for abnormal returns, which is crucial for evaluating market efficiency. So for the formula for abnormal return, so we know is that abnormal return equals your actual return minus the expected return. And the capital asset pricing model, which is also CAPM, will also be used to estimate that expected return. And expected return formula using the CAPM model is expected return equals risk -free rate plus beta times the market return minus risk -free rate. Now for the analytical process. (Speaker 1) So step one, data acquisition verification. This is for critical gates. So is a critical important thing to do. So we want to acquire historical daily stock price and volume data for GME from August 2020 to the present in a relative market index. We get this from S &P 500 and we want to verify the GME price in August 2020 and document the correction. (Speaker 1) Step two is to weak form efficiency test. So this shows the price patterns. So we want to analyze GME's price movements before the squeeze to identify unexploitable non -random patterns, calculate abnormal returns and cumulative abnormal returns around key event dates using the CAPM framework. And then we also want to test for statistical significance of Abnormal returns and cumulative abnormal returns and the existence of statistically significant abnormal returns suggests a violation of weak form efficiency. The third step is semi -strong form efficiency tests. So we want to compare the speed of price adjustment to major public views against the event timeline. (Speaker 1) And the massive price surge despite fundamental analysis Analyst estimates of 10 to 40 dollars per share which suggests a market reaction beyond public fundamental value potentially violating semi strong form efficiency The fourth step is strong form efficiency tests. This is more like insider private information So for this you analyze the required data points and the resulting hedge fund losses so like short interest peaked at 140 percent of flow and because of hedge fund losses, Melbourne Capital sustained a 53 % loss. Evaluate whether insiders and regulators could have profited systematically based on non -public knowledge. the extreme short -selling position, though this is difficult to prove empirically. For the fifth step, this is behavioral finance analysis. So we want to identify and analyze specific behavioral biases. (Speaker 1) So herding behavior, this is like Wall Street's best influence, social media influence, loss aversion. and stuff like that, and then also discusses limits to arbitrage, why the price disconnect from fundamentals persisted. The last step, Step 6, is Rational Profitability and Theoretical Implications. So, evaluate the high -risk, non -systematic nature of the profit opportunities to assess if they were truly systematic for a rational investor, and focusing on X -Sand vs. X -Post analysis, and we want to synthesize the findings to compare the EMH framework with the behavioral finance explanation. So, for this, we'll be using Python coding and Google Colab, and we will look at that in the implement stage. So for my code, I put into Gemini my prompt, and it provided me with this code on the side. (Speaker 1) Then I exported it into Colab. Here it is exported. So this one is good. It shows how we're looking for GameStop GME, and then it talks about then it also talks about like an analysis from 2020 so lowest price of august 2020 and um the conclusion is that the four cents thing is incorrect um as we know and then um it gives some things for squeezing peak rise, peak date. um and that's kind of like the code and then we're gonna we run this if we run this it provides us with this output so our gme which is your game stock price analysis so the lowest price gme traded in august 2020 was one dollar and so the conclusion is that the statement gme traded at four cents is incorrect and the actual low was around one dollar analysis for the 2021 squeeze is that the highest price gme traded for during the Jan or Feb of 2021 was $120 .75, and this peak occurred on January 28, 2021. (Speaker 1) So the conclusion is that the statement price surge was $483, which is accurate. I'm going back to the implement stage. So the goal is to execute the core event study calculations and build the empirical analysis required to test the efficient market hypothesis. The action is to build a model using Python, So the critical first step is fact verification and correction. So the initial claim was that GME traded at $0 .04, which is incorrect. So the correction is that the actual split adjusted closing price for GME in August 2020 was the range of approximately $1 .04 to $1 .67. (Speaker 1) For methodology, all calculations will use accurate historical price data for financial analysis and calculations. The analysis uses a CAPM, which is the Capital Asset Pricing Model, to calculate the market -adjusted abnormal return. So the formula for CAPM for abnormal return is GME actual return minus the risk -free return plus GME risk level times the market risk award. Some data inputs, which is assumed is that the estimation period is January 1, 2020 to January 31, 2020, which is 148 trading days. Your market proxy S &P 500 index for risk -free rate is an assumed leverage of 0 .10 % over the period. (Speaker 1) Then we talk about beta estimation. So the beta is estimated from the pre -event estimation period to represent GME systematic risk under normal market conditions. So this is the abnormal return formula again, as we mentioned before. So now we're going to go more in -depth in explaining. So our GME beta, that's your metric, the value is 1 .7. So the interpretation is that GME was 70 % more volatile than the market even before this squeeze. (Speaker 1) This suggests high business risk typical of a troubled small cap retailer. For number two, abnormal return calculation. So this code calculates expected return and abnormal return for the peak and minimum window of January 11th, 2021 to February 1st, 2021. So here again, we have the abnormal return formula. And then we are given the date, GME return, expected return, abnormal return. So for January 13, 21, return was 57 .39%, expected return was 1 .5%. (Speaker 1) So the abnormal return was 55 .89%. For the January 27th of 21, the return was 134 .84%, return was 1 .02%, and abnormal return was 133 .82%. For February 1st, 2021, post restrictions, it was a negative 30 .85 % GME return, a 0 .45 % expected return, and a negative 31 .3 % abnormal return. And then for cumulative abnormal return, there was nothing for a GME return expected return but hypothetically it was around 305 .9 % abnormal return. Then for analytical interpretation which is like market efficiency testing so for the weak form so The car of over 300 is statistically significant. (Speaker 1) This huge return was driven by price momentum and past trading volume, indicating that past price information was not efficiently reflected. For the violation assessment, this was violated. Then the next one is semi -strong form. So the price surge to $483 while fundamental analysis suggested a value of only $10 to $40. So this massive diversion shows the market ignored public fundamental news. So it's also violated. (Speaker 1) And then strong form. The trading restrictions implemented by Robinhood at the peak created an information asymmetry and advantage for those who could still trade, potentially allowing some informed parties to profit in a way that suggests a breakdown of fair access to information, so this was most likely violated as well. Behavioral finance analysis of the failure of the EMH requires an explanation from behavioral finance. So hurting a social media influence so this massive increase in retail trading volume directly corresponds to the positive of normal returns indicating that the returns were not based on new fundamentals but on coordinated collective action driven by social media. for limits to arbitrage. The cumulative abnormal return persisted for weeks because the short sellers losses created an asset substitution problem forcing them to take excessive risk while rationing arbitrage could not correct the price because the capital required (Speaker 1) was too high due to noise trade risk. For a rational investor profitability analysis, so before this fact, which is excellent, so a rational investor based purely on fundamentals, which is $740, would have shorted the stock. But however, due to the unquantifiable risk of this short squeeze, systematic profit was not available in this required margin and model. Volatility made it an irrational bet for systematic investors, and after the fact, which is exposed. While some individuals profited immensely, the opportunity was non -systematic and high -risk. It was a successful speculative bet on an anomaly and not a failure of the EMH in the sense that an average systematic investor could easily and repeatedly profit. (Speaker 1) The fourth step is validate, so we just want to make sure everything's accurate and makes sense. and everything is consistent as well. So statistical validation. So after calculating abnormal return and cumulative abnormal return, we would perform a t -test to confirm if the observed abnormal return is statistically significant. And if the p -value is below the significance level of 0 .05, the results are robust and support the conclusion that abnormal returns occurred. For the logical test check, which is risk return, The absorbed phenomenon is an asset substitution problem and a limit to this issue. (Speaker 1) For asset substitution, so short sellers, they face huge losses. So Melbourne Capital sustained a 53 % loss, which means it had an incentive to take on more risk. Limits to arbitrage, so rational institutions, Institutional investors knew GME was overvalued, but they couldn't exploit the inefficiency because of the high cost and risk of taking a short position, which is because of the short squeeze. And this validates why the price persisted. external benchmarking, so compare the calculated normal return to similar historical short squeezes to ensure the magnitude of the results is plausible for such an extreme market event. (Speaker 1) Five is Evolve, so we're going to have our next steps and everything. So how could we improve by using alternative models? So CAPM limitation critique is that this event study relies on CAPM, which is a single factor model. and CAPM only assumes beta as its only risk that matters. For evolution, we can use a multi -factor model like the Fama -French three -factor model or the five -factor model to calculate expected returns more better. And PGME is a small -cap value stock at this time. (Speaker 1) It's highly susceptible to these other risk factors, making a multi -factor model superior for empirical accuracy. Another thing is modeling behavioral biases. The analysis should move beyond merely identifying biases to potentially modeling them. So, evaluations that incorporate a variable for social media sentiment into the abnormal return calculation to directly quantify the influence of hurting behavior on price changes. Another thing is policy implications. So, this event exposed market myths microstructure issues. (Speaker 1) So the evolution is to discuss the role of payment for order flow and the collateral requirements for brokerage clearinghouses, which were the direct cause of the training restrictions imposed by Robin Hood. And this moves the analysis from purely academic to a practical policy discussion. And lastly, our last stage in the driver process is to reflect. So these are just some key takeaways or lessons that we learned. So the first takeaway is that efficient market hypothesis is a falsifiable in extremes. (Speaker 1) So the GME event provides a strong evidence against the strict forms of the efficient market hypothesis. And this violation of semi -strong efficiency was the most pronounced as the price became completely disconnected from all publicly available fundamental information. The second takeaway is that limits to arbitrage is real. The short squeeze demonstrated that even when a stock is clearly mispriced, which means it's inefficient, rational professional investors may be unable to correct it due to limits on arbitrage. arbitrage, namely the risk of margin calls and capital constraints. And the third takeaway is that the power of social coordination. (Speaker 1) So this event highlighted the new reality that retail investors, when coordinated, can act as massive unified force, which creates behavioral anomalies on a system systemic scale and redefines market risk in the age of social media. So this was for my session eight project. Thank you.",
  "video_url": "https://youtu.be/CbwCz7SmOSw"
}