{
  "student_name": "Van Uk",
  "org_defined_id": "035723111",
  "username": "vcuk",
  "email": "",
  "transcript": "Hello, I'll be doing the session 9 assignment and so the overview is calculate the weighted average cost of capital also known as WACCC for Netflix in connection with the hypothetical $55 billion dollar content investment decision and your analysis must determine current WACC evaluate the impact of additional debt financing says project specific versus firmwide discount rates. and compare Netflix's cost of capital to industry peers. And some hypothetical for the Netflix financial parameters are that the market capitalization is at $200 billion. Total debt is at 14 billion dollar. The depth is at $13 billion. Excuse me. The equity bet is at beta is at 1.3. The bond rating BBB plus which would has a yield of 5.8%. The corporate tax rate is at 21%. The current stock price is at $450 and the market conditions are risk-free rates uh of a 10-year Treasury at 4.5% the market risk premium at 5.5% the media industry WACC range at 8 to from 8 to 10%. The strategic context is Disney capital structure 70% equity 30% depth with a WACCC of 8.2% 2%. Amazon Prime Video uses Amazon corporate WACC at 9.5% and Netflix considering $3 billion additional debit issuance for content investment and so the required analysis are to calculate the Netflix's current WACC determine WCC after three $3 billion dep issuance the value of project specific WACC um compare Netflix WCC to Disney explain differences and recommend optimal capital structure your strategy. And so I put this into Gemini and I'm not going to get into everything that I uh did, but I'm going just break down things that it did. So to start with the strategic imperatives, it says capital structure optimization. The firm must immediately and deliberately utilize moderate depth to capitalize on the tax shield benefits and lower the overall cost of capital. This secured lowcost funding is vital for sustained aggressive content investment project appraisal policy. The policy of using a single firmwide WACC's financially precautious precarious I mean analysis mandates the immediate implementation of segmented risk adjusted discount rates for content project evaluation. This framework must incorporate explicit country risk premiums for international content to accurately reflect regional cash flow, volatility, currency risk, and geopol geopolitical factors. The competitive posture is Netflix currently operates with a higher cost of capital compared to diversified rivals like Amazon and arguably Disney. This structural WCC disadvantage necessitates meticulous financial planning focusing on superior capital efficiency and high required returns on content investments compared to competitors and to establish the foundation. So the market value of equity is derived from recent cap market capitalization figures as of November 13, 2025. Netflix uh market caps it was at $482.64 $64 billion. While the figure for November 18, 2025 was $467.33 billion. For valuation purposes, the analysis establishes a baseline market value of equity of $475 billion. And this high valuation reflects investor confidence in Netflix's global subscriber base and substantial free cash flow generation 8 billion plus annually expected. So, the market value of debt is approximated using book values for long-term borrowings as debts tend to trade close to par. And so, Netflix's long-term debt um at the end of September 30 was 14.463 billion. And that um value of it um it utilizes a uh market value of depth of $15 billion and incorporate long-term debt with the minimal approximization for um short-term liabilities. And the capital structure weights um based on the figures is the total calculation is at $490 billion um which is adding the you get that by adding the $475 billion and the $15 million and the that means the equity weight is approximately 96.9% and the debt weight of approximately 3.1%. And um so for the cost of equity calculation um we look at the first the risk-f free rate uh is just proxide by the yield on long-term government bonds reflected reflects the return available on a riskless investment. The 10ear US Treasury yield was 4.2% as of November 1825 and it closely aligned with the 4.2% rate pulled at the end of August 125. the rate of 1 2% is used for posision precision and um for the equity risk premium you can you can see that's 5 5% uh 2.2% the lever equity beta is reported at 1.58%. So if we do the cost of equity calculation you can by doing the 4.2 12 4.12% plus 1.58 time 5% which will equal 12.02% 02% which is the resulting cost of equity and the cost of debt is has a yield of 4.045% and a bid yields around 4.192%. As of November 2025 and if we look at the effective corporate tax rate by using this formula you can get the 3.28% and the average tax cost of debt 3.28% which is that is less than 1/3 of the cost of equity which is 12.02. 02 and to move on to the Netflix current weighted average cost WCC if we use all the data that we're given on top we get the WCC which equals to 11.75% which is like an approximation and it represents the appropriate discount rate for cash flows associated with an average risk in Netflix project and this high the high value is primarily attributable to the company's reliance on equity financing and its high operational volatility made of 1.58 within the intensely competitive uh streaming sector. And this is the the summary of the WCC calculation from the risk-free all the way up to the baseline the weighted debt. So the impact of a three $3 billion debt increase. So this where we model the $3 billion incremental debt load depth load. Uh the scenario inputs are the new debt that we're get that we find the total capitalization right here the new debt weight and the new equity weight. And if we do all that calculation but we we can see this on the top of the 11.69% and some analysis of capital structure optimization at the margin is the $3 billion debt. It reduces the WACCC by six basis points from an 11.75% to 11.69%. And uh the conservative financing policy of the past characterized by an overwhelming large equity weight is reflected in the fact that the introduction of lowc cost debt immediately lowers the overall cost of the capital. And this is the table that shows the sensitivity of WCC to three uh billion dollars depth increase. And this is where we find the cement which is firmwide discount rates. Here's the geographic risk. It says adjustments for market maturity and sovereign risk particularly for the 56% of revenue derived internationally. So if we look at the international content this is the formula that we would use and uh so Netflix revenue in uh the US and Canada is 44% 32% from EMA 12% from Latin America 12% from Asia Pacific and the complexity complexity of assessing risk across these region regions especially considering that the Asian segment alone counts for 50% of anticipated international growth uh that dictates the highly v variable discount rates. Um and this is all the um international places that's taking the the information from if we look at this this where we compare the WCC values and structural data. So for Netflix it's 11.75% value and for Disney. For Disney you can see that's 7.03% to 12.44%. For Amazon's 7.32% to 10.8% and beta is 1.58 while um for Disney is 0.82.5 implied and for Amazon it's not listed. The deadway market for Netflix is 3.1 for Disney is 15.44% and for Amazon's 2.09%. 09%. So the published WC figures for Disney show massive divergence ranging from 7.03% to 12.44%. And this this discrepancy is almost entirely due to different inputs for the cost of equity calculation. This is and the conclusion for the um for the for uh Disney is the conclusion is that the lower WCC best represents Disney's conglomerate rate structure while the higher WCC likely relies on outdated or typical inputs that fail to capture the stabilizing effects of its diversified portfolio. And for Amazon it's calculated based on extremely low deb weight and very low cost of equity and the higher point percent. It reflects the aggregation of the broader consumer discretionary sector and so the advantage is the complimentary advantage that we can find is both Amazon Disney benefit from the conglomerate effect. Their streaming divisions are financed by local corporate WCC due to the stability provided by other segments AWS for Amazon and parks broadcast for Disney. Amazon Prime Video in particular operates one of the lowest cost of of capital among streaming services allowing it to prove content projects with much lower expected returns than Netflix. Uh Netflix is a pure play content exponential company and is highly sensitive to market swings and the intensity of the content arms race and reflected which is reflected in the high equity bait of 1.58. This direct exposure results in the cost of equity of 12.02% 02% and a WCC of 11.75 75% that are structurally higher than those of rivals leveraging platform diversification and Amazon's low WCC means it can intentionally subsidize its content spending setting higher competitive barriers and potentially driving up content costs for the entire industry. To overcome this WCC gap, Netflix must maintain superior operational and content efficiency ensuring that its content projects projects consistently clear clear the high 11.75% her right um and this is where all the sources were got all the sources or Gemini got all the sources.",
  "video_url": "https://www.youtube.com/watch?v=GXfahyHHYEU"
}