{
  "student_name": "Julia Munkholm",
  "org_defined_id": "037076876",
  "username": "jmunkhol",
  "video_url": "https://youtu.be/TsTrVQJ9chU",
  "transcript": "Um for this assignment um the assignment overview is to deliver a full valuation of Panera Bread for a prospective KKR takeover using driver um combine DCF trading comps and precedent transactions to produce an informed bid range while contrasting financial um to buyer discipline um with strategic buyer um synergies. So the deal snapshot scale 6 billion in revenue growing at an 8% rate 900 million um EBITDA 15% margin 400 million net income across um 2100 stores and digital sales already 50%. So market references industry um price to equity ratio is 22x precedent um ebitda multiple uh multiples like 12 to 15x and Chipotle trades at 35x um for priced equity and McDonald's at 25. So that just kind of gives you a snapshot into the industry and then capital assumptions industry WACC is 9% um management wants 10% rollover strategic biders um like Starbucks and McDonald's are circling um growth levers so 500 um new stores in five years digital mix to 70% diner/catering expansion early stage international rollout and so then create an executive ready recommendation that states your valuation range, winning bid strategy and rationale for choosing finance financial versus strategic positioning. So define and discover. Um so the main point of this as I kind of just listed is determine an informed bid range for potential KKR takeover of Panera Bread by performing a full valuation including the DCF comps and precedence. Um contrasting financial buyer economics with with strategic buyer synergy value. So what price should KK are offer and what is the walk away number given competition from strategic buyers like Starbucks and McDonald's and KKR's required return discipline. So some things we need to find are what is Per's interesting standalone value? What value could a financial sponsor create through operational levers? How much incremental value would a strategic acquirer realize from synergies? And how does that translate into comp into a competitive but disciplined bid range? And so some of the constraints that we are given industry WACCC 9% management rollover um market comps PE 20 price to equity is 22x Chipotle 35X McDonald's 25X um precedent EBITDA um is 12 to 15X. So rep so now we're to the represent stage. So here are some of the formulas that our code is going to use um to find uh some of these numbers. So for revenue um of t so revenue tus 1 * 1 plus the growth rate um eBay t so revenue * t times the ebt margin um ibit t um equals ibit tda u minus dna and then the terminal value gordon growth model is fcf um time 1 + g divided by the wacc minus g. So those are some of the formulas that we're going to be using. Um the sensitivity parameters that we'll be using is g equals 2 to 3.5% and then um wacc equals 8 to 10%. Um so the comps and president's plan so trading comps um apply industry 22 um x price to equity to Panera and then test a premium such discount rate so 18 to 25% so go a little under go a little over and then strategic comms um compare Chipotle 35x and McDonald's 25x to bracket strategic bidder pricing precedent transactions apply 12 to 15 to EV um ebbit dah However you say that um scenario plan so base case 8% revenue growth 15% if the um margin and then store ramp as guided upside accelerated store openings um digital digital at 70% margins up to 100 to 150 bps downside is a 5% growth slower digital ramp and 13 to 14% um a bit margin so Now for the implement um this is the uh this is the prompt I use plus all the like initial information. So using the information above buildup multi scenario DCF base upside and downside professional valuation tool with a 5-year operating projections free cash flow detail WACCC justification and terminal value support and then I also told the code to include sensitivity analysis and planning and then make sure the output um shows the connections between the calculations with the financial analysis and then also like um turning the code into sentences that um show a clear statement on what the best option is. So if we go to our code now, here it is. So it starts with um the inputs um from the problem and then it starts these are all inputs. So then the calculation engine starts running the full analysis. So it's finding the FCF um the DCF loop for the five-year projection. Um what else? Um here's the um IPITA evaluation. So it's finding all that um the FCF and then this so then then it starts calculating the bases. So um base the base case um FCF for sensitivity um and then it's narrating the output here for our analysis. um it's looking at the WACCC range and deciding that and calculating everything. So then now we go down here to our output. So the scenario base thesis execution of 500 store roll out digital models hold at 50%. The enterprise value is 6,948 million. to 7.7xida um importance terminal value is 76% of the total and then a risk alert um valuation is highly dependent on brand longevity beyond year five. So the scenario the downside thesis um recessionary pressure margins compressed to 13.5%. Enterprise value is 4,312 million so 4.8 8 um x ibida and then terminal value is 69% of the total. So next um strategic um acquired by strategic mcds bucks um supply chain synergies drive 17% margin. So the enterprise value is 10,000 or um 10,000 and five and 50 million excuse me um at 11.2%. IDA importance terminal value is 79% of the total and there's a risk um um because the valuation is highly dependent on brand longevity beyond year five and so here is the sensitivity analysis um why this matters it shows the interest rates of WACC and execution um like the growth impact of our bid so um it shows it for WACCC 8.5% 9% and 9.5 so the low growth so the 2% % is 8.8 million, 8.4 million, and 7.9 million. The base growth is 9.3 million, 8.8 million, and 8.3 million. And then the high growth is 9.9 million, 9.2 million, and 8.7 million. So the final bid recommendation um chose to be um downside floor of 4.38 billion which is defensive base case KKR um of 6.9 billion which is the target and then strategic um seal of 10.1 billion which is the walk away. So strategic insight um there is a 3.1 billion synergy gap. conclusion do not bid over 13.5 billion above this we are paying for synergies we cannot achieve so if we go back to our analysis here um the validate stayed so we confirmed that the FCF matches the IBIDA to cash bridge um we cross-checked the terminal valuation proportion we verified multiple um based valuations line up with to line up with the industry norms um we did the stress test model using low mid and high WACCC. We confirmed the synergies are achievable and not um double counted and we ensured that the bid provides KKR with adequate returns. So for Evolve um here are some things we could add to our analysis to make it even better. Um compare valuation under different financing structures. Incorporate store level economics for a bottomup build. Layer in competitive benchmarking against digital leaders. Look at alternative exit scenarios. IPO versus sale to strategic and then benchmarking operating margin expansion versus comparable turnaround cases include real option value of the international expansion and then also providing a longer longevity um for like future cash flows. So instead of five years doing 10 or something. So the reflection final analysis shows a down um this is kind of just a reflection of the answer. So 4.3 million um downside for base case 6.9 million strategic seal 10.1 million and a 3.1 million synergy gap. Um so the conclusion the bid should not be over 13.5 million. And then just this analysis deepened my understanding of financial models by being able to practice applying them to a real life scenario while using Gemini and um Google Collab to um assist me with my work."
}