{
  "student_name": "Joe Dragoni",
  "org_defined_id": "036050644",
  "username": "jdragoni",
  "email": "",
  "transcript": "Hello there. I'm Joe Dragoni from your management 310 class and this is my session 8 assignment looking at market efficiency of the GameStop stock. So just a little bit of overview about our investigation we're going to be going into for now. So we are investigating market efficiency using GameStop. The game short short squeeze um the big event where GameStop stock surged to very high returns from 2020 and it was in early 2021 that it had the super high returns. Um so we're just going to be looking at the price behavior relative to the efficient market hypothesis predictions. Um then one of the first steps we'll be going into is um verifying the statement of GameStop trading at 4 cents in August of 2020 against the historical data which we'll go into in a second. Um and then we'll look at the event timeline of August 2020 where GameStop was nearing bankruptcy levels. September 2020 where Ryan Cohen, the founder of Chewy, acquired 30% stake. um January 2021, the big event where Wall Street Bets, Reddit, um subreddit drove the price um up to $483 a share as led by Roaring Kitty um in February 2021 after that event, congressional hearings about market manipulation and the stabilization of the price of GameStop uh post event I'm looking at today. So some other key points to look at is the short interest peaked at 100 140% a float. Retail trading volume increased 10fold during the squeeze. Um trading restrictions implemented at the peak by Robin Hood after they saw what happened with the influence of the Reddit account to have people invest in that stock. Um hedge fund Melvin Capital sustained 53% loss and analyst fundamental value estimates being $10 to $40 per share. So now some required analysis some points we'll be looking at over the course of this video being verifying historical price data and document corrections testing which form of market efficiency was violated whether it was weak semi- strong or if all of them were violated evaluating whether rational investors could have profited systematically comparing efficient market hypothesis predictions to observed behavior. So the real behavior that we saw compared to the hypothesis predictions and then assessing behavioral finance explanations for observed anomalies and then we'll do all of this using the driver framework. So the first stage of the driver framework the define and discover stage looking at our goal of investigating market efficiency of gametock from 2020 to 2021 um the event timeline that we went over already and verifying the facts stated in the problem. So just kind of going into that goal a little bit deeper. Um we want to determine whether the 2021 short squeeze of GameStop constitutes definitive anomaly that invalidates the efficient market hypothesis or if it can be explained as a rare and rational though very extreme as we saw market event driven by market structure and new forms of information flow aka social media. And did the market behave efficiently or were there behavior behavioral factors involved? So basically we're just trying to determine if efficient market hypothesis is still a valid model for understanding financial markets in the modern age of social media and widespread retail trading. some actions we'll take um using assistance from AI a little mostly Google Gemini a little bit of CHBT um as well as historical data and learnings of the um efficient market hypothesis as well as past concepts from this class like CAPM to analyze GameStop investment and understand certain anomalies can provide evidence against market efficiency. Um do the events of the timeline have anything to do with the price jump? um and then testing the form of market market efficiency that was violated. Um so looking at what the different forms of efficient market hypothesis here in this define and discover stage just to make sure we understand the financial concepts from this lesson. Um weak form um efficient market hypothesis is that price prices reflect all past price and volume information and technical analysis does not work to provide new information for investing. semi-trong form um EMH uh where the prices reflect all publicly publicly available information. So fundamental analysis doesn't work to get an edge over the competition for investing. And then strong form EMH is the price reflect all information including private information um that companies or market insiders might have. So insider trading doesn't work which insider trading is normally illegal. So this wouldn't help anyway. Um, and then kind of looking at that critical first step we talked about already about whether GameStop traded at 4 cents per share in August of 2020. So, just to kind of validate this claim, I used Yahoo Finance, pulled up GameStop, and looked at the entire history of GameStop stock. As we can see here, starting in 2002, um, there it was mostly the returns mostly close to or they were in single digits. um you know back when the rise of games um physical copies of games were popular it was it maybe rose a little bit around 2013 you know when the Xbox came out or when there were physical copies of games being sold and then as games started to go digital it went closer to bankruptcy levels as we validated and the stock price just continued to decrease but looking at August 2020 or 8 of 2020 we can see here that the open price was $11. Closing price is $167 and the low was a dollar and then the high was$1 179. So we can see here that that claim of GameStop being shared at 4 cents um in August of 2020 is false. So we can verify that with historical figures which we did with Yahoo Finance. Um we saw looking at the beta was negative 1.3 um at that time which means it moves opposite to the market. So, it had a negative correlation, which means it just continued to go down, but was not quite at that 4 cent range. Um, it may have been a calculation error, miscommunication error that made the professor think this. Um, and yeah, just the way we can communicate that error that was found is just, you know, using our voice in class to talk about this error or sending an email to the professor. Moving down to the represent stage. Um like we said the goal here of this stage um you know ma mapping out visualizing mentally timeline of events and how the returns reflected the change in the timeline. Um and then looking at the systematic approach to testing market efficiency. Um and this can help us to see abnormal returns drift and any other key factors we need to analyze. So kind of looking at the short squeeze or what a short squeeze is um that of what happened in 2021. Um, it's a short squeeze is when many investors short the same stock and the stock's price starts rising unexpectedly. So, in the case of the Wall Street Bets Reddit subreddit, um, uh, led by Roaring Kitty, um, a guy on with the Reddit username that and also had a YouTube account named after that. he was releasing videos about that stock on YouTube and caused a whole influx both on Reddit and on YouTube of people to invest in the stock to drive up the price causing a short squeeze and the stock to increase by hundreds of dollars a share. So then validating the timeline of the stock which I used with this uh the street.com looking kind of at the timeline of events that was given to us. So, you know, starting in August 2020, we see the end of August 2020, the games, I guess maybe there was insider information about Ryan Cohen um wanting to purchase some shares of GameStop. Um so, the price was going up to 668 at the end of the month, even though we already looked it was around a dollar. Um, and then just going through the different information about Ryan Cohen before he before the short squeeze of Roaring Kitty, which happened in January of 2021. Um, as you can see here, it happened right here on the 27th. Um, getting the short squeeze around $300, $380 up to around the $400 range. So we can see that we saw like we said already August 2020 um GM the GME was nearing bankruptcy levels in September of 2020 Ryan Cohen acquires the stake of of the company um buying shares outstanding. Um the Reddit accounts surged the price to $483 in January of 2021. February of 2021, the congressional hearings on market manipulation and then the postvent postevent price stabilization which like we saw here after the super high spike in the price in 2021. The stock has gone down to more normal levels. There were a couple it's still higher than it was before the bankruptcy levels but still stabilized a little bit. Um and then so that's just validating the timeline and then looking at the return calculations. Um what we're going to use in our implementation stage just kind of drawing those calculations out. Looking at normal returns, abnormal returns and then cumulative abnormal returns. So normal returns um is the expected return on a stock if the event had not occurred. So that would be the average return plus the systematic risk times the market return on day t. Um then the abnormal returns calculation would be um just the difference between the actual observed return and the normal or expected return. So the abnormal returns um if it's higher than the expected return that chunk between the observed return and the normal return will be what our abnormal return was. And then you know if normal is greater than the observed then we'll have a negative abnormal return. Um just showing that we actually observed less than what we predicted to be and then the car or cumulative cumulative abnormal returns being the total abnormal return over a defined period. So after calculating the abnormal returns for a bunch of different days or time periods summing all those up over the course of the event which we'll do in our implementation stage. So now going down to implementation. Um I had help from Google Gemini to debug it in um collab because it wasn't working after generating it in actual Gemini. So there's a lot to go through here. It made some changes here. Um but get the market data. It has the ticker of here at least. I have a few cells of implementation here that you'll see in a second. But Gamestock compared to GameStop compared to the stock of the S&P 500 as a market proxy. Um, and then the different dates they started the squeeze just the very beginning of it in January and then the initial 13% stake that Ryan Cohen bought in the company. So just to run it to make sure that it works um see the check there. we go down to look at well first we'll look at this visualization that we made between the um starting in 2019 all the way up to 2022. So there's three years of looking at the comparison between the benchmark the S&P 500. You can see this drop here due to CO 19 around March as we all know that was not good for the market. Um but just the constant um increase and rebuild of the S&P 500 after that. And then down here, this blue line shows the low returns or low low closing price of GameStop and then the crazy price increase, the price hike to around $8 a share then and then how it decreased back to stabilize out before rising back up again. Um but still we see how that uh the event in the market um or the restrictions on trade caused the drop the decrease back to low returns after the price hike um seen from the short squeeze. But looking up to what we actually were or what we actually want to know um the efficiency test that we calculated from the um September of 2020 and the January of 2021 um just looking at the cumul cumulative abnormal returns that we calculated from the pre-event the day of the event and the postevent drift um we see we get 42% or 0.42 42 drift um from day 20 to day one negative one which is leading up to the event before um Ron Cohen invested in the stock then the event day being negative so a drop in the drift um and then the postevent drift being 69 so or not 69 that's just the total over the whole window on the postvent drift being 33%. And then as you can see we got just shows relative days to the stock just just a quick head of the change there. Um how the market return compared to the stock return the actual returns here um reflect you know not very large numbers um still only like 1 to 2% not even 1% someday and sometimes it's dropping by a percent sometimes it's raising by a percent point. Um but then the abnormal returns you know um are a bit higher over time and then just the cumulative average returns or abnormal returns on average returns being in um daily being around the 13 to 20 or not 13 to 20 12% to 20% range. Um just to get an idea for how this code works. And then going looking at the next event being the first um January of 2021 and days leading up to the event that happened there. Um you know we see this is still a little bit before the actual short squeeze but we can see you know leading up to that there was negative drift. Then the day of um the actual start of the short squeeze it was 56% drift. And then days after that we see almost 200% here because 2.54 200% drift. So it's just showing reflecting the actual short squeeze there and the efficiency and kind of leads us to think about what is actually driving this. So again, here are the um the event window data just showing you know days leading up to or this is this time it's showing days postevent um but still showing the much higher returns market returns normal returns and the abnormal returns and then um 300% 200 yeah just around 300% um for these for the cumulative abnormal returns just showing super high returns there and And then just looking at the next I made another couple of graphs to actually show the short squeeze um abnormal returns in a graph. So run this. Um this is the actual event day of the short squeeze or the day after when the trade restrictions were imposed uh with Robin Hood. So just 20 days before 20 days after we see this graph here um shows how you know these days were nearing bankruptcy or the returns were not that good and then around 13 days before the short stock it had started to rise and um as more and more people were investing in the stock and searching the price to this to its peak of the abnormal returns of you know almost to 300% about 2.75 2.8% 8% looks like up here was the peak. Um, just showing that crazy spike in the abnormal returns. Um, and then right here on this red line, the day after was when the trade restrictions were imposed. Um, and people were beginning to sell their stocks because Robin Hood was letting people sell their stocks um for a short period of time but not letting people more people buy into the stock. Um and then just the days after showing the stabilization of the stock. We're not it's not quite the stabilization period yet, but um having less returns as more and more people are selling their stocks and the stock is not becoming as valuable from the squeeze anymore. Um as well as some of the federal um mediation as well. And then just one more graph that I made to actually show the same graph that we saw already but the dayby-day with the bars here the dayby-day cumulative or daily not cumulative daily abnormal returns. So as we see from day to day starting from -20 to15 or the days leading up to the event it was mostly negative to the most part. People weren't really gaining money on the stock until you know around the short squeeze started and the returns began to increase by a lot up until the point of the event. Um and then the day of as people were starting to sell the stock the abnormal returns were decreasing. Just a cool thing to cool graph to look at. Um, now we move on to the validation stage here. Um, like we said, looking above the graph of the benchmark versus the game stop shows negative correlation of betas because kind of looking back up here real quick, we see as this is rising, this is sort of decreasing or just staying stable. Um, so game like we said, GameStock had a negative beta. Um, benchmark S&P500 has a beta of 1.0. So it just shows, you know, this one at this time of the spike had a lot of volatility. Um, and then just began to or be began becoming more volatile but going in the wrong direction. Um, going back down to validation stage. Um I mean we already compared the calcul uh figures calculated online research. Um and then another way to validate our answers was with stat statistical significance and robustness checking. So a way to calculate statistical statistical significance rather sorry um you know looking at are the abnormal returns significantly different from zero. Um so the period we tested um was from the days 20 days before the event happened to 20 days after. So to calculate our t value here for our t statistic we did cumulative cumulative abnormal returns divided by the standard error um or yeah divided by the standard error over the or not overly this should this should be times standard error of the abnormal returns times the square root of the amount of days. So 40 days total gives us our t statistic. And I had Jim and I do these calculations for us. And we saw that during this event window, the t stat t statistic was very high. Sorry, I cannot talk tonight. And the p value um was a lot less than um 0.001 or alpha here. So abnormal returns are large and significant meaning that the event almost certainly caused the stock's price to move or the um social media influence and overconfidence hurting um all those behavioral factors influenced by the Reddit posting and YouTube video of Roaring Kitty cause the stock to move. Um and then looking at just a risk adjustment as well are normal or are abnormal returns compensation for additional risk. The abnormal returns seen during the GameStop squeeze were not rational compensation for additional risk. And we know this because behavioral factors and social media communication drove up price. Um and you know these people investing were not looking for extra risk. They were just trying to make a statement as we looked at and a lot of people you know thought this was an opportunity to make some extra profit but as we saw it was not really in a systematic way. It was in you know sort of a way of rigging the market to try and beat the market and make a statement. Um returns really temporary result of speculative of a specul speculative bubble and a market structure failure um as well as manipulation like we talked about already. So, a way to test robustness of this check would be run with a larger time period or a different time period rather than the 40-day one that we used. Um, and maybe doing a sensitivity analysis as well. Um, I talk about robustness checks as well in the evolve stage. But this is what I have for the validation stage. So, moving down to evolve. um you know doing what we did here in or what I did in the stages you applying these efficiency insights to the different market anomalies and market biases. So looking at the behavioral biases here um you know a lot of these did apply to this situation um and caused the price to drive up and show why it wasn't why we weren't dealing with systematic risk but it was an more of an unsistatic way of dealing with it. So overconfidence um like we said the investors on Wall Street Bets subreddit became overconfident in their collective ability to beat Wall Street. Um and then yeah both sides the retail and institutional sides in January of 2021 both displayed overconfidence um which amplified the volatility of the stock. um for anchoring. This was definitely another big part of the short squeeze as investors may have anchored on GameStop's historical low prices. Um and this caused irrational price expectations and poor timing decisions during and after the peak. um for hurting large numbers of retail investors followed this RW wall street vets communities momentum without conducting individual valuation analysis which arguably is the most significant part of the short squeeze because you know a lot of people were following the social media posts uh the YouTube videos the subreddit um memes and screenshots as well of the large profits triggered um by the short squeeze and this caused you know fear of missing out um and more people, you know, even as the price was going up more and more, people were buying even more to the point because they wanted to, you know, make this short-term profit off of the stock, especially using Robin Hood. Um, it wasn't the price was moving not because everyone else was buying, but because of new information here. And then loss aversion after prices fell from the $400 highs. uh investors refused to sell at a loss, holding on to their hopes of another rally um after they invested, you know, thousands and thousands of dollars into it. Um and you know, this kept long-term and short-term investors in positions far longer than rational analysts would suggest, which worsened volatility, worsened volatility. Um then for market mental accounting, you know, retail traders viewed GameStop investments as fund money or a statement against Wall Street, not as part of a rational portfolio. Um and this reduced sensitivity to risk encouraging irrationally high exposure to a single volatile volatile stock which in turn hurt the rest of the market. Um and had to or had to res or it didn't have to it did result in a government intervention. Um then you know some of the market anomalies that we looked at kind of seeing if those aligned with what happened with this investment story. Um looking at momentum Gamestock was not looking was not doing well before. So the sudden change in the earnings does not quite align with this concept or at least not until the short squeeze start. Um as trading was accelerated by algorithmic trading and social media amplification creating self-fulfilling cycle when prices attracted more buyers for the value effect. Um investors like Ryan Cohen when he invested in the stock saw long-term valuing long-term value in restructuring the company's e-commerce strategy because of its low trading levels. Um and after January 2021 the price was no longer driven by fundamentals or intrinsic worth but by speculative and behavioral forces. So in turn this negated the value effect. Um so so far momentum and value effect do not apply to this. Um the size effect here the small size made it more susceptible to volatility. um retail coordination and short squeezes um which we saw with the Wall Street bets um and all of the followers investing in the stock. So it was more vulnerable to price manipulation and momentum shocks and um it was easier for the group to manipulate it. So the size effect does is amplified there. Um and then the January effect looking at smaller stocks doing better in January. Um which we did see that this smaller stock or this lower price stock had its short squeeze in January but um you know this was with the help from the Reddit group that manipulated the value and drove up the price. So the drivers of price were different um being short squeeze and social coordination rather than the seasonal behaviors of this effect. So then just um another way to improve robustness here um or how to expand this analysis is like we talked about already using a longer pre-event period maybe like 120 250 days um of trading before the event window rather than only single or double digit events event single or double digit event amount dates. So we could also test with the cap model to strengthen our argument that the results are not model specific if the abnormal returns persist. So branch to other concepts that we've learned in management 310 already could help us to strengthen our argument as well. So like doing a cap model and then like we looked at the comparison of gametock to the benchmark to compare the betas of the two stocks um or the two you know the market to the stock um we could try a different market industy like the NASDAQ composite to test sensitivity analysis or perform a sensitivity analysis to further strengthen our argument. So now for our last part, the reflection stage um last part of driver some of the things that I took away from this assignment and what I've learned or the key takeaways that could be taken away from this um like we saw the market is mostly efficient unless a factor like something behavioral or arbitrage or collusion messes with it. Um, like we said, the we went over the behavioral biases and the market biases from above or the market anomalies from above. And this shows how those factors can drive up stock prices temporarily. Specifically, the behavioral biases. Um, looking at abnormal return, it reflected the difference between what GameStop's actual returns were and what the expected earnings were from the model. Um you know like before GameStop's um expected returns were very low being close to bankruptcy levels but um you know the short squeeze here showed the price drift that can be used to determine efficiency. Um so you know just kind of looking at the short squeeze and seeing how the different types of efficiency um using the efficient market hypothesis could have been violated which we'll go into in just a second here. um you know could rational investors have profited systematically from this. The price increase was not driven up naturally or by new information but rather um hurting the social coordination etc. Um and we did see some investors profit from this. You know some were smart to sell their stocks as it was keeping before you know Robin Hood stopped accepting profits or buys of the share and before there was government intervention from Congress. Um but uh the systematic and rational profit was extremely unlikely as this you know this wasn't done systematically or um by knowledge by one's own knowledge but rather by the social influence from the Reddit. Um and the short squeeze was highly unpredictable market frictions and trading restrictions from Robin Hood after the event. Um we saw the high volatility of the stock undermines the systematic strategy um because it was highly volatile after the short squeeze. Um and then just kind of going over the results of the market efficiency form testing. Um we saw the weak form market efficiency was not directly violated because the rise was not a repeatable not a repeatable thing to happen um because you know government won't let it happen anymore. rather it emerged from new non-pricreatelated factors um both social and structural um as they found a loophole within the system. The semi-rong form was violated as non-fundamental information aka the Reddit discussions created irrational mispricing inconsistent with semi-rong efficiency and strong form market efficiency was violated as market constra limited limited arbitrage capacity revealed that all information was not instantly or equally reflected in the prices. So then just some last key takeaways as this is a very long video. I apologize. Um but just to sum everything up, EMH holds in theory but weakens under social and structural strain. Behavioral anomalies can cause temporary inefficiency but markets will eventually return to normal as seen with GameStop today. Just kind of looking at that looking back at Yahoo Finance. It's at you know $21.32 today. Um and it is not at it super high level but it's again not at you know bankruptcy levels anymore but still went down and still looks to be super volatile. Um and then just last thing a market can be efficient on average but still experienced short bursts of chaos in his pricing as we saw with this. Um although it's unlikely now after this the lesson that was learned from all parties from this story this chaotic series of events it likely won't happen again but the market can still be efficient on average u even if some of these things happen. So, thank you for watching this very long video and yeah.",
  "video_url": "https://youtu.be/_vF6Px-7sug"
}