{
  "student_name": "Kayla Lee",
  "org_defined_id": "037191790",
  "username": "lee4991",
  "email": "",
  "transcript": "assignment about capital okay hello my name is Kayla Lee and I'm going to explain the session 10 assignment about capital budgeting and the cost of capital analysis regarding Starbucks so First what is going on? So we're going to evaluate Starbucks proposed flagship roastery that requires a 12 million dollar upfront outlay and expected to operate for the next 10 years. We're going to use the firms provided 8.5 % WACC as the hurdle rate to determine whether the project creates value and to recommend and accept or reject this decision using the driver documentation. So here are the project parameters. We have the initial be $12 million regarding the equipment, training, building, and then it is depreciated straight line linearly over the next 10 years. We have the working capital, which is $500,000, deployed at launch, and it will be recovered in year 10 of this analysis. Then we're going to, are the revenues. So it's $8 million in year one, $11 million year two through five. And then lastly, year six, year 10 will be $9 million. And we have the operating costs and the taxes of 25 % goes to corporate and the terminal value of $3 million at the end of year 10. So we're going to look at this analysis and I'm going to explain using cash flow models, core capital budgeting metrics, sensitivity tests, and executive ready recommendations. So. I used the Google Pro Gemini to create a Python code that had all these analysis and now I'm going to explain that here. So using this flagship grocery project, it's not merely a capital expenditure request, but it's also a critical strategic investment design to solidify our leadership position in this premium. experiential coffee market globally. And so we're going to have to reject this decision. So first of all, part one, I implement, use the incremental free cash flow schedule using years zero through 10. So the initial year zero investment totaling $2.5 million. This covers both the substantial $2 million in capital expenditure for the unique architectural design equipment, the initial stuff, and then the necessary $500,000 working capital investment. So this initial working capital covers inventory build up, other expenses, and also starts creating the cash balances. Crucially, the FCF stream from year one through year 10 is also consistently positive, as you can see here in these increments, and it demonstrates the rosary's immediate and sustainability to generate cash returns from its first year of operation, kind of showing the success with Starbucks as well. So, excuse me, operating the revenue assumptions. Our revenue projections beginning at $800,000 in year one. $8 million in year one are driven by two key strategic assumptions. First of all, the premium pricing power leveraging the rosters unique status to charge higher price points and also the high foot traffic, which anticipates a rapid ramp up based on its status as a destination location as well. Then we have the depreciation tax shield. So we have elected to use the straight line depreciation method as stated before for simplicity and consistency across our capital assets. Depreciation is a non-cash cash expense, but it is vital for financial modeling because it reduces our taxable income. We correctly isolate the benefit asset depreciation tax shield and we see valued at $300,000 annually during this initial asset life. This is a real cash inflow that we would not have without the investment. So this depreciation, depreciation, sorry. And then the tax shield of $300,000, the total investment. obviously initially it's going to be the minus or like negative balance, but we're going to build that capital up with the years progressing. So the value will hopefully increase, which it will. And then the terminal value at the end of the project's 10 year planning horizon, we calculated a robust terminal value as well. And this reflects residual economic value of the roastery, the land, the buildings, continuous use, and the potential for the foreseeable future and profitable sales. So that means we the total inflow in year 10. will eventually, uh including this value and the recovery of the initial working capital, be a significant $5.7 million. And so this is a reliable, positive FCF profile confirming by our detailed FCF table. And this is indisputable with the prerequisites as well. Now, how did these calculations work? So using the code above, the m code values will show. like for annual depreciation, let me find the code. So these like different models show how these calculations work. So for example, the inflows will be the NPV plus the initial outlay. Other calculations would be, for example, the annual depreciation would be the initial investment divided by the project life. So we had $12 million. We divided that by 10 because of the 10 years with the year 10 projection. So it's $1.2 million per year. For example, finding the earnings before interest in taxes was the revenue minus the operation cost minus the depreciation. The tax expense being the earnings before multiplied by the tax itself. em And then finding like the operating cash flow would be the earnings before interest in taxes multiplied by the complement of the tax expenses and then we also have to include the depreciation as well. And then like free cash flows would be kind of like the operating cash flows minus the change in the NWC minus the capital as well. And the net present value is a summation of that. And so we use these different values to help create them. So the net present value ends up being 5,000,000. or sorry, the net present value. So this is the second portion and it will be over $7 million, which is above $0. So we kind of stepped out using the basis of that rule. And so. Sorry, I had to clear my throat. Now, as I explained the basis of here of this first model using the cashflow, now that leads the segue, I explained the formulas. Now I'm talk about my section two using the core capital budgeting metrics. So again, the numbers specifically and what do these mean? So the financial health of the project is measured against our benchmark, which is the weighted average cost of capital of the walk, which is 8.5%. This walk is carefully calculated. And so for this high profile project, we need to be confident with our decision and also make sure it's appropriate for the minimum required rate of return to satisfy our creditors and equity holders as well. So using the net present value, which is the most important. in a way, arguably, this project yields a substantial $7.1 million, is greater than $0. So this is acceptable. This figure signifies that the project is to create over $7 million in net value for shareholders today after covering the cost of all the capital, and this provides an excellent risk-adjusted return as well. Then we use the uh IRR decision, so the internal rate of return. This represents the actual annualized rate of return the project is expected to yield. This project's IRR is a powerful 19.31 percent which is greater than the walk itself so that's initially important to recognize and The profitability index provides a valuable measure of efficiency so the benefit received per dollar so our PI is 1.57 which is greater than one which demonstrates an excellent capital efficient return on investment as well for our shareholders. And finally the discounted payback period assesses liquidity as well. It determines the time required to recover the initial investment while correctly accounting for the time value money. The project's discounted payback period is 7. Well, here it's 4.05 years and then the discount is 5.17 years, which is less than the project life. So that's good. It's less to pay back and it won't be the 10 years that's initially projected, ensuring a timely recruitment of capital and reducing our exposure to a long-term operational risk as well. And so that kind of explains the whole core capital budgeting metrics. And now I'm going to implement that. using or sorry, um, I used the python code to kind of represent it and now to implement that I'm showing this and then just also validating these claims as well. So now I'm to explain the sensitivity analysis. Well, how does this impact the net present value and internal rate return as well? So no investment decision is complete without, you know, trying to mitigate the risk, trying to assess the risk as well. And this analysis is going to represent the integration of finance technology using scenario analysis but also providing the data-driven insights using the walk sensitivity and testing the cost of capital. So we tested the scenarios where the cost of capital increased dramatically. ah simulating the interest rate hikes or shifts with the structure. So this parameter stream demonstrates the project's robustness. So let's say that the walk was hypothetically able to rise. So evolving that aspect, what happens if we increase that? It only decreases just a little bit. but remains still positive. let's say we increased it to 10.5%. It's still over 5 million and 19.31 % of the IRR exceeding that. So this shows that it's highly resilient to adverse changes in funding costs as well, which is a good point to mention with such a long-term investment with also such high stakes with lots amount of money. So this also shows the revenue sensitivity, operating performance as well. We also tested the impact of a significant decline in operational performance, a permanent 20 % reduction in revenues across all years. So even if this major down time scenario, the project still yields a positive 2.1 million. and the IRR of 4.88%. So this pairs out the project that's not brittle, but it can successfully absorb a different market shock and still add different value to the firms as well. And this sensitivity analysis is the validation step of our process. Why does this work? How is this important? And what it means to as well. So now to also evaluate the economics behind this project, I plotted three visuals. So again, I use the Google trend to help me create these three models right here. So all you can only see two per screen, but. Let me explain each one. So this first one is the free cash flow timeline, which shows the upfront investment in year zero, followed by the increasingly positive cash flows each year. This confirms the project generates growing operating values over time. And then the second chart is the NPV sensitivity. So we can see the different models between the walk plus 2 % and the walk minus 2 % and then the revenue as well. Oh wait, sorry. That's the third chart. Sorry, the second chart is the walk curve versus the NPV. So this is... how the difference so as expected the NPV declines as the discount rate rises but it still remains positive across the entire range because this just supports that the project is robust even if its financing is uncertain so that kind of mitigates the risk think about what happens with the funding it's still going to be in a positive we're not going to have a negative net present value and sorry now the third chart shows the NPV sensitivity, which shows when it's the most sensitive to the revenue risk and while the changes in the W WOC can be have a smaller effect. And this highlights where management should focus risk mitigation as well. So overall, all visuals reinforce that the project is financially sound with manageable, manageable sensitivity as well. And now I explained the first three of these models. Now, what does this mean? the executive recommendation and what do I have to say about that? So this final section is just going to provide the managerial conclusion and also just the strategic context behind it using what I created before. So we accept. We accept. This is important. This is a good thing. And we accept this project and we will move forward with this project. The project demonstrates exceptional financial strength and is also characterized by all the positive net present values and the internal rate return as well that far exceeds our cost of capital. So it's a win-win situation. We'll always get money from that as well. The strategic imperative, so this initiative is a profound strategic necessary that goes beyond just the numbers. So the road story serves as a powerful example of experiential marketing anchor and how it reinforces the premium pricing power. So it justifies the higher price that we mentioned before here. the higher prices across the entire product portfolio in the region by raising the brand's perception because Starbucks is a name household. And then it evaluates the customer experience. is the ultimate manifestation of our brand narrative. And that's how we're going to try to curate that using all the money upfront and attract a new tier of customers as well. So the financial viability is tightly coupled with the resilience demonstrated through the sensitivity analysis, confirming the project's capacity to generate sustainable above average return for years to come as well. Okay, now I just want to do more of an analysis and just kind of evaluate and reflect on what I just explained, just because it was an information overload. So we understand we're going to accept this project idea. There's so many reasons why is why to do that. So we see with the casual model here. how it increases and eventually it caps off the operating costs and the depreciation. It's linear, so we already have an idea moving forward and the benefits from that. And now we look at how the payback period is less than the project life. that's, excuse me. We understand that that is a good decision and we accept that as well. and then the walk, if it's reduced, what is the net present value? If the base case, this is how much it is. Let's say that the walk increases, what does that still mean for the net present value? It's still a large amount. Even if the revenue is reduced, we still have the net present value. And also the impact of the walk change, the net present value remains significantly positive. And the internal rate of return is also unchanged as it's also independent from the walk, which is really important. That shows the financial health of the company as well. And so I having this project is a great idea because it also just demonstrates financial viability as well. And like we see with the net present value. For the base case with the 8.5 % It's 2.2 million which is still greater than zero which is expected to create a significant shareholder value as well the internal rate of return Let's say it's still greater. Let's say decreases from the 19.31 that we predicted here with the calculations, it's still greater than 8.5 and then the payback periods as well. So we used the different real option analysis incorporating and just expanding the groceries capacity as well. And then next step, so how can we evolve from this? We can. have it go through different simulations of different analysis of kind how the market could be. The market's not, you know, it's unpredictable. It can be quite arbitrary, but being prepared for it is. important as well. And we can also just see how inflation or um affects these numbers as well, nominal rates and such like that. But we kind of started, we kind of did preface that and kind of introduce that just because we did hypothetical scenarios. If the walk was reduced or increased and how that would affect the net present value, which kind of supports the decision of accepting this because it's not as uh reliant or dependent on it and then reflecting that just kind of the analytical background behind this so we parameter parameter uh sorry parameterized this by building a reusable and transparent model that clearly defines the input and this allows for scenario testings and just kind of an analysis of what we're looking at and then also tax accounting mechanics. So the equations that was used here and that I also said before it you know finding like the net income using the EBIT minus the tax the operating cash flows it's crucial for accurate capital budgeting decisions and then also the decision hierarchy of this what do these different mean? So the MPV and IRR decisions are pretty heavy and important for these type of analysis and because they're crucial as these models provide like the what's the high value which must be paired with the why the strategic fit for this and so that's really important in explaining and also understanding why we should accept these. Like I said, also the profitability index is greater than one, which means it's profitable, it's important, it'll work, and not only that, it was 1.45 or only 1.57, which is pretty high and goes beyond that as well. And like I said before, like the different... um Equations I use the using the probability index would be the P the present value of the future cash flow survived by the uh Value of the FCF so the free cash flow the value of that was also used and the net present value was just a summation of the walk plus one raised to the amount of time and then that was all divided from the free cash flow. So all of these different equations that like here the project life, the range of that, the depreciation, these were all important in finding these calculations and how it all correlates together. So now just to double everything we were able to use the walk as you know the discount rate and just also articulate why we use the MPV for this decision why is this a good good decision and what does this mean for the company we use the different tax amounts the profitability in tax for those as well and then finding the driver framework I you know implemented the Python code evolved that to kind of do different mechanics and also what it means and then I use these three models to kind of have a better visual understanding in my aspect and then just reflecting on that I felt like it was really under it was a lot understandable using these different models like the basis of when the revenue is low or when the walk is low or the walk is high. What does that mean? It's important to think about the what if scenarios just because the market is unpredictable as well. And so that is my analysis for the Starbucks Roastery. We should accept this market decision as it will be vital and important for all of us as well.",
  "video_url": "https://youtu.be/YqVkR6S1n50"
}