{
  "student_name": "Bella Hess",
  "org_defined_id": "037228782",
  "username": "hessi",
  "email": "",
  "transcript": "Hello. Um this is the session 10 assignment capital budgeting and investment decision. um also the section six assignment um the cost of capital analysis and essentially we will be evaluating Starbucks's um investment decision requiring requiring 12 million upfront outlay. It is expected to operate for 10 years. um it has a 8.5% um weight with average capital cost as the hurdle rate and we essentially are determining if the project will create value for the company and to formulate a recommendation supported by the driver framework for executives to accept or reject the investment decision. Um, so yeah, essentially to wrap everything up, the main objective is to evaluate the project using capital budgeting to determine if it creates this value um measured by comparing the project's expected return to the hurdle rate, which is the um weighted average cost of 8.5%. We have a couple key project inputs here or perimeters. So we have as stated in the session assignment the initial investments the operating cost depreciation revenues and um operational as well. So those are all listed there. But again to reiterate this initial investments would be $12 million. So all the building equipments, the training, um everything that goes into this project is valued at this $12 million. Um it has straight line depreciation of over the 10 years. The working capital is $500,000 um which is deployed at launch and again recovered in this 10-year time frame. Revenues consist of the $8 million in year 1, 11 million in year 2 to 5, 9 million in years 6 to 10. Operating costs, so the cuts of goods sold, the 40% of revenue, the 2.5 million in labor, rent and utilities of 0.8 million, marketing at 0.3 in year 1, then 0.1 million more after. So more marketing within the first year rather than the times after that. We also have taxes to take into consideration. So 25% corporate tax rate, the terminal value of $3 million at the end of the year 10. And essentially we we will be producing this transparent cash flow model um really backed up by these capital budgeting metrics, the sensitivity test. So running how sensitive this is to the following and our recommendation. To start off with, we need to really understand a couple key concepts. So capital budgeting, which is essentially this process of evaluating the long-term investment decision, um caring only about the incremental cash flows. So the change in the total cash flow with the project versus without the project. So kind of using that cost benefit principle directly tied to economics however in a more investment decision and financial lens free cash flow. So FCF which I will get more into within the actual assignments but essentially this is the cash flow that is available to all of the investors. So including debt and equity um after accounting for all of these operating costs and investments and this thus is the stream that we must discount. So here is how that is calculated here. um taking into consideration the tax rate, the depreciation, NWC, the capital spending, the EBITS, um all of that kind of consists of the free cash flow, um weighted average capital cost, the 8.5% the weighted average cost of capital, um the which is essentially the product's opportunity cost. So the expected return um of the that the investors require and this is also used as the discount rate and then we have the decision rule or the net present value. So again kind of reiterating what we have learned in class. If the net present value is positive or greater than one, you should accept it because that means that there is value that the project is promising or the cash flow um exceeds the initial cost which then again creates shareholder value. Um, so just diving right into what is expected the 10-year cash flow schedule. So I have the Python code that represents this here. Um, the incremental cash flow schedule. So years 0 to 10 just kind of stating what has been given in the case. So that revenue of year 10 at $9 million um revenue side here the operating cost um that's again was given to us here in the case. So the operating cost all of that is taken into account in this column right here. Um we have the depreciation taking into account the EBIT, the taxes, the OCF, the change in the NWC, the capital expenditures, the terminal rates and the SCF which I had um discussed here. So that free cash flow. So all of the cash available to investors, the debt and the equity are all accounted for within this column here. Um again, this kind of just is a visual representation of how we would expect this um cash flow to turn out within years 0 to 10. And this gives us some insights into what exactly the project is promising. So again, revenue, operating cost, appreciation, the tax shields, the taxes, the working capital change, and the terminal value are all in here. Um, and again, we're focusing on the weighted average cost of capital as discount rate and the net present value decision rule. And again the correct calculations are addressed in this cash flow schedule with the given situations in the session. So to go with this we have the core capital budgeting metrics. So that net present value based off of the base case value um discount and payback the simple payback um internal rate of return 88.13 net present value at negative277,485.15. So diving into that sensitivity analysis um excuse me and then again to kind of address what was previously talked about with the net present value internal rate of return and the probab probability index or that pi um we have the current calculations here. So just kind of how the python explained that and implemented that um these calculations are here. So specifically with the profitability index, the present value of the future cash flows divided by that initial investments um or that net present value plus that um excuse me initial future the um free cash flow divided by the same free cash flow. So, excuse me. Again, the sensitivity analysis summary essentially shows the different scenarios here. So, that base case, the net present value, um, and that's IRR and how they specifically connect to each of the scenarios. So, the base case, we're looking at that negative NPR and that's IRR of 8.13. And then if revenue was down 20% we see this net present value drastically increase to -6 million and the irra drastically decrease from 8.13 to0.63. However, if the weighted average cost of capital is down 2% um we see that net present value drastically increase and that IRR the same. Um and then again if it were to increase 2% that IRRa stays the same. However that um net present value drastically decreases. So to sum this up, this is essentially very sensitive to the scenarios and it's something definitely to keep in mind when you're making this decision of whether or not to invest in this decision. Um just because again the sensitivity analysis shows that the project would essentially be very sensitive regarding any change to the revenue to the weighted average cost of capital um whether that be increasing or decreasing. And then again to kind of visually represent this um just to make this more concrete and to further the recommendation um there is a visual representation of the sensitivity. So showing that base case at that um positive net present value excuse me negative net present value um but still not quite in the millions. So definitely between the base case and the decrease in revenue, you can just see how drastically different that is um you know decreasing revenue goes past that $6 million mark where the base case doesn't even hit 1 million and then again decreasing that weighted average cost of capital. you see that drastic increase from really both of them um above a positive net present value of 1 million and then an increase by 2% of the weighted average cost capital you see that drastic shift from the base case to here um and essentially from the decrease to the increase that is drastic too but not as drastic as the decrease in revenue. So essentially the biggest thing to look out for with this project is if your revenue would increase or um really decrease because decrease is based off of this analysis what you are wanting to look for because it will just shift that net present value so much and will really just change things a lot. Um, so again, just kind of looking at that decreasing this weighted average cost by as much as you can will essentially increase that net present value as expected because you're decreasing those costs which increase that um value. So with all of this said, our final conclusion um specifically looking at the base case analysis using this 8.5 weighted average cost um yields a net present value of negative 277,000 um and the internal rate of return of 8.13. So since the net present value is less than one, the project really is not expected to create this significant um shareholder value under the three assumptions or under the assumptions that we have just given. And the discount period, the discounted payback period is never which indicates the initial investments is never fully recovered on a discounted basis. um which again proves to not be a promising project um especially given you know the above stated with that drastic um decrease for the net present value if you were to decrease revenue by 20% which yes that is a lot to decrease revenue by but um again we're comparing you know less than negative 1 million I mean 277,000 compared to over 6 million. That is a very drastic increase. So, um again, comparing that to a 20% revenue drop, that's still a significant amount to be worried about. Um but again so with this following information with the cash flow um schedule having that FCF in the f zeroth year so the zero year being 15,800 um just kind of essentially throws things off and makes the project not necessarily viable and um very essentially risky, very sensitive to external factors. Um not necessarily proving to be a viable um you know investment for shareholders and essentially that's what we're very much looking at. So um again going back to that sensitivity and that risk assessment um the project is very sensitive to both revenue and the cost of capital although proven to be more sensitive to that revenue rather than that weighted average cost. Um and again a 20% reduction in revenue across all years lowers this net present value to -6 million. um which essentially is still positive but demonstrating the substantial erosion of the value. This essentially would not be um something necessarily to to look at. So or something necessarily to invest in just because you are taking on a big load, a big a big risk and will definitely affect the shareholders and their decisions with the company as a whole. Um and then again just kind of going off of some assumptions that we've had to make. So that straight line depreciation. So um something for us to to look for within here. were able to see that there. Um, sunk cost is something for us to take into consideration. So, excluding the cost of things that have already been spent, um, that terminal value, so the $3 million estimate is a significant assumption, which essentially the recommendation would be to test that using the growth per perpetuity model. um which essentially would be more advanced settings. So using the cash flows of year 11 divided by that weighted average cost minus the growth. Um and then again having some future improvements of the model for more accuracy could include that Monte Carlo simulation. So instead of only having the three sensitivity tests, you can run a simulation where the all the inputs, so revenue, cost good sold, the way to the average cost um are varied randomly based off of the probability distributions to get a probability distribution for the net present value. So that's more accurate but essentially more advanced. Um so again, a future improvement to improve this accuracy would be included in the recommendation. um also too scenario scenario analysis. So an upside case so let's say revenue increased by 10% to fold the the full the full range of the potential outcomes which essentially is what happens here except we decreased revenue um by 20%. Excuse me. So it can be inferred that if revenue were to increase by 20% you would see that net present value increase by um a lot another drastic change. But even if it was just like increasing by 10% you would still see a pretty um drastic change between the base case and that that scenario. So also having a detailed NWC. So breaking down these into accounts receivable, inventory, accounts payable instead of just having a fixed um deployment/reovery period or a fixed number for that. Um increasing that accuracy would look like just really breaking these little details down. kind of going hand inhand with the Monte Carlo situ situation um of having those random um cash flows and and just randomized values as a whole. So again, just to reiterate, based off of the incremental cash flow um schedule and the core capital budgeting metrics um taking into account the sensitivity analysis, given that this project is very sensitive, it would ultimately be suggested that the company did not go with this project just because it gives so much risk and not promised a lot of return. Um, so thank you so much and have a great rest of your night.",
  "video_url": "https://youtu.be/T_NNs3jf9-o"
}