{
  "student_name": "Colin Crean",
  "org_defined_id": "037433259",
  "username": "creanc",
  "email": "",
  "transcript": "Hello, my name is Collin Crean and this is my Session 10 assignment on Cost of Capital Analysis. So for the D, the define and discover part. So for my overview, we're going to evaluate Starbucks's proposed flagship row, roastery that requires. 12 million upfront outlay and is expected to operate for 10 years. We're going to use the firm's 8.5 whack or weighted. Average cost of capital as the hurdle rate to determine whether the project creates a value and to recommend and, and accept slash reject. A decision supported by the driver documentation, or, or in my own words, or in my other words here, we will be determining if Starbucks should invest $12,000,000 into a five flagship roastery by calculating if the project creates shareholder value with an NPV or a net present value greater than zero . So for my parameters that I was given, so it's a time period of 10 years, weighted average cost of capital, 8.5% and initial outlay or year in year zero. Depreciation, so we have straight line depreciation over 10 years, which is 1.2 million per year. And book value, I have to end equals zero working capital of $500,000 outflow in year zero, fully recovered by year 10. Revenue in year one of $8,000,000 in years two through five of $11,000,000 in years six through ten of $9,000,000. Operating costs, costs. The goods sold 40% of revenue, labor, 2.5 million per year, rent slash utilities, 0.8 million per year in marketing, uh, year 1, 0.3 million, and then in years 2 through 10, it is 0.1 million. The tax corporate rate is 25%, the terminal value or TV is 3 million, uh, salvage at year 10, and the entire 3 million is taxable gain. And the sensitivity analysis, ah, right. Revenue of negative 20%. And we'd average cost of capital of positive or minus 2%. So for the represent, First, we are going to show the operating cash flows for years 1 through 10. So for the operating cash flow, it equals revenue minus expenses minus 2%. So for year 1, we have, and all of these numbers are in millions, so we have 8 million, which is the revenue, minus 3.2 million, cost of goods sold, minus 2.5 million, which is the labor, minus 0.8 million, which is the rent and utility. It's minus 0.3 million for the marketing minus 1.2 million for the depreciation. And that equals $0. So it's even. So the even. EBI T the earnings before interest in taxes equals zero. So therefore we're going to pay no taxes. So this part of the equation doesn't matter for year one. And then we're going to add the 1.2 and depreciation where, so the OCF equals 1.2 million. And our cashflow comes entirely from depreciation tax shield logic. So we didn't actually write a check for 1.2 million depreciation. So that cash stays in the bank. Now for years two through five, I made it simple. Just the numbers. I didn't add any of the labels here. Uhm, so we have 11 million for the revenue, minus 4.4 million cost of goods sold, minus 2.5 million labor, minus 0.8 million for rent and utility. Minus 0.1 million. Cause the marketing changed from 0.3 to 0.1, and then minus the 1.2 and depreciation and the eBay. Bit, or like we said up here, the earnings before interest and taxes equals 2 million, but then we have to multiply it. By 1 minus 0.25 for the tax, 1 minus the tax rate here, and we get 1.5 million. And then we have to add the depreciation back, and we get an OCF, or an operating cash flow of 2.70 million for years 2 through 5. And then for years 6 and 10, same thing, 9 million minus 3.6 million minus 2.5 million minus 0.8 minus 0.1 minus 1.2. And we get an EBIT of 0.8 million. Multiply it by 1 minus the tax rate, and we get 0.6 million. Add the depreciation, and we get an operating cash flow of 1.8 million for years six through ten. So next we have to handle depreciation and the terminal values. So for depreciation, we have annual straight line depreciation on the 12 million over 10 years. So therefore it's just simply 12 million divided by 10 equals 1.2 million. Annual depreciation each year for the TV or the terminal value logic, the salvage value is 3 million and the book value at the end of year 10 is zero. $0 because we fully depreciated it over the 10 years. So therefore the taxable gain is 3 million minus zero, which equals 3 million and the tax on gain. And it's 3 million times 25%. Uh, and it equals 750,000. So the after-tax cashflow is the salvage value. Minus the tax, which is 3 million minus 750,000, and we get 2.25 million. So now we will find out metrics using. Formulas. So for the first metric, we're going to look at the FCF or the free cashflow timeline. So for year zero, it's negative 12 million, which is the capital expenditure minus. And it's 0.5 million, which is the working capital. And after year zero, the FCF is negative 12.5 million for year one. It's 1.2 million. Cause it matches up. Matches the OCF for year two through two through five and six through nine also matches the OCF. So 2.7 million and 1.8 million, but for year 10, it is 1.8 million, which is the operating cashflow plus 0.5 million, which is the working capital received plus 2.5 million in the terminal value. And the FCF for year 10 is 4.55 million. So for the present value and the net present value, so for. So we're going to, I calculated here the present value and the net present value. And so if you don't know, uh, the formula, it's, um, PV. E equals FV over one plus the rate raised to the number of periods. So for year one, it's 1.2. Divided by one plus .085 raised to the one, and we get 1.11 million. So then for years, Two through five, it's the same thing, uh, as that, except 2.7 million. Instead of 1.2 million, and then you have to raise it to the number of years, so 2, 3, 4, 5. And then, so for two, we get, year two, we get 2.29 million, for three, 2.11 million, for four, 1.2 million, for.95 million, and for five, 1.8 million. So now for six through nine, it's the same number here, 1.8, but just the different. Uh, number of periods here, and we get for year six, 1.10 million, seven, 1.2 million, oh, two million for eight, 0.9. 4 million, and for nine, 0.86 million, and then for year 10, it's the 4.55, uh, raised to 10 periods here. And we get 2.01 million. So the sum of all the inflows is 15.24 million. And to calculate the NPV, we get. We take the inflows minus the outflows. So the 15.24 million minus the 12.5 million for outflows. And we get around 2.7 million here. So the total present value of future cash flows is approximately 15.24 million when we subtract the 12.5 million. So, I, I gave a little chart here to show us. So, for year zero, the cash flow is negative 12.5. The cumulative cash flow is negative 12.5. It's negative. For year one, the cash flow is 1.2. The cumulative cash flow is negative 11.3. Still negative. Year two, 2.7. Negative 8.6. Still negative. Year three, 2.7. Negative 5.9. Still negative. Year four, 2.7. Negative 3.2. Still negative. Year five, 2.7. Uh, negative .4. And this is the last negative year. And then year six is when we go positive at 1.8 for the cashflow and the cumulative cashflow of 1.3. So it turns positive. So here we have the formula. So five years plus the 0.5 unrecovered over the 1.8, the next year seems positive. So that's this number right here for the 0.5 divided by 1.8, which is right here when we start going positive and we get five. Plus 0.28, which means it's 5.28 years to pay back. And for an explanation here, we recover almost all of our investment by year five, leaving only. 1.8 million coming into year 6. We cooler the debt early in that year, resulting in a payback of 5.8 million. So, now for the profitability index, PI equals the present value of future cash flows divided by the the initial investment, so for the people. Yeah, it's 15.24 divided by 12.5 and one, and it's 1.22. So this number means that for every $1 Starbucks invest in this- the project returns $1.22 in present value terms. And since this is greater than 1.0, it confirms the buy decision. and for that. I-R-R, we're gonna use, we're gonna calculate and explain that during the implement stage. So now moving on to the I, or the implement stage, umm, I'm going to pr- I have to AI to output a code that will weigh out all these metrics and numbers I have calculated thus far so I can compare my numbers and see if I need to change anything, fix anything. re-evaluate. So here's the code here. See right here. you We have all the numbers, initial investment, working capital, WAC, tax rate, years, and the stuff provided to us. And this is what it outputs. So it outputs. An NPV of around 2.7 mil. It's a little different from mine, but that's just cause I rounded it differently than them. But it's around 2.7 mil. The IRR, or internal rate of return, is 12.84% and the payback period is- is 5.0. Umm, so as you can see from all of these numbers here, uh, they're the same things like- I calculated up here NPV of around 2.7, IR, internal rate return, 12.84. Or so, I didn't calculate the IR yet, but I'll explain that later. Or they calculated IR is 12.84%. The payback period, 5.28 years, which we calculated in the profitability index of 1.22 years. So for the cash flow schedule for year zero to ten, which it calculated, so in year zero, the revenue is zero, operating cash flow is zero. But the F.C.F. is negative twelve point five. But for year one, the revenue is eight mil. The operating cash flow is one point two. 2 million and F.C.F. is 1.2 million because remember it was the same. Same thing for years 2 through 5, the revenue increased to 11 million, but that's- operating cash flow and F.C.F. stayed the same. And then the same thing for years 6 through 10, 9, I mean 6 through 9, the revenue decreased to- 9 million. But the operating cash flow stayed- or the operating cash flow 1.8 million, and the F.C.F. was also the same. of 1.8 million. And then for year 10, the revenue was 9 million, so the operating cash flow was also 1.8 million. No. But the FCF is 4.55 mine. And then here, to explain the internal rate of- 12. I don't know why that's a 7, I'm gonna say 4 here. To explain the internal interest rate of 12.84%. This is the actual annual interest rate the project earns on the money invested. This project pays us a 12.80. Again. 4. Percent interest rate per year. And since the bank only charges us 8.5% to borrow the money, we are keeping the difference. Now. Nope. For the validate section. So for this validate step, I've already validated my numbers. I calculated with the Python code above. We said, umm, we got the- I calculated the same numbers as I explained above. Umm, and then also, when I was calculating the present value, I used the- This online PV calculator helped me. And so here you can see, I already had this in, there's the uhh, uhh, uhh, uhh, So it was the 4.55 million, the number of periods, 10 years, interest rate of 8.5%, and we got the present value of 2.01, which, that we calculated. So, that was my work. Now for the evolve section, we are going to do a sensitivity, The analysis check where we're going to check what happens when revenue drops 20%. So for this, I'm going to prompt AI to give us a Python code to check what happens to the metrics. Same thing here, we have all the assumptions that we are given, all that stuff. The code, and then this with the sensitivity analysis brings us. So the base case, I'm- pv, which we calculated was around 2.7 million and the internal rate of return or the IRR is 12.84%. But now for- The sensitivity analysis case where the revenue dropped twenty percent, the NPV goes to negative three million dollars, and the IR drops to three million point one three percent. So the impact on value, this project loses roughly five million in value, if revenue misses by twenty percent. This project to sh- drawies, uh, value, which provides a negative MPP in the stress code. So you can see here, the sensitivity analysis of the, uhh, ahh, 20% drop. So you can see before the 20% drop, which numbers we calculated, the net present value is positive all the way up here around 2.7 million. But after the revenue drop of negative 20%, the NPV is down here around 3 million. in. Uh, negative three million. So we can see, you know, the huge impact on our revenue here, on the caves, or on the project. And here's my explanations. So as we can see, a drop in 20% revenue absolutely kills the project. What I can take away from this is Starbucks has a high-fix cost, like, rent, l- never into appreciation. And in a case where there's a moderate drop in sales resulting in a 20% also revenue, this would wipe out the profit. This project is risky and we- needs to be very confident in our 11 million revenue projection because we don't have much room for error. So for the reflect stage, based on my- I know. Alice's, I recommend accepting the project. The project produces a positive MPF of around 2.7 million and has a positive profitability index of 1.0 and an internal rate of return of 12.84%. All of these metrics as well as the other ones calculated suggest that this project should be- ,profitable and perform well for the future. However, we also calculated in the sensitivity analysis that this project could be extremely risky. As long as Starbucks- Bye bye. If the confident in its projected revenues, then this project should be profitable. Overall, throughout this project, I learned a lot about cost of capital analysis. And how you can- you can't- solely rely on projections. Even though I said they should accept the project based on the- . . It doesn't mean the projections will be 100% correct, although we are confident based on my projections that the project should be profit. So thank you for listening, and this is my session time assignment. We'll next time.",
  "video_url": "https://youtu.be/TbxYfjTnSfo"
}