{
  "student_name": "Ryan Swann",
  "org_defined_id": "037338799",
  "username": "swannr",
  "email": "",
  "transcript": "Hello, my name is ryan swann, and today in this video, I will evaluate Starbucks' proposed $12 million flagship roastery project using Driver Analytic Framework. I'll walk through each driver stage, define, discover, represent, implement, validate, evolve, and reflect, while showing how the code and financials work. model lead to a well-supported capital budgeting recommendation. Getting into our define stage. articulate the business decisions Starbucks faces. Starbucks is considering a $12,000,000 dollar investment to build and launch a flagship roastery expected to operate for 10 years. The central question is, does this project create value? Does it shareholder value when discounted at Starbucks' 8.5% weighted average cost of capital? To answer that question, the project must be evaluated using full incremental cash flows and capital budgeting data. NPV, IRR, Profitability Index, Simple and Discounted Payback. I must also perform sensitive testing on revenue and weighted average cost of capital, and finally, offer a financial plus strategic recommendation. For our discover, I collected all project parameters, assumptions, and constraints before building anything. Here are the key inputs, the initials, Total cash flow is 12 million initial investment in year 0, plus 500 working capital deployed in year 0. and recovered fully in year 10. Revenues year 1 is 8 million, 2 through 5 is 11 million, and year 6 through 10 is 9 million. For operating costs, the cost of goods sold is 40% of revenue, labor is 2.5 million, rent and utilities is 800,000 annually, and marketing is 300,000 in year one, then 100,000 annually. For depreciation, 1.2 million per year, ah, it's a straight line of over 10 years. Taxes and terminal value. Corporate tax rate is 25%, and the terminal value in year 10 is 3 million. The hurdle rate for the weighted average cost of capital is 8.5 percent, and these inputs form the foundation for the model and satisfy the discover stage. Moving into our represent, uh, I intentionally designed the model before implementing any code. This is required by driver insurer's structure and clarity. My plan for the cache flow engine includes building a year's worth zero through ten table with revenue, operating cost, EBITDA depreciation, taxes at ten, twenty-five percent, NOPAT, add back depreciation, free cash flow, and year ten adjustments. plus working capital recovery. I also plan the python structure as a parameter holding all assumptions, a cash flow construction function, and separate functions for NPV. IRR, Payback, Discount Payback, and Profitability Index. Moving into the NPV. Implement, and building the Python, I translated my plan model into Python, and the script automatic generated the full cache flow schedule from years 0 through 10 using the assumptions gathered earlier. So, looking at, at our Python code, here it is. Each line of code shows what exactly is being done and gives something to you further understand what is going on and what our Python code is operating. We then see the formulas it is using to calculate different things. Uhm, for instance, like, if e is ebit is negative, and then at the bottom of our code we have all of the information we wanted The, uh, FCF was minus 12.5 million. Which, this is investment plus working capital for years one through nine. The FCF was positive annual income. Capital free cash flows from operation in year 10 includes operating flat ca- free cash flows. Plus $3,000,000 terminal value plus $500,000 working capital recovery. The model ran clearly. It ran cleanly end-to-end, generated the expected intermediate values, and produced the final cash flow vector. needed for capital budgeting. For our validate stage, I checked that the model behaved. calculated the capital budgeting results. I confirmed that the depreciation lowered taxable income. Working capital was not double counted, and terminal value appeared only in year 10, and discounting was unnecessary. Here are the financial, final financial results. Core project metrics. The NPV at 8.5%, uh, gave us $3,022,515. gave us a 13.25%. The profitability index was 3.35%. The simple payback, uh, came in year 6, and the discounted payback came in year 9. Uh, so, to interpret that, 18.25% exceeds the 8.5 weighted average cost of capital. This is, uh, attractive economically. The profitability index is less than 1, which is efficient use of capital, and payback occurs well within the project's useful life. The model passed all validity checks and shows compelling financial returns. In the evolve stage, I tested how robust the project is by running required sensitive scenarios. Scenario 1, uh, reducing revenue by 20%. When I decreased all revenue, revenues by 20%, the new results were NPV drops, but remains positive, and the IRR decreases, but stays above. of the weighted average cost of capital. This shows that even under weaker demand, the roastery still generates positive returns. Positive value highlighting a resilient business model. Scenario two, the weighted average cost of capital. We did plus and minus 2%. I recalculated NPV at different discount rates at 6.5% weighted average cost of capital, NPV increases significantly, and at 10.5% weighted average cost of capital, NPV decreases. but remains positive. This confirms that the project's value is sensitive to Starbucks' cost of capital. but remains economically viable across plausible financial environments. Uh, finally, I visualized that the annual cash flows and sensitive results using Python's, uh, map, plot, lib, to support a clear narrative of how- how the project performs over time. In the Reflect stage, I integrated all financial and strategic- strategic insights to arrive at a recommendation. Uh, the project demonstrates a po- positive NPV of 3.02 million, an IRR of 13.25%, comfortably above the hurdle rate, strong payback profile, resilience under both revenue downturns and discount rate increases. Financially, this project creates shareholder value, which is a good thing. Beyond the numbers, a flagpole ship roastery strengthens Starbucks in several ways. It enhances the brand's global premium position. It provides an experiential retail destination, drives tourism, traffic, and reinforces storytelling around craft and innovation, expands the halo effect for surrounding stores. Thank you for watching. Thank you watching my analysis of Starbucks. Thank you.",
  "video_url": "https://youtu.be/1Folu7vIn_0"
}