{
  "student_name": "Hillary Tobias",
  "org_defined_id": "034075524",
  "username": "htobias",
  "email": "",
  "transcript": "Hi, my name is Hillary Tobias, and this is my video for the Session 8 Assignment. I'll start with the Define & Discover stage of the DRIVER framework. The objective for this assignment is to investigate market efficiency using the GameStop short squeeze event of 2020 and 2021 as a case study. For the scope and horizon of this assignment, I will use historical stock data from January 2020 through June of 2021 to analyze the event and understand its present-day implications. A constraint for this assignment is that it could potentially be difficult to find information on the event since it happened almost 5 years ago, but I don't think that should be too difficult. My success metric for this assignment will be understanding connections between the GameStop event, Efficient Market Hypothesis, and behavioral finance. And my benchmark for this assignment will be the S&P 500 index because it is representative of the whole market. Continuing with the Define & Discover stage of the DRIVER framework, I will go over the data inventory of what was provided for this assignment. I was first given a timeline, and it started with August of 2020 where GameStop was near bankruptcy levels and the textbook stated that GameStop was trading at just 4 cents per share in August of 2020. The next event was that in September of 2020, Ryan Cohen, the founder of Chewy, acquired a 13% stake in GameStop. Then the next event was that in January 2021, the GameStop stock price surged to $483 per share. And this was driven by a Reddit page called Wall Street Bets. And then in February of 2021, there were congressional hearings on market manipulation. And finally, in present day, the stock price of GameStop has stabilized. Also for the data inventory, I was given some key data points for this situation. It said that short interest peaked at 140% of float. Retail trading volume increased 10-fold during the squeeze. Trading platforms such as Robinhood implemented restrictions at the peak of the squeeze. The large hedge fund called Melvin Capital sustained a 53% loss during the squeeze and required a bailout. And analysts estimated that the fundamental value of the GameStop stock was just about $10 to $40 per share during this whole event. Moving on to the Represent stage of the DRIVER framework. I came up with seven steps that I will go through in order to complete this assignment. My first step will be to verify the information that was provided. My second step will be to understand the GameStop short squeeze and all of the events that happened and also define some key terms related to the event. My third step will be to use Python code to visualize this event and compare the returns of GameStop to the market. Step four will be to compare Efficient Market Hypothesis predictions to observed behavior of what actually happened. Step five will be to determine which form of the Efficient Market Hypothesis was violated by this GameStop short squeeze. Step six will be to assess behavioral finance explanations for the observed anomalies. And step seven will be to evaluate whether rational investors could have profited systematically during this event. Now I will start the Implement stage of the DRIVER framework and start with the first step in my plan which was to verify all of the provided information. I did this by asking Google Gemini to verify the event timeline and key data points that were provided. And I also asked Gemini to provide me with its references so that I could ensure it was giving me reliable results. And I found that everything was correct except for the stock price of August 2020. The textbook stated that GameStop was trading at just $0.04 in August of 2020, but I found that it was actually trading at $1.04 according to Google Finance. But other than that, all of the other information was good. So then I moved on to step two of my plan, which was to understand the GameStop short squeeze and just understand all the key events involved. So, revisiting the timeline that was provided, in August 2020, GameStop was near bankruptcy levels as I noted, trading at just $1.04 per share. So you can see it was really struggling at this time. And then in September 2020, the founder of Chewy, Ryan Cohen, acquired a 13% stake in the company. And it was also announced in the following months that he would be joining their board of directors. So this brought a lot of increased media attention to GameStop and also caused the stock price to increase a little bit. And then by January of 2021, the price of the GameStop stock had surged to $483 per share. And the price surge was driven by a bunch of social media attention from a Reddit page called Wall Street Bets and also a massive wave of individual retail investors. Users of this Reddit page noticed that large hedge funds were betting on GameStop crashing. So whenever you bet on a stock crashing, it is called short selling, which is when an investor borrows a security and sells it on the open market, anticipating that the price will decline and they will be able to later repurchase it for a profit. So, for example, an investor might borrow a security that is currently worth $10 and sell it for $10 on the market. And then if the price declines as they are betting it is going to, down to say $3, then they will repurchase the security for $3 and then they have just made a $7 profit. Short selling is very risky because if stock prices don't decline like the investor think it's going to and the stock prices actually increase, they can rise indefinitely which means that the short seller can lose more than their initial investment. So, with a really large number of GameStop stocks shorted, the Reddit users realized that they could buy more and more GameStop stock and push the price up and this would somewhat punish the large hedge fund investors because then they would be required to repurchase their shares at a higher price. So, the massive price increase in the GameStop stock did lead to a short squeeze, which occurs when the price of a stock increases unexpectedly, compelling short sellers to buy back their stocks at a higher price. So and then whenever the investors buy back their stocks during a short squeeze that continues to push the stock price even higher. So, the overall effect of a short squeeze is a rapid and chaotic response from investors as they all try to exit their positions and cover their positions. And then the next event on the timeline was that in February of 2021, there were congressional hearings on market manipulation. And during this time there were complaints that it was unfair for trading to be restricted like it was at the peak of this event. And then that triggered an investigation into potential manipulation. And the last event on the timeline is that the stock price of GameStop has stabilized currently and it is currently trading at about $21 per share. I will continue with the Implement stage of the DRIVER framework and move on to step two of my plan which was really understanding this GameStop short squeeze. So, the key data points that were provided for the assignment, the first one was that short interest peaked at 140% of float, and short interest is the number of shares sold short as a portion of total shares outstanding. So, the fact that short interest was 140% means that there were more shares sold short than the number of shares outstanding, which means that the same shares were shorted multiple times. And just for comparison, short interest ratios are usually less than 15%, so 140% is an extremely high number. The next key data point was that retail trading volume increased ten-fold during the squeeze. So as the price of the stock increased, so did the trading volume. There were huge increases in the number of individual retail investors trading GameStop stock daily and on January 22nd of 2021, 197.2 million GameStop shares were traded. The next point is that trading restrictions were implemented at the peak of the squeeze, and it gave Robinhood as an example. So, what happened was brokerages like Robinhood were unable to immediately meet the massive collateral requirements, so they restricted the buying of really volatile stocks such as GameStop to reduce their risk exposure and lower their collateral demands. And as I mentioned on the previous slide, this then raised a question as to if these restrictions were fair or not. The next point is that the hedge fund Melvin Capital sustained a 53% loss that required a bailout. And this is an example of how large hedge funds were forced to repurchase their stocks at higher prices than what they sold them for. And it demonstrates the massive losses that short sellers may suffer during a short squeeze. And the final point is that analysts estimated that the true value of the stock was just about $10 to $40 per share while it was trading for hundreds of dollars. And this indicates that there was a market inefficiency in place. Now I will move on to step three of my plan which was to use Python code to visualize this event. In order to do this I asked Google Gemini to write simple Python code to visualize the event and I asked it to consider things like stock prices, abnormal returns and the CAPM formula. So now I will go to Google Colab and show you my code. So it starts with a comment that explains that this script downloads historical data for GameStop and the S&P 500 to demonstrate the abnormal return that occurred during the 2021 short squeeze, which is a key anomaly in the Efficient Market Hypothesis. The code starts by first downloading or installing the libraries that it needs and then it sets up the tickers which is 'GME' for GameStop and 'SPY' for the S&P 500. Next, it sets the dates for the event. So, it is going to pull data from January 1st of 2020 through June 30th of 2021. So we can see what the returns looked like before the event, during, and after. The next section of code is where it downloads the price data and it downloads it from the database called Stooq and it sorts the data and cleans it up to make sure that it is good to use. And it also has code that will handle any missing data and give a message if there are any errors that occur. And then the next thing that the code does is calculate the daily returns, and then it uses those daily returns to calculate the cumulative returns and then it plots those results. It starts by plotting the GameStop cumulative returns and then plots the S&P 500. And it says that the date is going to be on the x axis and the cumulative returns will be on the y- axis. And then it adds titles to the plot and labels for the axes. And then it also adds a vertical line that will mark the peak of the short squeeze. And then it adds a legend to the plot. And finally has code that will display the plot. So now I will run the code. And you can see it says it's downloading and calculating the data. And then this is the graph that it produced. So you can see the date is on the x-axis, the cumulative return is on the y-axis. And this red line shows the cumulative return of GameStop. And the blue line is the cumulative return of the S&P 500. And the gray line indicates the peak of the short squeeze, which occurred on January 28th of 2021. So you can see that prior to the short squeeze event, the cumulative returns of GameStop and the market were pretty similar and the CAPM formula would likely predict that the GameStop stock would continue to move with the market while also taking into account the beta of GameStop. And so the fact that the red and blue lines are together at the beginning of 2020 show kind of normal returns and what you would expect, but then this large gap that formed between the red and blue lines during and after the short squeeze event show massive abnormal returns. And the fact that there were these large abnormal returns indicates that the GameStop event did violate the Efficient Market Hypothesis. So now I will go back to my slides and I will move on to step four of my plan which was to compare Efficient Market Hypothesis predictions to observed behavior. The Efficient Market Hypothesis states that all pertinent information is already incorporated into prices in an efficient market and therefore there are no undervalued or overvalued stocks and there is no way to beat the market. So considering these things, I will compare what the EMH predicts should happen and what actually happened in this GameStop event. Starting with stock price, the EMH predicts that the price is a rational reflection of the fundamental value of a company. And the fundamental value includes things like future earnings, assets, and debt. And from the GameStop situation, we saw that the price was completely detached from its fundamental value. The fundamental value was estimated to be about $10 to $40 per share, but the price was $483 per share. So, you can see that the price was not a true reflection of the fundamental value. Then in regard to information, the Efficient Market Hypothesis predicts that the price of the stock will only move with new public information about fundamentals like earnings reports and new product lines. However, in this situation, we observed that the price moved based on nonfundamental public information from social media like Reddit and the whole narrative and the hype of the whole situation. In regard to investor behavior, the Efficient Market Hypothesis predicts that investors are rational, and they analyze all of the information that is available to them before making their decisions. However, with the GameStop situation, we observed that people were irrational and they were buying the GameStop stock simply because everyone else was buying the stock and they were not buying based on rational valuation. When it comes to market opportunities, the EMH predicts that it is impossible to beat the market and profitable opportunities that do exist will be immediately arbitraged away by rational investors. However, in the GameStop situation, it was observed that there was an obvious inefficiency demonstrated by the 140% short interest. And this was publicly identified and exploited by retail investors. And then finally, when it comes to price movement, the Efficient Market Hypothesis predicts that prices follow a random walk and are not predictable based on historical prices. However, in the GameStop situation, we observed that prices were following a self-reinforcing loop. So, rising prices brought more attention to the stock, which drove more people to buy the stock, which drove prices higher, and so on. And that loop just continued, and the price got caught in this predictable loop. Next, I will move on to step five of my plan, which was to determine which form of Efficient Market Hypothesis was violated. So, there are three forms of market efficiency that are part of Efficient Market Hypothesis. The first form is called weak form and that form states that past price movements are not useful for predicting future prices, stock prices reflect all current information, and technical analysis does not work. The second form is semi-strong form and that states that stocks adjust quickly to absorb new public information, only private information is useful to gain an advantage, and fundamental analysis does not work. And the third form is strong form and that states that market prices reflect all public and private information, so insider trading does not work. The form that was violated by the GameStop situation was the semi-strong form and this form claims that stocks adjust to new public information, so it is impossible to achieve any abnormal returns by trading on information that is publicly available. However, in the GameStop situation, the short interest data and all the social media sentiment was all public information and the market did not adjust to that. The abnormal returns persisted for several days as was shown in the graph that was generated by my code. Now I will move on to step six of my plan which was to assess behavioral finance explanations for observed anomalies. So, the first anomaly that was observed was that there was this massive, synchronized buying from millions of independent retail investors. And the behavioral finance explanation for that is herd behavior, which is when people tend to mimic the financial behaviors of the majority of the herd. So, in this case, seeing a growing crowd investing in GameStop attracted new investors, which drove the price up and pulled in a bigger crowd, which continued to draw the price up. And so people weren't buying based on their own analysis, they were just buying because everyone else was and they were just following the herd. The second anomaly that was observed was that investors held the stock even as its price plummeted. And the explanation for this is loss aversion, which refers to the fact that people feel losses more acutely than equivalent gains. And this causes people to hold on to stocks that are losing because they still have hope that the stock will return to its higher price. And then the third anomaly that was observed was the dismissal of negative news such as analyst reports and warnings from short sellers. And the explanation for this is confirmation bias, which refers to the human tendency to search for, favor, and recall information that confirms your pre-existing beliefs. So through social media, people built a one-sided view of reality, and they only believed what they wanted to, and they wanted to believe that the stock price would continue to climb, and this caused them to exhibit irrational behavior. Overall, these behavioral finance explanations show how psychological factors and biases caused people to act irrationally, which contributed to the market inefficiencies and abnormal returns during this GameStop event. Now, I will move on to step seven of my plan, which was to evaluate whether a rational investor could have profited systematically during this event. And the answer to that is yes. If a rational investor was able to see through the narrative and the hype surrounding this situation and understand that it was really just a temporary deviation from the true value of the stock, they would have been able to profit. One thing they could have done was buy both a call option and a put option with the same strike price and expiration date, which is essentially betting that the price would move dramatically but not betting on the direction of the movement. So they basically could have just bet that the price is going to either go up or down by a lot and they didn't have to pick a direction, and they would have been able to profit on that. And another thing they could have done was bet on the inevitable collapse by buying put options or short selling at the peak of the short squeeze. Now I'll move on to the Validate stage of the DRIVER framework. In order to validate my analysis, I verified all of the information that was provided and I corrected it when necessary, such as the August 2020 stock price. I also checked multiple sources to verify my information whenever I was ensuring everything was correct and also doing research on the Efficient Market Hypothesis and behavioral finance elements. And then I also ensured that the graph from my code made sense. I double checked that the market remained steady over time and that the GameStop short squeeze peak was identified on the correct date, and it was, so that was all good. Now moving on to the Evolve stage of the DRIVER framework. This case study can be used to inform my own investment strategy. This case shows that the market is mostly efficient but not completely rational because people are not rational. And so an investment strategy based on this could be a combination of passive and active management. I would probably do about 80 to 90% passive management. And I would invest in broad market index funds. So by doing this, I would be accepting the market's average return, minimizing transaction fees, and really capturing the steady long-term growth of the economy. And this would also avoid the chaos that ensued in the GameStop situation. And then the other 10 to 20% I could actively manage. And I would do this by applying insights from the observed anomalies from the situation, such as not getting caught in herd behavior, loss aversion or confirmation bias. And then I would also try to be rational even when others are irrational. And one way to do this would be to bet on the collapse of a bubble rather than going down with the collapse. Finally, I will move on to the Reflect stage of the DRIVER framework. So, this GameStop short squeeze is an example that markets are mostly efficient, but inefficiencies still exist at times, and those inefficiencies can be explained by behavioral finance. As we saw from the graph that my code generated, the market did appear to be efficient prior to the short squeeze as the GameStop and market returns moved pretty much together. But then major inefficiencies occurred when behavioral finance elements were present, and those elements were herd behavior, loss aversion and confirmation bias. So this indicated that when people behave irrationally, markets tend to react irrationally. So Efficient Market Hypothesis and behavioral finance come together to explain why markets work the way they do. Efficient Market Hypothesis explains the fact that markets are mostly efficient. But then behavioral finance comes in to explain that irrational behavior from humans can create inefficiencies in markets at times. So overall this assignment taught me a lot about understanding the whole GameStop short squeeze event. I learned a lot of new terminology, such as short squeeze and short interest. And then it also taught me about the three different forms of Efficient Market Hypothesis and how behavioral finance can be used to explain market inefficiencies. And then another large takeaway is a good investment strategy that will combine passive and active management, and I think this will be really useful in my future. Thanks!",
  "video_url": "https://youtu.be/23Bicn_qx1E"
}