{
  "student_name": "Sandy Skinner",
  "org_defined_id": "037337729",
  "username": "skinne36",
  "video_url": "https://www.youtube.com/watch?v=YnISoslVyjs",
  "transcript": "Hi, how's it going? I'm Sandy Skinner\nand this is my session 12 assignment.\nSo to start off with the Define & Discover\nstage, we want to perform a comprehensive\nfinancial valuation of Panera Bread, providing\nKKR, which is a private equity firm with a\nrobust analysis to inform their potential\ntakeover bid. This valuation will use various\nmethodologies to arrive at a good bid price\nand give strategic recommendations for that.\nSo the first step is data ingestion,\nwhich is to store all qualitative and\nquantitative financial information\nfor Panera Bread, which I put in here.\nAs we can see, this is all stored, and\nthen I also found the corporate tax rate\nof 0.21, as the federal corporate tax\nrate in the United States is a flat 21%.\nWe then want to use DCFs to project Panera's\nfree cash flows, calculate WAC, terminal\nvalue and the EV and equity value using\nthe DCF model. So we also use comparable\ncompany analysis, precedent transactions to\nlook at how accurate this is compared to\nother big companies in the same industry,\nvaluation synthesis to evaluation against\nKKR's target IIR and industry weighted average\ncost of capital, and provide a strategic\nrecommendation for a recommended bid range.\nSo to start off with my first DCF, we\ncan see here that by using the cost of\ngoods sold percentage, initial system\nsales, operating expenses percentage,\nDA percentage, corporate tax rate, along\nwith base unit growth, comp sales, price\nmix, downside unit growth, comp sales,\nprice mix, and upside unit growth, comp\nsales, price mix, we came to this DCF,\nwhich shows revenues of $6.46 billion,\nthen $6.96 billion, then $7.49 billion,\nthen $8.07 billion, $8\n.69 billion for the base,\nslightly lower for the downside, and\nslightly higher for the upside. And as we can\nsee, the net income also reflects this,\nwith the largest year for the base being\n$890 million, $830 million for the downside,\nand 960 million for the upside so in\nthis model revenue represents essentially\nthe growth of the company which we can\nsee is growing over time roughly three\npercent each year and making good progress\nin that time it goes up by more and more\nevery year which is what we want to see\nand EBITDA sort of represents our operating\ncash flow how much money is flowing\nthroughout the company and is that money\ncontinuing to grow which it is even on\nthe downside and net income which shows\nhow much money we have left over after\nall that that we can give to shareholders\nand now looking at our free cash to the\nfirm cash flow calculation which is\nslightly different than the other dcf we can\nsee the fcff which is essentially the\nmoney that the company has left over after\nall expenses, all interest payments,\neverything, taxes, everything. We can\nstill see that it's growing every year and\ngets up to, even for the base model,\n$790 million, which is a lot of money.\nThey're obviously making money with this\nproposal, which is good for the company.\nNext, we needed to calculate the weighted\naverage cost of capital and terminal value. And\nusing the industry weighted average cost\nof capital of 8.5%, we calculated that and\nfound a terminal growth rate of two percent\nwhich was provided which for the base case is\n12.44 which is right in the range that reflects\na growing stable company very mature like\nPanera is but also almost in that range of\nterminal values that is more of a fast casual\nwhere they have more upside like a Starbucks\ntype of company and we can see for the\nbase case it is 12.44 which is that 11.6 which\nreflects way more of a stable mature company\nand for the upside 13 .34 which would be in\nthat fast casual range now looking at the\npresent value of terminal value versus the\ncalculated enterprise value we can see that the\npresent value of terminal value makes up\naround 75 percent of this calculated enterprise\nvalue which is very high it means you're\nessentially sort of buying a story in a company\nwhich is a little more dangerous than just\nbuying for example a company with a much\nhigh higher present value forecasted free cash\nflows to the firm because that means you're\nnot necessarily going to get your cash back\nquick you're going to need lots of time in\norder to regain that cash so for a private\nequity company this isn't necessarily ideal.\nWe do not want to have 75% of\nour enterprise value to be that\npresent value of terminal value.\nHowever, it is normally thought of that\nif a present value is higher than 80%,\nthat is a very risky company. And if it's\nless than 60%, that is a company that\nis much less risky and expected to make\na lot of money within those years. So\nwe can see that it's not necessarily a\nterrible thing for 75% as it doesn't go\nabove that 80% for a very risky company.\nNext, to compare Panera to two major\ncompanies that are very similar,\nChipotle and McDonald's, we want to\ncalculate the implied enterprise and\nequity value of Chipotle and McDonald's\nby taking the enterprise value and dividing\nit by the earnings before interest taxes,\nthe EBITDA, and using the price per\nearnings ratio. And we can see that the implied\nenterprise value for Chipotle and\nMcDonald's from this estimated value per\nEBITDA multiples is $26.06 billion. the\nmedian is also $26 .06 billion, and the\nrange is $19.54 billion to $32.57 billion,\nwhich is a lot higher than the $10.95 billion\nthat we calculated before. And for equity\nvalue, it is $22.3 to $31.22 as the range,\nwhereas Panera was also that $10.95 billion,\nmeaning that Panera's enterprise and\nequity value are much lower than these two\ncompanies and essentially with the industry.\nNow, since Panera's enterprise and equity\nvalue are so much lower, this means\nthat it is essentially trading at a discount\ncompared to industry peers, which can\nbe both a good thing and a bad thing.\nThe number one reason would be for\nperformance issues, which means it's hard to\nget revenue from this company, which they're\ngoing to sell it for a lot less than\nyou'd expect because they're struggling.\nThis could also be a risk factor, meaning\nthere's just a lot of risk associated with\nthe company and people don't want to have that\nrisk and take on that risk, so they're\ngoing to trade it for less than it should be.\nOr it could mean the company is undervalued.\nIn this case, it seems logistically\nprobable that it is because of performance\nissues, knowing Panera Bread has been suffering\nfrom revenue problems within the past\nfew years. But since it's so much lower\nthan the industry average, it could also\nbe significantly undervalued, even taking\nthat performance issue into consideration.\nNow looking at precedent transactions and\nanalyzing that, we can see that the precedent\ntransaction EBITDA multiplier is 12\nto 15 times that projected year five EBITDA,\nwhich means the implied enterprise value\nrange is between 15 .63 billion and 19.54\nbillion, meaning that's what we should\nexpect the enterprise value of this company\nto be based on what has happened in the\npast using that 12 to 15 times multiplier.\nNow to look at buyer analysis and the\ndifference between financial and strategic\nbuyers. So for a financial buyer, for\nexample, KKR in this, we generally want to\nlook at cash flows and leveraged buyouts.\nObviously, a DCF is used to determine the\nintrinsic value based on those future\ncash flows, which use aggressive revenue\ngrowth and margin expansion assumptions.\nAnd a leveraged buyout model focuses on the\ndebt capacity of the target company, the\nequity required, and the expected IRR to this\nfinancial buyer. And then we also want to\nuse comparable company analysis and precedent\ntransaction analysis, which we've done.\nAnd the key drivers here are earnings\nbefore taxes, depreciation and\namortization, debt pay down, multiple\nexpansion upon exit, operational efficiency\nimprovements, and cost cutting.\nHowever, a strategic buyer will also use\ncash flows, a DCF, to see if those first\nfive years will be good, as that's a very\nimportant time for a company you buy, as well\nas that comparable company analysis and\nprecedent transaction analysis. However,\nthey will also use synergy analysis, where\nthe value of expected cost savings and\nrevenue enhancements are quantified and added\nto the standalone valuation. It is sort\nof a 1 plus 1 equals 3 scenario, meaning if\nyou have one company and you buy another\ncompany, you can cut other things to make\nthat revenue greater and cut down costs.\nSo, some potential cost synergies for these\nstrategic buyers would be supply chain\noptimization by combining purchasing power\nfor ingredients, packaging, and equipment.\nFor example, it was the owner\nof Jersey Mike's who bought it.\nOperational efficiencies, such as\nstandardizing back office functions like HR, IT,\nand accounting Marketing and advertising,\nby consolidating advertising spend and\nmarketing efforts, reducing duplication\nGeneral and administrative overlap,\nwhich is eliminating redundant corporate\nstaff and administration expenses\nTechnology integration, by rationalizing\nIT systems and platforms And shared services,\nby centralizing functions like customer\nservice, legal, and finance And some\npotential revenue synergies would be cross\n-selling opportunities by offering Panera\nproducts within a strategic buyer's\nexisting channels, like Starbucks offering\nPanera grab-and-go items, geographic expansion\nif an international market were to\nacquire it, customer -based expansion by\ntapping into each other's customer segments,\nmenu innovation and product development,\nloyalty program integration,\nincreased foot traffic, and digital integration,\nwhich is enhancing online ordering,\ndelivery, and mobile app features. which we know\nthis company is already getting 50% of\ntheir sales from digital scenes. So if a company\nsuch as McDonald's as a strategic buyer\nwere to buy it, they could integrate that within\nthe McDonald's app to make more revenue.\nNow to look at our football field analysis,\nwe can see that our DCF valuation is much,\nmuch lower than both the precedent transaction\nand trading comps range which makes sense\nin some aspects because one we were comparing\nPanera to two pretty significantly larger\ncompanies but the main thing is we used a very\npessimistic terminal value of two percent\nwhich means we're really not expecting that\nmuch growth of the company and it's really\nhard for a company to gain a ton of revenue\nand gain a ton of profit simply with a two\npercent terminal rate so perhaps by simply\nraising that rate we would get up to this 15.6\nrange and have a value that made more sense.\nAdditionally, a reason for the trading\ncomparison being much higher is McDonald's has a\nmassive EV over EBITDA range of 45% because\ntheir costs of making products are so low\nand they can still sell those products for a\nrelatively high price, meaning that there's\na huge competitive advantage there, so it's\nhard for Panera to sort of bridge that gap.\nAnd specifically to look at some of these\nranges, we can see that the walk away\nprice for KKR would be $10.3 billion.\nThe base case would be roughly $11 billion\nand the upside case is $11.7 billion.\nThis means that KKR should not buy Panera in\nany way, shape or form if they are paying\na penny more than 10 .3 billion dollars as\nthat's what our downside case states. There's\nno way they make a profit or there's a very\ndecent chance that they just do not make a\nprofit on this and when inflation is high you\nneed to make a profit on your investments.\nNow to sort of validate I wanted to look at\nthe EBITDA margin versus their peers of\nMcDonald's, Shake Shack, and Chipotle, and we\ncan see that Panera's 15 % EBITDA margin is very\nreasonable when compared to its direct\nfast casual peer, Chipotle. It suggests a healthy\nlevel of profitability within its operational\nmodel. The discrepancy with McDonald's\nis expected due to structural differences\nin their business models. Like I said before,\nthey make much higher margin on the food\nthat they sell, and their margin indicates that\nit is competitive within the fast casual\nsegment while not achieving the asset light\nhigh margin model of a franchise like mcdonald's\nit demonstrates solid performance against\na direct operational comparable for kkr\nthis margin suggests there is potential for\noperational improvements and cost efficiencies\nto potentially increase this margin especially\ntowards the higher end of the of the\ncomparable fast casual range or through scaling\nbenefits post acquisition and to evolve i\nwanted to do some sensitivity analysis to\nsee what different WACs would look like and\nalso as well as different terminal growth rates\nand we can see that with the lowest WAC\nand the highest terminal growth we can see 15\nbillion in profits which is very high or an\nenterprise value of 15 billion which is much\nhigher than our original 11 billion and\ndoes in fact overlap with that precedent\ntransaction which makes a lot more sense so perhaps\nour WAC was also a little too high or is\nalso a little too high for this company and\nit's not a smart acquisition or perhaps our\nterminal growth rate was slightly too low.\nAnd additionally to Evolve, I wanted to look\nat the role of debt financing and private\nequity acquisitions and how the interest\nrate would impact that private equity bid.\nWell, they most commonly employ a strategy\nknown as a leveraged buyout where a\nsignificant portion of the acquisition price\nis financed through debt, which magnifies\nequity returns and provides a tax shield\nand this interest rate environment directly\nimpacts the cost of debt because it\ntranslates to a lower cost of debt for the\nprivate equity firm meaning they are willing\nto pay more for the company as they\nhave to pay less interest on that money that\nthey financed buying the company with.\nIt lowers the weighted average cost of capital\nfor this company which is a huge metric\nin understanding the enterprise value. So to\nreflect on this presentation, I found that\nthe most critical thing was the difference in\nthe intrinsic value of the company and the\ndifference between the market premium that\nmarkets expect people to pay, which sort of\ntells me that we're not necessarily paying for\nperformance. we're paying for potential and\nthe potential to grow through that synergy,\nwhich means I think for a private equity\nfirm such as KKR, it makes less sense as an\ninvestment and makes more sense for a strategic\nbuyer who can gain money and gain value from\nthose synergies. Thank you for listening."
}