{
  "student_name": "Maanasa Gogula",
  "org_defined_id": "037442697",
  "username": "sgogula",
  "email": "",
  "transcript": "Hi, my name is Manisa Googler and for this week's weekly assignment, I had to perform a comprehensive capital budgeting analysis for a project including defining all given financial parameters such as investment, depreciation, working capital, WACC, revenues, cost, tax, terminal value, and building a detailed 10 year 0 to10 incremental cash flow schedule to calculate the free cash flow for each year and computing the NPV and the IRRa discounted payback period. simple payback period and profitability index. Additionally, perform a sensitive analysis for first one revenue reduced by 20% and the second one WACC plus or minus 2% summarizing the impact on NPV and IR. Finally, develop a comprehensive recommendation that based the financial results, strategic benefit, brand implications, key project risks including uh and uh an accept or reject decision and summarizing all uh findings. So, first I define my project parameters. So, this subtask here defines all the parameters as Python variables. So this is in initial investment depreciation method depreciation years uh working capital investment wcc annual revenues annual operating cost tax rate terminal value growth rate and project life years and then I built an incremental cash flow schedule from 0 to 10. So here is that. So I created an array for cash flow schedule and for each year I iterated through for that many years and at the end I got my incremental cash flow schedule right here. So now the cash flow schedule has been successfully generated in a data frame. Now I need to calculate the net present value, the internal rate of return and discounted payback period, simple payback period and profitability index using FCC's from the CF IDF U array. So I did that since I first installed numpy financial and then I executed the code below to run the NPV, IR and simple payback period, discounted payback period and the profitability index using NumPy financial functions. So here is NPV the NF NPF.NPV NPV function takes the rate and then the cash flows excluding time zero if it's separate and then it treats the uh first element as the cash flow for period one and I needed to calculate the NPV by discounting subsequent flash cash flows and adding the initial investment and then I calculated the internal rate of return and then the simple payback period and the discounted payback period and then the profitability index and these were my numbers my NPV was 0 801295 5.01. My IRR was 18.69%. My simple payback period was 6.11 years. Discounted payback period was 9.14 years and profitability index was 1.76. And then I performed a sensitivity sensitivity analysis by a revenue reduced by 20% and b the WACCC plus or minus 2% and then I summarized the impact on NPV and IR. So the subtask below requires defining a function calculate FCF schedule to ensulate the cash flow schedule generation logic. I will adapt the previous written code for generating the CF_DF into this function ensuring all relevant project parameters are passed as arguments. So here's that and then I ran it to make sure my function was working and then I defined calculate metrics function which will encaps en encapsulate the logic for computing NPV IR simple payback period discounted payback period and the profitability index from a given cash flow data frame and WACC and I made sure that function also was compiling and then I had both my functions defined. So then I calculated the base case NPVR and then I proceeded with the three sensitivity scenarios as described in the instructions and then I summarized the results. So in uh best case my NPV was 0 801295.07 and my IRR was 18.69%. In scenario one where the revenue decreased by 20% my NPV was 191265.00 and my IRR was 11.2. two scenario two where the WACCC increased by 2% my NPV was 500,585.95 and my IR was 17.39 and in scenario 3 when my WCC decreased by 2% my NPV was 1295459.4 and my IRR was 20.56%. So and then I just basically summarized the difference in each of the IRS and NPVS from each scenario. So then I developed a recommendation and based on so my I summarized that the project is most sensitive to changes in revenue a 20% reduction in revenue leads to a decrease in NPV and a decrease in IRR which is a substantial erosion of value and indicates revenue projections should be more carefully scrutinized and my decision finally would be to accept the project. Despite the sensitivity to revenue fluctuation, the project demonstrates strong financial viability in its best case with a high positive NPV and IR significantly above the WACCC. The discounted payback period is also acceptable indicating timely recovery of investor capital. While the 20% reduction revenue scenario shows a notable impact, the project still yields a positive NPV. suggests that even under moderately adverse revenue conditions, project remains economically sound albeit with reduced profitability. The WAC CC sensitivity analysis indicates that the project is robust to typical variations in cost of capital. So assuming that the strategic fit is strong and the brand brand implications are positive, the financial upside outweighs the risks and mitigating these strategies should be developed for revenue related risks such as market research, robust sales forecasting, contingency plans etc. Operational and regulatory risks should also be continuously monitored and managed. Therefore based on the compelling financial returns and the manageable risk profile, we recommend proceeding with the project. So my next steps would be or insights would be prioritizing risk revenue risk mitigation given that the project's high sensitivity to revenue fluctuations conducting in-depth market research defining sales forecasts and developing robust contingency plans for sales targets are crucial next steps and then I also would like to integrate qualitative factors confirm strategic fit and brand implications with relevant stakeholders ensuring that the qualitative benefits align with the quantitative ative findings before final commitment. So I recommended this project for acceptance due to it strong financial viability in the best case and its ability to remain positive profitable due to its positive NPV even under a 20% reduction in revenue. Thank you.",
  "video_url": "https://youtu.be/ecBvrX-HhK0"
}