{
  "student_name": "Tanish Kukreja",
  "org_defined_id": "036513412",
  "username": "tkukrej",
  "email": "",
  "transcript": "Hi, my name is Tanisha and this is my session 9 assignment for management 310. First, I'll be starting off by explaining what we need to analyze in this assignment. I'll be first explaining what the question is and what answers do we need to find through this analysis. So what we need to do is calculate the weighted average cost of capital for Netflix in connection with a hypothetical $5 billion content investment decision. Your analysis must deter determine current WACC. Evaluate the impact of additional debt financing. Assess project specific versus firmwide discount rates and compare Netflix cost of capital to industry peers. So the data we have for these financial parameters would be the market cap is $200 billion. Total debt is $14 billion, debt is $13 billion, equity beta, the risk is 1.3, bond rating has a yield of 5.8%, corporate tax rate 21% and the current stock price is $450. The information we have about the market is it has a risk-free rate of 4.5%, market risk premium 5.5%. Media industry WCC range is 8 to 10%. Strategic context or its competitors. Uh the information we have about its competitors include Disney Capital Structure has 70% equity, 30% that with a WCC of 8.2%. Amazon Prime Video uses Amazon corporate WACCC 9.5%. Netflix is considering 3 billion additional debt assurance for content investment. So this is all the information that we have for this analysis. The main concept that we'll be using in this assignment will be the weighted weighted average cost of capital. First I'll be explaining what this is in easy language and then I'll be moving on using the driver principle to find my analysis and find the answer to these questions. So let's just first go and see what WACC is. The weighted average cost of capital is basically the interest or the average interest that a company pays to fund its project or its company. So there are two types of basically uh funding. So either it's equity or debt. So this formula helps us calculate the weighted average cost of capital. So that is basically the cost if the project so as Netflix is uh doing a project that is hypothetically for like $3 billion. If the weighted average cost is less than $3 billion, then it's a good deal. But if it is more than the value of the project, then it's not a good deal. So this is basically the amount a company needs to pay to fund its own company. What this formula basically is WCC equal to E upon V multiplied by E. This is E is the market value of equity of the company. V is the total firm value. Re is the cost of equity. This is the equity side of this formula. Then the debt side will be D upon V where D is market value of the debt. V is again the total value of firm. RD RD is the Yes. RD is the uh rate of the debt. 1 minus T is the corporate tax rate. So these this is the whole formula that will help us basically calculate the WACC and we'll be using this formula in this question. Okay. Now let's go in first using the R framework we'll be answering the questions. So the in the refined stage what we are evaluating is we evaluating the Netflix investing in a $5 billion uh project. We need to calculate Netflix current WACC. Calculating WCC after issuing 3 billion additional debt. Determining uh determining project specific WACC comparing uh WACC to Disney. Um as we had a question regarding comparing it to its peer and recommending Netflix optimal capital structure strategy. The question that we need to answer would include how much does it cost Netflix to raise money which is basically WACC. How does adding more debt change to change the cost of capital uh after adding the $3 billion debt? Should Netflix use different discount rates for US and international projects? How does Netflix compare the competitors like Disney? What capital structure minimizes Netflix WCC? Okay. After this stage, I'll be using this Python code that I u extracted from Gemini. Uh with the help of Gemini, I was able to uh use this code over here. The code is also based on the driver framework and kiss principle. So it's like easy for people to understand. First it includes all the parameters that we had from the question. Through this it'll be through the implement stage uh it'll be implementing this formula of WACC and it'll be able to help us to calculate the WACC. So if I run this code as you can see over here. So over here the okay so with the help of this code I was able to calculate WCC currently for Netflix and Netflix post $3 billion debt. So in the implement stage basically we implemented the code and reduced the formula to calculate the WCC. So the current Netflix WCC is 11.22%. Which was calculated using this formula from this code. Now I'll explain the research um part. This research part is basically from all the parameters that were given is in the question. These are all the formulas that were used in this code. This is the implement stage in which we calculated the WACC uh from this code. After adding a $3 billion debt, our code calculated 11.20%. Which is the WCC after adding $3 billion in debt. So what this basically means is currently if Netflix has uh has to find its uh interest that it'll need to pay to fund its project it'll come out to be 11.22%. But if it uses a huge chunk of debt which is $3 billion the cost would come down a little bit which is 11.20%. We can also validate this which is the next step in our thing using this graph that we got from this code. What this graph basically shows us is this is pre uh debt of $3 billion this part. So the blue part is the equity, the orange part is the debt weight. As you see after taking the $3 billion loan the equity share moved a little down and the orange part which is the debt width which increased. So this basically shows us that even if Netflix takes loan it wouldn't affect its WACC by a lot. It'll only affect it a little bit. So that means Netflix is in a stable position to take debt and it'll be better if it uses this ratio in which the debt weight is this much and the equity weighted is this much to explain my finding Netflix current WCC is 10.9% if this the calculation is a little bit different uh because this was calculated through the code that Gemini gave us and this was calculated ated through Gemini's actual calculation. So this is why it is a little different but the difference between post $3 billion debt and pre3 $3 billion debt is the same. So this is the minimum required return must earn on new investments. After $3 billion debt the WCC drops to about 10.7%. which we saw also here there's like a really minimal drop in WACC which means debt is cheaper but equity becomes slightly riskier the net effect is small in reduction in WACC now to answer this question compare Netflix WCC to Disney and explain differences I'll be able to answer this question in this explain phase so Netflix WCC is 10.9%. Disney WCC was 8.2% which is given to us in the question. The reasons behind this would be Disney is more diversified. It has a lot of components in its business. It has more stable revenue streams, lower beta which means lower risk which in turns means lower cost of equity. That is why it's WCC is better than Netflix and it has a stronger credit profile. So which means it can get cheaper debt from the market. The takeaways from this explain phase will be Netflix is riskier because it has a higher WACC and Disney is slightly safer because it has a lower WACC uh as compared to Netflix. Now in the last reflect stage um recommend optimal capital structure strategy. Okay. So in the last stage I'll be able to explain that answer. Uh Netflix has gradually increased leverage from its current low level about 6% depth a target of 20 to 25% depth similar to Disney. As we just saw that the WCC of Disney is slightly better than Netflix. The reason is because they're they are using kind of this ratio. So they have a higher debt. So Netflix should also target a higher 20 to 25% debt ratio. The reason behind that is as we just saw in this graph post debt the structure is better um and the WCC slightly lowers down. debt is cheap due to tax benefits and it improves the shareholder value. If the WCC is posted, the that would obviously be cheaper uh which gives them tax benefits and it improves the equity value. However, Netflix should avoid high leverage because it is less diversified than Disney. uh we saw the reason which is basically the WACC revenues depend heavily on subscriber growth. The revenue of Netflix is basically the major chunk comes from subscriber growth. Uh excessive leverage would sharply increase equity risk. So if it raises more money through its shareholders value or through equity that is that means the excessive leverage it would increase the risk of equity. So to conclude uh this analysis I would say a grow a controlled increase in debt improves Netflix cost of capital while preventing any financial risk and Netflix should move towards a moderate leverage structure not an aggressive one. So this will be my recommendation which will be able to answer this uh question for our analysis. Thank you.",
  "video_url": "https://youtu.be/kiQqUFRk6ys"
}