{
  "student_name": "None None",
  "org_defined_id": "036111483",
  "username": "bowma177",
  "video_url": "",
  "transcript": "All right. Hello, my name's Silas. You're first and we'll showcase the.\nSilas Cameron Bowman 0 minutes 14 seconds\nAnd.\nSilas Cameron Bowman 0 minutes 16 seconds\nPlaybook. So first it starts with the track chat trigger that is connected to the conversion memory, which is also connected to the financial advisor agent so they can communicate together and they can remember and remembers what the track trigger is.\nSilas Cameron Bowman 0 minutes 31 seconds\nThen we have the open A I chat model that provides us with the A I then a market data API tool that gives us market data, a risk calculator tool that calculates risk and a scenario comparison that can compare scenarios for us. All right. And this is what it looks like. So stock decision advisor.\nSilas Cameron Bowman 0 minutes 49 seconds\nWhat it tells us what it can do for for me real-time stock market analysis, livestock price tracking, market trend analysis, then advanced risk assessment, sharp ratios, value at risk, other things, stock comparison analysis, side-by-side stock comparisons, risk and return trade-off evaluations and contextual investment guidance. So cleaning.\nSilas Cameron Bowman 1 minute 8 seconds\nEnglish explanations of stock metrics and then it can it provides example questions if needed. So as you can see I said should I invest in the video comes up with a bunch of considerations and questions to consider.\nSilas Cameron Bowman 1 minute 24 seconds\nSo if I'm doing this with my goals, I'm gonna say what are you looking for long term or short term growth if you're a long term investor, so.\nSilas Cameron Bowman 1 minute 34 seconds\nWould I be able?\nSilas Cameron Bowman 1 minute 39 seconds\nTo make.\nSilas Cameron Bowman 1 minute 49 seconds\nOr.\nSilas Cameron Bowman 1 minute 50 seconds\n$1000 in five years.\nSilas Cameron Bowman 1 minute 59 seconds\nSo as you can see here at the top before this, it pulls the approximately with the recent change, with the prices, the stock volume, what it is, the key considerations for investing in Nvidia questions to consider, you know, recommendations.\nSilas Cameron Bowman 2 minutes 15 seconds\nProvides hey the stock and experience fluctuations 24 high and a low and can provide recommendations.\nSilas Cameron Bowman 2 minutes 26 seconds\nSo from this from what I just input.\nSilas Cameron Bowman 2 minutes 32 seconds\nIt provides me the investment metrics, the risk assessment, you know, potential outcomes it has for me and the conclusions and then also provides recommendations at the end. So this.\nSilas Cameron Bowman 2 minutes 47 seconds\nIs the project and it provides a understanding and solves the problem of asking the question of should I invest in this stock and to show kind of the improvement I had to do working with AI to help build.\nSilas Cameron Bowman 3 minutes 6 seconds\nChanging this, asking it questions and at first it was not outputting a correct visual and then I output the worked with it to create a correct visual. So thank you.\nSilas Cameron Bowman 3 minutes 24 secondsOh, and then up here it also does. The important disclaimer is this AI provides educational analysis only licensed financial advisor before making your decisions."
}