{
  "student_name": "Michelle Cheng",
  "org_defined_id": "037286470",
  "username": "cheng754",
  "email": "",
  "transcript": "Hello, my project is an investigation into market efficiency using the 2021 GameStop short squeeze as a case study. So, the core question is, was this event a black swan that broke the market or can it be explained? And crucially, what does it tell us about the efficient market hypothesis? So to conduct this analysis I follow the driver framework. This process is mandatory for assignment. So I'm just going to get started. Um so the entire process begins with stage one um define and discover. The define part is simple. Define the problem. The prompt askked us to analyze the GME event test EMH and evaluate behavioral financial finance. The discover part is the most critical first step. This isn't about analysis. It's about factchecking. We're not allowed to proceed until we verify the data we're given. Um my discovery work found this is factually incorrect which is that the assignment provided a critical first step which is to verify the statement GameStop traded at 0.04 in August 2020. Um, I searched historical market data and GME's lowest price in all of 2020 was 2.5 uh $2.55 in August 2020. It was trading around $4. Um, this DND process was invaluable. It stopped a critical data error before it could position the analysis. I also used this stage to verify the other facts which were correct. Short interest did peak over 140%. And the Melvin capital did lose 53% of its value. Now moving on to the second stage which is represent. Um this is the planning stage after discover but before implement. So this is where I designed the how for the analysis. My plan had two parts. First part is a technical plan. I would use a Python and a Y finance library to download GME's price and volume data. So to test a weak form of EMH, my plan was to chart a price against its 50 and 200 day moving averages. And um my second one, my second plan is a qualitative plan. So to test a semi strong form, I would compare the market price to the publicly available facts we just verified like the $10 and to $40 analyst targets. So with a solid plan, I move to stage three, which is implement. So right here are the codes. Um first I download the GME's price and volume data. This chart right here is the first result that implementation. It perfectly visualizes the event. On the top you can see the price flat flattered for um some years for years and then the explosion in January 2021. On the bottom you see the trading volume showing that the price peak was driven by an absolutely unprecedented surge in trading activities. It's crazy. Um next I implemented the plan to test a weak form. I calculated the 50-day and 200 day moving averages and plotted them against the price. So this is the result chart. However, nothing came out which I'm still working on but that is what I am trying to do. Now we're on stage four which is validate. Um the implement stage g gave me charts and validate stage is where I interpret what they mean. So first the moving average chart the weak form EMH status um states that you can't use past price data like moving averages or predict future moves. The price should be um a random walk. This chart is not a random walk. It shows a massive sustained uh deviation from the historical average. This is a clear visual validation that the weak form EMH was violated. Um second I uh validated the semi strong form. This form says price reflects all publicly available information. The public info include included analyst targets of $10 to $40. The market price hits $483. The price was completely detached from public fundamentals. Therefore, the semi strong form was also violated. So then moving on to our next um second to last stage which is expose where I synthesize everything into a final answer. So if the market wasn't efficient what was going on the answer is behavioral finance hurting. So um what the r/wall street bets was a mechanism that allows thousands of individual investors to act as a single herd. Uh second one being limits to arbitrage rage ema assumes rational investors will short the stock back to its real value but they couldn't. Why is that? Because the cost to borrow shares was too high and the risk was infinite. So, as Melvin Capital learned, um the Robin Hood buying restrictions were uh a literal limit to arbitrage. Finally, could a rational investor have profited? No. So, this wasn't a systematic, repeatable strategy. it was a lottery and EMH is concerned with systematic opportunities not lotteryies. So lastly, finally going up to um our review stage which is right here. You can see um the process worked perfectly and uh the driver framework by forcing me to start with the fine and discovery uh was the most important part of this assignment. It saved me from using bad data. Uh the conclusion is clear. the game stop if that is perfect case is a perfect case study um of a behavioral market. It proves that while markets are mostly effective, they're not perfectly efficient. And when you a unique set of conditions align, a social catalyst, a clear enemy, and limits on arbitrage, mass psychology can temporarily and um spectacularly defeat fundamental logics. So basically what we learned is that we can never control the market and predictions can always fall off. So I think that's it. Thank you for listening and that is my session sess session eight project.",
  "video_url": "https://youtu.be/KtANjFBlgZc"
}