{
  "student_name": "Tomas Gomez",
  "org_defined_id": "037922167",
  "username": "gomez281",
  "email": "",
  "transcript": "Hi Dr. Zhang, how are you? My name is Tomas Gomez and this is my session 9 assignment uh cost of capital analysis. Okay. So, uh the assignment overview is to we have to calculate the weighted average cost of capital or the WACC or for short I may be calling it WAC uh further in this presentation just uh as a clarification for Netflix in connection with a hypothetical 5 billion content investment decision. So basically the goal is to figure out Netflix cost of capital or the WACC for a potential 5 billion content investment. Uh so the key question that we have to uh investigate in this assignment is how much does it cost Netflix to raise money today and how does that change if they add more debt? This matters because WACC determines whether the project creates or destroys value. So here are some important financial inputs uh that we need to know that is given to us. Uh obviously the hypothetical the market capitalization is 200 billion which means that Netflix has a huge equity base meaning Netflix is very equityheavy. The total debt book value is 14 billion. But for this uh assignment, we're going to focus more in the market value because that's what uh weighted average uh cost of of capital uses in its calculation. So the debt market value is 13 billion which is relatively low leverage compared to peers and especially looking at the uh at the other companies that we're going to go over in in in a couple seconds. Also the uh equity beta is 1.3. The beta measures how risky a company is basically. and Netflix 1.3 beta is riskier than the market which raises the cost of equity. Uh the bond rating of tripleB plus and a yield of 5.8% is a rough estimates of ne of Netflix cost of debt before taxes. Then the corporate tax rate is 21% which this is needed for after tax debt costs uh because WACC always uses after tax. Um and then uh we have to go over the market conditions. These are very important in our analysis. And uh the risk-free rate is 4.5% plus the market risk premium is 5.5%. So these are all uh CAPM or capital asset pricing model ingredients for calculating the cost of equity. Of course all these are ingredients that we have seen and have gone over in previous assignments. So now it's uh really cool how we can get to use all of this knowledge that we have been construction periodically uh to keep using it to move forward in our assignments. Uh and then uh the current stock price is 450. I I I forgot to mention that which is I mean it's it's mostlyformational because the market cap already gives us the equity value. Then there's also the strategic context that we need to know which is really important. Uh for example that the uh Disney capital structure is 70% equity 30% debt. So the WACC is 8.2% 2% which Disney obviously benefits from scale and diversified revenue so it's more stable. Um, Amazon Prime uses uh Amazon's corporate uh WACC, so it's 9.5%. So, borrowing Amazon's ultra super strong balance sheet helps obviously Amazon Prime Video and it's important to take into account that the industry WACC range is between 8 to 10%. So this helps us sanity check uh Netflix number. So the implication is that if if Netflix WACCC ends above 10% it signals the market views Netflix as a riskier investment. Then the strategic point that we have to take into account is Netflix considering uh three billion additional depth insurance for content investment. So this additional leverage affects the tax shield. So it lowers WACC and uh however it might raise WACC if it's overdone. So what we're going to do in this assignment is uh quantify how much depth quantify how much the WACCC changes with the added depth that we're taking into account. Um and for this we're going to do some project specific discount rates. So for example for US content it's similar to firmwide risk. So we use the normal WACC but for international content there's a higher risk uh because of uh political problems or market entry. So there's an extra 1% of cost to equity. Um and before going over the the the code on on the output I want to uh talk about our the the represent state the representing. So my my plan to carry out this this analysis this assignment is uh before coding uh compute the cost of equity using the capital asset pricing model and compute the after tax cost of depth. Then I adjust the capital structure with the new depth calculates project project specific uh WACC's and generating a sensitivity plot and finally comparing Netflix to its to to to its industry peers. So now that we have gone over all the all the information and outlined everything we need to know uh the next thing I did was uh going to Google Gemini and giving him my code. It was a a pretty long code. Honestly, one of the prompts, sorry, giving it a prompt, one of the longest prompts I have I've I've done. But I wanted to be really specific and be able to get a lot of analysis and a lot of depth out of this assignment. Uh, and it created uh this Python code which I then exported to Google Collab. And here we can see the code is is is divided in different sections. defining the inputs uh computing the firm value and weights calculating the capital asset pricing model uh the things I say I was going to do in my represent part computing the after tax cost of debt uh current WACC and know that the code continues and this is uh the output that I was given which initially I was a little surprised because I expected it to be a little longer but uh this is absolutely perfect like uh in my opinion because uh I asked it to use Python only code only with minimal remarks no comments so that it was I that did the whole explanation rather than just reading uh what Collab said off the screen. Uh so here we have the Netflix WACCC analysis results and here are some pretty interesting numbers that they all contribute to answering the the question that we are going over in this assignment. So first we have the current equity weight is 93.90%. What does it mean? This means that Netflix is almost entirely equity financed. This confirms what we saw in the in the define and discover stage that Netflix runs a very low leverage business model. What does what does this imply that I mean high equity is high equity weight is higher weighted average capital cost. Um because equity is more expensive than debt obviously. And then uh contrarily to the we have the current depth weight which of course is 6.1% because added to the 93.9% of the current equity weight obviously has to add up 100%. So the current debt weight it's just above 6%. Uh and this is incredibly low compared to Disney that we know had a 30% debt and typical media companies that have 20 to 40% debt and Netflix has only 6% debt. So this explains why Netflix may have a higher cost of capital than Pierce because it's uh current depth weight is really low. And using this information uh the output we got is that the current uh weighted average cost of capital is of 11.22%. So this is a firmwide discount rate today. Um what we can see from this number is that it's above the industry range which as we know was 8 to 10% and obviously above both and Amazon Prime Video. So uh our main takeaway here is that Netflix pays uh more to finance projects because investors view it as a as riskier and because it relies heavily on equity. So, uh, yeah, that's what we know. Our WACC, our current WACC is 11.22%. Uh, and then we move to uh the WACC after the new debt um is our next point of analysis. And as we can see here the WACC after the extra three billion in debt is 11.13%. So uh after issuing the new 3 billion the WACC drops but very very slight from 1122% to 11.13%. Uh this drop is very small but uh regardless it's logical because more debt uh equals more tax shield um and debt obviously is cheaper than equity. However, the effect is very mild in this case because it is a three billion investment. So it's obviously a great amount of money but in the industry that it works and obviously with the capital that it usually works with three billion is not that much. And even after the investment, Netflix still stays mostly equity heavy, like really really equity heavy. And the bond yield of 5.8% isn't dramatically lower than the cost of equity. So this is our uh weighted average cost of capital after the debt insurance. And here at the last two sections, we have the project specific uh WACC's. Uh first we look at the US project WACCC is obviously 11.22% because as we know it's the same because US content uses firmwide risk. So we apply the uh normal cost of capital. Um but then we have the international project WACC which increases to 1216%. So as international deals are riskier um because of as we said political risk, FX risk, new markets uh that pushes the WACC up making global projects harder to justify financially. Uh and obviously we know this because the assignment told us to add 1% to the cost of uh to to the cost of equity. Um then uh we have this uh plot of WACCC sensitivity to leverage. So depth to value this plot is uh really interesting because here we evolve and we take into account a different scen different scenarios different sensitivities. Uh so this chart shows in the x-axxis we have the debt weights um which ranges from 0% to 50% here is 0.5 but obviously we know that means 50% and in the y-axis we have the wacc ranging from 8% to uh 11.5%. this line slopes downward. Uh meaning that as Netflix takes on more debt obviously to a certain point uh the WACC goes down. This is because debt is cheaper than equity and debt creates a tax shield. So a low risks uh more debt improves the capital structure. In this chart we're changing our major assumption our major assumption which is the capital structure. And here we're observing how the WACC reacts. Um is as we can see here when the uh debt weight is really low like uh at zero or at 10% then the weighted average cost of capital is really high like 11% 11.5%. But as the dead weight um decreases uh to the right like to 40% or even 50% the weighted average cost of capital decreases uh to uh 8% or 8.5%. So here we can see in different scenarios how uh how this would behave. Here we can see that Netflix optimal capital structure is definitely not 6% debt. The pl the plot shows that a more reasonable leverage of 20 to 40% would reduce significantly the weighted average cost of capital. uh which also explains and connects to why Disney uses 30% debt and Amazon's WACC is supported by I mean Prime Videos is supported by Amazon's strong uh strong position. So Netflix is underleveraged uh related to peers. Here obviously we have at the end a little summary comparison that uh the the code gave us in which uh it just goes over a little overview saying Netflix WACC is higher than Disney and Amazon and significantly exceeds the industry range and adding a three billion in depth slightly lowers WACC due to the tax shield but the capital structure remains highly equity focused compared to uh industry peers. Um then to just uh validate a little the the the information uh how does these uh if this result does this result make sense compared to the industry and the the answer is that yes it definitely makes sense because Netflix 11.22 22 WCC is as we know both higher than Disney, Amazon and the industry range which gives validity to the model we're using as it aligns with the economic intuition in which uh the more debt you take on the lower your weighted average cost of capital uh is. Um and then just basically to to to wrap it up, what all of this means is that uh Netflix current capital structure is uh very equity heavy. It's unusually equity heavy which drives their WCC above competitors making their growth more expensive. and adding debt, the 3 billion we're taking into account slightly helps. But Netflix would need much much more leverage, much more than three billion to get closer to a Disney level. WCC or Disney has uh a lot to to to back up because they're they are very diversified. uh but Netflix would need a lot more debt and our sensitivity analysis suggests that also suggests that Netflix should consider more debt long-term if they want a lower a lower cost of capital. H and we know that international projects require discount rates making them harder to justify financially. And then just to finally uh end with with a little reflection, I think uh I was surprised first of all by how high Netflix uh WACC is relative to its competitors. Um, and also I I was very surprised and the biggest thing I learned honestly is how sensitive WACC is to capital structure because I always thought companies like Netflix, of course, in my head, Netflix is this humongous company. And I always thought that companies like that had their cost of capital set mostly by market risk. But this case showed me that just adjusting leverage can change WACC meaningfully. And then the sensitivity plot made it clear that Netflix extremely low use of debt uh is a major factor behind its higher WACC. So yeah, this was my session nine assignment on the cost of capital analysis. I hope you liked it and see you next time.",
  "video_url": "https://youtu.be/auMy9juzDFc"
}