{
  "student_name": "Aly Foster",
  "org_defined_id": "035604553",
  "username": "foste304",
  "email": "",
  "transcript": "Hi, I'm Alyson and to start I'll be going over the assignment overview. So, the goal is to calculate the weighted average cost of capital or walk for Netflix in connection with a hypothetical $5 billion content investment decision. So, your analysis must determine current walk, evaluate the impact of additional debt financing, assess project specific versus firmwide discount rates, and compare Netflix's cost of capital to its industry peers. So, from there, we're given the Netflix financial parameters as hypothetical. So, to start, the market capitalization is $200 billion. The total book value debt is 14 billion and the market value debt is 13 billion. And then from there the equity beta are 1.3. The bond rating is BBB plus yield 5.8% corporate tax rate is 21% and the current stock price is $450. So the market conditions are a risk-free rate um 10-year Treasury which is 4.5% a market risk premium at 5.5% and the media industry walk range at 8 to 10%. And then the strategic context is a Disney capital structure which is 70% equity and 30% debt with a walk of 8.2%. Amazon Prime Video uses Amazon corporate walk at 9.5% and Netflix considering $3 billion additional debt issuance for content investment. And then the analysis calculates that Netflix's current walk, determines walk after $3 billion debt issuance, evaluates project specific walk, and compares Netflix to Disney and explains the differences. And then finally recommends optimal capital structure strategy. So from there this is my driver framework. So I have the objective is to calculate Netflix's walk assess the impact of the $3 billion debt issuance um compare peers and recommend an optimal capital structure. So all of these inputs being the market cap, debt, beta, bond yield, um tax rate, risk-free rate, and market risk premium are the building blocks of this situation. So for research and reason, we use the CAPM cost of equity, which is a risk-free rate plus beta times the market risk premium. And then for debt we adjust for taxes because interest is deductible. And then finally walk blends equity and debt cost by weights. So CAPM explains the risk-free rate beta and market risk premium. The cost of debt determines why after tax adjustment matters. And the walk shows how weights shift when debt changes. And then a little bit more information is walk is built on the cost of equity and after tax debt. CAPM shows the return that shareholders require and combining these will give the firm's overall rate for investment decisions and then interpret. So Netflix's cost of equity is the 11.65% which is high because investors see risk. And then debt is cheaper at the 4.58% after tax. So using the walk formula seen above, we see that the walk is 11.22%. And then if Netflix issues the $3 billion in debt issuance, they will bump down to 11.13%. So that's a small drop, but it shows a debt helps. Um, but that equity risk tends to take over. So to continue, all of the rest of those are found in this code. So I told the code to take all these assumptions and inputs and calculate the market cap, debt market, and everything else that we talked about. and then also to interpret the results and then make a com a pure comparison. And then from there we see the define and discover shows the assumptions and inputs and then all of the percentages that we had given and then research and reason we talked about is the formulas and then interpret was the results. So then here it also shows the peer comparison. So compared to the peers, Netflix has the highest walk. So Disney at the 8.2% benefits from the stable cash flows whereas Amazon at 9.5% um shows growth risk. So Netflix's higher walk means that it must generate stronger returns in order to justify those investments. And then from there validate I had it make two graphs to show the relationship between debt ratio and walk. So this shows that they are strongly correlated and the red dotted line shows the current walk and the green dotted line shows the post debt walk. And then here is the relationship between the beta and the walk. So again correlated very strongly. And then for explain and recommend it outputs this information but I also put it in my driver framework. So for explain it shows that Netflix's walk is 11.22% 22% which is above but not greatly above Disney's 8.2% and also within the industry range of 8 to 10%. So this means that investors see volatility therefore um Netflix's walk is higher because of the high beta and then Disney's lower walk shows the benefit of diversification. So for recommend we see that moderate increases in debt can reduce the walk slightly but excessive leverage raises risk. So the target debt ratio near the 15 to 20% for optimal balance and therefore Netflix should gradually increase its debt ratio toward the 15 to 20% which in return balances the tax shield benefits of debt in order to maintain flexibility and protect credit rating and then it also moderates leverage strategy while slightly reducing walk which in return will improve capital efficiency and align Netflix more closely with the industry norms. So most importantly, the biggest takeaway for me is that management should apply project specific rates using higher international walk ensuring that investments are properly risk adjusted. Thank you.",
  "video_url": "https://youtu.be/1OtbsKJoS8M"
}