{
  "student_name": "None None",
  "org_defined_id": "035882855",
  "username": "krame144",
  "video_url": "",
  "transcript": "Project 2, what I'm doing here is I wanted to create an AI finance advisor toolkit. So you put in a prompt at the beginning and give it all of the given information through an Excel file and it'll give you an appropriate response. So what we do here is we start with a webhook prompt and then you upload the Excel at the Google sheets that I have right over here with all the information, just your specific name, state you're from, monthly income, expenses, debts, assets, goals, important information like that. \n\nAnd then it was just a lot of coding that was generated through AI and it was very well thought out, very well understood and very clear. It's very, very clear when it comes to describing what everything is and what every word and line of code was. So I did think that that was very, very helpful and then of course you need to get through the code. \n\nSo we're starting with the webhook and then we go into an HTTP request node to use what we have available. We'll go into function nodes a lot of function nodes but all the coding was about and it's just getting that information in there. And then my secret AI code is in here with the messaging model. \n\nI just used OpenAI which is what we did in mini project two. And then you finally get a response to the AI question that you ask. So for example, I just want to prove that this does work, our output here. \n\nIt's kind of pulling that information given from the Excel files. And so when you ask the question like, should I save my $500 or should I not? It pulls out the information here like no monthly expenses or it doesn't have an employer match and it has more specific calculated responses here, which is really nice and something that Excel doesn't give you. So if you needed to actually calculate like your expected equity return or inflation, this code is doing it for you. \n\nAnd so I think that's what is very helpful about it.This project is about building an AI-powered finance advisor in n8n that can take natural language questions like \"Should I invest or pay off debt?\" and return clear, contextual advice. The workflow starts with a webhook to capture the user's query and profile ID, pulls profile data from a Google Sheet, and fetches market assumptions. Code nodes then normalize the data (debts, assets, emergency fund) and apply guardrails such as prioritizing high‑APR debt or ensuring a minimum emergency fund. An AI node (e.g., OpenAI) analyzes scenarios over different time horizons, explains tradeoffs, and outputs both structured JSON and a human‑friendly summary. Finally, the results are delivered back via webhook response, Slack, or email. The outcome is a self‑contained advisor that not only crunches numbers but also explains the \"why\" behind recommendations, making financial decisions easier to understand and act on."
}