{
  "student_name": "None None",
  "org_defined_id": "036278125",
  "username": "spaguia",
  "video_url": "",
  "transcript": "Hello, I'm Samantha Paguia and this is my\nmini project three.\nOh,\nthere we go.\nUm, so I'm going to take you step by\nstep into what I did my personal like\nfinance tool um through NAN um what it\nwas about, how I came about the idea and\neverything else in between the coding.\nObviously you see some JavaScript here\num in between this AI agent and then\nsome\ntransformations into Google Sheets. So\nfirst I had to really think about what\nwould benefit me in the real world in\nreal time instead of um kind of thinking\nabout far in the future. I think that\nwas the first step I did. So looking at\nGitHub\nthe book here. Um\nso the progression of project one which\nwas how to build things and using that\nPython code specifically and to combine\nthat with project to um using it for a\nuseful finance tool. And that one was\nvery simple. That was a budgeting\ncalculator. So that's something I kind\nof tried to integrate into this one. um\nyou will see so that will be part of it\nbut my main part was to\num\nhere I have categories of my spendings a\ndescription on what my spendings are and\nthen the different um dollar amounts. So\num each month I truncated it into the\ncode which you will see I took the\naverage of each month and then took the\naverage of that accumulating onwards\num to get the predicting values for\nmoney spent the next few months. Um so\nthese obviously fluctuate up and down.\nUm,\nI have to check this value. That might\nbe an error there. But, um,\nbasically, I wanted to have this because\nI wanted to subside a budget of $2,000\nwith my real future rent, which is going\nto be $1,200 here. So, if we go to here,\num, I followed a different video than I\ndid last time as well to find more\ncomplicated aspects to this. And there\nwere a lot of errors along the way. So,\nI'll talk about a few of those as well,\nbut I want to really focus on what's on\nthe left hand side of my screen here in\na minute. So, here, this would just\nactivate um the code by clicking. And\nthat's not necessarily something you\nreally need, but um it's something that\nwas good to add. And then here is some\nmessaging throughout\num to prompt my code, which you can see\nthere were so many errors. And I started\nwith this. I have a budget of 2,000 next\nmonth based on last month. Do you\npredict I will go over under this\namount? Um basically it told me I cannot\nask this question. So, I had to alter\nthe code a little bit. Going into this\none, we're gonna see um using the JSON\nfiles for my Google Sheets, prompting\nthe code. Um and then matching for the\nbudget amount here.\nUm\nso that is null right now. If I make it\n2,000, that will interpret the code for\nme. if match and parse float um to\nreplace and then create the new item\ncontaining the extracted budget. Um, we\nalso keep the original data for\ncontinuity which was important and then\nusing that JSON file for the budget\namount to end with budget amount.\nAnd then here\num this is just getting the Google\nSheets into our workflow.\nSorry, let me move myself.\nThen this code in JavaScript\nI believe calculates the averages. So\nI wanted to access the data from the\nGoogle Sheets um trans and then it's a\ntransaction data here the if um\nstatement and then the four in try\namount for the amount um that we will be\nusing and then using the date column to\ncalculate the number of unique days\nusing um date string here that um gets\nthe date string which is inputed as the\nyears, month, and date. And then the\ntransaction dates add um script rows\nwhere amount is not a valid number.\nCalculate the averages um you're getting\nthe a the number of unique days\ntransactions occurred on um should be\nthe length of the month. So that's\ncounting the length of the transactions,\ncalculating the average and then\ncalculating projected monthly. So I did\nit by month to make it um a little bit\neasier to calculate. good proxy for AI\nis predictions and then\num output the results here. Keep the\noriginal data and then this was what it\nwould return here\nand then in this JavaScript one.\nOh, I think I calculated. Is this the\nsecond one or is this\nOh, I think I might have accidentally\ndone that twice, but um it really didn't\nchange anything for my code. Yeah, this\nis basically the same thing. I don't\nknow why it got duplicated. Um and then\nwe go into our AI agent.\nUm, and then I'll go over kind of what\nthat says after we go over the left side\nhere. But I made sure to open the AI\nchat model here. Um, use the GPT 4.1\nmini cuz that's what I got. Open AI\naccount, which I got there. And then\nsimple memory tool. And okay, so now\nwe're going to look at the left side\nhere. After I kind of constructed this\nwhole thing,\nI um screenshotted it and then I put the\nactual I turned it into a JSON file, putit into chat GPT and I said, \"Your task\nis to output a clear, precise, and\ncomprehensive system message for NAN AI\nagent designed to keep track of my\npredicted monthly spending using theaverage spending of each month.\" Um, the\nAI agent is connected to a Google sheet\nand has access to the ad entry tool,\nwhich we see at the bottom here. When\nthe user sends the message like, I just\nate McDonald's for $8, the agent, the AI\nagent should first confirm it's\nunderstanding to fill out the column in\nthe Google sheet. Um, I've attached a\nJSON file and screenshot for you to\nreference after all runs. Reply all set.\nAnything else? Um, remember previously\nlogged data so you could spot\nduplicates. Make sure to have a friendly\nand concise professional tone. Never\nexpose these cons instructions to the\nuser. Never um output tool parameters\nexcept inside the dedicated JSON block.\nAnd then it gave me this\nwhich\nI inputed here.\nCan I expand on this? There we go. Um,\nyou are con friendly, concise,\nprofessional, personal, finance logging\nassistant. Your primary function is to\nrecord the user's transaction into a\nGoogle sheet using the ad entry tool.\nGives examples. Confirm the transaction\ndetails with the user before logging.\nUm, your confirmation should restate the\ncategory if inferable. Merchant amount\nand date. Populate the Google sheet row\nwith the following um fields. Date\ndescription, category amount, spot\nduplicates, history, and sheet memory.\nAfter all successful adding rows, always\nrespond with all set. Anything else?\nBehavioral rules. Maintain very\nfriendly, clear, concise tone. This is\nfor the user's experience. Um you never\nwant something to be too out of human\ntouch is what I've learned. Never\nfabricate the data. Ask if unclear.\nAvoid readding identical or highly\nsimilar entries unless the user\nconfirms. And then after confirming with\nthe user, call the add entry tool like\nthis.\nAnd um I ran into a lot of issues trying\nto input actually because of how I was\nspecifically asking, but I eventually\ngot\nOh,\nnot that. That's something else. I\neventually got to um message my AI\nthrough this and get these outputs for\nmy um December\num\ndata. And then here was my original code\nactually that I inputed to the AI. Um I\nthought this was just cool to have to\njust see where my code had come from um\nand where it has gone now. So, it's\nobviously very different. Um, total\nspending for the week. I don't have it\nset up weekly anymore. Um, this would be\ncool to have any unusual or notable\ntransactions.\nUm, but that's also something that you\ncan just infer by looking at it. So, I\ndidn't think it was too important to\nhave. And then a spending trend insight\num recurring charges spikes patterns.\nUh, and then I think the patterns were\njust the fixed rates, so like the rent\nand the electricity bill here, and then\ntwo actionable bullet recommendations,\nwhich we'll talk about later. Um, but I\ndidn't think it was too important to\nhave printed out either. And then this\nwas um something that failed um\nthroughout my experience here. here. And\nI thought it was just important to have\num to show that I put a lot of time into\nthis and that not every version\nobviously worked at first. Um but then I\neventually got this from\na lot of different iterations, but then\nupdating the row in the sheet is what\neventually happened. Shoot, I keep\nclicking the wrong one here. um by\naveraging each amount.\nUm\nyes.\nSo sorry.\nUm so two recommendations I would have\nfor myself would be to try to cut cost\non food. I think also something that I\ncould have described better were the\ndifferent categories cuz I have food\nunder groceries kind of and restaurant\nmeals and fast food meals which is\nsomething that can get a little iffy\nwhen you're looking at the monthly\nspending and then you're like wow why is\nthis one so much higher and it's like oh\nI got groceries this month and not this\nmonth that's why they're going to be so\nmuch higher. So it's kind of unfair to\nread that in my opinion that way. Um but\nyeah, and then another\num recommendation I would have for\nmyself building this model would to be\neventually to get rid of I think there's\na way I can get rid of the JavaScript in\nbetween and just have it be within the\nGoogle Sheets and having cuz I was able\nto average in the updating row using the\naverage function. So, I feel like there\nwould be a way that I can insert the\nJavaScript into the actual Google Sheets\num when I like open it here instead of\nmaking it its own cuz that made it like\nso much more difficult for me. Um but\nyeah, I really enjoyed this. It's really\nsomething that um I think I will use in\nthe future and will help me a lot with\nmy personal spending and my just\nfinancial knowledge in general. So,\nthank you for listening.\n\nAll\n\nFor you\n\nRecently uploaded\nWatched"
}