{
  "student_name": "Isabella Wish",
  "org_defined_id": "037174968",
  "username": "iwish",
  "email": "",
  "transcript": "Hi. So today I'll be going over the session n assignment of cost of capital analysis using the driver method. So first of all, first I'm going to just go over the assignment. The assignment we were given is to calculate the weighted average cost of capital or WACC for Netflix in connection with a hypothetical 5 billion dollar content investment decision. Your analysis must determine the current WACC. evaluate the impact of additional debt financing asset project specific versus firmwide discount rates and compare Netflix cost of capital to industry pierce um for next Netflix's financial parameters their hypothetical numbers is per market capitalization $200 billion total debt book value $14 billion debt market value $1 13 billion Equity beta is 1.3. Bond ratings or BB+ yields of 5.8%. Corporate tax rate 21%. Current stock price $450 $450. Um for the market the market conditions that we will be going over is the risk-free rate of 10-year Treasury is 4.5%. Market risk premium is 5.5%. media industry WACCC range of 8 to 10% and strategic con the strategic contents is the Disney's capital structure is 70% equity 30% debt um and their WACC is 8.2%. Amazon Prime Video uses Amazon corporate WACCC at 9.5% and Netflix is considering a 33 a $3 billion additional debt insure is insurance for content investment. Now moving into driver, we're going to go into define and discover. So I'm going to go over the financial object objectives of today's presentation. I'm gonna calculate the current WACC of Netflix. Calculate the WAC AC WACC after the $3 billion new debt. Evaluate the project specific WACC and compare the WACCC of Netflix to appears and I will be using Disney re and then I'm also going to re recommend an optimal capital structure. So for some key financial ter terminology that you'll probably hear a lot today um first of all WACCC which I've already mentioned is the weighted average cost of sort of all finance financing resources kapm the this is the model used to calculate the cost of equity tax shield the tax shield the tax savings from interest deductibility which lowers cost of debt. Now on to represent um the first step is to calculate the two main components cost of equity or and the after tax cost of debt then combine them using the market value capital structure weights. What needs to be found is cost of equity after tax cost of debt current and new capital structures and the final WACC figures. So some formula and components that we're going to use is cost of equity which is the required return for equity investors. The equation is K which rep uh represents cost of it's K equals RF plus beta time MRP. So K is represents cost of equity. RF is the risk-f free rate. This is a theoretical return from an investment with zero risk. Um beta is equity beta which is a measury measure of systematic risk. Basically, how sensitive the stock's return is to changes in the overall market. And the MRP is the market risk premium. This is the extra return investors demand for investing in a risky stock market instead of a risk-free asset. Then for after tax cost of debt which um is the return of the return required by Netflix's bond holders because interest payments are taxdeductible the the effective cost of debt is reduced by tax savings creating the tax shield. So the formula for after tax cost of debt is KD uh 1 minus T equals bond yield time 1 minus T. So KD 1 minus T is the after cost represents the after cost of after tax cost of debt. Bond yield which is the pre-tax cost of debt is the yield demanding by demanded by lenders based on how a company's credit rating on the company's credit rating. This is the cost before accounting for taxes. And then 1 minus t is the tax shield factor. This is the reduction in debt cost due to corporate tax. The corporate tax rate which is the t represented in the formula. Next is the weighted average cost of capital WACC. The weighted average cost of cap uh cost of equity and the cost of debt. This is the weighted average cost of equity and the cost of debt based on their proportions in the capitals in the company's capital structure. So the formula for this is WACC equals E / V * K plus D / V * KD 1 minus T. So some of these you may have seen in the previous equations that I went over. So WACC is the weighted average cost of capital. The E divided by V is the weighted weight of equity and that's the percentage of the company's total financing that comes from the equity. K we saw it earlier here and it represents cost of equity plus DV. DV represents weight of debt and that's the percent of the company's total financing that comes from debt. KD 1 minus T as we saw over here is the after tax cost of debt and then V represents the repres represents the total market value. So this is the sum of the market value of equity and the market value of debt. Now we're going to go and move on to implement and I'm just going to go over here into our collab. So one second. So I'm going to sort of just kind of go over some of the key things that you may see. So here you see the cost inputs. So we have the equity beta of 1.3 the risk-free rate of 4.5% or 0.045 market risk premium which is 5.5% pre-tax cost debt 5.8. This is also the bond yield. The corporate tax rate is 21% or 0.21. And then over here you see the Disney's WACC is 8.2% and then the equity weight is 70% 30% debt. Coming down here, you can see they're using the cost of equity formula that we went over in represent and the after tax cost of debt formula that we also went over in the represent stage. Going down here, you can see this is the they're kind of going over the this is the WACC formula just kind of really elongated. Here it is kind of what we did before which is slightly. And then this is the WACC formula calculating for the 3 billion debt insurance because we're going to go over both. And here they're going over the strategic interpretations which I will be going over later in the presentation. So for the important current information that I'm going to go over, this is what it came out with the component costs or the as it says is the building blocks of the WACC analysis. Um so we have the cost of equity is 11.65% after tax cost of debt 4.58%. That's the benefit of a tax shield. And then for the current WACC calculations, they got the current total value or B is 213 billion, current equity weight is the N is 93.9% and the current debt weight is 6.10%. So the and Netflix's current WACC is going to be 11.22%. And then the WACC after the three billion debt insurance would be the new debt value would be $16 billion. The new equity weight would be 92.59% and the new debt weight would be 7.41. This would mean sorry that Netflix's new WACC rate is 11.13 which is going to be considered their hurdle rate. Now I'm going to come back over here and move on to validate. Um, okay. So validate, we're going to go over some of the calculations sort of how they got to what we went over kind of just using the formulas that I brought in represent and finding the same numbers. So for cost of equity, I just did the 4.5 plus the 1.3 beta times the 5.5%. Narrowed it down. It ended up equaling 11.65% which is what the collab showed us. The after tax cost of debt, I did the same thing and I got the same answer. Same thing for the current WACC. found all the numbers, did all the calculations, was brought to the same and the post three billion WACC same calculations did the same. So all the numbers that we received in the collab were correct. Uh and so some logical explanations of the output the current WACCC of 11.22% is very high. the it's the minimum return Netflix needs to satisi satisfies its investors which is mostly high-risisk equity holders because of how high the risk rate is and then the new WACC 11.12 only slightly lower. It confirms that adding cheap tax advantage debt slightly improves the cost of capital but not much. A crucial validating point is the 5 billion content project must exceed the 11.12% return that was shown in the new WACC. That kind of validates the WACC as a project because it's it's the project hurdle rate. It just needs to get over the 11.12%. Now for Evolve, we're going to calculate the WACCC of 11 point using the 11.12% and the provided pure data of Disney's WACC of 8.2%. And then draw a strate strategic conclusion about Netflix's competitive positioning in financial efficiency. Um, so coming back to the collab, I'm going to go over the strategic impleations and what I'll be using for this stage. basically just saying because the hurdle rate as it says here is 11 12 the the WACC needs to be higher that um this WAC because that WACCC is higher than Disney's it's not going to be the best and this is due to this is because Netflix's high equity beta is 1.3 which increases his cost of equity and the Netflix's conservative capital structure which is low of a low of 7.41% is compared to Disney's 30% debt. There's a big difference in those two depths. The debt insurance reduced WACC's by a z by 0.09 base points. So the recommendation that collab sort of gives is that Netflix should consider further increasing debt to optimal optimally you utilize the tax shield. Coming back to our presentation same thing I just said Netflix it relies too much on expensive equity and is missing on the full benefits of the cheap taxdeductible debt or the tax shield. Um so as I said the recommendation is to consider increasing the debt to use that tax shield. Now moving on to reflect some conclusions that I gathered from this is that Netflix's capital current capital structure leads to a high hurdle rate of 11.12%. And the strategic recommendation that we're going to give Netflix should is to increase that components to benefit more from tax shield, lowering its W ACC to bring it closer to 8 to 10% media um indust which is the media industry's average and reducing the high cost of the capital barrier. Now going back on the steps that sorry one sec going back on the driver steps that we went over today in define discover we found the initial components and formulas represent we planned out the analytic steps K um C cost of equity the cost of debt and WCCC or after tax debt to WACC implement we executed the calculations and supported it by with our collab code validate. We confirm the results and the meanings as a hurdle rate and then in evolve we used the result to recommend a strategic changes that Netflix should consider. So thank you for watching.",
  "video_url": "https://www.youtube.com/watch?v=q2BsQRwP1Jc"
}