{
  "student_name": "Jeenay Dedhia",
  "org_defined_id": "036587896",
  "username": "dedhiaj",
  "email": "",
  "transcript": "Hi. Um, today we're going to be doing the session 9 assignment where we're going to analyze Netflix cost of capital for a hypothetical $5 bill $5 billion investment. So, let's see what we have. This is the defined part of it. Netflix is deciding to invest $5 billion in new content. To judge if that's a good idea, we need the weighted average cost of capital, the WACC. WACC is basically the minimum return Netflix Reflex must earn to satisfy both its shareholders, its lenders and its hurdle rate. So we given these hypothetical numbers in the question. The market cap is $200 billion for Netflix. The total debt of the book value of total debt is 14 billion. Market value is 13 billion. Equity beta is 1.3. Bonding rate is BBB plus with a yield of 5.8%. Corporate tax is 21% and current stock price is4 $450. The market conditions right now in an hypothetical thing are 4 the risk-free rate is 4.5%. The market risk premium is 5.5% and the media industry WACC ranges from around 8 to 10%. And this is the competitors of Netflix. So all the peers so the Disney has a 70% equity 30% debt. The WACC is 8.2%. 2% Amazon corporate for the prime bidder WACCC is 9.5% and Netflix is considering issuing 300 billion3 billion of extra debt. So the questions that I will be exploring and answering today are what is Netflix current WACC? What WACC after $3 billion depth is insurance? What should be the WACCC for the US content versus the international content? and how much does Netflix WACCC compare to that of Disney's and or Amazon Primes and Y and what capital structure strategy should Netflix follow. So I will quickly um represent this in financial ambush but simply WACC is the equation as equity weight into cost of equity plus debt weight into after tax cost of debt. So we need the CAPM the cost of equity which we get as 4.5 uh%. After after tax cost of debt is 5.8%. And capital structure weights and using the market values where equity is 200 billion debt is 13 billion. So the total will become 213 billion. So I'll start by putting all of these inputs in Python uh and computing the current WACC for Netflix. Okay, so this is what we get. So this code basically now will store all of Netflix and whatever I basically set the market inputs and calculate the total firm value and the weights of equity and debt. So the total value we get is 213 billion as we just saw the equity is around 93.8 94% and the debt weight is around uh 6.1%. So the Netflix is mo mostly equity financed and uh next I'll write a function to compute WACC and then calculate Netflix current WACC. So this is the function we will run. Okay. So this uh function basically calculates the CAPM and the after tax cost of debt and then the WACC using the formula we just discussed. So the cost of equity is 4.5% plus 1.3 uh times 5.5% which is about 11.65%. The after tax cost of debt is around 5.8% it is between 121% and it is about 4.58%. With about 94% equity and 6% debt that we just saw the current WACCC is around 11.2%. So that is a uh hurdle rate basically. So Netflix current hurdle rate hypothetically is around 11.2%. Which is higher than the media industry range which we take around 8 to 10%. And this with a high beta fairly risky streaming business obviously. So now I'll see what happens if Netflix issues three billion shares like billion dollars of extra debt. This is financing idea for $5 billion content investment. I'll assume for this scenario that the bond yield and the beta are the same. And this is simplifying assumption in reality. In reality, obviously more debt would probably erase both. But for now, let's take it as same. So we will run this. Okay. So the current WACC is around 11.21% that we get here. After issuing 3 billion more debt, WACC falls very slightly. It's almost negligible. It's like 11.1% now. And the debt weight rises and equity weight falls a bit. So under these assumption a modest increase in debt significantly lowers slight sorry I'm very sorry slightly lowers Netflix WACCC because we're using more tax advantage cheaper debt and instead of the equity that it has issued this is the tax shield of work and interest is deductible so the effective cost of debt is lower than the pre-tax coupon for Netflix so now we will move to a project specified WACCC which for me was the real aha moment while doing this entire assignment. I used to think that a company had just one WACCC and every company's WACC is around like from 1 to 21%. But uh US content looks like a lot lot like Netflix course business. So I'll use a beta 1.3 over here. International content obviously is more risky because of political regulatory currency risk and I'll model that with a higher beta because there's a higher risk involved of 1.5. So here is both of it over here and we will run this code. Okay. So the first number that we get over here is the WACC for a US content project which is around 11.2% basically the corporate WACC that we got for Netflix. And the second is for international content project with a higher beta higher beta of 0.2. So the beta is 1.5 and the WACC comes to around 12.25% 25% which is let's take 12.3%. So here's the real aha moment. Using one single WACC for everything can seriously underpric the risk. International projects obviously should be discounted for a higher late. If Netflix um use a lower like the 11.2 to WACC that they got for risky international content. It might approve projects that don't really compensate the investors for the extra risk and don't really get the investment in and don't really give the proper actual investment that the investors should do. So what we have to do is we have to use the corporate WACC for typical US content that is made in US and a higher beta to calculate the WA. This so this is something I've just taken as 1.5 but yeah obviously a higher beta for riskier international content that Netflix creates. So to connect these finance and technology now I'll show you how WACC changes as the very uh debt level and visualize it. So here I keep the cost constant constant and we shift the debt level from 0 to 40 billion and this obviously isolates the pure tax shield effect. Okay. So now we have this graph over here. So basically what this table and this graph show is that as debt weight increases from zero up to 40% um WACC gradually declines. So as you can see at zero it is 11.65 but at 40% it's 10.47. 47. So this is because we're replacing some of the expensive equity with cheaper tax shield debt. This is the validate step. The pattern makes sense given our assumptions. In reality, as the leverage climbs, the bond yield would eventually rise and the equity beta would rise. So beyond some point, WACC would turn back up. This is where the idea of optimal capital structure comes in. So let's put this into strategic insight and strategic terms and compare Netflix to its peers. So the Netflix WACCC that we got from our calculation is around 11.2%. Disney it's 8.2% with 70% equity and 30% debt and Amazon is 9.5%. So Netflix is obviously clearly higher. So let's see why. So obviously Netflix is less diversified than Disney and Amazon. It's focused only on streaming. So obviously the beta is higher which is 1.3%. And Netflix capital structures almost equity by market value around 94% equity and 6% debt. For Disney it was 70% equity and 30% debt. So equity is obviously more expensive than debt and especially equity is also taxed. Hence the beta is higher. So Disney is very smart at this. They deliberately use more debt and it's more diversified cash flow. Hence give a lower WACC. Amazon obviously is a much bigger company, has a huge scale and diversification, but also like lowers its perceived risk and cost of capital. So look at my recommendations. I would recommend an optimal capital structure approach and reflect on the assignment. Right now Netflix debt weight is only about 6%, analysis shows that adding 3 billion of debt lowers the WACC slightly from 11.2 2 to 11.1%. And it doesn't push push leverage anywhere near Disney's 30% debt ratio. Netflix is still at 6%. So Netflix should gradually increase its use of debt moving towards a somewhat higher but still conservative debt ratio and takes advantage of the tax uh shield obviously because debt is not taxed and slightly lower the WACC lower growing the beta and giving less risk to investors on discount rates. Uh we would usually uh use the roughly 11.2% 2% form by WACC for US content and as we calculated 12.3 project specify WACC for the international uh content. So to reflect uh in conclusion this assignment shows how WACC brings together CAPM bond yields and tax field and obviously the capital structure strategy. WACC is not just the formula. So what we get is the minimum return that Netflix must earn to keep the shareholders and bond holders satisfied. So they have to earn at least 11.2% minimum return and if it's more to keep the shareholders and bond holders satisfied. And the big learning for me and the big aha moment like I mentioned earlier is WACC is not fixed at one number. It can vary from project to project as more risky projects will have a higher WACC and it is shaped by strategic choices and how much debt versus equity a company might use.",
  "video_url": "https://youtu.be/LxDmC5ETsRI"
}