{
  "student_name": "Alexander Emenhiser",
  "org_defined_id": "035713425",
  "username": "aemenhi",
  "email": "",
  "transcript": "Hello, my name is Alexander Emenhiser and this is my video for the session 9 assignment. I'm in the section of management 310 and it is currently Sunday, November 16th. In this session, we're going to be conducting a full cost of capital analysis. Our goal is to calculate the weighted cost of capital for Netflix in connection with a hypothetical $5 billion content investment decision. In our analysis, we're going to determine Netflix's current weighted average cost of capital, evaluate the impact of national debt financing, assess project specific versus firmwide discount rates, and compare Netflix's cost of capital to industry peers. We have several Netflix parameters as we see here, market conditions and strategic context that we will consider throughout this session. As we work through this project, our analysis will include calculating Netflix's current WACC. Uh uh we are going to determine after a the WACC after a $3 billion debts insurance issuance uh evaluate uh project specific WACC which within US content versus international content and finally we we we're going to compare Netflix's WACCC to Disney and explain the differences as well as recommend optimal capital structure strategy. As before, I have used the assistance of AI to help create some of our code models while validating with my own analysis and interpretation for accuracy. Like before, I'm going to continue to use the driver framework of learning to guide the structure of this assignment. So, let's begin our capital analysis. So as we know the first step in the driver framework of learning is to define and discover and in this page in this stage I am defining the financial question and setting the foundation for the entire analysis. Netflix faces a clear financing decision which is that the company wants to pursue a potential $5 billion content investment but before determining whether the investment creates value it must know the true cost of capital. This matters because the weighted average cost of capital acts as the minimum hurdle rate that any new project must succeed in order to increase shareholder value. Before looking at the calculations, it's important to understand the strategic environment that drives this financing decision. Netflix operates in a highly competitive streaming landscape where constant investment in original content is essential for sub subscriber growth and retention. These initiatives require massive upfront spending, which means Netflix must continuously decide how to balance equity financing, debt financing, and operating cash flows. Historically, Netflix has relied heavily on debt, especially during years of rapid content expansion. Uh to ensure that the rest of the analysis is built on accurate information, I first verified the key financial inputs that the Python code model uses. as we will be able to see up here. So these include Netflix's current equity value of $200 billion, the total debt of $13 billion market value, the cost of equity on market risk, the after tax cost of debt, and the marginal tax rate of 21%. Just like last week, when I confirm the accuracy of GameStop's price data before conducting an event study, verifying these numbers is essential. Even small inaccuracies can meaningfully change the weighted average cost of capital and potentially lead to incorrect conclusions. With the inputs I can I confirmed, I can summarize the financial context that frames Netflix's cost of capital problem, which is that Netflix invests more in content than nearly any competitor, which increases the need for reliable financing. Market interest rates and yield spreads have shifted in recent years, influencing Netflix's borrowing costs. Competitors like Disney, Warner Brothers, uh, Discovery face similar investment needs but have different capital structures and risk profiles. Netflix's global expansion introduces additional regional risks, meaning US projects and international projects do not always warrant the same discount rate. Together, these factors shape the central question of this project, which is what is Netflix's actual cost of capital today, and how would issuing an additional $3 billion of debt influence its ability to finance a $5 billion content investment? To explore this, I calculated Netflix's baseline weighted average cost of capital, analyzed how the WACC changes with additional debt, compared project specific risk discount rates in different geographic markets, and benchmarks Netflix's cost of capital against Disney. This establishes the foundation for later recommending an optimal capital structure salary. So in summary, our define and discover stage identifies the problem, verifies the data, and builds strategic context needed to understand Netflix's financing decisions. The next step in the driver framework is to represent where I will translate the financial question into a structured analytical mo model that our Python code as we see here will execute. To evaluate Netflix's financing decision, we need a framework that clearly represents how each part of the capital structure contributes to the WACC. WACC serves as Netflix's hurdle rate and its components, which are the cost of equity, the cost of debt, and the capital structure weights determine how expensive it is for Netflix to fund new projects. In my framework, I broke our WACCC into three different parts. The first is the cost of equity. This represents the return shareholders require for the risk of owning Netflix's stocks. Using the capital asset pricing model, we combine a risk-free rate of 4.5%, Netflix's beta of 1.3%, and the market risk premium of 5.5%. This captures how sensitive Netflix is to market movements and how much compensation investors demand for risk. The resulting cost of equity, as we'll see later, is 11.65%. Next is the cost of debt. This reflects the interest rate Netflix pays on long-term borrowings. Because the interest is taxdeductible, we adjust the cost of debt by the corporate tax rate which is 21%. Given an effective after tax financing cost of 4.58% which is 5.8% time 1 minus uh 21%. This recognizes that debt is cheaper than equity up to a certain point. Finally, we have our capital structure weights. The framework assigns weights to debt and equity based on their market values. Currently, net Netflix's equity is 200 billion and debt is 13 billion, giving weights of 93.9% to equity and 6.1% to debt. These weights show how how much each component contributes to financing. A company like Netflix which carries significant equity finance will see its WACC heavily influenced by equity costs. Once these components are clearly represented, we combine them into the full WACC equation. Using the weights and costs above, Netflix's current WACC calculates to 11.22%. This framework allows us to visualize how different financing choices such as issuing more debt or relying on more equity influence Netflix's overall cost of capital. In the next stage, we will use this representation to evaluate which financing oppos option minimizes WACC while supporting Netflix's longterm strategic goals. and some of our results will be found here. The next part of our driver framework is to implement and this is where I build a systematic process for calculating Netflix's WACC and evaluating how sensitive it is to changes in key assumptions. This step translates conceptual financing framework into a working quantitative model. To accomplish this, I wrote some Python code here to automate each component of the WACC calculation. The code begins by defining all fundamental inputs the such as the uh risk-free rate, Netflix's beta, the market risk premium, the pre-tax cost of debt, and the corporate tax rate, which are all stuff that we can find here. uh these correspond directly to the formula established in the represent stage as we talked about. The first function of our Python script is it calculates the cost of equity using the capital asset pricing model. This function is reusable meaning if any input such as beta or the risk-free rate changes the cost of equity updates automatically. Next, I created a function for the after cost the after tax cost of debt. This adjusts the pre-tax borrowing cost by the tax rate recognizing that the tax shield benefit that reduces Netflix's effective cost of borrowing. Again, the function is scenario-driven, allowing different values to be plugged in easily. After that, the our script combines these components into a final WACCC calculation using the appropriate weight based on Netflix's market value of debt and equity. Organizing the code this way makes it transparent and flexible, allowing for quick updates. To expand our analysis, I built a sensitivity analysis module. So this portion of our script uh systematically varies capital structure weights, beta values and debt costs. Uh for example, one loop adjusts equity rates from 40% to 80%. while another test uh tests different beta scenarios and uh you're able to see some of this sensitivity down here and these similations reveal how the WACC responds when Netflix's risk profile or financing miss mix changes. These results show that the WACC is most sensitive to changes in cost of equity primarily driven by her beta value. While moderate changes in debt levels have smaller effects due to the tax shield. I also modeled the impact of a $3 billion debt issuance. Assuming equity remains at 200 billion uh dollars, the new debt is 16 billion giving weights of uh 92.59% to equity and 7.41% for one% to debt revealing uh beta to reflect the added debt increases. The cost of equity slightly to 11.73 while the after tax cost of debt remains 4.58%. The resulting WACC decreases marginally from 11.22 to 11.2 two illustrating the near neutral effect of moderate debt increases on overall financing cost. Additionally, I evaluated project specific WACC. Uh for US con content, the project beta is similar to the firm 1.3 yielding a WACCC of 11.2%. For international content, higher risk leads to either a bold beta multiplier approach which is our beta goes to 1.56 and our WACC goes to 12.56% or a risk premium adder approach plus 1% on our WACC which goes to 12.22%. This ensures that pro projects with different risk profiles are evaluated using appropriate discount rates. By implementing this coddriven approach, the analysis becomes objective, repeatable, and responsive generates not only a single estimate of the WACC, but also the full range of outcomes Netflix may face under different financing conditions. Now that the model is implemented, the next stage of the driver framework is to validate. In this step, I compare the code the models output to industry benchmarks and peer companies to check whether the results make sense. From the code output, Netflix's current WACC is 11.2%. Uh when we compare the industry WACCC range of 8 to 10%, Netflix's cost of capital is slightly above the norm. And this aligns with its high equity rates of 93.9% which increases its overall exposure to equity risk. The code also computes the pure companies uh WACC. So you get Disney at 8.2% and Amazon at 9.5%. These values confirm that Netflix's WACCC is higher than its peers. Disney has a more diversified revenue stream and a steadier cash flow that reduces its beta, while Amazon's diversified business model spreads out its risk. Both trends justify the lower WACCC's. I also validated the model by using the sensitivity tables as we talked about before. For example, the beta sensitivity analysis shows us that lowering beta from 1.3 to 1.1 decreases the WACCC from 11.22 to 10.19%. This aligns with expectations for a company heavily weighted towards equity financing. Similarly, when the market risk premium increases, the WACC rises proportionately. Another sign that the model is functioning correctly. scenario modeling confirms that adding $3 billion in uh debt barely changes the WACCC decreasing it slightly from 11.22% to 11.20%. The tax shield on moderate debt nearly offsets the increase in equity risk which makes which matches financial theory. These validation checks confirm that the outputs are accurate and behave in line with industry data, financial theory, and pure comparisons. This gives us confidence that the WACC estimates are reliable for decision-m. So now that we've calculated and validated Netflix's WACC, we move on to the evolve stage of the driver framework. And this is where we expand beyond the assignment to exam examine why the WACC matters not only for our project here but for corporate valuation and strategic financial planning more broadly. First, the WACC is central to capital budgeting. When Netflix evaluates new projects, whether expanding content libraries, entering new markets, or investing in gaming, the WACC is the discount rate used to evaluate future cash flows. If a project's return exceeds WACC, value is created. If it does not, the firm destroys value. In this sense, the WACC becomes the minimum hurdle rate for strategic initiatives. Second, the WACC is a key input in firm valuation, especially in discounted flash cash flow models. Even small changes in WACC can significantly shift the estimated enterprise value for company like Netflix where cash flow and growth rates are volatile and accur accurately estimating WACC is essential for internal planning and investor expectations. Third, WACC influences capital structure decisions over time. As market conditions shift, for example, if interest rates rise or fall, Netflix must reconsider whether debt or equity financing is more cost effective. Our sensitivity analysis illustrates that moderate debt is beneficial, but excessive leverage increases financial risk and raises the cost of equity. Finally, the WACC plays a role in performance evaluation. Managers can compare business unit returns to WACC to determine which segments are generating economic profit. This supports shareholder focused decision making using metrics like economic value added. In short, WACC is not just a calculation. This is a strategic tool that shapes investment decisions, valuation, and long-term financial planning. So, as we get to the final stage of the driver framework, which is reflecting on our analysis, the overarching insight is that there's no single perfect capital structure. Instead, firms like Netflix operate within a range of optimality where the balance between debt and equity minimizes WACC while maintaining flexibility and managing risk. Our calculations and sensitivity analysis hire several key highlight several key themes. Debt is beneficial up to a point, but only when risk remains controlled. Moderate increases in leverage reduce Netflix's WACC because the after tax cost of debt is lower than the cost of equity. However, too much leverage increases financial distress risk distress risk and raises the cost of equity. Next is that equity financing preserves flexibility, but it is more expensive. Equity avoids interest obligations but increases Netflix's WACC due to high shareholder return expectations. The optimal structure is dynamic, not fixed. As interest rates, volatility, and business maturity change, Netflix's ideal mix of debt and equity evolves within it. The WACC acts as a strategic boundary for financing decisions. The code showed how small input changes can significantly affect their WACC ACC, meaning financing decisions ripple into valuation and shareholder expectations. And finally, Netflix benefits from a balanced financing strategy. A measured blend of debt and equity allows Netflix to take advantage of lowcost debt when available while still preserving financial flexibility and protecting long-term strategic goals. This has been our analysis for Netflix's weighted average cost of capital. I am Alexander Emenhiser and this is my video for the session 9 assignment. Thank you.",
  "video_url": "https://youtu.be/XWIYeB2ojqI"
}