{
  "student_name": "Jonathan Hinds",
  "org_defined_id": "037200739",
  "username": "hindsj",
  "video_url": "https://youtu.be/GlNLLWEVd00",
  "transcript": "0:02\nHello, my name is John and today we're\n0:05\ngoing to be doing our session 12 um\n0:07\nvideo assignment. So, our business\n0:10\nvalueuation and financial modeling.\n0:14\nSo, first hopping in, we're going to be\n0:16\nanalyzing Panera bread. So, our goal uh\n0:20\npretty simple. Just figure out what um\n0:24\nPanera is worth uh to do uh to two uh\n0:28\ndifferent types of buyers. So, um like a\n0:31\nprivate equity firm like KKR or a\n0:34\ncompetitor like uh Starbucks or Chipotle\n0:37\nor you name it. Um I use a driver\n0:41\nframework in my code as always. So,\n0:43\ngoing over to my code on um Google\n0:47\nCloud, you can see I uh first started\n0:50\nout with our uh discover\n0:53\num section. Just put in our current\n0:56\nmarket data uh for Panera as well as we\n1:00\nwere uh we needed to run\n1:03\nsome uh scenarios to get um some\n1:07\nforecasting data. And so we're having a\n1:10\nuh base case which is what they're\n1:12\nprojected looks like right now. Uh and\n1:14\nour upside case so basically best side\n1:18\ncase scenario. Um it it has uh an\n1:22\nadditional\n1:24\n500 stores and it's 70% digital\n1:28\nand um they're getting higher growth and\n1:33\nwe have downside case. That's our worst\n1:36\ncase scenario. And then we have all this\n1:38\ndifferent stuff. So comparable and\n1:40\npresident multiples and then the synergy\n1:43\nassumptions. Now moving on to the\n1:49\nuh represent section. Um we\n1:53\nfirst use this to figure out the um\n1:56\nintrinsic value. So basically what the\n1:59\nuh cash flow is worth today.\n2:02\nUm and so I represent all the functions\n2:06\nhere in the uh the code. I I uh um using\n2:12\nAI to write the code. It gave them all\n2:14\ndefinitions and variables of what the\n2:17\nformulas are going to look like. So, um,\n2:20\nour setup for this is, um, we're using,\n2:26\nuh,\n2:28\n9% uh, for our WACC, uh, shown. Yeah,\n2:32\nright here. WACC is 9%. Um, and we're\n2:36\ngoing to be using that to reflect that\n2:38\nborrowing money is expensive right now.\n2:42\nAnd um I believe we're also using a uh\n2:46\n2.5% growth rate. Um\n2:51\nand um we're using the uh why why that's\n2:54\nall important is because uh the WACCC\n2:56\nmust be greater than the terminal growth\n2:58\nrate for the Gordon uh growth model to\n3:01\nbe valid. So having the 9% um WCC make\n3:05\nshould make it valid. uh as well as um\n3:09\nuh it matters because um\n3:12\nI didn't have it program\n3:16\num any exit multiples in in this step. I\n3:19\ndidn't want it to double count growth. I\n3:22\nI did a first uh loop I would say on uh\n3:25\nGoogle Collab. It did not work out so\n3:28\nwell when it kept trying to use um\n3:31\nuh like an exit multiple. So you know\n3:33\nwhat the cash would be worth 5 years\n3:35\ndown the road. I just kept it simple and\n3:38\nI used um\n3:41\nthe DCF um specifically so it was a safe\n3:45\ncalculation of the cash flow um\n3:49\nimplementation. It's the\n3:52\nsame thing. Um,\n3:55\nusually you look at the past earnings,\n3:57\nbut instead I had the uh Python\n4:00\ncalculate the uh year five projected\n4:02\nearnings and applied the multiples to\n4:05\nthat. And the logic behind that is if uh\n4:09\nKR buys Panera, they they don't they\n4:12\ndon't care about today's price. They're\n4:14\nthey're they care about the exit price\n4:16\nin five years. So, um I have some high\n4:20\nnumbers in in the output. Um\n4:24\nyeah, that's\n4:26\nuh that's just our um\n4:30\nfuture sale price.\n4:33\nUm\n4:34\nyeah,\n4:38\nso I think that's uh for the most part I\n4:41\nhave it did uh validate and um\n4:47\nthe E what's what's the E? Where is it?\n4:50\nEvolve. It it did that stuff in in it\n4:53\nfor extra data. Um that's whatever. It's\n4:57\nnot really relevant to our output. So\n4:59\nfirst looking at our output um these are\n5:01\nthe numbers we're really concerned\n5:02\nabout. So our valuation um\n5:07\nnumbers. So with the worst case\n5:10\nscenario, our downside case, the total\n5:13\nequity is supposed to be um 8.1 million\n5:17\nor uh billion.\n5:20\nBest upside case 16.999\n5:25\nuh billion. So basically 17 uh billion\n5:28\nand 12.1 billion is going to be our base\n5:32\ncase scenario. That's uh what the base\n5:34\ncase is.\n5:36\nAnd\n5:38\nwe're looking at our uh DCF um\n5:42\nsensitivity analysis little table here.\n5:45\nYou can see that um for what we put in\n5:48\nso the 9% interest rate at the 2.5%\n5:53\ngrowth rate\n5:55\nit gets us our um\n5:59\nour uh DCF base case uh scenario and\n6:03\nthen uh the sensitivity analysis shows\n6:07\num how it it it will react with\n6:10\ndifferent things. So if interest uh\n6:14\ndecreases and we still keep a 2.5 uh%\n6:17\ngrowth rate then it jumps from 12\n6:20\nbillion to 18 billion in uh total equity\n6:24\nand\n6:29\nthe\n6:31\num I mean even even if uh\n6:36\nthe like the high uh interest rate stays\n6:40\nthe same at 9% % and we we even decrease\n6:44\nour growth to 2%. Uh this\n6:49\nstays above 11.3\n6:53\nbillion uh just barely which means our\n6:56\ndownside is kind of protected. Um\n7:02\nuh\n7:03\nsynergies are also important too. So I\n7:05\nalso modeled um strategic scenarios.\n7:09\nUm\n7:11\nso like\n7:15\nfor example if if if uh Starbucks buys\n7:18\nPanera they can they can cut uh costs.\n7:23\nUm, so in the code it's modeled to be\n7:27\num\n7:31\nI believe it's 75 million in yearly\n7:34\nsavings uh with the\n7:40\nsynergies\n7:42\num which bumps up the value to um 17 um\n7:48\nbillion. And so\n7:53\nbasically explaining the synergies is um\n7:58\nif being bought out by a competitor that\n8:00\nalready uh does similar things, they can\n8:03\ncut corners at different places\n8:06\num that save money because if they\n8:09\nalready use a uh similar management\n8:12\nsystem or um cate you know doesn't\n8:15\nmatter. um if if if they can figure out\n8:18\nstuff that overlaps and they can cut\n8:19\ncorners, then they can um chop off some\n8:23\nof that cost. So the inflated price\n8:26\num kind of models um\n8:31\num that\n8:34\nand so we have um for our valuation\n8:39\nrange with our um stuff we have our\n8:41\ndownside at 8 12 as our base 1600 upside\n8:46\num our PEI ratio that's the five-year\n8:49\nout uh pie um for comps Um so the yeah\n8:56\nthe\n8:58\nuh the competitive the comparative um\n9:04\nthe comparable company multiples\n9:08\nthat down the road is the 19 the 31 and\n9:12\num the EV to um\n9:16\nEBIT\n9:18\nTDA. So the earnings before the\n9:22\num interest tax\n9:27\num amortization and um something else\n9:32\ndepreciation. So that's what it is\n9:36\nbefore that. And same thing with uh the\n9:38\npresident precedent. Um same same\n9:41\nnumbers there. Um you can tell that's uh\n9:44\nso the uh basically to explain that um\n9:49\nare comparable company multiples um we\n9:53\nhave those um for the um two model um\n9:59\nwhat other companies of similar stuff\n10:01\nwill be worth five years down the road.\n10:03\nSo like Starbucks and uh Chipotle if\n10:07\nthey had similar financials to this as\n10:09\nwell as um uh Precedent. So what have\n10:14\nother companies similar to this similar\n10:16\nfinancials have sold for in the past? Um\n10:19\nso that's basically the text part of the\n10:26\nuh our analysis.\n10:28\nAnd so\n10:31\nthe more important part uh is like who's\n10:35\num paying what. So this is like our\n10:39\nrecommendation. So looking at our uh our\n10:43\nfootball field chart um\n10:47\nthis is where I'm going to make the um\n10:49\nuh like the final recommendation. So our\n10:53\num KKR our financial buyer is this left\n10:57\nside. So, for some reason it formatted\n11:00\nthe numbers weirdly. So, they're they're\n11:04\nthey're in in\n11:07\n10 billions.\n11:09\nSo, like this little dot here is our\n11:13\nuh 12 billion number here. So, that guy\n11:16\nis that dot. And so, even on it, it\n11:19\nwould be 1.2 on this. That still\n11:21\nrepresents\n11:23\n12 billion. And so from\n11:29\nuh\n11:30\nthe\n11:32\nthe uh the KKR um they're really looking\n11:35\nat the left side of this. They need to\n11:38\nbuy at a lower point so they can sell\n11:41\nhigher. They can't uh pay for a um\n11:45\nsynergy that doesn't really exist yet.\n11:47\nSo they're more interested in this part.\n11:48\nAnd then as you can see up here um our\n11:52\ncompetitors\n11:53\num like Starbucks or Chipotle or\n11:56\nsomething like that, they can afford to\n11:58\npay um the control premiums for the\n12:02\nthese inflated prices because they\n12:05\nalready um\n12:09\nuh they're they they can afford to pay\n12:12\nthe control premium which is extra money\n12:16\nto just own the board. own own the\n12:19\nsector to own it all, get their little\n12:22\nmonopoly going basically. And because\n12:26\nthey immediately make that money back\n12:28\nthrough um synergies that we had\n12:32\nmodeled, um they can afford to do so.\n12:36\nAnd that leaves us last um\n12:40\nwith the recommendation bid range.\n12:43\nBecause of that, the bid that we would\n12:46\ndo as a um\n12:50\nKKR buyer would be between 9 and 13\n12:56\nbillion. Nine gets you in the door\n12:59\nsafely. Um you know, it it makes your\n13:02\nbid valid. You're not lowballing\n13:05\num the company. They're actually going\n13:06\nto consider your offer. And um 13 is uh\n13:12\nor yeah 13 billion is just enough um to\n13:18\nuh 13 is is basically the max limit.\n13:20\nIt's it's enough to beat out the\n13:22\ncompetitor. You don't want to go higher\n13:24\nthan that though because you're going to\n13:25\nbe overpaying. So somewhere between 9\n13:28\nand 13 billion is your optimal bid range\n13:32\nbecause you're not going to get taken\n13:33\nseriously. You're not going to get the\n13:35\nbid if it's under nine. And if it's over\n13:38\n13, then you're losing value and you're\n13:42\nlosing your money on that deal. You're\n13:44\non the you get the short end of the\n13:45\nstick on that one. And um uh let's see\n13:50\nthe rationale behind that is that the um\n13:54\nit's updated to reflect the\n13:56\ncomprehensive value uh valuation\n13:58\nanalysis.\n13:59\nIt's positioned above the downside uh\n14:02\nscenario\n14:04\nand a little above the um\n14:08\nuh yeah let's let's see\n14:12\nyeah because you can't really p uh\n14:14\npredict the upside. So, it's based a\n14:16\nlittle above the downside uh case\n14:19\nscenario so that um you cover the the\n14:22\nrisk\n14:24\num basically for the um the uh Panera\n14:27\nthat you're purchasing from and then\n14:28\ngoes to 12 million because you don't\n14:30\nwant to, you know, overly pay more than\n14:32\nwhat it's worth today if you're going to\n14:34\nbe buying today for it. And uh with with\n14:37\nthat analysis, I think it's all good.\n14:39So, thank you"
}