{
  "student_name": "Aren Dominic Damayo",
  "org_defined_id": "037061012",
  "username": "adamayo",
  "email": "",
  "transcript": "Hello. This is my session 8 assignment submission for Professor Zen's class, management 310. And for session 8, we talk about market efficiency. And for our prompt, uh we are given this issue where effectively we are meant to investigate the market efficiency during the GameStop short squeeze of 2020 through 2021. Um so we're given some data here. We're meant to check this data, check that it checks out, and also do some additional research before we go ahead and implement. So you can see we're going to use the driver framework today and we start off with define and I just decide define as analyze the market efficiency during the GameStop short squeeze. So that's what we going ahead and did. I listed out our known info, right? Just some general things that we know like fundamental value estimates $10 to $40. There were trading restrictions impo imposed, etc., etc. And then that moves us on to discover. So here I did a bunch of research on a bunch of different data. So here are some key things that we found out. Uh, one thing, one of the things that they mentioned in the problem is that GameStop hit .04 cents. It never did, but the lowest it did hit was $14 in August of 2020. Um, also it mentioned that Ryan Cohen had 13% stake. That is true, but not by September 2020. He actually had it by December 20. By December 2020. In September, he had about 9% and he later raised it. And some other things that are going to be necessary for calculations. These are things that I mainly just searched up. Um, so the average rate of a Treasury bond in 2021 for a 30-year bond was 1.45%. Why was it so low in comparison to the 4% that we might see right right about now? That's because of CO 19 shooting down those values way way far down. Likewise, we have average spy compound growth for the last 30 years to be 10.46%. And then also the beta of GameStop in 2021 was 3.24. This will all be necessary for when we're calculating things like CAPM. And then uh uh for discover um one of the some of the things that we needed to look into were behavioral finance analysis and rational investor profitability analysis. So when it came to behavioral finance analysis I basically did some research on some of the things that required of us. I looked at some common biases like overconfidence, fear of missing out. I looked into hurting behav hurting behavior. I also looked into what arbitrage meant um talking about how it's when you short sell an overvalued stock but also some risks involved with that. And I also looked at what market micro structures were which are basically things that are involving how trades are executed. So that might be the apps that we use in order to trade stocks and the things that they can do within the market such as trading halts etc and high frequency trading. And I will get all into this uh deeper later when we're moving on to the actual analysis. But all you need to know is that I basically researched here and then like likewise the rational investor profitability analysis we already knew that they there was an expected amount of $10 to $40 per stock. based on fundamental analysis but I also wanted to see hey how could we figure out these risk adjusted returns uh and analyze that and um basically after discussion with my AI we found out that we can utilize the sharp ratio in order to evaluate that uh and later on we'll be assessing uh how information provides advantages and then also um we'll be discussing Xanti versus X post however I didn't really know what that meant so I found out that Xanti refers to before an analysis that occurs before the event and then X post refers analysis after the event has occurred. And then some further context that we also looked into basically which basically told us the entire story basically people a lot of people view GameStop as a failing company because they weren't able to keep up to things like digital downloads and stuff like that that were happening in the markets and so hedge funds such as Melvin Capital being one of the biggest players had massive shorting short positions on GameStock. Um some key um some key in investor figures in r/wall street bets such as those like Keith Gil had uh their own personal analysis separate from the hedge funds and such where they believed that uh the stock was actually um undervalued. I mistyped that. Undervalued. And so retail investors figured out that GameStop was being heavily shorted. And eventually they thought up, hey, if we were all to buy GameStop and force the price up, uh that might cause the hedge funds in uh to freak out, realizing they're starting to lose some money on at least on paper, and proceed to cut their losses by buying back a bunch of stocks, further growing the stock back up. Um and then likewise another point that we found out is that investment apps like Robin Hood as as the price extreed extremely once it was nearing its peaks they had to put trading halts down um locking down the uh buying of GameStop and um only allowing you to sell stocks of GameStop as opposed to buying them. So now that we have a bunch of context uh we can go ahead and move on to represent. So to represent this uh first off we wanted to first uh get data um and how I got the data was um I didn't include in discover page I did event uh before but I would just show you basically I use Yahoo Finance and I used uh data from uh August uh 2020 up until um the 2021st uh or sorry 2021 uh February 26th. So basically the start of August up until the end of February. uh got the stock data uh for all of those days and I went ahead and made a PDF out of this which I fed into the um AI in order to use and so first I wanted to extract that data and make it readable in Python and then from there so that's what it does in phase one then phase two I wanted to calculate the key figures you know cap m um an asset pricing model calculate the sharp ratio I wanted to identify some normal returns and conduct a volume analysis with all the data that we had um and then moving on to phase three I wanted to identify predictability patterns as well as classify um the EMH or the effective market um the effective uh under the effective market hypothesis what how strong of a market was right whether it's weak semi- strong or strong based on the analysis and then lastly using all this I wanted to develop a visualization which showed like the volume and the prof stock prices throughout this time so we can really take a look and see the big jumps and differences and use that in our analysis later on um and what this is here this is my old plan which is basically almost onetoone with this plan. I just utilized AI in order to make it clearer um and then read through after the AI had redone it. So in a way that would make it easier for the AI to digest because I was having troubles along the way. And so I just kept this here but that is the old version. And then lastly I will be conducting behavioral finance analysis, rational investor profility analysis and also some theoretical implications using all the previously made information. Um and I that's how I will be doing the last parts. So that moves us on to implements. Um, and after feeding the AI the prompt, I was given this code here and we can run through this code now. Uh, so we can see for phase one, it first takes uh all of the data that we gave it in the PDF and kind of just puts it all in a way that uh in a data frame that can be read in Python. And so we can go ahead and check some of these data values, right? We can see here 122 2021. If we go ahead and look for the corresponding data here, it should be 1 one 10.65 65 19.19 10.58 16.25 also 16.25 and 7.89 E plus 08. So that is all correct. So that's good. So that means that it copied it down correctly. Uh and so now we can keep on moving forward now that we know that this is correct. Um so that's just part of our validate stage. Um you can see that's where it's creating and sorting the data. Um here uh here's where it calculates the daily return using the adjusted closes of it. And then that moves us on to phase two. So we can see here that this is the data that we provided. Um right 0.145 is the risk-free annual rate. Uh market return of 10.46%. We gave it a beta of 3.24 and trading days of two 252 which it'll use in order to calculate the daily rates and that's what it'll use in a lot of calculations. So here's where it's calculating CAPM, right? It's using the formula that we know for CAPM. expected return daily is equal to the return of the rate daily plus beta times the market return daily minus the all right uh the risk-free rate. So it's basically using the formula that we know for CAPM but then just uh using it as on daily basis rather than on the annual which we use for a lot of previous ones. And then here's where it figures out any annual uh abnormal returns uh figuring out right uh seeing if there are any annual returns that are where the actual return is much different from the expected return. Uh here is where it finds the sharp ratios. Um right, it's using that formula of where it takes the returns um uh subtracts off the risk-free uh rate of the daily return and then divides it by the standard deviation which is like the volatility in order to get a sharp ratio or like a an idea of how good the returns is in in relation to risk or volatility. Here is where it conducts the volume analysis. as well figuring out where the biggest amount of volume was. And then also phase three is where it interprets, right? Giving us some information and classifying whether or not it is weak, med uh medium or strong. And then finally for phase four, this is where it basically creates the graphs that we'll be seeing. And uh you can see plot one, plot two, plot three. It's giving different kinds of graphs depending on what kind of value we want. Whether it be adjusted close price, plot two is about the trading volume and plot three will be any abnormal returns. uh which it also highlights uh moments of where abnormal returns were the largest uh and then prints out those plots for us to look at. So if we go ahead and run this code, it should go ahead and work. All right, looks good. Okay, so phase one is here where the data is being put in and that moves us on to phase two. Um right, so this is all the data we fed it. Um and then also calculate the risk-free rate and the daily market return based off of those rates and then it uses those in calculations. So we can see our cap m our daily expected return was or about 0.1216%. Now keep in mind as capm this is used as a percentage so it's extremely small um and so using our sharper and then this moves us onto our sharp ratio calculation right we can see that our daily sharp ratio is about.1 943 um and our annualized sharp ratio is 3.0848 0848. So that sharp ratio is decent u right uh as we know from before uh greater than around one is pretty good um at least for annualized but for a daily sharp ratio it's actually rather quite small showing that uh there's actually quite a lot of risk as opposed to the returns that were happening at the time and then for a volume analysis it found that the peak trading volume of 7889 million shares occurred on 2021 um January 22nd right so that's when the peak of everything was happening and that moves us on to phase three right interpretations. So we can it talks about the sharp ratio about how it is positive but it is pretty low considering the massive daily volatility. So as I mentioned before um even though there were large returns that also came with a whole lot of volatility which showed that there was also a lot of risk with the stock which made the sharp ratio not so favorable. Um and some abnormal returns uh we can take a look at the plot later on but basically uh the actual returns were massively positive far exceeding what was expected uh which was that.1216% predicted by the CAPM model. Um, which makes sense because we know that during a time after the stock was short was squeezed, it suddenly shot up like crazy, which would make sense about why it's outpacing the CAPM is going for. And then EMH classification, right? Um, it's basically looking at uh the three different possible ones, weak form, semi- strong, and strong. And basically, um, what it says here is that um, all three of them are violated. All three of them were violated. Um however uh because of the fact that right we took a look at weak form it's basically saying that the past price and volume data was already factored into the stock. However, there is evidence of that not being necessarily true because you could see at times where the volume was starting to increase and the price was starting to increase prior hand um prior uh and yet uh that wasn't fully um already put into the stock price because eventually there was that huge jump. So all previous information hadn't necessarily already been included. Um and then the main thing that was violated was the semi-strong effective market hypothesis because this was saying that all publicly available information was um uh which we call already factored into the stock. But in this case we knew that this isn't true because they were beginning talks much earlier than what actually occurred in January. And yet even so um they still managed to succeed and they still managed to drive up the stock price like crazy even though that was already out there in public forums. Um and so in general what the AI concluded is that the short squeeze is an example of a market inefficiency because of the massive abnormal returns during the squeeze which demonstrate a clear deviation from what we expected the risk adjusted returns to be utilizing CAP N. And then finally it gave us this um these data here uh using these plots. So we can see like how the price right it's generally consistent um all the way up until we reach and you can see the dates here up until we reach around January 2021 and then about mid to late January 21 is when things really started to shoot up right volume started to increase roughly around here. Um you can see this is probably where a lot of retail investors were starting to increase and then as that price started to raise uh eventually the hedge funds made their play and they uh started to cut losses and that's where this huge spike occurred. Um and then you can kind of see a taper down here. And we can explain that by the trading halts that occurred, right? Uh because as the buying was put as buying restrictions were put on that forced the stock price down because people were no longer able to buy in order to cut down the losses of the hedge funds and the price was no longer since people weren't buying the price would no longer increase much further. Um and you can see here the abnormal returns as opposed to expected returns right here and you can see how they deviate like quite a lot. Before then, the abnormal uh the returns uh weren't very different up until the squeeze where there was a huge difference between what the CAPM expected returns were and the actual returns with the expected return being this line here. All righty. And so that concludes our um market anal our market efficiency uh testing. I'm just going to go ahead and double check too if there's anything else we should talk about. Right. We classified it as a like weak or even less than weak effective market hypothesis form as it kind of broke that general form because even uh because public information wasn't already factored into the price and even in some cases we could even say argue that um past previous information wasn't already factored into the price because the price was already starting to increase, right? Things were starting to get known and yet even so it still increased like crazy. But it's probably best described as a weak um effective market hypothesis form. Um we already talked about how information was incorporated to the prices, right? As information got known and um as things were discovered. Um that price the price slowly adjusted as like the hedge funds realized that the price was starting to increase and people were starting to buy and so they uh changed as a result. Um we also looked at the abnormal returns seeing how in January 2020 there was a huge difference when it came to the price and returns shot up well above uh like to 1.5% uh or ne or even in some case negative 1% um right these huge deviations from what the expected returns were based on cap m um right and we can also look at the patterns too seeing how it kind of started to increase over here right we talked about before about why that could be argued against because there was some predictability here with how it was increasing and suddenly these big increases were showing beforehand which kind of foretold what would happen. Um we could kind of see uh if someone was able to pick on that how they could realize what was going on and adjust accordingly. And so after market efficiency testing that moves us on to behavioral finance analysis. And so here I just used um the research that I had done and we can go ahead and use the graphs that we had created as well in order to look at these things. So we can look at some biases that were shown in the situation right there was overconfidence, fear of missing out and fear of missing out and loss aversion. Why? Because these hedge funds were very overconfident at first, right? They believe that their fundamental analysis was solid. Um, however, they didn't consider the fact that there was this little ragtie group of retail investors in I guess I shouldn't say that little, but this ragtai group of investors in our/wall street bets who suddenly decided to try to artificially force the price up and they didn't consider that and so that's what ended up happening and why they ended up losing so much money as a result of their huge shorts and that happened because of a fear of missing out and loss aversion, right? because um they know that as the price rises, other hedge funds and stuff too are going to start buying back their stocks in order to cut that cut back their losses and the price and the stock will rise meaning that their shorts will start losing value and in some cases even become negative causing them to lose money. And likewise with loss aversion, this would also push them to also consider buying back stocks and continuously pushing that stock price up, which is what happened here around in this area as that price started to shoot up and the volume was increasing like a ton as well. And then so that moves us on to talking about hurting. Um, and we can talk about how uh the effects of social media, right, in places such as Reddit where people are easily able to gather together and even just one sole individual or a few small group of individuals can rally together a large amount of people in order to do something and herd together and kind of joining in the crowd and like using that effect of kind of herd mentality in order to perform things. And this is a great example of that because all the retail investors gathered together in order to drive up the stock price just enough where the hedge funds would be forced to try to cut their losses as well. So that was a good example of hurting together. And then that kind of connects to arbitrage where we mentioned before it's kind of how when you uh short sell a stock in order to make the um in order uh if you expect that the stock is overvalued and you expect it to go down and how some of the risk with arbitrage or if the stock continues to increase you'll start you'll lose money and also noise investing where in this case this is a good example of noise investors because even if the fundamentals of the stock aren't very favorable to a majority of people um if some people are able to convince others that it is a good stock choice and um kind of builds this big bandwagon um then the noise can sometimes beat out what the general just pure fundamental analysis telling people and that's a good example what happens here because even though GameStock didn't have the most appealing fundamentals um the analysis done by those people uh on our/wall street vets were able to gather enough people in order to perform such a steep and that moves us onto our rational investor profitability analysis and so based on the 10 to $40 fundamental valuation. It's clear that some systematic profit opportunities did exist prior to when the price shot up like crazy, right? There was a time where if you invested around like here or so when it was still around $2,10 $5, you could definitely make money. But then as it rose like crazy, you start to lose that um opportunity because now it is well past that $10 to $40 fundamental evaluation. And now most of that effect is purely because of the noise that happened from all the events going on. Um and also the hedge fund pulling out uh which is not something that you would have necessarily being able to consider with fundamental evaluation because it's not really within the company itself is happening external to the company. And then looking at the sharp ratio, there was a low daily but a high annual sharp ratio showing that even with risk, it was certainly possible in the long term to make money from the stock. But in the short term, right, there was a lot of risk, not making it not necessarily appealing, right? And so um obtaining information was necessary as even though things like the discussions on Reddit were public, uh primarily only retail investors realized at first. Uh so uh we can see the value of information in this case right of how even though it was publicly available uh uh being that our/wall bets is relatively small in comparison to the grand scheme of things that information was still able to stay within that kind of I guess you could say that small echo chamber uh where they were able to plot and able to perform such a big activity even uh even though they were relatively small um and even though that information was being public the large uh hedge funds weren't necessarily able to find out about that because either one they just didn't know because it was so small or two uh at least in comparison to them or two they just didn't consider that they would actually be able to have a large effect which in case they didn't and so in an Xanti versus expose analysis prior to the event it seemed like profitability was possible but big investing players such as hedge funds had extremely low hopes about the company whilst retail investors had high hopes so that's what was happening beforehand and afterwards we can see how the retail investors end up forcing their opinion by buying the stock and forcing hedge funds to cut their losses, moving the stock from being in its undervalued state um back into what the retail investors would have probably thought was more of like a reasonable price. Um so lastly, we can validate, right? Does it make sense? We can take a look at our values here. I'd say our values do definitely make sense here, right? Uh we went we went ahead and checked uh some of the values here. Uh and it does look like they're correct. And we can go ahead and check that again. So if we look at another one, we look at 1030. Let's say 21:31 2020, 2.91, 2.91, 2.59, 2.62, 2.62. Yep. So the numbers are correct here. So the data that we imported was correct. Um it we checked that the calculations were going correctly. So that absolutely makes sense. And if we went ahead and take a look at the values too, these values aren't crazy, right? Um these daily returns are small. That's because they're doing on a daily basis. nail sharp ratio of three isn't crazy, especially considering of how big of a jump there was. We know for effect that the volume analysis was super high. And considering just generally knowing what happened in this situation, we can see how it would violate a lot of the effective market hypothesis because a lot of the effective market hypothesis says that the values would be factored in. Um like prior data would be factored in and public information would be factored in. And yet we know that this in this case that kind of breaks that idea because of the fact that there was plenty of public information available and yet the stock price still get got affected way later on when the actual plan was um I guess put put into place. Um so yeah our values definitely seem to make sense and we can perform some basic sensitivity analysis too right seeing if the values change a lot. So let's take a look at our current values right now and we can see how um these are all the same which are good. We can see how our sharp is like 3.08 um etc. All righty. Perfect. And our cap was like 12116. So if we change something small here, let's go ahead and change let's say uh we change to be a market value of 1 point let's 1.026. Right? This shouldn't have a huge difference um if our model is good. So if we went ahead and run this change. Yep. So we can see here the cap m only changed by a little bit changing it to 119 uh 9% which shows that um generally our mark our model is generally pretty robust because of the fact that it didn't change by a ton even even when we changed by about a percent in our actual um values that we provide to it. So it wasn't like just by chance that it gave us our values. And so now that we've validated our code, we can move on to evolving. Uh and in the future, I think some more definitive measures uh definitive measures and data for risk-free rate market return could definitely improve the model. Right? I just found some sources online that describe what was happening at the time. But I could probably pull data and give a more definitive or I guess my own analysis on those risk-free rates and market returns and give um my own I guess analyzed risk-free rates and market return in order to use in the analysis. Um, also being able to quantify more parts of behavioral analysis. You can definitely see these things being shown in the data, but being able to quantify them and maybe tie them more and comparing them to, and I kind of talked this here, but creating visualizations for what a rational investor may have predicted prior to the event could be useful because we can compare that to behavioral analysis and potentially see the effects of behavioral analysis um uh to see how much um the behavioral of the behavior of investors and everything that happened outside of purely fundamentals would have actually affected the stock price. And also there's the final output is kind of confusing at times, right? Like it is a lot of data given to you and spat out your own words. Uh being able to sort this in a more way could also be a way to improve this in the future. And so now moving on reflect. Uh we successfully made an analysis with the visualizations and key values. And I'm just going to move on to theoretical implications really quickly before we move on there. Um and so we can look at here under the effective market hypothesis. This situation violated a lot of its assumptions. We described this a lot already because of all that public information as we mentioned before. Um effective market hypothesis s",
  "video_url": "https://youtu.be/QZJasxx8Sa4"
}