{
  "student_name": "Tanish Kukreja",
  "org_defined_id": "036513412",
  "username": "tkukrej",
  "video_url": "https://youtu.be/_z3nThEtRkQ",
  "transcript": "Hi, this is my session 11 assignment for management 310. Uh first I'll be giving a overview of the whole assignment and what we need to analyze and find. Uh so evaluate Apple's hypothetically hypothetical $90 billion share repurchase using driver. act as an independent analyst who must determine whether the buyback creates value relative to alternate uses of cash while balancing stakeholder incentives. So the information that we have regard regarding this situation is liquidity uh they have like $165 billion in cash in investments $100 billion annual fee free cash flow market context is $185 share price PE is 30 dividend yield.5% $15.5 billion shares outstanding balance sheet shows a debt of $110 billion Bugshshire owns 6% % CO CEO holds 3 million shares and retail investments average 100 shares. Employees have $170 strike options. Proposal is $90 billion buyback executed over one year which is 10% market cap and the other alternatives are $6 special dividend, strategic AI/VR acquisition, uh debt reduction or incremental R&D. So we need to deliver a recommendation that explains uh stakeholder impacts, agency considerations and value creation versus value transfer outcomes. This is what we need to recommend in this analysis. The few requirements regarding our analysis would be we need to answer that we need to quantify stakeholder outcomes uh under the buyback. Compare the buyback to dividend acquisition, debt deduction and R&D alternatives using metrics such as EPS impact, ownership changes, ROIC, leverage and strategic fit. The last question we have is discuss signaling effects, market perception and long-term retail capital allocation discipline uh tied to each option. So we need to basically figure out what will be the best option among all of these alternatives including buy backing uh buy back our shares. So this was basically overview or def or I was basically like defining uh what the assignment is about. Um so if you go to if you start by explaining it in using the driver framework it's basically uh the company has $90 billion and must choose among all of these options which is share buyback uh special dividend debt reduction uh R&D investment or doing nothing. Um stakeholders include retail shareholders institutional investors management employees and bond holders. So this was basically the def definition stage of our assignment in which I gave you a overview of what our uh assignment is. Now if you go to the represent stage uh the key metrics used to evaluate each scenario is uh we need to use all of these and I've used all of this. when I went to my when I go to my implement stage I'll be able to explain all of this uh is EPS impact shares outstanding um return on investment capital u leverage which is basically debt upon equity uh ratio ownership concentration um and signaling effects. So this is basically the depresent stage in which I need to like depresent all of these uh to provide my analysis.\n\nOkay. Now if I go to the implement stage and use all of this I'll be able to go over here. This is basically implementing a Python code and explaining this assignment. U I used driver framework for this whole code too. So this has all the information that was basically given to us in our questions uh which includes the current share price, the number of shares outsting what is the proposed buyback amount, debt and cash that were given in the balance sheet in our question.\n\nOkay. Now the model needs net income. Since uh the PE ratio is given to us which was 30, we need to calculate EPS which I'll be able to find my calculations when I run this code.\n\nYes. Now if you go to the uh implement stage as we also need to keep it like simple for people who do not have financial knowledge about this. uh we took this example of fewer slices of the same profit pie means a bigger slice. So if we buy back our op our shares we are basically investing into a small pizza but we want the whole pizza to get bigger. So this is basically the concept of buyback in this assignment.\n\nSo now these are all the options that we have and we need to find out uh the basic alternatives that we have. So this code basically like helps us calculate what would be the scenario. Uh if we use the total dividend cost if the debt if we choose the option of debt deduction then this is the code for that. If we invest on R&D and strategic acquisition this is the code for that. Okay. So now if I run this code, I'll be able to make a better comparison.\n\nOkay. So over here we can see these are all the basic alternatives that we have. So share buyback. If we buy back the share, the retail shareholders benefit from higher EPS and possibly a higher stock price ownership per share increases. um institutional investors will have the same benefit as retail shareholders. Management if the EPS goes up, stockbased compensation becomes more valuable. Employees will have no direct benefit and the bond holders will also not have any benefits in this case. So as we can see over here, if we do the if you do the paste case and do nothing, then our EPS is 6.17. Um if we do share repurchase or buyback the EPS goes to 6.37. If we take the special dividend case which is over here uh the EPS would change to 6.17. In case of dividend the retail shareholders will get immediate cash from their investment. Institutional investors will not get anything and there will be no value creation. uh management there will be no EPS boost employees no impact and bond holders also no impact in dividend case then we go to the debt reduction case if we take the alternative of debt reduction uh then the EPS increases because interest rate cost falls uh bond holders strongly benefit credit rating improves uh for the management safer balance sheet but no aggressive EPS changes employ low financial risk So if we take the debt uh reduction method then the EPS boosts to 6.40. Uh and if we take the acquisition and R&D the EPS goes to 6.63. So this is the part of the code that shows us how much the EPS is changing in each case. So we can see the acquisition and R&D on 8% return uh return on investment. The EPS changes the maximum. So that would be probably be the best uh alternative in choosing from all of these options. U here are all the f all the um factors that'll change if we take this option and we invest on 8% with 8% return on investment. The retail and institutional highest EPS increases if ROI ex succeeds. uh management bigger company prestige and agency risk employees more opportunities as we'll be investing on R&D uh bond holders risk depends on success of the project uh for bond holder the impact will depend on the project uh or the investment and market if there is a positive ROI earning yields okay so after the code and seeing all of these changes on the EP PS this is basically the um main output that we get. So if we buy back our shares then there is this percent increase in our EPS. Dividend there will be no change in the EPS. Debt deduction EPS there will be this much percent increase in the EPS and acquisition which is the highest value creation there is a 7.53% increase in EPS. So this is probably this will be basically my recommendation and answer to the question of that we needed to answer over here. Uh compare the buyback to dividend acquisition, debt deduction and R&D alternatives using metrics such as EPS impact. So this is uh basically answer to this question and my recommendation would be to investing on R&D uh with a 8% ROI. Okay. So to answer uh the other questions from over here uh does the buyback create value? Uh yes but not as much as if we invest with a 8% ROI or debt reduction. Buyback increases the EPS but does not grow the company. Uh it mostly transfers value rather than creating value.\nOkay. Now I went through all of these in the represent stage. So my recommendation based on uh the metrics and the stakeholder impact would be uh acquisition we go with acquisition and R&D with 8% ROI as it has the highest EPS improvement and long-term value. Uh debt reduction reduces the risk improves leverage and boost EPS. So that will be the second best alternative. Third would be buy backing the $90 billion shares. good but mainly transfers value and doesn't create value as EPS boost the most in acquisition and R&D alternative and dividend uh probably has the lowest value creation. So this was basically my reflection and recommending stage for this assignment. Thank you."
}