{
  "student_name": "None None",
  "org_defined_id": "034423095",
  "username": "cbrunton",
  "video_url": "",
  "transcript": "All right. So, this is my uh submission for mini project three, the um creating the AI capital budgeting explainer. And I'm just kind of going to walk through what I built and how it evolved from how it evolved from my my different versions. Um so, big picture here, I made this using Python and Streamlab instead of N mainly because I wanted full control over the logic in the UI and uh some of the issues I've had with N in the past. Um but everything here runs locally and um through things like uh VS code and using Python and all my API key API keys are stored in a private uh file. So nothing leaks on camera here. But um the whole point of this tool is to take normal caping budget normal capital budgeting stuff like NPVR and payback and then actually explain what the numbers mean in plain English using AI specifically and open AI API. So starting with the uh version one 1.5 you can see here um here I kind of took uh the calculator just the basic calculator and then added um the first AI explanation um opportunity here which basically just kind of tells the user you know what do the numbers even mean? Um, but what I want to show here is uh version two and pulling it up using streamllet here is what version two looks like. Um, which is you can see it here. This is where I start adding actual user context. Um, there's a drop down here that is a risk tolerance selector. Um, so so here you know the A doesn't just explain the finance numbers. explains them differently based on whether the user is conservative, moderate or aggressive. Um, you know, those are the three different options here. So, the output does change on the personality of the user, the role or the comfort with uncertainty that the user has, which is something financial advisors do in real life, which is so that's why I wouldn't include it here in this um mini project. But if we select different options here, um, change some of these numbers as if we're in a certain scenario and then calculate metrics and get the AI AI explanation. It'll take you a few seconds to run, but you can see here the app calculates MPV, IRR, and payback. Then it packages all the numbers plus the plus the risk tolerance into a structured prompt. Um, then Open AI generates a three-part explanation. um a plain English summary, a personalized recommendation, and then a caveat section that that gives guardrails so nobody thinks this is real financial advice. Um so and and that was that was how how I developed it here. Um I used it um I created it using Streamlit and VS Code. If I can pull it up here. Um, you can see VS Code here and all the code that I use to develop it. Um, here is where my app is and then the API key is in here. But you save this and then you go into terminal, run it, and then it pulls up here, which is how I got to, you know, this. So that kind of explains what I did here. Um anyways that's how I developed this many project and it was very interesting actually um I've never used um this kind of method I use I've used nan before I had struggles with nan but I like this way of developing a kind of project especially when it's local on my computer is a lot more useful um I don't know if this this is something you could publish publicly and let other people use Um although that would be expensive for the API. Um I don't know how worth it that would be for that. But um it's definitely interesting to see that you can actually create a very personalized um project especially with these API keys which I've been learning about in other classes. Um, and it's a a very new part of the way AI is affecting especially, you know, the things you can develop and create over time, especially if you're working with personal projects because, you know, APIs aren't um necessarily cheap over time, but if it's for a personal project, it might be a viable solution if you're wanting um a personal catered AI for you to use for your own financial information. Um, and I used an open AI um API here. So this uses, you know, the Chad GBT AI framework um or AI machine. Um but yeah, that's my uh submission for this assignment."
}