{
  "student_name": "None None",
  "org_defined_id": "035801901",
  "username": "seichsta",
  "video_url": "",
  "transcript": "Hello, my name is Sam Eichsted and this is my mini project #3. OK, so for this project we're building an advanced AI finance tool using NAM.\nSo we have to build a more advanced A I finance tool using another platform of your choice. You should analyze, explain and or advise on financial decisions using A I as the brain.\nOK, so I was going through, I looked at the inspiration ideas, financial statement explainer really stood out to me because in my past I had a internship that was actually being in investor relations.\nAnalyst for a pretty big company and that was super fun. It's kind of my niche that I like. So I then started doing some research and started working and I figured out that I could use NAN to pull data.\nFrom companies earnings reports and then shoot it over to a Google sheet. So I decided to do this because one, it can get extremely tedious to go through and to find all this data yourself.\nUm, for example, um.\nIf we go to this companies.\n10 Q We will be able to see that how just how long some of these companies quarterly reports can be. So we'll go to the latest 10 Q right here and then scroll through this.\nSo starting here you can see there is many, many, many, many, many pages and going through this and trying to find each individual little thing can be very difficult. So I really wanted to make a tool.\nThat helps the average person kinda go through and just find these values for you without having to spend hours and hours looking and for multiple reports too. So for this I went ahead and used used a company called Patrick Industries.\nBut you can use literally any any company as long as you have their a link to their 10 queue. So we'll we'll see how this runs now. So first step is go through.\nAnd find the 10 Q that you want and then you go ahead and copy this, copy the link, go back and then paste it into this URL column here. So that's pasted and then yeah, so pretty much what this does.\nIs you ask it to update the data that we want and then it will go through or process it and then it would extract all the key values from this quarterly report and send it to A I. A I will go through find the values and then it will add them to this.\nGoogle sheet. So here we go. Let's start. Hello, can you please?\nSimplify and extract data to fill.\nOut my.\nSheet from Patrick.\nYeah.\nThe date 2.\nReport November 6th, 2025. Go ahead and send that. It would go ahead and do its job. So it's going through finding the 10 Q all of this and simplifying it down, extracting the key numbers.\nThen sending it to the AI, the AI will go through and say, OK, this looks good, this looks good, keep it in its memory, and then go ahead and append the rows in this sheet right here. So we'll wait for it to do its job real quick.\nPass so it goes through and then it does that.\nAnd then you can see it updates this entire row of revenues, cash and cash equivalents, cost of goods sold, net income, property, plant, equipment, net. So that is my project. You can do this for any company."
}