{
  "student_name": "Dylan Scheel",
  "org_defined_id": "037036066",
  "username": "dscheel",
  "email": "",
  "transcript": "Hello, my name is Dylan Sheiel and this is my management 310 session 8 assignment. We are talking about market efficiency hypothesis and doing some investigation with that. I first off need to say I'm sorry in advance. I am deathly ill. And so if I get brain fog or I am a little confused or maybe I don't go into as much depth as I should on this assignment, I apologize, but I I tried very hard, but I've had to miss the last couple of classes due to being so sick. So, but we'll get into this and we're going to try our best and try to rally. So first off uh the goal of the assignment is we are going to investigate market efficiency using the GameStop short squeeze event of 2021 as a case study. So this is one of the most notorious um I guess market abnormalities of all time or at least definitely in recent time for somebody growing up like me. I was in high school during this um and I was reading on the news and it was just very confusing. It was um I obviously at the time didn't really know what was going on, but everyone was saying that it was it was abnormal and it was different and we had no clue why at the time and now we kind of have some some ideas of how that could have happened and um but we will uh we'll we'll get into why and how that happened. So the first step of this is we want to verify the statement that GameStop traded at 4 cents in August 2020 against actual uh historical data and use the event timeline given in August 2020 GameStop was near bankruptcy levels then the tree founder acquired 13% stake and then it rose and we'll get into all these things as we go but so for the prompt I said first thing I said is hi I am a financial accounting student learning about market efficiency and this week I plan to use GameStop short squeeze event in of 2021. I know that this is one of the most abnormal market changes in history and today I want you to help me explore why that is. I first want to verify the information I believe I know that the real world information from the real data which I know to be true market data which cannot be messed or changed. I then want to test which from which form of market efficiency was being violated. My first thought would be semi- strong as it seemed to have there had been some major insider info being passed that the public did not know. But it's important with the semi strong that there was still um all market data being able to be used. I then want to check if I as a rational investor could have profited systematically from this surge. Lastly, I want to compare market efficiency hypothesis predictions to observe data and assess behavior finance uh explanations for abnormalities we see. for the anomalies we see. Sorry. I said I want you to act as a financial accounting professor with a vast knowledge in Python coding as well as market efficiency and market history. And then important thing I said when using Python as a tool, please keep the code clean, organized, and beginner friendly. This just makes it easy to digest. And then I told it I I wrote out my goals. I said to complete the goals, I want you to first want you to create a simple Python code that imports the real data from the 2021 uh 2020 and 2021 short squeeze of GameStop and uh verify that the stock price of GameStop traded at 4 cents in August of 2020. I then want to use this info to do a market efficiency testing which includes classifying the event relative to the efficient market hypothesis forms which are weak, semi- strong and strong and then do an evaluation of abnormal returns during the event and lastly do an assessment of predictability patterns. I then want you to create a simple yet effective sensitivity table to show rational investor analysis to show if the average Joe like me who is riskaverse could have profited during this event. this and then I said this information should all come from the real data that you import using panda software. Please keep the clip code clean, organized and beginner friendly. So we go into my collab and the first thing it did is it imported to pandas. It imported mat lab mattplot just to um show these things and then um an important thing that we had was um it shows that the prices are adjusted for or split adjusted because there was a 4:1 split. So the stock prices were divided by four and if we see in August of 2020 um our stock price was a dollar to a$150. It was a it was this was before the split of 4 to $6. And so the first thing we see is that we um this information that we thought we had the GameStop traded at 4 cents in August 2020 20 was um we I believe that's wrong. Um it looks like as we can see that it was actually trading in a dollar and I think the reason this um misinformation could have came was potentially we were looking at the we thought that that had been split already the 4 to1 stock split but it actually hadn't yet that stock that came in 2022 I believe and so it actually was trading at a dollar at the time and then um so this is just it um it uh showing the stock split and stuff. And so, um, I, um, was wrong in my, um, efficient market hypothesis and why it was being violated. Um, the, uh, the I was correct that it was a semi strong form violation, but I was actually wrong in the reasoning. So, I had said it was insider info, but the insider information was not the primary driver. information during the squeeze um driving the squeeze was an 140% short interest in the Reddit coordination which we actually had in the key points here that it was primarily driven by Reddit and it peaked at an 140% of uh float and it's technically was publicly available um but the prices weren't adjusted to this and that is where the uh market efficiency uh died. the market ignored the short squeeze and then everyone um violently overreacted. We can see there's actually a graph in here that uh did not input. Where is it at? Let me try and find it. We can see this graph and we can see here um this puts us into 2021 and we have this in this area right here is where we would have started to see that information become prevalent. But then it quickly skyrocketed. we saw that this is where the overreaction came and this is where people finally started to realize the issue and that's when it got pushed up. And so the next thing I wanted to do was create a sensitivity table to see if I as an average Joe could have um invested. And here we are. And no, the answer is no. Uh systematically at least. Um, as you can see, the returns are incredibly different than anyone could have thought they would have been, could have guessed they would have been. And as an average Joe who's risk averse and trying to make sure that they do what's best and trade at a normal rate and um basically it's it was impossible here because the um the surge and the price skyrocketing was had no real rhyme or reason to how it happened. We saw that um a lot of it came from this hedge fund that needed to be fixed. And so on Wall Street, these people drove up the prices at random times and in coordination from a uh Reddit group. It's in here somewhere. It's in here somewhere. I'm so I'm sorry. But um it is um Oh, here we go. The anomaly came from uh following the Reddit crowd. It it's it's called hurting is one of the uh anomaly uh things which is the behavioral finance explanation. It's called hurting which basically means that everyone follows a small path and that came from I believe the right was called Wall Street Bets and so everyone herded together and rose the stock up and yes technically uh you could have followed this but I in my opinion as an average Joe as a rational investor that's not something you would do that's not systematic in any way and that's the answer we're uh trying to trying to see is could it you have profited systematically the answer is no you can that is not systematic. um systematic would be trading normally and trading with a pattern and this there was no pattern to this and so um I was correct that it was semi- strong but I was wrong in the reason it was it was there there there was public information it was given it's just the public information was treated abnormally and that was due to hurting and so the market efficiency was um was faulted in that that and then the market efficiency predictions were also violated in this because as you can see the abnormal surge we went from in August we were selling at a dollar a share and then at the turn of the new year in January we shot up to $4 a share and that is incredibly unheard of and then by the end of that month we were at $19 a share and that is so abnormal nothing could have uh no market efficiency could have uh predicted that and again that goes to the abnormality of hurting and um how people drove this up together. This was a coordinated effort that um the average Joe could not have could not have went to. We see that by the sensitivity table. This is not systematic in any way. And um so yeah, I overall the first thing we look at is we were we one we were wrong in the um idea that GameStop traded at 4 cents in August of 2020. That is not correct. It was actually a dollar and that's okay. Again, I think there was just some issues with the uh idea of the stock split that came later in life. And so I think there was some confusing there. And um so yeah, and then as we can see from this graph here, there is so many abnormalities. It rose, it skyrocketed up and then it came slightly down and then it rose right back up. And that again is due to the abnormalities that the market efficiency could not have um could not have happened. And the company did look like it was going bankrupt in 2020. This is goes a lot to the idea of the um the market model in 2020. Everyone was stuck at home in COVID. You couldn't go out and buy games. And so the idea of GameStop shifted uh almost became obsolete because of everyone was buying their games online through Microsoft or through Sony or through Steam. And so um GameStop's um GameStop's what's the word? Um like their their model became obsolete and so it almost went bankrupt. But then but then these these uh these men uh Ryan Cohan and the hedge fund they they saw an opportunity to make money and drive it back up and that's what happened. And so one of the things I learned most from this was that the this idea of not necessarily insider training because I guess as we see it isn't what it was but it was a coordinated effort by people not normal people with ideas and people with the the ability to push things up and they were able to do that. And so as an average Joe that's not something you can really find yourself in. And so it was very interesting because these things can happen in the market and they are very abnormal. And so it was kind of the aha moment in this thing was it happened and there's still to this day not really an explanation for it but that's how it happened. And so as I reflect on this, it's it's very interesting to see as somebody who is trying to get into the market as I get older and in my career as an actuary, I will look at market fluctuations a lot and have to deal with them mostly in the health insurance field, but still um it's very interesting to see and to be able to know that some of these things are out of the control of normal people, of the average Joe, of the normal investors, people that don't have pole and that's a little scary. Um, but that's also something that um I hope that in the future I can be a part of and be able to learn from. So yeah, that's my that's my uh session assignment. Thank you again. I'm very sorry for being sick. Please give me some grace on this. I am I am trying my best today. Thank you.",
  "video_url": "https://youtu.be/ilM0haTqOF0"
}