{
  "student_name": "Spencer Beebe",
  "org_defined_id": "034593722",
  "username": "beebe9",
  "email": "",
  "transcript": "Alright, welcome to my Session 8 assignment. I'm Spencer Beebe. Umm, So yeah, this week we're looking at market efficiency investigation. Uh, assignment overview. We're looking at GameStop and the short squeeze event of 2020 to 2021. Umm. We'll look at the historical data and how it's relative to the efficient market hypothesis predictions, and then we'll evaluate whether the market anomalies constitute evidence against market efficiency or not. Uh, so the first step, verify the statement, GameStop traded at $0.04 in August of 2020. So, uh, I just use Yahoo Finance uh, went over to GameStop corporation GME, Uh, and then I just went back in the historical data here, uh, and as you can see. Uh, of January 2021, it's opened at $4.75. Uh reached a low of 427 and a high of 1/20/75 and it closed at 8125. Umm, so much higher than the four cents that was. Um stated earlier in the instructions, so actually. Uh, in August of 2020. So that would be. Right here. It closed at $1.67. Uh, it opened at $1.01. So much higher than the four cents that was predicted, so I put here in the find and discover right here. GameStop traded at .4 in August 2020, which is false. It was actually $1.67 umm Ryan Cohen stake umm, so it was predicted he had what 13% ownership uh. I found 12.9, so basically 13% uh now is through his RC ventures uh. So that's correct. That timeline fills in uh and then January 20. One, like I said earlier, the peak was 1/20/75. Uh, low 4/20. Or 427 and then it closed at 8125. So that's the, uh, correct data. Umm, so that's what I used going forward. Umm, So I just made a little timeline here. So August 3rd, that's pre Cohen involvement. That was 411. Once he acquired 13%, it jumped up to 656. Umm. January 4th is when it started. That squeeze jumped up to 17 uh, that Reddit attention, the subreddit uh, made it jump to 31. Retail trading spikes to $65 and then uh. Peak closing price was 97, but it jumped up to uh. That was the closing price. The high was 1/20/75 and it closed at UMM. I need to change this close at 8125. Uh, and then. You le going further uh along the line in February, it dropped down again to 60 uh and as you can see here as of uh let's see what's the date November 12th of 2025, it's trading at $21.00 uh and it's kind of evened out it's kind of plateaued since that spike in 2020. Umm definitely still higher than what it was pre 2020 uh, which is good for the company uh revived GameStop uh and you know. Allowed them to to not go out of business. So the goal here is to test the EMH weak, semi strong strong and explain its behavior is consistent with the efficient market hypothesis. Umm so a weak EMH reflects all information and past prices. Umm so an interpretation of that significant auto correlation or predictable patterns and returns around the event implies a violation of. Weak form emh umm but temporary auto creation due to microstructures, frictions and information arrival can appear ex post uh. So a a violation of a weak form umm basically means that there's predictable patterns in the returns uh, for that event. So for a semi strong EMH. Umm, if abnormal returns persist after public news is released? Umm. So that means that's a violation of the, uh, semi strong EMH? And then the strong image, it's very hard to test. You got to look for evidence of insider trading or abnormal profits, uh, with, you know, traders with private access. So it's not usually supported. Uh, it's very hard to, uh, uncover unless there's, you know, SEC filing, umm, or you know, investigation into, into the company or the traders. Alright, so that is the define discover there. Uh, we've created a timeline of everything. We found the correct historical data, Uh, and then we kind of just gave a little overview of what we're actually testing for. Umm. So now let's go over to the implement stage, the Colab code. So created this code here. It's using the timelines from 2020. Umm. 20/21/2020. Umm, so it's going to compute the returns, visualize the key events, uh, it's going to classify the emhs. And if there's any violations, uh, per, it's going to. Yeah, it's gonna predict if it's a violation of the EMH. Umm, risk adjusted returns, abnormal returns. We got behavioral finance, herding and microstructure. Uh, so that's just to see if there's, you know, a short squeeze, panic, FOMO, that kind of thing, uh, rational investor profitability. So, you know, who's making money off of this, umm. And then just like a chart here. So the graph is just the timeline of the actual. Uh, closing prices through January of 2021, so as you can see there, that's the Reddit surge on the left uh, and then after that it just continued to increase uh, in price that peak close right there and then the, the peak high umm, the following day. So what this uh uncovered, the code showed the auto correlation of returns is a -0.258. The weak form EMH violated, that's true. Semi strong EMH violated true and strong form EMH violated true. So it's saying that all three Emhs were violated. Umm and the annualized Sharpe ratio is a 7.89. Umm. And then it it just gives some, uh. Summary here. And then this is just some explanation which I'll go over here in a second. So looking on the the right here. So the weak form image violates. So all three emhs were violated. So what does that mean for the weak form? That means past returns were predictive. Umm, so I mean it's kind of in the in the name there umm, the historical data was predictable for what was upcoming on the returns uh, so that was a violation for the semi strong. The public info did not immediately reflect in price umm. So that causes that violation. If the public did immediately, if the public info did immediately reflect in the price, that would be uh, it wouldn't be a violation, but it did. So that does make it a violation of semi strong Uh, and then the strong form was also violated because some participants had insider early information. Umm, this has been proven in the. Uh. With the Reddit surge and I'm pretty sure there's been some SEC investigations into people that played a role into this short squeeze. All right, so let's go over what it's telling us here. Umm, so it says the cumulative abnormal return, uh, was -127.25%? So that just shows that it was abnormal. Returns were extreme. So that shows that the umm event was driven in risk and vitality. Uh, it was a very. Unpre, uh, not unpredictable, but very, umm, kind of out of left field 'cause I remember this, uh, when it happened in, during the COVID years, umm, GameStop was about to go out of business and then the Reddit post, uh, Wall Street bets kind of coordinated to buy up all of the. Umm, the stocks and kind of raise the price and uh, especially because there was a lot of umm, investors that were betting against GameStop, so basically betting them to fail umm. And it was kind of, it was known as like a meme at the time. However, it had extremely high implications on the market and, you know, the future of the market and how people can now, you know, almost work together to to save a company or possibly put them out of business, depending on the situation. Uh, the Sharpe ratio is 7.89. That shows that it's a high risk adjusted return potential during the event. So it's very volatile, very risky, which is kind of uh. Just kind of. You know, warranted given the event. Very risky event, very volatile. Uh, so let's see here the. So some of the, uh, the reasoning. For uh. The violations here, so one could be FOMO or that short squeeze panic. So fear of missing out. People want to be in on it. They don't want to, you know, possibly lose money that they could have made. Uh, like I said earlier, the Reddit, the subreddit Wall Street bets drove coordinated retail buying. Umm. It limits the arbitrage broker restrictions like Robin Hood. Uh, they actually didn't allow people to trade umm GME for a short while. Umm, liquidity issues, market microstructure, high volume spikes, price volatility, uh, systematic profit opportunities existed post event. Umm, so that's a risk-adjusted returns. The sharp is greater than 0, which suggests high volatility opportunity. Umm, so there is opportunity to make money, but it's very risky umm. Information advantages existed for early retail participants and insiders, so that shows it's a violation of the strong form. Umm. Looking at active management could capture short-term games during the event. Passive management would miss event driven returns. Uh, so that just goes to show the type of management and how that could affect it. Umm, going down here I. To the to the evolve stage. So I did a second code in collab here uh and it just shows you know how much money you'd actually be making if you were to buy and trade on these specific days in 2021, umm, following the subreddit surge of the price umm so if you were to sell. On the 27th, that's 100 and 2% umm, return on investment. And if you were to wait another day, that's another 80% uh, increase on, on top of that 100% uh, so 180% increase, umm, in profitability just by, you know. Trading and buying at the at the right times. So definitely opportunities to profit off of this, especially with insider knowledge if you knew what was going to happen with those markets, which is what has been alleged to to occur. So, uh, let's go back here. Uh, where are the questions at? So we tested all the Emhs. All were violated. Uh, we distinguished them all. Umm, we validated the evidence, we analyzed the real world market events. Umm, that's what that code did. Apply the driver framework throughout integrated financial theories. Perfect. Umm. Just need to find. All right, here we go. So we found all the historical price data, uh, we tested umm, which were violated. We. Uh, now let's evaluate whether rational investors could have profited systematically. I kind of already showed you that, uh, earlier with the second code, umm, but over here on the right, uh, I kind of just laid everything out, uh, with bullet points here. So early investors or insiders, uh, who bought GME before the Reddit surge had huge upside. Umm, because someone buying at, you know, $43 on January 13th could have sold, could have sold. $86 on January 27th. So that's, it's like 2 weeks and you're doubling your profit. So very high potential there. Except these investors exploited information advantages, umm, such as the timing of the social media buzz, insider knowledge, or you know, the unusual high short interest, umm, some momentum traders during the spike. So during the actual surge, how they could have made money. Uh, would be, you know, riding that short term momentum buying when prices were trending upward, umm, you know, due to FOMO, so you didn't want to miss out on the opportunity. So you might have bought a little higher, uh, than, you know. You wanted to with that it's high volatility umm and a lot of people had exit quickly uh before the price dipped because as you can see here. A huge spike during 2020 and 2021, and then from there it has just continued to decrease. Umm. I mean, in 2024 it was trading at $7.00. Or excuse me at. Just under $10.00. So you go from selling at $80.00 to selling at $10. That can be a huge downside and a a big loss. Umm for traders. Umm. Short sellers who covered early sell hedge funds or retail traders uh who shorted GME earlier may have profited uh, if they covered their shorts umm before the spike. However, if you did bet on the short and then that spike happened, you would lose everything umm, however. Looking now umm if you were to short GameStop now, it wouldn't be the the worst uh investment because it has already hit that spike that's very unlikely to happen again uh and as you can see year after year it's just decreased uh except for a little spike in the uh. In the start of 2025. Um, and then, yeah, like, uh, like the information provided, uh, Melvin Capitals, we had a 53% loss. Umm, so a late short covering short squeeze can cause enormous losses. Umm and then you have that Sharpe ratio of 7.89 in case there's returns per unit of risk were exceptionally high, which is rare in normal markets. Umm. So you know you wanted to create extreme profit potential if trades were timely, correct, but if not a very volatile and risky. Just reflecting on everything, uh, it's a little quote. The GME short Tweed shows a clash between EMH and behavioral finance. Prices deviated shortly from fundamentals, violating weak, semi strong, and strong form. EMH. Uh, investor herding, FOMO, and social media coordination created predictable patterns and abnormal profits. While EMH provides a baseline for efficiency, behavioral finance better explains the real-world market dynamics. Actually during extreme volatility, umm. So that's kind of just my overall summary of of this entire project here. Umm. So yeah, we did. Did 1, did 2, did 3. We compared them. And then we assess the behavioral finance explanations. Umm. So yeah, we went through a driver defining discover represent right here. Uh, implement with the code. We validated the code. Umm, and we evolved it with that second code and how people could profit off of this and then reflect if we just, uh, compared behavioral finance and EMH and what it does well and what it, it doesn't do well. Umm, and what you need. Uh, behavioral finance for because of those, you know, those real world market volatility, umm, and patterns. Umm, yeah. So I think that is everything here. Uh, we went over all the financial concepts here. Umm. Yes, so the behavioral biases would be that FOMO are hurting umm, which which happens if you, you know, maybe bought a little bit too high after the prices surged a little bit. Umm. But yeah, we went through, uh, went through the driver framework. I used uh, KISS for the code. Umm, and then we found all the data using, uh, Yahoo Finance and the GameStop, umm, price sticker here. Umm, so just I guess to go over it again, the week form pass prices and return data cannot predict future prices. Returns are random. Semi strong means all publicly available information is immediately incorporated into prices and then strong form uh, insider information cannot produce consistent profits. So we found all three of these were violated uh, because daily returns showed strong auto correlation. So. Prices help predict short-term moves for the semi-strong. It was violated because public information such as the Reddit posts, the news, or the short interest data did not immediately reflect in prices. Delayed reaction and it created abnormal returns, uh, which people use to their advantage to, you know, make a good, good profit on the opportunity. And then strong form was violated because early insiders and, you know, traders exploited the timing advantages, uh, to, you know, increase their profit. And it showed that the private knowledge had value and they were able to profit off of it. So in summary, image predicts efficient, largely unpredictable prices, but GME uh, displayed predictable, extremely volatile prices. Uh, abnormal returns, hurting behavior, uh, social media influence contradicted EMH, while the behavioral finance explains the anomalies. Uh, so for a good financial analysis, you want to be able to use the EMH, uh, but also use behavioral finance to explain some of those things that EMH can't, can't explain. Um, so that's going to be everything. Um, thanks for watching.",
  "video_url": "https://www.youtube.com/watch?v=d-eobBzRMGE"
}