{
  "student_name": "Abdulrahman Ali",
  "org_defined_id": "037005845",
  "username": "ali243",
  "video_url": "https://www.loom.com/share/e7ed0ad8726740cfb7e03f8352b60cbb",
  "transcript": "0:02 Hey, how's everyone doing? I remember for a prospective KK Arctic over during using Driver Combat CZ. You see, you have trading comps and perc- and percident transactions to produce and inform better.\n0:20 It's a of contrasting financial bias and strategic bias diagnosis. It's all a start. Alright, so, over, we want to go to the kitchen, KKR, by per hour.\n0:36 We're quite sure to pay. Let's go, set a winning bet, and that and a strong BE return. Success metrics is an entry multiple that supports 15% plus IRR, strong cash flow, manageable risk, and good exit paths.\n0:47 Constraints is WACC, which is around 9% management, was 10% equity, all over strategic Starbucks, McDonald's, can be more just synergies.\n0:56 We are solving for disciplined KKR, but we're not the highest possible price. What's the plan? Is this- I have trading comps and president transactions.\n1:02 Key driver is going to revenue growth, e-b-i-t-d-a-maging, free cash flow, entry month, mobile, we ignore. It's going to be aggressive, mobile explanations, prefer, and perfect execution assumptions.\n1:12 Basically- Next one. Now implement, as I have to do what we're going to talk about, DCF is a five-year multi-linear starting point will be at $6 billion, EPI, TDM will be $500,000, it's in the set, digital sales will be 50%.\n1:25 WSU will be 9% and terminal goes to 2.5%. Snare results from Python models, low E, is what I did right here, was being downside.\n1:33 It's probably 8.1 billion, it's the best value, basically 9.9, but outside will be 2.1. So, I implied DC F range will be from 8 to 12 billion.\n1:40 Um, trading concrete, I'll check with the industry, P over E, earlier on me, 22 times. So, total will be 8.1, public market value, Panera below.\n1:51 Take over prices. courses. I don't want to go back. Umm, President, Presedent and Transactions Control Buyers is fast, casual deals, 12-15x, e-back, E-B-I-T-D-A.\n2:01 Panera, E-B-I-T-D-A will be $900m. If you multiply by 12 it will be 10.0.0. 0 1-8-1-13-11-11-17-13-13.5. Val, they do the answers to make sense.\n2:10 Cross-check DC-F-10-11-1-1-1-1-1-1-1-1-13-13.5.0.0. check only 25x. P-E, much higher growth. Put downs at 25x. P-E, go-bose-couples, dividends. Parents, there's a controlling number, notch, volume, basically.\n2:23 Alright. Val, dated, rick, rick, rick. Value is regulated, range. 10.5 to 12.5 billion. So we now know what the validation is for it.\n2:31 So what changes the answer? So upside-down rates, digital mix, 100, new storage, dinner, post-kitroom, strategic service. Okay, alright. So 5.5 billion, global franchise and marketing skills, which you can just 5.15x e-v-i-d-a.\n2:43 I've left with the final cause of all the reaction I do. Final recommendation- and executive answer. KK are fair values.\n2:48 What's the fair value of it? It's 10.5 to 4.5 equating, $1,000,000 equating. It turns 30 times of e-v-i-d-a. Winning KK R-bit is really, the target would be 11.5% and what way we talk about it.\n2:58 Strategy accepting- except management, types are all over. Use moderate leverage. Focus on executions and not synergies. Less- less- less- less- less-- less- less- less- less- less- and as of as you might as well.\n3:10 Uhm, if, uh, KKR would be paid just as you know, maximum flow around 13 times in risk tolerance lower, would be a little bit lower and, like, lean when er- nope, I tchasing as strategic prices, but worth that, other.\n3:27 KKR should bid to anyone about what if it gets emotional. So if it's too much, do you think that's not working?\n3:33 Don't do it. Thank you guys very much for talking for listening to me. So we answered almost- Almost. We answered every single thing here and we used driver framework, so we used DRIVR, which was exactly why each one works.\n3:43 We also had the little- all. Also in our DCF right here, and we- I think there will be other- I need it for this video.3:51 Thank you guys very much for listening to me and I hope I'll see you guys next time."
}