{
  "student_name": "None None",
  "org_defined_id": "037145385",
  "username": "gaddam10",
  "video_url": "",
  "transcript": "0:00\nSo for project three, I decided to make\n0:02\na financial scenario generator.\n0:05\nSo the first step that we have here is a\n0:09\nchat message and then that is connected\n0:11\nto the AI agent. And so the model that\n0:14\nwe're using is Google Gemini. And then I\n0:17\ngave it a memory of 30 days. I chose a\n0:21\n30-day window length because since we'll\n0:25\nbe making um financial scenarios over\n0:28\nlong periods of time, I thought scenario\n0:31\nI thought that 30 days would be a good\n0:34\namount of time to so the model remembers\n0:38\nwhat we've talked about previously.\n0:41\nAnd then I used a code tool as the tool.\n0:44\nSo, we can just input a financial\n0:47\nscenario.\n0:50\nAnd so, this one talks about an initial\n0:52\ninvestment of 75,000.\n0:54\nAnd then it'll just give us what it\n0:57\nthinks is best for the scenario. So,\n0:59\nhere's its response. It'll give us a\n1:03\nwhole breakdown\n1:05\nof um what we should do, and it'll give\n1:08\nus the pros, the cons. It'll give us um\n1:12\na wide range of everything that could\n1:16\nhappen given our scenario.\n1:27\nAnd so it was also given a system\n1:29\nmessage just to make sure that it would\n1:32\nact as a financial analyst\n1:36\nand um it would make sure to clearly\n1:39\nstate the user's confirmed goal and\n1:40\nrestraints and provide two at least two\n1:43\ndistinct variable scenarios just in case\n1:46\nsomething would go wrong. And also it\n1:48\nhas a guard rail. So if the request is\n1:52\ndangerously unrealistic,\n1:54\nthen it'll trigger a warning and make\n1:57\nsure that it states that this is not a\n2:00\nplausible scenario that could happen. So\n2:03\nwe can also test that by asking it\n2:04\nsomething unrealistic like turning $1\n2:07\nto1 billion in a month. It'll say that\n2:10\nit cannot fulfill this request and then\n2:14\num it'll trigger the guard rail and then\n2:18\num recommend that it cannot advise\n2:22\npursuing an unrealistic goal. So it has\n2:25\na guardrail in place. So for loop 2, I\n2:28\nmade it so that the code tool can um\n2:31\nprovide code for two different scenarios\n2:33\nand provide a way to compare these two\n2:36\nscenarios and provide the best option\n2:38\ngiven that.\n2:40\nSo we can input our prompt. This one is\n2:42\nfor retirement and then modeling and\n2:46\ncomparing two investment strategies.\n2:48\nAnd then we'll ask it to give Python\n2:50\ncode as well.\n2:53\nSo we can see that the code tool has\n2:55\nran. And then here is the response that\n2:58\nit gave us. So here's the response that\n3:00\nit gave us. And so we can see we can\n3:02\njust copy this and run it in Google\n3:04\nCollab to get an accurate calculation\n3:09\nbecause sometimes the values that an AI\n3:11\ngenerates are not accurate. So by having\n3:14\na code we can receive our accurate\n3:17\nvalues. So this is my project three.\n3:20\nThank you."
}