{
  "student_name": "Kyle Sandwell",
  "org_defined_id": "035947102",
  "username": "ksandwel",
  "email": "",
  "transcript": "Hi, my name is Kyle Sandwell and today I'm going to be going over the major 310 session 9 assignment. So, started off we have um it's about a cost of capital analysis about uh the weighted average cost of capital for Netflix in connection with hypothetical $5 billion content investment decision. So come over here. Get rid of that. Uh sorry about that. Okay. So, as I say in session n assignment, um the objective the objective is calculate and analyze Netflix's weighted average cost of capital or the WACC for hypothetical $5 billion content investment. This involves calculating the current WACCC. Determining the new WACCC after a $3 billion debt issuance. Evaluating the project specific WACCCC versus the firmwide rate. Comparing Netflix WACCC to industry peers and recommending an optimal capital structure strategy. So some key formulas WACC equals uh EVV * uh cost of equity plus DV * cost of debt time 1 minus T. Then cost of equity is right here. Cost of debt is the bond yield pre-tax and after tax cost. And then for EV and DV is the capital structure weights. We use the market values of these things. And some parameters um market capitalization is $200 billion. Total debt the book value is 14 billion. Debt uh market value is $13 billion. Equity beta is 1.3. bond rating and is BBB plus and it yields 5.8%. Corporate tax rate is 20% and the current stock price is $450. The risk-free rate is 3 4.5%. The market risk premium is 5.5%. The beta is 1.3. The tax rate is 21%. The pre-tax is 5.8. The market value is 13 billion. Kind of just the same thing. Then some market conditions. The free risk-free rate of a 10-year treasury is 4.5%. The market risk premium is 5.5 and the media industry WACC range is 8 to 10%. Then some strategic context, Disney's capital structure 7%, equity 30% debt and their WACC is 8.2%. Then Amazon Prime uses uh the Amazon corporate WACC is 9.5%. Um, Netflix is considering three billion additional debt issuance for constant investment. R, moving on to R. Um, this is just solving this back here. The cost of equity is 4.5% plus 1.3 the beta* 5.5% equals 4.5% plus 75 and that equals the cost of equity to be 11.65%. Moving on the after tax cost of debt model um this is cost of debt the RD it's 5.8% time 1 minus21 comes out to be 5.8% 9% times 79 which equals 4.582% for the cost of debt and then some current capital structures. You can see the equity debt and total firm value. Equity is 200 billion. The weight calculation is 2003. The weight is 93.9. The debt um is 13 billion. Then 13 and 213. Then 6.10 6.1% is the weight. The total firm value is 21 213 billion. And the total weight is 100% as you would expect. And then the WACC model setup. We're now ready to move on to implementation and find the WACC with this uh this information. And the WATC is the weight times the cost of equity plus the weight times the weight times the rate of debt. Move on. You can see the calculations here. This is the uh current uh WACC. You see the equity is 200 billion. The weight is 93.9%. The cost is 11.65%. The weighted cost is 10.94%. The debt is 13 billion. Then of market value then the weight is 6.1% the cost is 4.582 and the weighted cost is 28 in the sort of form and this comes out to a current WACC of 11.22%. We move on to the new WACC and you can see there is a change in the weight right here. It goes from uh 93.9 to 92.59 and from 6.1 to 41%. And this creates a new WACCC of 11.13% right here. And um just to sum that up, since the WACC went from 11.22 to 11.13, it is safe to say that Netflix's weighted average cost of capital fell due to the three billion debt issuance. Then to verify this, the 11.22% WACC is significantly higher than the industry average of 8% to 10%. This is this is caused by a high systematic risk and conservative leverage. In conclusion, this 11.22% is not appropriate for investment. Netflix must employ a system of project specific hurdle rates to ensure an accurate valuation and to maximize shareholder equity. Move on over here. Um to evolve this uh adding three billion in debt shows Netflix is underleveraged. Um the current capital structure acts as a competitive disadvantage. A higher WACCC means a higher hurdle rate forcing Netflix to demand a greater return from its investments than its competitors. This makes it harder for Netflix to justify investments that Disney or Amazon using a 9.5% hurdle might easily green light, potentially limiting market opportunities and growth. The analysis successfully determined that Netflix's current WACCC is 11.22% which drops to 11.13% upon adding the proposed 3 billion in debt. This confirms that the current capital structure is highly conservative or low leverage resulting in a WACC significantly higher than peers like Disney who have 8.2% WACC. The process strictly adheres to using market values in the CAPM for component calculation. And then to enhance the robustness of future capital budgeting decisions, Netflix should focus on these analytic improvements. Um model the optimal capital capital structure. Conduct a sensitiv sensitivity analysis to determine the precise point where the WACC is minimized. This involves modeling how the cost of debt increases and the cost of equity increases as grows. They could implement a project specific beta or asset betas. Future analysis of content investments must utilize asset betas from comparable publicly traded pure play content companies if available to accurately derive the project's systematic risk rather than relying on the nosy noisy firmwide equity beta. And then the cost of flotation. The current calculation ignores the transaction cost or flot flotation costs associated with issuing the $3 billion in new debt in any future equity. These costs should be incorporated into the analysis as they slightly increase the overall cost of capital. So that's all that. Then I'm going to come over here, show you my Gemini. I just really asked it uh to go through here and help me figure it all out. You can see the numbers here, some of the more numbers. Here's some of the equations that it gave me and proved earlier. Then got to the bottom. I asked to put this into Python so I can put it into collab. And this is the code. You scroll down here and it shows the core financial compies. It shows the cost of equity, the after cost after tax cost of debt. These are both accurate to what I had. Then it shows the current capital structure right here comes up to 11.22%. And then it also finds after the 3 billion debt issuance 11.13%. And then conclusion the change is a negative uh 0009 change. And to evaluate this the uh walk decrease confirming F is under leveraging and reduce its cost of capital by issuing more depth. The walk the ACC of 11.22% is higher than the media industry of 8 to 10% and Disney at 8.2. It's driven by high-risisk beta and low leverage. And then recommended implement project specific curdle rates and target a higher debt weight to maximize firm value which I said already but this Python just verifies it and proves and make sure that my information was correct. Thank you.",
  "video_url": "https://www.youtube.com/watch?v=qMOZTC9dI7A&feature=youtu.be"
}