{
  "student_name": "Aryan Mangal",
  "org_defined_id": "037551940",
  "username": "mangal2",
  "email": "",
  "transcript": "Hi, my name is Arian and this is my session 10 assignment. So, going over the assignment first, uh, we want to see that Starbucks proposed a rostery for a $12 million upfront and they expect a 10-year operation time. They have an 8.5% weighted average cost of capital as a hurdle rate to determine if the project will be valuable and they want a recent or reject decision documented by driver. So our project parameters are we have 12 million in initial investment depreciated over a straight line method over 10 years. So the same depreciation applied across 10 years and then whatever net book value we have left. They have about $500,000 as working capital deployed to launch and recovered in year 10. About $8 million expected revenue or revenue we don't know year one 11 million in years 2 to 5 and 9 million years 6 to 10. So up and then tapers down. Operating costs are the cost of goods are about 40% of the revenue. Labor is about 2.5 million. Rent and utilities 8 million. marketing.3 million in year 1 and then 0.1 million after and then a 25% standard corporate tax rate and then a terminal value of 3 million at the end of year 10. So we want to produce a cash flow model core capital budgeting metrics sensitivity test and then have like a recommendation behind our accept reject decision using driver. So to do this I prepared a document with my driver walkthrough and we can start from the beginning. So same that we've already discussed which that they need 12 million upfront for the roaster. They need.5 working capital at launch. It's a 10-year operation rate and it's a Brad Hail location. They want to know if it creates sharehold shareholder value at that working average capital. How sensitive are the results and does it actually make sense for Starbucks to actually invest in this? So obviously 12 million capex straight line depreciation is about 1.2 million a year because we're given a netbook value of zero at the end of 10 years. So we can make that assumption. We're going to recover our working capital by year 10. Uh revenues we've already went over and the operating cost we went over, same maternal value, discount rate, and taxes. So, what we're going to build today is a year 0 to 10 incremental cash flow schedule. We're going to get an NPV, the internal revenue rate, or sorry, IRRa, simple payback period, discounted payback period, and the profitability index. And these are all to help us support that accept project decision. Um we're going to run sensitivity analysis for revenue about 20% and the weighted average cost of capital about 2%. And then based on all of these calculations, we'll provide a recommendation that either accepts or rejects the financial results, strategic fit, brand impact, and key project risks. Um, and all these considered. So now we want to start and represent how we're going to go about this. So we'll start off with the cash flow structure. And we know it's incremental. So we're negative 12 million from capex. We're.5 from working capital. So our total cash flows for year zero are 12.5 million in investing in the initial startup cost. You can say now for years 1 to 10 we have the revenue as given to us uh in the scenario operating cost of 40% of this revenue labor is 2.5 rent utilities 8 marketing is.3 and 1.1.1 after then depreciation is 1.2 2 million per year. And then our our EBIT uh our earnings before interest in taxes is about is our revenues minus costs minus labor minus rent minus marketing minus depreciation. And then our taxes will be 25% times that max EBIT. And then our operating cash flow is shown as calculated below with the EBIT minus taxes plus depreciation. So and then obviously for year 10 we're going to add on the capital recovery of.5 and then the terminal value of $3 million. So we want to do some capital budgeting uh metrics now. So net present value is calculated by the formula shown and we also know the discount rate is 8.5%. The internal rate of return is the discount rate that gives NPV or the net present value of zero. The single payback period is the earliest year where our cumulative undiscounted cash flow is greater than or equal to zero. And then discount is just when we apply the exact same thing but using discounted cash flow values. Our profit our profitability index is our profit um our present value of future cash flows. So we can just say that the profitability index is just the present value or future cash inflows. So um we can kind of set some parameters based on these capital budgeting metrics. So which is acceptable. So if the NPV the net present value is greater than zero, the IRRa is greater than our walk. So that rate is greater and then our profitability index is above one that may that is going to show us that this project will start to make sense from a financial standpoint. So we're going to run and we're going to implement this in Python. So I'll talk about the implementation plan that I went over first and then I'll go over my Google Google Collab code. So first we're going to parameterize the whack the revenues by year cost structure and all these values. We'll generate your 0 to 10 cash flows. We'll compute the NPV IRR discounted payback profitability index. We'll run our sensitivity scenarios that we discussed above and then we'll plot this on a bar chart and different charts to help us um see. So if we go over to our collab notebook over here. So we'll start off we imported our library so we can get the rates and then we just simply hardcoded the values. So this is what we're given and then as you can see the sensitivity scenarios that we discussed are 065 and.15 uh 2% above the whack. We're using a standard tax rate and then these are all just hardcoded values based on what we've given. These are our revenues for each year and then these are our cost structures that we've also been given. Um then we use a straight line depreciation which is discussed. So we just divide our initial investment by 10 and then this is going to be plotting it. Um then we're going to have some help functions. So first we're going to initialize the cogs. We're going to have labor, utilities and rent all constant. Marketing uh we have the values. We'll calculate the EBIT by taking all these values that we calculated over here and then applying it to the formula we discussed in the represent stage. Uh our taxes are going to be exact same thing we discussed operating cash flow same thing. And then we're going to plot the cash flows over here. So it's our initial investment minus working capital which is negative. And then year 10 we'll also add our uh cash flows our recovery for the working capital the terminal value back. And this is how we're going to solve our uh net uh our net premium value or our net present value sorry given our cash flows array and discount rate. So we're just going to calculate by dividing cash flows by 1 plus rate times t which is time. Then our IRRa is just going to be calculated again the same formula we used. We're going to just switch a sign in case the sign is off. And then these are just simple calculations we had Gemini come up with for irr. And moving on to our simple payback period in years. Um that just going to be calculating it with uh the following formulas. It's a bit long, but basically just calculating how much our payback period would be in years if we're not discounting it. And this is just going to discount it with discounted cash flows. Now profitability index we know is just the present value of future inflows divided by the initial outlay. So we know the present value uh present value inflows divided by initial outlay will give us this value. And now we're going to take all those values we calculated and kind of print it as our base case analysis. So this is this is what's going to happen if everything goes right according to what the scenario we're given was which is highly idealistic and probably not going to happen. So here we're going to show that if the revenues were 20% down, what would happen to these same scenarios that we plotted here? Now here we're just going to do it with the whack at plus two or minus 2%. And then here we're just going to visualize on a bar chart or a plot everything that we just talked about for cash flows. And then here's the MPV versus walk or sensitivity. So as you can see um this is the output. So for our base case we have an 8.5% walk. Our cash flow starts off like this. So we start off at 12.5 at year zero then positive 1.2 2 2.7 2.7 2.7 then 1.8 and then finally 5.3 in the last year. So our net present value in the millions is 3.023 and our IR is 13.25%. Our payback in years uh not discounted is 5.27 and discounted is 8.2 and our profit profitability index is 1.2. Now just looking back at the uh parameters that we set up in our doc um eyeballing it our IRRa is greater than our walk here of 8.5%. and our profit index is above one which means that it is looking financially um suitable. Now if we lose 20% at the same lock our MPV becomes a negative 3.157 million which is a huge impact and our IRRa actually dips below the walk. So there's a huge change here and we can also see that it's it's um if it doesn't go all the plan then it could hurt Starbucks. And finally this is what we would get if we adjusted the walk by plus or minus 2%. So if our walk went down then our NPV would go up which is expected and we can expect the IR and the other values to go up as well. So that would be a much better scenario and then 10.5% would be 1.6 so it would go down which is also now here's kind of like a basic plot of the cash flows. So as you can see we started off 12.5 year zero these are all startup costs as kind of like an outlier and then as you can see the revenues kind of go up come down and in the last year because of all the money we return kind of stabilizes over here and this is just the NPV plotted against the walk percentage. So as the walk percentage goes up our NPV or net present value goes down which is expected and we saw this when 8.5 it was about 3 point something here when we use 6.5 is about five and when we use a higher value the NPV went up so that's the financial calculations that we used for Starbucks now these are the validation questions that we came up with and we're going to talk about it in the evolve in the um kind of reflect and recommend scenario so our year zero cash flow does show this our depreciation does equal this we do include these values our taxes 25% deposit is correct. Our NPV does align with the cash flow pattern which you saw in the visualization chart and our IR is recently above 8.5 and below 8.5 in some depending on the periods and our payout periods are consistent with the timing of the cash flows. So it does look like a realistic scenario as well as the stress test scenarios we had. Now before we got the recommendation, here's some things we could do to evolve the model uh before we're 100% ready to make a decision. We want to add multi scenario analysis. So not just 20% of revenue but let's say plus 20% revenue or minus 10 or plus 10 and cost cases we want to model inflation because inflation is a massive massive um factor in uh this this type of business capacity risk though demand is lower than expected multi simulation and incorporate real options like expanding contract closing and one thing I didn't write but I kind of came up with was that there's a lot of other business conditions that Starbucks get hit with for example if there's tariffs or if there's weather storms in Africa where they source their coffee beans from then suddenly your cogs will go up and that's something you might want to calculate if cogs go up or some other factor that we didn't discuss go up. So now interpreting the results we came up with a few templates um thanks to Gemini and we're going to use that to kind of interpret our results. So using the 8.5% whack our NPV was approximately 3 million the IR was approximately 13.5 which is above our hurdle rate. We know that the payback period is 5 years and the slightly discounted payback is about eight years. The profit index is about 1.24 24 which is indicating that we're creating a lot of value per dollar invested and obviously in the sensitivity insights uh with a negative 20% revenue our NPV is small and our MPV is negative so it does highlight risk. So this kind of means that this is all hedged on the fact that Starbucks believes that they'll hit the revenue numbers that they projected. So if it falls 20% they're very deeply in the hole. We do confirm that the walk plus 2% would give us these values. And some things that we want to consider or we want Starbucks to consider is that even if it is a highly modest um positive NPV, these flagship groceries do have other non-monetary benefits that we can't model through Gemini or code. So like flagship groceries can enhance brand equity, pricing power, global image. The customer experience is a lot higher. Like you can see a lot of these Tik Tok videos at these groceries are a lot more viral. people enjoy their experience a lot more. It looks a lot more fancy. So like there's some stuff that you may not be able to put into numbers or monetize that that roaster would help bring to Starbucks. Like if someone saw a video of the Starbucks roaster and they either came there, they came to a Starbucks because they saw that, you can't put money on that because you never know that happened, but it would be there. And then there's obviously risk factors like foot traffic risk, construction, macroeconomic downturn, the tariffs thing I was talking about, or if the cost went down. So now we're going to plug into these uh numbers in this template. So based on our cash flow model at Starbucks's walk of 8.5%. The flagship grocery project has an NPV of approximately 3 million and an IRRa of 13% which is above our harder rate. Under a 20% revenue down scenario and walks just a 2% NPV does become negative in these cases but we have determined that they're pretty isolated cases that we don't expect to happen. Considering these qualitative results as well as the strategic benefits that we discussed above of these flagship um um roaries, I do recommend that we should accept the project, but we should also monitor the risk factors that were given as well as the cost of goods, the revenue potential and other things like the cost of capital. So overall, that's kind of my source presentation.",
  "video_url": "https://youtu.be/zTBKTjiywVg"
}