{
  "student_name": "Benjamin Engels",
  "org_defined_id": "037980105",
  "username": "bmengels",
  "email": "",
  "transcript": "Good evening, everyone. Welcome back. In this week's assignment, we are looking at, um, session 10, um, capital budgeting and investment decisions. In this assignment. Um, um. We are looking at Section 6, uh, the cost of capital analysis. So we are given a company, so Starbucks, in this case. And we are asked to evaluate, uh, using the driver method. And we have, um, here, as we start now, if we have our problem. Um, we, uh, have our parameters here of given information. Um, these are our assumptions for revenue. Um, now as we get into the driver method, we use, uh, first we have to calculate depreciation. Which will obviously help us, uh, go into the CF, um, the cash flow, which is CF formula. Um, so we have depreciation in there as well. So we get about 1,200,000 per year. Um, as we scroll down, we go through, uh, this is in Google JMI, by the way, terminal year cash flow. Um, this is where WACC comes into play. So we have our net present value as we go down. Remember, these are all our given values that we're using. Uh, so we come out to our final number, uh, of the WACC being plus or minus two percent. Um, here's our cash flow schedule. So this is the D, you know, the driver. Uh, so we have our, Uh, our cash flow schedule here. And then as we continue to go down, uh, core capital. So we have that. Uh, our sensitivity analysis. Um. Let's see. Let's get down to, um. Let's see. So, based on this, uh, accepting the project for Starbucks. And then as we get into a code for determining that, we have, again, our parameters here. Here's our, um, 1,200,000, which is our, what we calculated earlier in this problem. Uh, we have our revenues, right? We have our labor costs, you have rent, utilities, marketing costs. All those are calculated in, uh, Python, which is what I use there. So, in this sense, with this section in the assignment, we are looking at zero, year zero, to year ten, uh, NCF. And so we're able to use that calculation, uh, with our initial investment of 1,200,000. And, And, uh, and then our working capital. So then, we go and we calculate that with Python, and, um, you know, our revenue comes out and is reduced by 20% in our W. You see, see, it's 6.5 and 10.5%, uhm, plus or minus. You know, the price is plus or minus 2%, uhm, percent. And then, uh, this is, uhm, the end of this driver. Or method. But in this case, it allows us, as we go back here, uh, for our deliverables. Umm, let's show, you know, narrates the drivers so we walk through each step of the D, the R, the I, the V, the E, and the R again. Uhh. 8 9 8 8 showed the Python code going through it. Umm, and then, uh, connects insights to capital budgeting concepts. Umm, so Starbucks. Umm, if we go back up here to, umm. Let's see, where was it? So, right, so, umm. Let's see. So, Starbucks should accept the project. Should accept that change. And this should make it, umm, available. Have a, a clear plan, a contingency plan, umm, again. Not just one through five, but zero through ten years, zero through ten. umm, you're gonna have a positive MPV umm. Uh, 1,885,081, and then an IRR of 10.98, or, you know, or if you have a WCC of, uh, 8.5%, which matches up other numbers from the beginning. So, uh, I would recommend, Starbucks, uhm, to accept in this project, uh, but just realizing there are some risks involved if they do, and to make sure they have a clear, organized plan, uh, moving forward for that. So, okay, this is it for this assignment session. In ten, uhm, capital budgeting and investment decisions. Thank you so much.",
  "video_url": "https://www.loom.com/share/ab5d440e3db84069b84f2329b6428f76"
}