{
  "student_name": "Sandy Skinner",
  "org_defined_id": "037337729",
  "username": "skinne36",
  "email": "",
  "transcript": "Hi, I'm Sandy Skinner, and this was my Session 10 Capital Budgeting and Investment Decisions Assignment. So, to start off in the Define and Discover stage, we want to evaluate Starbucks' proposed flagship roastery that requires a $12 million upfront outlay and is expected to operate for 10 years, and then we're using an 8.5% working average cost of capital as the hurdle rate. So, the first thing that we need to do is define and store this data. So I went into Gemini, and I stored all this data. You can see we have the initial investment. That's what they pay up front, the first part of $12 million. Working capital, which is what they also pay up front, but then get back at the end. 10 years project life year. That's how much we're expecting to get those big cash flows. Revenues of year one of $8 million, and then $2 to $5, $11 million, and $6 to $10 of $9 million. And then our cost of goods sold percentage represents how much of revenue we spend on making those products. Labor costs of $2.5 million represent that we spend $2.5 million on labor every year. Rent utilities, $800 ,000. Marketing year, $300,000. And then $100 ,000, the rest of it. the 0.25 corporate tax rate which is what we pay in taxes and a terminal value of three million dollars which is um how much we expect to make after this whole thing is over so we stored all that and then i was going to plan on what's the best way to analyze um this investment decision and that was just look at the cash flows and see how profitable we are using the hurdle rate and all that's all that good stuff so we can see the cash flows for all this we have all this input revenue cost of goods sold labor costs rent utilities marketing expenses total operating expenses and then earnings before tax and then the tax of 25% and you can see we have 900,000 in operating cash flow for year 1, $2.4 million for years 2 through 5, and $1.5 million for years 6 through 10. Next up, we needed to see what the consolidated cash flows are, which are the same thing, except for year 10, you add that terminal value and the working capital recovery, and you find $3.5 million, which means that the actual year 10 cash flow is $5 million, and everything else stays the same. Negative $12 million, $12.5 million in year zero, and then all these numbers year 1 through year 10. Next up was calculating the present value and the NPV at the end. So we can see the first cash flow, we have negative 12.5 million, which has a PV of negative 12.5 million. And as each of these years go on, we use that 8.5 % working average cost of capital as our hurdle rate to get 0.9217, 0.8495, 0.7829, et cetera, et cetera, goes down. And on year 10, we have 0.4423. So using these cash flows, we can see that these are the numbers right here, this $829,000 through $2.211 million. That's how much we were making every year. And then we subtract that $12.5 million from that, and we calculate a net present value of $1 ,054,110.43, which means it is profitable and is a good investment as the MPB is in the positives, which means you are going to make money even using the hurdle rate. It is acceptable. Next up, I wanted to calculate some additional financial metrics, starting off with the discounted payback period, simple payback period, the IRR, and the profitability index. We have an internal rate of return of 10.19%, which means that's what we're getting back on each year, whereas that 8.5% is what we're giving up. which means if we want our IRR to be higher than 8.5%, and it is, which means we are in fact making money, we have a simple payback period of 6.33 years and a discounted payback period of 9.52 years. So you can see we're really only making money in that 10th year, and then the terminal value obviously adds a lot as well. Without that $3 million, it would not be profitable. That terminal value is the only thing that makes us profitable. And then we have a profitability index of 1.08, which means because it is higher than 1, we are making profit. If it was lower than 1, we'd be losing profit. So now we want to see if there is, in fact, a revenue reduction. What would this do to some of the other percentages? 20% revenue reduction. we had this code and it turns out that the consolidated cash flows with their reduced revenue are obviously a lot smaller at the peak we're only making 1.4 million and we get an npv with a 20 revenue reduction of negative 4 million 721 thousand 49 dollars and 14 cents and only a 0.33 percent internal rate of return which is obviously extremely small and way smaller than that 8.5%. So this would not be a good investment if this was the case. That 20% makes a huge difference. We're getting much less in cash flows. It does not add up to that 12.5 million that we originally spent. The difference in NPV is almost negative 6 million, which is a huge difference. That 20% really changes everything. The original internal rate of return for the original investment was 10 .19%. It goes down to 0 .33%, and there's a difference of 9.86%, which is huge. It is no longer financially viable, as we can see, and it is now below the weighted average cost of capital, suggesting it is no longer financially attractive under reduced revenue. Now, with this weighted average cost of capital variation, we wrote this code, and we found the base was 8.5%, 2% reduction puts it at 6.5%, and a 2% increase puts it at 10.5%. And when the WAC is reduced, we have an NPV of 2.4 million, as we can see that 10.19 % internal rate of return is much, much higher than the 6.5% and the 2% reduction when you're going to make more profit. However, in scenario two, we have an NPV of negative $177 ,000 as that internal rate of return of 10 .19% is lower than the WAC of 10.5%, meaning we are not going to be making as much money as we are losing with our discount factor. So it is financially viable in scenario one and more viable than the original and not viable. A decrease in weighted average cost well significantly increases NPV and an increase in weighted average cost of capital significantly decreases NPV. The IRR obviously remains constant across all scenarios because it's the discount rate that makes NPV of all cash flows equal to zero and is less independent of the weighted average cost of capital. Now lastly we want to do some sensitivity. Now for the sensitivity now is a summary of that. We already went through this. A 20% reduction in revenue. Project is no longer financially viable. And yeah, we did this. So the main implication for this investment decision is given the sensitivity, doing a thorough risk assessment and robust forecasting for revenue are very critical. And so Starbucks should consider strategies to mitigate revenue risks, such as strong marketing and clear competitive advantages, and monitor their weighted average cost of capital fluctuations closely. If these revenue forecasts are conservative and weighted average cost of capital is expected to remain stable or decrease, the project remains very attractive and should be done. However, if there is significant uncertainty in revenue generation or an anticipated increase in capital costs, further due diligence or risk mitigation strategies would be necessary before proceeding. Thank you. Thank you.",
  "video_url": "https://www.youtube.com/watch?v=hJc3OWZnUqk"
}