{
  "student_name": "John Gascho",
  "org_defined_id": "035820898",
  "username": "gascho",
  "video_url": "https://youtu.be/BP2aK2YRSmM",
  "transcript": "Hi, this is my Session 11 assignment where I analyze Apple's $90 billion buyback using the DRIVER framework. I built a full financial model in Python. I'll scroll through the notebook as I talk so you can follow each DRIVER stage.\n\nThis is the Define and Discover stage. This table shows every assumption used in the model. I include Apple's share price, cash, debt, free cash flow, shares outstanding, and stakeholder details like Berkshire's 6% ownership and the CEO's 3 million shares.\n\nYou can also see assumptions like ROIC for acquisitions, cost of debt, tax rate, and small signaling effects. DRIVER requires showing all assumptions upfront, so I made sure it's clean and easy to see here.\n\nThis is the Represent stage. The run_scenario() function is the core of the model. It takes in how much cash is used, how much debt changes, how many shares remain, how net income changes, and the signaling effect. Then it outputs EPS, accretion, predicted share price, ROE, leverage, option value, and stakeholder impact.\n\nRepresent is all about creating the structure. This function allows every scenario to be compared fairly.\n\nNow we're in the Implement stage. Let me walk through the buyback math. Here, Apple spends $90 billion at a share price of $185. That removes about 486 million shares, bringing the share count down to about 15 billion. Net income stays the same, so EPS rises. I also apply a +2% signaling boost, which slightly lifts predicted share price.\n\nThis also boosts insider incentives — employee option values and CEO wealth rise because the stock becomes more valuable.\n\nHere is the full scenario summary. I have EPS, accretion, predicted share price, ROE, leverage, stakeholder value changes, and bondholder impact. Quick highlights: R&D gives the highest EPS, buyback gives solid EPS accretion but mostly shifts value to insiders, dividend reduces share price mechanically, and debt paydown lowers leverage and risk.\n\nValidate stage: This table shows EPS over the next three years. R&D and acquisition show strongest EPS growth; buyback gives a one-time pop.\n\nValidate the buyback by testing different repurchase prices. If Apple overpays, accretion gets smaller; if they buy shares cheaply, accretion jumps. This confirms the model reacts realistically.\n\nThe visuals help validate the full model: EPS chart shows R&D gives highest EPS, share price chart shows signals affect price, option value chart shows insiders benefit most from buybacks, and risk vs reward shows debt paydown has lowest risk.\n\nEvolve stage: Looking at long-term meaning. Buybacks boost insiders most, retail investors barely gain, debt paydown reduces risk, R&D gives strongest long-term EPS growth, and dividends create no long-term value.\n\nReflect & Recommend stage: After modeling and validating everything, my recommendation is Apple should prioritize R&D or debt paydown instead of a $90 billion buyback. These options create real long-term value instead of mainly shifting value to insiders. If Apple still wants a buyback, it should follow valuation rules so shares aren't repurchased when overpriced.\n\nThis completes the full DRIVER workflow: Define, Represent, Implement, Validate, Evolve, and Reflect.\nThank you for watching."
}