{
  "student_name": "Jonathan Hinds",
  "org_defined_id": "037200739",
  "username": "hindsj",
  "email": "",
  "transcript": "Hello, I'm John and today for session eight, we're going to be going over our market efficiency and behavioral finance unit. Um, so first step in our driver framework is to define and discover what we're looking at here. So for our assignment going to be investigating market efficiency using the GameStop short squeeze event of 2020 and 2021 as a case study. Verify the accuracy of stated facts. Analyze price behaviors uh behavior relative to efficient market hypothesis predictions and evaluate whether market anomalies constitute evidence against market efficiency or can be explained within existing frameworks. And we're given some of this information too. So we have um our event timeline. That's it right there. We have our critical first step right here. Um verify the statement uh of GameStop traded at uh 4 cents in August 2020 against actual uh historical data. And we have some key key data points. So um there's those five key data points right there. And we're going to be looking over these required analysis steps for the most part. And so we're going to be verifying that all stated high historical prices uh and price data and document corrections. So we're going to be just verifying all those. Test which form of market efficiency was violated. So weak, semi-strong, and strong. Evaluate whether rational investors could have profited systematically. Compare efficient market hypothesis predictions to observed behavior and assess behavioral finance and explanations for observed uh anomalies. Okay. Implementing and uh representing with AI. Uh have written some code. So uh it just runs uh lots of tasks for me. Um, and we're going to be looking at some outputs. So, I have tasks on this two through six we're looking at. So, we have uh price data, um, we have chart, we have volume data, we have uh the form tests, and we have our um, uh, C uh, chart here. And so using all of that I had developed this code as well uh with AI to be able to just generate the quick report on the analysis of those five. So uh quick overap of room you're looking at uh to quickly answer everything is that the claim of 4 cents is false. The actual minimum low price in August 2020 was $1 on uh August 3rd. Now uh we have our market efficiency tests uh wheat form violated uh the Elgen box test p value extremely low and since it's smaller than 05 uh past returns can predict the future returns uh proves correlation with statistical significance and semi- strong efficiency violated as the c um by um February uh 5th of 2021 was plus 291 or plus 291% and that challenges efficient market hypothesis predictions as prices detached from public fundamentals rational investor uh profitability the the strong and positive C of plus 291% % shows that systematically abnormal profits were possible. Um, and the event was not just rational risk pricing. Um, now um efficient market hypothesis predictions and behavioral explanations. we have um that the price hit $483 uh versus the analyst values of $10 to $40. Um this and the massive volume points to behavioral factors such as hurting social media um over EM and mean volume uh was almost 10 times higher um in January 2021 compared to quarter 3 of 2022. um which is the evidence of an anomaly. So, now that we went over those um quick answers for all of them, we're going to go take a deep dive into um why uh they are. So our first step is uh our right here in task two is that um we had ran the um uh Python code um importing the um the Y finance libraries um to help us grab historical data um using these functions here. And so it grabbed historical data and it came back with the actual minimum value was $1 on um August 3rd of 2020. So we can successfully say that the claim is false. Now going on, we have our tasks three and four, which is uh our um uh volume and um volume for four and price and volume for um in this little chart here. So um I it's the the chart speaks for itself. It it's near bankrupt the whole way through and then all the sudden the uh the clos price just explodes during this uh January 2021 squeeze. it it it takes off. It it shoots up the the price. It shoots up the volume um over said dates. Uh this chart is looking at uh between January of 2022 and January of 2020. Um and you can just see that before uh 2021 it's it's flatlined. It's it's almost bankrupt. And then all the sudden it it the stock price explodes and takes off. And we can see that um with the mean and median volume um taking an almost 10 times increase um between quarter 3 of 2022 and January of 2021. Um, now we're going to be going on to our Elgen box test. And so we just use this test to check for autocorrelation. Um, and that is really just um do the past prod uh prices predict future prices? So um this is just a standard hypothesis test and um so we would have uh this test we're running against our um null hypothesis which is um that past prices do not predict future prices. And because we have a value of uh such such a large or or small we have such a small p value that we can safely reject um our null hypothesis because it's below um 05 for our p value. And um because we reject our null hypothesis um we can statistically prove that um it can predict future prices uh the past prices can predict the future uh prices uh proving um significant autocorrelation here and because of that weak form efficiency is violated. Um lastly we have our C uh chart here. And so it this tells us a lot about um everything we're looking at here. Um so we have it's just our total abnormal returns and um the abnormal um returns can prove um anomalies. And so we're going to we pretty much proved that uh the claim is false and we're just going to be going over our analysis again just to cross reference that with above. um market efficiency tests the weak form p value violated um it's no longer uh it's it's suggesting significant autocorrelation so it's proven there now semi-strong efficiency is also violated um because of the C was up 291% which challenges EMA H as prices detach from public fundamentals. Um yes. So we can go grab that chart real quick. And you can see it it it spikes here. Um, and this this spike is a huge um anomaly. And that's what this is referring to here where it's violated as it went up 291%. Um meaning that um in efficient market hypothesis predictions the prices were not the same as um what they would have been for um the public fundamentals because um here it's been predicted that they would be at 10 to $40 and that is just not the case. Now rational investor profitability uh we went over that um the strongly positive C um of plus 291 shows that systematically abnormal profits were possible um and that the event was not just a rational uh risk pricing. Um and so going into that um our evaluate whether rational investors could have profited systematically and short answer would be yes potentially because um since we form was violated we can just assume that um a momentum based uh strategy could have been used. Um, so that's uh if the price went up uh yesterday uh then I could buy today and vice versa. And using that strategy um you could have profited heavily. Um and you can see that on our price and volume chart. Price goes up a little bit. Same with volume. you start buying and you know once you once you start buying when it goes up that little bit there uh your profit just surged through the roof. Um so using the um um rational investors um if they were systematically they could have profited from that. And last to compare efficient market hypothesis predictions to observed behavior. And so um I mean efficient market hypothesis predictions just have have failed on this because they predict zero abnormal returns and this code here calculates far from zero. this huge spike alone disproves um a efficient market hypothesis in this case scenario um just because of this massive spike right there in the abnormal returns and because of that abnormal return um we can um pretty much conclude that um uh there is a huge evidence of anomaly There's the volume the volume went up 10 times um where is that right here from from mean and median volume of quarter 3 2020 and January of 2021 it went up almost 10 times um which supports uh our um analysis report that it it is an anomaly. And um looking at the um behavioral explanations for the observed um anomaly is that um because it it hit huge prices compared to what uh analyst values. Um also including um the massive volumes it points to hurting and social media over efficient market hypothesis predictions. Um and so basically all that is is just instead of um staying to efficient market hypothesis predictions in the case of GameStop um social media um um and like momentum just took over um for the company and everybody heard it together to buy which created uh a huge surge in volume and price. Um, which is the behavioral explanation of um the surge in not only our cumulative abnormal returns, our median and mean volumes, but also our price as well. Um, thank you.",
  "video_url": "https://www.youtube.com/watch?v=et53-X-8lxg"
}