{
  "student_name": "Ethan Mendonca",
  "org_defined_id": "037327547",
  "username": "emendon",
  "email": "",
  "transcript": "Hello, my name is Ethan Mendonsa and this is my uh this is my corporate uh WACCC and NPV model assignment. So the first thing I do is I is I tell the for the d for the discover part of my of my assignment I act as a corporate treasurer calculating cost of capital for investment decisions comp giving in the company data the beta values uh the tax and so on. However before calculating I do want to understand why do we use the market values rather than the book values for WACC calculations. And so the AI goes on and tells me in short that the main the forward-looking measure that WACCC is is meant to evaluate future investments and book value is a back backwardlooking historical figure accounting figure right and it goes to the treasures perspective which reflects current re uh current reality investors perspective as well as the opportunity cost uh which WAC C represents the opportunity cost of investing in a new project. And so it lays out the the main formula that we'll be using to calculate the WACC, which is the um weight of equity times the cost of equity plus the weight of debt times the cost of debt pre-tax times 1 minus the corporate tax rate. And so it also lays out the problem statement and a step-by-step sort of way of calculating all of these values. And so the market value of equity is 150 million. The market value of debt is 76 76,800,000. The total market value of the firm is 226,800,000. The capital structure weights um the weighted equity 66.14 and the debt is the opposite of that and as well as the cost of equity which is 11.3%. And thus we get our weighted average cost of capital at 8.82%. And this is the end of the discover stage. Now I want to essentially map represent the um represent the discover stage represent what this WACC value represents. And so I also ask it to uh review this methodology and the framework to make sure that my implement stage does not is actually accurately um represents and uh represents the correct what I really want the main thing that I want to do which is to uh essentially calculate the current WACC determine the these analysis essentially And so it tells me what is correct. The WCC values are correct. The capital rates are correct. The cost of equity and cost of debt. However, there are issues that needs to be addressed for this sort of uh rigorous WCC calculation. And one of the biggest components that is missing is capitalized lease liabilities. And since my so my framework uses V equals E plus D. However, this is incomplete since the recent accounting change. Operating leases are now capitalized on the balance sheet and hence the fix will be to add liabilities to our to our equation which represents the least liabilities and hence our formula changes to this idea. Additionally, another flawed assumption that I seem to have is the value of debt as well as the cost of debt yield. And we must use market values instead of just using the um average instead of using the uh book values. Essentially, we must use the market value instead of the book values. And so, it summarizes the main things that are changing, which is an added added variables towards our total capital, capital weights as well as the cost components and hence after that we implement the corporate WCC analysis tool and essentially the script is to be run on Google app. So essentially first is you need to input the data and so first I import all of the the financial the financial functions as well as um define all of my variables here and so first I need to calculate the total capital including this L value. Step B is to calculate the capital weights and step C is to calculate the component costs all in variables and we can add in the values later. And so we need to calculate all the component costs of the WCC which is cost of debt, cost of leases as well as calculate the final WCC value which is the new version of our of our value of our uh formula and thus returning all of the values in a dictionary. Next is to analyze the actual project because that is the main goal of this is to evaluate the project specific WACC as well as compared to to Disney. And so if we go back we see that this helps us to calculate the the present value of future cash flows and the total NPV is the present value of the future cash flows plus the initial negative investment. And so here we input the data capital structure, the commodent costs, inputs, the market rates, the project investment data for each of the years. And next is the WCC calculation where we just essentially input all of these values into the formula and then present all of the results. Additionally, we're going to analyze the project to make sure that we get the final essentially the ending of our case study. And so this is the corporate WCC analysis that gets printed. So first we have the capital structure where we calculate the equity debt and leases market values instead of the book values and then the component costs and rates and this helps us to get a firmwide hover rate WCC of 10.98%. And next is the investment decision analysis. So the project initial investment is 100 million and the future cash flows per year are 30 40 50 and 50 million and with a discount rate of 10.98% the project net present value is 43 million220,000 and hence the decision is to accept the project as the rationale is the project's NPV is positive meaning it is expected to generate returns in excess of the firm's 10.98% costs of capital thereby creating value for the shareholders. Next is the validation. So essentially I asked Gemini to validate the any flaws that I have as well as the all the code that I've written and it found an error that I've created which is the capital structure is not static and I can't just add 5 billion debt and assume that my equity holders will feel just as safe as they did before as introducing new debt to a company can critically change the the way shareholders think about that and the way uh people invest into new projects and hence a better idea could be a dynamic framework which is to first step one is to unlever the Netflix's current beta uh and step two is to relever the beta with the new capital structure. So essentially change the capital structure and change the beta and hence recalculate the true post debt WCC values which in this case is 10.94%. Which isn't a big change from the initial WCC value which is 10.98%. However, it does definitely change how uh change some of the the ways that we can look at the net present value and whether what we want to what projects that we want to invest in in the future. And next in terms of the evol evolution stage, um one of the main things that I could do is obviously to be more optimal in my capital structure. And so hence instead of just doing my regular analysis um while the mathematical model suggests that this move is slightly beneficial it's it's not really um the best recommendation and here's the bal here is a balance recommendation that they've given. So the benefit which is a tax shield as well as for the risks which is outside the WCC model which is the credit rating risk loss of financial flexibility as well as shareholder perception which we talked about earlier when there's debt included. Additionally here we can see the WCC versus Disney explaining the 272 278 basis point gap. So while Disney's 8.2% 2% and Netflix is 10.98%. This 278 basis point gap is not an error. It's the market price for different corporate strategies and risk profiles. Essentially, Netflix has uh less lesser risk than Disney. Uh however it does have high beta as well as and here are the differences between Disney and W and uh Netflix in terms of the WC values and why it matters so much. Finally in my reflex page the key t the main key takeaways of my analysis is that our cost is high for Netflix are 10.98% WCC significantly higher than Disney's 8.2%. This reflects our strategy. We're a high growth uh company and the market demand demands a high risk premium for our high risk high reward strategy. Our job is not not to match Disney's WCC. It is to be our own because Disney is a different uh sells a different type of product than we do and hence we must focus on our own values and beliefs and our business methodologies. Additionally, financial in engineering won't create any value. The analysis showed that adding three to five billion in new debt has a negligible impact on our WCC as well as only great projects create value. This leads to the most critical point. We cannot create value by simply creating random projects that we don't truly believe in and by simply shuffling our capital structure. And hence the final accept recommendation. So this brings us to the 5 billion content investment. How do we improve it? We must compare the expected lifetime cash flows from the 5 billion content slate and calculate the internal rate of return. And this is how we can uh use the WCC in order to figure out whether it is worth investing in to this debt or not, this content investment. Thank you.",
  "video_url": "https://www.youtube.com/watch?v=XBthjhYD5GU"
}