{
  "student_name": "Krish Aggarwal",
  "org_defined_id": "036289409",
  "username": "aggar117",
  "video_url": "https://youtu.be/Wmhivw9htfY",
  "transcript": "0:03) Today I'll be demonstrating my AI-powered earnings call analysis tool. This tool is designed for (0:08) investors, wealth managers, or anyone in general who is interested in keeping up with a company's (0:16) financials and their earnings, specifically for investors and wealth managers who need (0:21) to quickly understand what a company's earnings call means for the stock and its strategy. (0:26) So the problem we're solving is that investors often spend hours reading transcripts and piecing (0:31) together implications.\nThey want insights, not just words. So let me show you what I've done. (0:38) First and foremost, let's run it.\nI was just installing all the necessary libraries. Next, (0:50) then it jumps to the actual transcript part. So I've given it two options.\nEither I can upload (0:55) a text file or I can paste the transcript manually. So I'm using ROICAI. I have Amazon's (1:04) quarter three earnings call right here, which I've already copied.\nSo let me copy it one more time. (1:10) Go back to this. So I'm going to click option two, and then that's going to give me this box to (1:17) paste it.\nSo I'm going to paste it and enter twice. And then after that, I'm going to enter (1:26) the company name, its stock ticker. And then if I want to add in the previous quarter for analysis, (1:35) I can.\nSo in this case, I will. So for this one, I've downloaded it already. (1:46) I've downloaded the file already right here as a text file.\n(1:53) That goes right there. And after that, this is going to start the actual analysis (2:01) for the quarter three transcript as well as the quarter two one. Essentially, the comparison (2:09) between the two, it's going to highlight the differences in revenue margins, the management (2:13) and the overall strategy.\nSo this one, because it's a pretty big function, it does take a little (2:20) bit. And then throughout all of this, this is using Gemini's 2.5 flash model and an API key (2:34) from Gemini itself to produce an executive summary, bullish and bearish signals, sentiment (2:39) scores, and strategic implications. And it's not hard-coded.\nIt is using... (2:46) And it's fully ran already. So then next, it took the stock ticker, Yahoo Finance Libraries, (2:57) and created a six-month volatility forecast based on both what the stock is currently doing (3:03) and the earnings cost. And so we've ticked it out to be about 24.65%. And it's been downloaded (3:09) into this overall file, which I'll go to in a sec.\nAnd this is two visualizations that (3:15) shows the price history and the returns distribution power over the year of whatever (3:19) company you've chosen. So in this case, Amazon. And this just puts everything, (3:26) converts all this previous information into a PDF file.\n(3:31) Yeah, puts it into a PDF file that has all the forecasting, all the comparisons, (3:38) the insights throughout this analysis going to file. And this automatically downloads it (3:43) onto your local device. So here, I can click on it.\nAnd it's going to do everything. (3:52) It's going to give you the executive summary of the quarter three and give some of the key topics (3:57) that were covered and also what they really mean. The bullish signs that the company is moving (4:04) towards something big, something new.\nPossibly some bearish signs that might not look too good, (4:11) that there might be some underlying issues. There's some sentiment analysis for what the (4:17) tone really looks like and some credibility looks at. For example, we had the CEO and CFO (4:22) of Amazon talk.\nAnd these are any calls that shows that there is some credibility and what's (4:27) being spoken. Also predicts what could be some implications for the stock in the upcoming six (4:33) months and possible strategic implications for the company going forward. And then this is just (4:39) overall sentiment scoring for performances, what the strategy look like, operations, profitability, (4:46) efficiency, expenditures, and other ventures as shows based on the call.\nWhat's that looking like (4:53) for each separate section? And then here is the analysis between quarter two and quarter three (5:00) again. It just compares those similar metrics between. So investors and wealth managers can see (5:06) what's the difference between quarter two and quarter three.\nAnd that can help guide investment (5:10) decisions. Same for bullish and bearish signals. That's the same thing.\nAny change between tones (5:17) and focuses and implications for the stock in between. Same with strategy. And then these are (5:25) the two visualizations.\nSo this graphs out the one-year price history. So (5:31) investors and wealth managers can see what's the stock price been looking like. (5:36) And overall, just daily return distribution.\nSo in this case for Amazon for this year, (5:39) it's been very bell curve, not too much daily returns, very centered around zero to 0.3, 0.2. (5:50) Yeah. So overall this approach to break it down and through the driver stand out. So (5:58) this virtual iterative, I tested Gemini API integration, fixed edge cases for stock data (6:03) and shared robust PDF output.\nI used Google call up for development, handling file uploads, (6:08) AI calls and visualization generation. During development, I learned to handle missing stock (6:13) columns, integrate dynamic AI prompts for comparison and embed charts into PDFs, (6:18) as well as utilizing APIs for live data pulling and the interactive AI analysis. (6:25) I validated the tool with simple earnings calls and shared the insights match what analysts were (6:30) saying.\nI also tested both upload and paste workflows for real usability. And this could (6:35) scale to handle multiple companies, portfolio reports, and more live earning feeds in the (6:40) future. This is a little bit more simple version, which is copy and pasting or uploading transcript (6:47) files or pure just plain text.\nAnd it's only one company, but this could easily be scaled up to (6:54) handle multiple companies, compare different companies within the same sector or different (6:58) sectors and create more dynamic portfolio reports and possibly even use live earning feeds (7:05) in the future. So ultimately, I've learned how to integrate AI responsibly, handle acceptance (7:10) data, combine interactive visualizations with AI insights to produce a product that investors (7:15) could actually use and that they would actually use. But in summary, this tool demonstrates a (7:21) live functional AI powered financial solution.\nIt works. Someone would use it like wealth managers, (7:26) equity analysis, equity analysts or portfolio managers. It's fully interactive and ready (7:30) for deployment.Thank you."
}