{
  "student_name": "Arturo DeJesus",
  "org_defined_id": "034076668",
  "username": "dejesus3",
  "video_url": "https://youtu.be/CFMC9D_mwBM",
  "transcript": "Ticker: AAPLDate: December 13, 2025 (or \"most recent trading day\")\nWhy this works:\n* Apple always has:\n\n   * Market-wide movement\n\n   * Tech sector sentiment\n\n   * Interest rate expectations\n\n   * Analyst commentary\n      * Even if there's no single headline, the AI can correctly say \"possible drivers\" (which your prompt allows).\n\n\n\n  \n\n________________\n\n\nINTRO \"For this final project, I built an AI-powered financial tool called the AI Stock Move Explainer.The problem it solves is that most people don't understand why stocks move. Financial news is often confusing, full of jargon, and hard for beginners to follow.\"\n________________\n\n\nPROBLEM & USER \"This tool is designed for beginner investors, finance students, and anyone who follows the stock market but wants simple explanations.Instead of reading multiple articles or guessing, this tool explains market moves in plain English.\"\n________________\n\n\nHOW IT WORKS\"The tool works very simply.\nYou enter a stock ticker, like Apple or Tesla, and a date, such as today or a recent trading day.When you click explain, the AI analyzes possible reasons for the stock's movement and breaks them down clearly.\"\n________________\n\n\nLIVE DEMO\"I'm going to demonstrate the tool now.I'll enter the ticker AAPL and today's date, then click explain.\"\"As you can see, the AI generates a structured explanation.\nIt starts with a quick summary, then lists the most likely drivers, what to check next, and a short risk note.This is not a hardcoded response — it's generated dynamically by an AI language model.\"\n________________\n\n\nAI + FINANCE CONNECTION\"This project combines finance knowledge with AI by translating market behavior into clear explanations.Instead of replacing analysis, the AI helps communicate financial information in a way real people can understand.\"\n________________\n\n\nTESTING & VALIDATION \"I tested this tool with real stock tickers and real dates to make sure the explanations were clear and accurate.The tool consistently provides understandable summaries without overcomplicating the information.\"\n________________\n\n\nWHAT WAS HARD \"The hardest part was designing the prompt so the AI didn't hallucinate information and stayed clear and structured.I had to refine the instructions to make sure it stayed beginner-friendly.\"\n________________\n\n\nWHAT'S NEXT / SCALING \"In the future, this tool could be expanded by pulling live market data, adding charts, or comparing multiple stocks at once.\"\n________________\n\n\nWHAT I LEARNED\"Through this project, I learned how to turn financial knowledge into a real, usable product using AI.\nThis assignment showed me that simple, working tools are more valuable than complex ideas that never ship.This is something I could realistically use beyond this class.\""
}