{
  "student_name": "Luisa Kramer",
  "org_defined_id": "035882855",
  "username": "krame144",
  "email": "",
  "transcript": "Okay, so we are into session 10 already, and this time we are doing a comprehensive assignment that tests several critical skills for a fixed income analyst, which is who I am in this scenario. So my video will be broken down into five main sections directly corresponding to the assignment's requirements. So the first part is the initial setup and the data loading. So to give more context, I am a junior analyst at Pension Partners LLC. I'll be demonstrating the construction and analyst of a 10 million fixed income portfolio for Mega Corps' pension fund. The core objectives are generating a steady income, achieving a target duration match to the fund's liabilities, and maintaining credit quality. So the first part of this code, I'm going to just import the necessary libraries, like NumPy, which is for numerical operations, and Pandas for data handling. And anytime I may have any questions about the code, I can just hover on it, and it gives me a lot of information as to what the code is and what it does. And so after importing the libraries, I define the portfolio size and load the hypothetical bond universe data, which contains key metrics like the coupon, maturity, the price, and the credit rating. So as you can see, after all of this code has been inputted, I will run the code, and this is what pops up is this little table here with all of the information and the metrics like I had just mentioned before. We have all of our different bonds here, the maturity in years, that coupon, the rating, and the duration of it. So next part is the portfolio construction and optimization. My primary goal is to maximize portfolio yield subject to two hard constraints. The portfolio must meet the 10 million dollar size, and its modified duration must closely match the six and a half year target. I also must enforce a minimum credit quality of A minus or A hyphen. I'll use the numerical optimization for this. So in this code here, I filter the universe for bonds, meaning that minimum A minus credit rating. Then I define the objective function, minimizing the negative portfolio yield, which is equivalent to maximizing the positive yield. So we're kind of doing the opposite there. Our constraints ensure the sum of weights is one for that 10 million dollars of total allocation money, and that the weight duration is exactly six and a half years, or just six and a half. The optimizer determines the optimal weights. So we have, excuse me, all of the code here, again using those metrics that we have and that we need, and then we are given this bigger table with, again, the metrics that we had before, but also we have the allocation, we have the weight, which is what we're looking for here. We are just narrowing it down to two bonds instead of all the ones that we had before, and so the key portfolio metrics that we find here is that the target duration is six and a half years, and luckily our portfolio duration is also lines up pretty well with our six and a half years, and then our portfolio is 4.81 percent. That yield to maturity is 4.8 percent. So that is part one, and that's part two. Now part three, we are on to yield safety and duration trade-offs. The final portfolio has an impressive annual yield of 4.81 percent, which is very good in our case, with the duration of 6.5 or six and a half years successfully hitting the target. This result highlights the necessary trade-offs. So some discussion points to mention here, some really important points here is that yield versus safety. So to increase yield, I must either take on more credit risk, which would be moving from AAA bonds to A negative bonds, or liquidity or term risk, which are longer maturities. My portfolio uses a mix, leveraging the higher yields of longer-dated bonds while maintaining an investment grade four. I also want to mention the duration matching. The target duration of six and a half years is crucial for liability-driven investing, or LDI. If interest rates rise, the value of the assets will drop. However, the present value of the liabilities will drop by a similar amount, meaning the funded status is protected. So a trade-off example is that I could have achieved a higher yield by including more longer maturity bonds, but this would have pushed our overall portfolio duration higher, exposing me to a greater interest rate risk relative to my liabilities. Now on to part four, we're going to do some stress testing. So no portfolio is complete without the stress testing. I will simulate two critical scenarios, an interest rate shock, which is parallel yield curve shift, and a credit spread widening event. What's going on in this code for stress testing is using the modified duration to estimate the change in portfolio value under a 100 basis point, or that one percent parallel increase in yields. This is the first order approximation of interest rate risk. For credit risk, I assume a widening of credit spreads, or like for example, a downgrade of all A-rated bonds, and calculate a new portfolio value. So that's what's going on in this long, long list of code, and what we are given is that the estimated percent change in the portfolio value is negative 6.5 percent. Our initial portfolio value is at 10 million dollars, which we already know. The value after the 100 bps shock is nine million three hundred and fifty thousand dollars, and so what this means is that this loss is offset by a similar reduction in the present value of liabilities due to duration matching. What we are given from that credit spread widening, which is the 50 bps on a and or triple a and a plus rated bond, all that stuff, is that now our total value change from credit shock is negative 105 thousand 142 dollars and 86 cents, and the value after that credit shock is nine million eight hundred and ninety four thousand eight hundred and fifty seven dollars and 14 cents. Now, on to part five, which is our conclusion and the next steps. In summary, I successfully construct a 10 million dollar in fixed income portfolio with our bonds achieving a six and a half year duration, precisely matching our six and a half year target, and generating an annual yield of 4.81 percent. The portfolio maintains the required investment grade credit quality. Some main takeaways or my reflection is that the duration matching projects, the duration matching protects the funds funded status against market interest rate movements. However, they, the primary risk remaining is credit risk, as seen in our stress test, which must be continuously monitored. The next step would be to analyze the fund's cash flow schedule more precisely to use a cash flow matching technique, which will provide even greater certainty from monthly benefit payments to the 8,000 retirees.",
  "video_url": "https://youtu.be/M9Mb8dKf7ss"
}