{
  "student_name": "Arjun Suresh",
  "org_defined_id": "037585093",
  "username": "sures111",
  "email": "",
  "transcript": "Okay. So this is WVA8 on uh market efficiency and uh behavior focused on the efficient market hypothesis and uh the abnormal return formula. So let's go to the actual prompt. So, basically, we'll want to investigate market efficiency using the GameStop short squeeze in uh 2020/2021 as a case study. Uh, and we're going to want to verify the data the book gives us. Um, and then there there's a general timeline here. Uh, and then key data points that we'll all have to verify. So, basically in August 2020, GME wasn't doing too well. Uh I believe its stock was around a little more than a dollar, which isn't very good for such a big um retailer. And then at some point uh at least my knowledge before I went into this and do research is that some guy named Roaring Kitty made a YouTube video where he shorts it. And eventually that snowballed into a whole Reddit thing where a lot of people shorted it and basically uh some of them at least I hope got a lot of money. Um and then there was hearings about whether it was considered market manipulation etc. Then there's some data here that um I think is maybe not exactly what we want. So the short interest just means that a lot of people were shorting the money and um so the retail trading volume increased 10fold because uh you know everybody on Reddit suddenly got into this nothing stock and then um there were trading restrictions and yeah other stuff like that. really good idea is that the fundamental value of the stocks were like 10 to 40 maybe. So before I even get into define and discover, I want to talk about a crucial first step is verify the information. So generally through facteing I figured out all the information is there is correct except for this that says GameStop traded at 4 cents in August 2020. Untrue. So I believe the highest that month was was 132 and the lowest was 105. So uh we definitely want to resolve that data point because it's very important. Click this. So um now basically because one piece of data has been gone into question it would be smart to look at everything and verify the accuracy. Fortunately for us everything does check out. Um and there's the bonus in that we've sort of started our verification process. Uh now let's move to discover and define. So what's our objective here? What do we want to get done? Is we want to compare the efficient market hypothesis against the reality of GameStop. So there are three forms. The weak, the strong and the semi- strong. Weak says the market captures all historical price data. Semi-rong says it does that and it adds all public data. And then the strong form says it also includes um insider data. Um so what's our scope? We to be really broad at the moment. we want to look around August 2020 to perhaps even look at towards February 2021 because that's like the to the moon event where the the stock price shot up um because everyone was buying it and then um we want to talk about the aftermath talk about the bonus later with the with our constraints. Uh let's think about what we have to analyze here. So we have the historical stock data and the method we're going to use abnormal return calculation and sort of use that to make a conclusion about historical stock data. Our success metric is going to be a uh can we make a well ststructured explanation of whether this violates or follows the efficient market hypothesis based on abnormal returns. Sanity check. I expect large abnormal returns because GME really wasn't worth as much it was trading for. It was uh trading for hundreds of dollars at some point and we know that the uh the fundamental value is around 10 to 40 per share. Next, let's talk about S uh this is our standard. Let's talk about benchmark. I think what we're going to see is a a very very big abnormal return within our specific period and then we may also uh see a return to normal as time progresses. Now we can move to the represent stage. So what are we going to look at? We're going to use an estimation period. So uh basically I guess I'll skip down there to the formulas. But to figure out the expected return we have, we need to find alpha and beta values for the stock. And uh the only way for us to do that is to use data or given to us. I prefer using data um because it's alpha and beta right now might not be the same as it's alpha and beta in 2020. So I made a sort of estimation period from 888 to11. That way we have some buffer between it but we are very close and we're using a lot of days. So our data will be accurate but not manipulated by the event itself. And then um I call January 13th 2021 day zero. And then um we call January 4th to January 29th uh sort of the peak days. Um because what we want to analyze here is not necessarily looking at oh every single piece of data that's happened in this period of like a year or two. We want to look at these specific concentrated clusters. And I think here we want to look at the point where the price peaked which is right during that time. Uh this test is specifically going to be about the semi- strong form. Um but I will I will eventually get into what this says about the weak and the the completely strong form. And then our formulas normal return is alpha plus beta times the return of the market. That's pretty standard. Um and then we'll find alpha and beta by using the historical returns. And then our abnormal return will be hey what's the difference between what we expected and what actually happened? that'll tell us what like arbitrage occurred. Okay. So for the implement step um on the bottom left first is where you should look. Um that basically calculates uh within that set of like 10 to 14 days what the return was that we of the market what the return of the actual stock what it was what we expected to be and then the difference. So you can see on 127 something crazy happened like a huge increase and then on day uh on the 28th of January it it had a crazy drop. Um, in terms of our conclusions from our implementation step, I'm going to say the average daily abnormal return is 21% which is very very high and the cumulative amount was almost 400. Um, and then um, sorry something is blocking my view. Okay. And then we need to talk about the market efficiency. So uh the semir has been violated because uh generating those kinds of abnormal returns shouldn't be possible in a extremely efficient market. And the insights I'm going to have is that the semi strong predicts that all the public information like the short interest information um should be priced in like nearly instantly or very fast. uh we found our our analysis found like even like months uh of uh time for arbitrage if you want to call it that and then you know the market failed to efficiently process this information like quickly so that's a pretty standard violation now I want to go to my collab and just explaining the generals of my code so we want to import uh sort of use Wi-Fi panda pandas inside so that we can use financial data, put it in a data set and then analyze it with stats. So these are our tickers and then this is our time frame that we're inputting and then what we're doing is we're downloading the data and then we're finding the percent change. So that allows us percent change is like the definition of return from year to year at least. Um and then it's just dropping anything that uh doesn't exist. So any data we have or don't have, we're just ignoring it. In this case, we are not. So that's fine. Um and then now we need to make code for the estimation stage. So we set a start date and end date and then we find the returns from the start to the end. And then basically we estimate uh the spy return on average and then we estimate the uh returns of games and then we perform a linear regression using stats is probably one of the best ways to do it. Um that's basically going to minimize error in our results and then basically it's going to find an alpha value and a beta value. So that line has an intercept and a slope. And so beta is the slope that scales with how much the market is doing. And then the alpha is uh just the intercept there. Great. So we should expect a high beta. Anyways, now we actually going to implement uh the analysis. So we set event start date and event end date and then see we copy it and then basically we're calculating what the return should be based on the market by doing alpha plus beta times the data. It's a very simple. It's just doing it parallelly. So it looks a little complicated. And then um basically it's just putting all that information we just calculated in the chart. And then right here, right here is printing it. So that's great. And then now it's just saying some stuff about uh the efficiency test uh which is basically uh the conclusion I just told you. there's not much stuff that I haven't already covered there. So, it's uh some insight into my code. Now, I want to talk about verifying. So, let's talk about the significance of our results and its real world impact. So, is it like statistically significant? Is this something that occurred just by chance? Uh or do we at least have some reason to think that it's not by chance? And I would say yes because when the cumulative percent is like 400 that is a crazy amount. There are people that like are getting like I mean in my high yield savings account I'm getting like 4% a year. 400 is crazy. That's what you expect from an extremely extremely risky investment that like gets pretty close to throwing money away or something incredibly lucrative. So yeah, that's something is definitely going on here that's not just up to chance when it comes to economic significance. Yes, because um one of these stocks alone was worth hundreds of dollars from from single dollars. So that's if someone puts $100 in, they get $10,000 out and a lot of people can afford to put in 100 and their lives would be changed by 10,000. So it is significant in this very real world sense of some some big changes are happening here and then um when it comes to does this keep happening or is it a one-off uh this sort of thing has been going on cycllically with GME a couple times not quite as strong as the initial time but I believe it it's at least happened uh two times at this point and then uh is this just a result of investors taking on more risk and happening to get lucky. No, because GME as a retailer, it's not like the things you would expect 400% interest from are like I don't know like mobsters like mostly illegal things or like if you're investing in an incredibly lucrative company like Open AI, you might expect that like at the very beginning, but even them, they're not going to keep that up. So uh no there there's no amount of risk that uh sort of justifies this happening. Now we move to the evolve step. So basically I use my code from before with alpha and beta values except instead of using an estimation period I just slightly change them in one way or another. Um so the middle value is uh what I found. uh beta equals 2 it's about what I found beta equals 2.5 and a=.3%. So, uh, the center of the graph is the situation we are currently looking at. And then I just varied them because I wanted to see, hey, maybe it's a data issue. Maybe our estimations are just off and that's throwing us off. But you can see I'm having huge variances. I'm almost having and doubling B and then alpha is going like negative and like tripling. And even then, the abnormal returns are still in the high 600% cumulatively for every single one of these situations. Meaning, you know, even if our estimates like were way way way off, like we wouldn't expect any of this to happen. So, um we'd be in a similar situation. So, uh that's I guess an extended verification of how good our estimation is. And we know for sure it's good because every situation generates uh this scenario. Now let me make a conclusion about the fishing market hypothesis. Uh so let's start with semi- strong form. Um this was violated because we didn't uh I talked about short interest, right? because so many people are shorting the stock uh that they didn't account for the both of the risk for them and the return for other people of buying the stock from them when they flood the market. So um the semi- strong form generated abnormal we generated abnormal returns meaning we know the semi-rong was not uh doing well then we can talk about the strong form uh this is sort of just logically violated because stronger is more strict than semi- strong. So uh if the semi-rong is violated the strong also must by definition be violated. Um just sort of logically there. Uh I'm unsure about any insider info. Obviously I don't have any good insight into that. Uh I tried to look but I I couldn't find anything. Um so yeah and then uh the weak form we can sort of logically say this was violated because the historical price data didn't reflect what was happening. The week says the price at least considers the historical data but it wasn't it was violated. it considered it was uh it was mispriced in the sense I guess if you look at it one way uh it was overpriced because everyone was buying into it and it was violated by momentum right everybody says everybody needs to buy it suddenly we all buy it suddenly we all want it and suddenly the price goes up that's what happened right and the converse would be sell when going down but that hasn't quite happened as much um and then from another perspective you know the true value of this is $10 to $40 guys uh based on our our past details. Um and like it was trading for like a dollar. So maybe it was a little undervalued. Uh like I say little but it was like 10% of its actual value but like relatively slightly undervalued but really it was like massively undervalued if you think like 400 is like the real value. But uh I think the first one is more accurate where the weak form has been violated by momentum and sort of this craze of investors and uh psychology like the human element. Now I can move to the reflect stage because I've uh I've pretty much covered the prompt. So what I've learned is that we're kind of iffy on the efficient market hypothesis. It is just a hypothesis and it isn't always true and it doesn't always work. um people being irrational on Reddit about buying into things because it's going to it's going to moon, it's going to make me rich, etc. And then things like structural flaws like some people not realizing that uh that short interest was so high makes us have very very inefficient market outcomes. So uh that's a very interesting thing where the human element can sort of take us out of what we calculate and what we expect. Another thing is I realized that public info is not just financial, right? That info that people look at isn't just hey the returns this that like analytical stuff like we might be looking at. It's also hey like oh who bought not even who bought shares. It could be like oh what did someone say about this or on Reddit how are people talking about this? Which is something that's very hard to regulate and control. It's very interesting. Uh a lot of my conclusion is that we should respect the markets pricing but we should also doubt it um because there are opportunities for arbitrage everywhere for us to make a profit. And then finally um we need to be active in the market uh at least in the way we interact with it not passive. So passive is just accepting the prices that come your way. What we need to do is aggressively uh be looking at hey this is how it's valued but you know it isn't always valued right. So uh we want to bring in some sort of house view. you know, as a VC, as an investor, even as an individual, you want to be looking actively at how uh stock prices both change based on financial data and like social data.",
  "video_url": "https://youtu.be/bX6L-mlCJeU"
}