{
  "student_name": "Ryan Cairo",
  "org_defined_id": "036112967",
  "username": "rcairo",
  "email": "",
  "transcript": "session 8 assignment. Um the goal here is to look at the GameStop uh short squeeze of 2020 and 2021 um and investigate the uh market efficiency. So before we even started uh before I even start I have to go through the define and discover stages. Um, so I say that the GameStop price in August of 2020, uh, August 1st it was a dollar and August 31st it was a $167 which is an increase of 65.8%. Um, we are, you know, defining the GameStop short squeeze event and uh, the target audience for this would be like individual retail investors as a big one through like Reddit and stuff. uh financial analysts and uh researchers and um regulatory bodies uh policy makers and financial media and educators. That was a big one as well. I remember seeing all this stuff on the news uh about GameStops up, you know, x amount of percent or whatever, x dollars. Um so yeah, so this is the event timeline. um the key data points. Um and yeah, so basically what I did is I all of this code here is just importing all of the um historical data. Uh there's a lot of it. Um but it just takes all these dates here and it gives you the price, the high, the low, the volume, the open, the close um of the the stock price. Um um so now defining the EMH. So the MH is the efficient market hypothesis uh which essentially states that the uh it's a financial theory stating that the the asset uh prices fully reflect all available information um making it impossible to consistently uh beat the market so to speak uh and achieve uh superior returns. So this theory is is divided into like three different forms weak, semi- strong and strong. Um each with a different each with different assumptions. So the weak form suggests that um current prices reflect all historical data in the market such as past you know trading volumes uh past stock prices. Um and according to this firm uh technical analysis uh which is essentially using past price patterns to predict future movements is useless um for generating abnormal returns. Um and the uh semi- strong uh version form of the EMH is uh a form that uh prices reflect all publicly available information including historical data, financial statements, news, uh economic reports. Um and then the fundamental analysis which relies on public information uh is therefore also considered ineffective and consistently outperforming the market. So, and then there's finally the strong form which the strongest form of the hypothetical or the the hypothesis um claims that price reflects all information both public and private. Um so like insider information as well and this implies that even uh with in insider information uh or inside information uh it would be impossible to consistently achieve superior returns as prices would instantly adjust to reflect it. Uh so yeah that is the EMH defined. So now moving on past that um we have a couple graphs here that show the daily returns of GameStop um and then the auto uh correlated daily returns and autocorrelation of uh volume um and just more and more graphs. Here is the um not this one the next one. Uh a lot of historical information given here. Here we go. So the uh daily and cumulative abnormal returns for some key events here um are shown in these graphs. So daily abnormal uh returns for Ryan Cohen's initial stake and then cumulative uh from August uh of 2020 to for two months. Uh here is for the board seat in December of 2020. As you can see it's going up over you know the days. Um and then there's the short squeeze for Reddit and the congressional hearing in February and in March. Uh so yeah, deficiency, behavioral biases and anomalies. So given these uh quantitative uh findings on these major events here um only two of them are statistically significant which is the initial stake in the board seat and these are not. Um however um the behavioral link for the initial stake um this uh prolonged positive abnormal return could be attributed to underreaction or delayed reaction of positive news. Um this potentially is forming an anchoring position um where initial presses are used as a reference point uh causing slow adjustment to new information. Um the market efficiency implication of this is that the uh it's it's suggest a violation of semi- strong form market efficiency which as stated before um is right here. I already read it. I'm not going to read it again. Um the Reddit short squeeze 2021 January. Um, unfortunately I was not part of this. Uh, I had I had just started investing um a year later actually. Um but regardless um definitely overconfidence uh by the the investors um in a way at least if you're looking from a a safe standpoint obviously everyone's dumping or pumping you know short squeezing and and it got kind of wild. Um definitely hurting behavior. um you know, everyone was getting together and like, \"All right, we can screw over these um you know, billionaires and and uh hedge funds and stuff that are betting against the market or against uh GameStop.\" Um it was pretty rational. Nothing really like to this scale has it doesn't happen very often or ever. Um the Yeah. And then the congressional hearings although not stat uh statistically significant um in terms of the p value the um semi- strong form because there's a lack of statistical significance as stated. Um so yeah um overall semi- strong um which is uh price reflects all publicly available information uh including historical data uh news financial statements and economic reports. So uh yes and then um these are the values taken from all the historical data that I showed above um and why exactly they're not or are uh statistically significant for the confidence interval of 95 uh% ient.",
  "video_url": "https://youtu.be/rhV8Z7g-TMk"
}