{
  "student_name": "Anne Pumphrey",
  "org_defined_id": "037166275",
  "username": "apumphre",
  "email": "",
  "transcript": "Hello everyone. I'm Ann Pumphrey and to start off this assignment, I wanted to go over the WACCC principle, which is a company's cost of capital equals the weighted average of its debt and equity cost reflecting the blended return requirement of all capital providers. And the key concepts of this principle include cost of equity which is the return required by shareholders often calculated using um CAPM. Uh the cost of debt which is after tax interest rate on a company's debt. The market value weights which is proportion of total capital from each source. the tax shield which is interest payments reduce taxes lowering effective debt costs and the hurdle rate which is minimum return required by positive NPV projects. So after going over these topics I asked Google Gemini to give me a simple Python code to calculate Netflix's current WACCC which you can see here on my screen. So this um calculates the total enterprise value, calculates the capital structure weights, calculates after tax cost of debt and then calculates the WACC. So here are all the numbers and then um here are the results. So the market value of equity is $200 billion. The market value of debt is $13 billion. The cost of equity is 11.6 65% pre-tax cost of debt is 5.8% and the tax rate is 21%. And then the total calculated WACC is 11.22%. So after finding the current WACC I found the WACC after $300 billion debt issuance which is um 11.13%. The increase in the debt proportion slightly increases the the WACC. This is due to the beneficial tax shield provided by the cheaper debt financing. This change is marginal because Netflix is Netflix's capital structure remains heavily equity weighted. Next, I evaluated project specific WACC. If Netflix has US content, there is a mature market in lower risk. Investigating investing in established high demand content likely carries lower systematic risk than the firm's average. This project should be discounted at a lower WACC. Using the firmwide WACC would lead to understating the project's net present value potentially causing Netflix to reject profitable profit a profitable project. On the other hand, if they were to have international content, there is emerging markets in higher risk. Investing in content for new rapidly growing international markets, especially those with regulatory uncertainty or high currency volatility. Um, it carries higher systematic risk. This project should be discounted at a higher WACC. using the firm why WACC would overstate the project's net present value potentially causing Netflix to accept a value destroying project. Then I found Disney's a competitor of Netflix. I found their WACCC which is 8.2%. Netflix has a lower has lower leverage um so it has a higher WACC. So this means that current Netflix's current debt weight is only 6.1% while Disney's is 30%. Since the after tax cost of debt is significantly lower than the cost of equity um higher debt levels initially decrease WACC Disney's higher use of cheaper debt financing is the primary reason for its much lower WACC. um they also have a higher business risk. So Netflix is generally viewed by the market as a high growth, high content spending pure play streamer resulting in a higher equity beta and therefore a higher cost of equity. Disney has diverse, mature and stable business segments like their parks and traditional media that likely result in a lower overall corporate beta. Um Netflix's higher WACC was compared to its peers and the industry industry average um and it suggests that it is underle levered and is not fully capitalizing on the tax benefits of debt by strate by strategically increasing its debt proportion. Netflix can reduce its WACC, lowering the hurdle rate for capital budgeting, making more content investments profitable, and ultimately increasing shareholder value. Um, overall, I thought the use of Gemini and AI was very helpful in doing this assignment.",
  "video_url": "https://youtu.be/5SNvy2_s2Ug"
}