{
  "student_name": "Matthew Pelletier",
  "org_defined_id": "036151432",
  "username": "mpellet",
  "email": "",
  "transcript": "Hello. So, today we are going to be working on our session 8 video assignment. And so, just to walk through, we're going to be um doing the driver framework for the GameStop um price spike basically, which uh we'll get into what it is, but first I want to map out what we're going to do. So we'll start with define and discover, then make our way to represent, then implement. Then we'll go ahead and validate those with Yahoo Finance, then evolve. We're going to take a look at some, um, crypto, and then we're going to reflect on what we learned and how we learned it all. So, um, just a little background, we can go up to our session 8. Um so we're looking at the market efficiency uh of the time period which is the 2020 20 uh 2021 GameStop thing. It started late 2020 then moved into 2021. So um we had to work with this first step first which we have right here and uh the claim was that GameStop traded at 4 cents in August 2020 which is false. Um, we know that it traded around three to four dollarsish, 380. Um, we have it up right here and, uh, you go to here and this is Yahoo Finance. But, um, oops. This is the spike that we're going to talk about later, but I screenshotted it for now, just right here. Um, so then we're going to look at the timeline of how this all So, GME is GameStop. So, GameStop goes near bankruptcy. Um, and then the Chewy founder took 13% stake of it in September. And then January 2021, uh, so this platform called Reddit, which is where users can, uh, collaborate and bounce ideas and stuff like that to share socials. um they all came together and basically said let's all rise or uh like start buying GameStock and uh surge the price to 483 which uh if we go to here um where is it at we can see that it got up to 483. So, uh, yeah. So, that is true. And then February, they had the congressional hearings because people manipulated the market, which just means they all bought it at the same time and drove it up. And then, uh, present is just the price stabilization now, which we'll get to, but that's just it's around $20 right now. So the key data points for us are that it peaked at 140% flow. Uh the re retail trading volume increased 10fold during the squeeze. Um trading restrictions happened at the peak. So like Robin Hood didn't allow people to buy it at the peak. And then uh a hedge fund person uh Melvin Capital sustained 53% loss requiring the bailout. and uh analysts uh fundamental value estimated $10 to $40 per share and it got all the way up to 400. So now we're going to go to our represent stage which we have these questions that were asked about in here um we had to verify these or the critical analysis. So we have to verify the stuff. We have to test for market efficiency and then evaluate if rational in investors could be profit and then compare efficient market hypothesis to what we saw and then uh just look at the behavioral finance that could have explained how this all happened. So I mapped it out right here as my represent. So first we need to verify the data and define important terms. Then we need to think like a rational investor. We can't just sit here and look at numbers all day. We actually have to think about it. And then we need to compare it to what we know about the GameStop incident, which is where we'll find it in the data part right there. Excuse me. And so these are just some things to look for. Efficient market hypothesis, uh the efficiency testing, behavioral biases, stuff like that. So first let's start off with number one. We're into our uh implement stage now which we're going to do it. So verify all stated historical price data and documents are correct. So we went ahead and we have some sources here. Um we'll just pull one up for example. Um basically it's just talking about the whole incident and it comes around to say that they're right. So now we're going to get into our which we have uh we did verify this with Yahoo Finance which I showed you earlier. So, um, we're going to test which form of market efficiency was violated. And we would say that the inefficiency that was, um, the market was inefficient was that Robin Hood was so convenient that people could buy any stock anytime, ETF, memecoin, anything like that. They could buy it right away. And also, um, when Robin Hood put a cap on how much they could buy or if they could even buy it at all, that raises ethical and legal questions when Robin Hood like froze all of the stuff. So, that's a inefficiency that we saw. And uh, then we need to evaluate whether rational investors could profit through this. And so another article that I read just said that a lot of people uh rational buyers, they bought into the hype. They they bought it and they sold it at its peak of like $400ish dollars, like right before it peaked and then they sold it right before it crashed and uh they made a lot of money. So yes, they could, but at the same time, not many people would want to get into like a risky stock, especially knowing that GameStop was about to go bankrupt. So, uh, a lot of people lost money by buying the hype late like at $400 and then not selling it in time and having it crash all the way to like $50. That's $350 they lost per share, which adds up quick. And then we want to compare the efficient market hypothesis to what we saw. So basically the market hypothesis says that current asset prices reflect all available information. Um so basically um in this case uh GameStop we see that it's not true at all. it didn't follow it because GameStop's price just kept rising and rising and no new information was even given or came out. Even the insiders said that there was no reason for it to gain the traction it did. So, um I would say that it didn't follow the efficient market hypothesis at all. And then we want to look at some behavioral finance explanations. Um, so the first one is hurting behavior. Uh, so many people saw GameStop rising that like the price of it that they just wanted to hop on the train and uh they didn't want to they didn't want to be left behind. So they all bought at once, which is uh brings me into my next point, social coordination. Reddit had a big thing to do with this. all Reddit users came together and said, \"Let's buy this thing and drive up the price and then sell it and burn Wall Street.\" Um, so social coordination is just that they all did it together. And then fear missing out. People didn't want to watch other people make money and be like, \"Ah, dang it. I should have bought that.\" Or, \"Oh my gosh, I'm such an idiot for not buying it and selling it.\" And then finally, overconfidence bias. people felt like they were smarter than the market or that GameStop maybe people knew stuff that they didn't know so they just bought in to buy in and they finally lost all their money when it crashed and they got burnt. So, um just to validate all this, we're going to go to GameStop and kind of look at all these uh um the timeline here. So, as we can see, the uh the stock doesn't really do much from way back in 2000 all the way up until 2020. It kind of stays right where it should be. Um, and then we see that this keeps going, keeps going, keeps going all the way until uh November, December, stuff like that. keeps going all the way there and it's a at about like $2 like we said earlier and it spikes all the way up to that number that we talked about earlier. So um uh sorry lost my spot found it. Um so we can validate all this information with that and other sources that we have seen like this one is that uh it they short squeezed it and then to evolve my points that were made in this um I think a similar thing is kind of happening with crypto right now. So I wanted to look at it or a case of it. So, Dogecoin, if you're familiar, um, basically it's just a meme coin and it opened in 2013, but at kind of as a joke, but in 2021, uh, went up like 800% to 7 cents because, uh, Twitter or X, Reddit, all those, uh, that it got endorsed by Mark Cuban and Elon Musk, which led to people buying into the hype. And um so we saw kind of the same behaviors in crypto as we did in GameStop. And just to show you kind of um what it says it's all the way down to 17 cents right now, which is way less. But we kind of see this uh we see these spikes. So, here it comes and it's all the way up to about 60, which when people were buying it for less than 1 cent, that's a huge turn. Like that's it's up 6,000% from 5 years ago. and uh it's been down as of late, but it's similar to GameStop as we see this sudden uptick all at once, then back down, then another swing when President Trump got elected. So, I think it's very similar to that. And then finally, just to reflect on all this, uh we see that no matter how efficient we believe the market is, it'll always have its inefficiencies that just are uncalled for. like nobody knew the GameStop thing would happen and you kind of just have to learn from it. And then also that the feds got involved with the GameStop thing. That's kind of crazy. And then um I learned about how behaviors like anchoring um the hurting effect, the overconfidence, like all that uh plays into how people think. And sometimes it is irrational uh rather than just being smart with your money. And then finally, I just want to bring up that I I'm gonna personally keep my eye on crypto because if it keeps having those spikes, it doesn't hurt to throw your 10 $15 in there and see if it ever shot up all at once. And worst comes worse, you're losing like $15. So, um, that's about it for me. I thought this case was really interesting and I enjoyed doing it and I hope you enjoyed learning about my experiences. Thank you.",
  "video_url": "https://youtu.be/Wu_pJajTrr4?si=wXD0kj38uHcyvZ2O\n\n(HIGHLIGHT RIGHT CLICK OPEN IN NEW TAB... MAY HAVE TO REFRESH)"
}