{
  "student_name": "Chihiro Ueki",
  "org_defined_id": "034175099",
  "username": "ueki",
  "email": "",
  "transcript": "prefacing the assignment in terms of the objective is to investigate the GME event against the EMH and to verify the specific price claims that are within the assignment. Uh in terms of the scope and horizon, I'm analyzing GME with this GameStop and its daily price data focused on August 20 August of 2020 to Mar the March 2021 time frame. In terms of constraints, the most critical task is the first question that I asked which is to verify the statement that GameStop traded at 4 cents in August of 2020. In terms of data inventory, I have the event timeline analyst estimates of about $10 to $40 somewhere within that range. And so, first I need to pull the actual historical data. In terms of a successful metric, it's a clear data back answer for each of the five required analysis questions, which I'll get into next. And in terms of a benchmark, my analysis would be benchmark against the two numbers, which is a 4 cents the 4 cents claim, and then the $10 to $40 of fundamental value estimate that I provided earlier. Next, in terms of what I go into next, my plan here is to import white finance. as you can see right here and then create one data gathering function called get key data for each of the five separate um uh each of the five separate um functions for one of each for each required analysis question. So you get as you see you get like analysis one analysis two. Yes. And then I'll start by moving on to each of the questions. So the question that the first the first question that it asks here is what I said earlier in terms of verifying the four cents claim. So in order to do that I use the wife finance like I said earlier um it so it would this here the ticker history it would just go through um all of the Y finance and then find the numbers for those particular months. As you can see, you get like the August low August low date and things like that here. And then from the output, you can see that it actually wasn't 4 cents as the lowest split adjusted low price for GME in August of 2020 was $1, which was on the 3rd of August of 2020. So, we can conclude that the 4 cent claim is incorrect and that the actual low was $1, which is 25 times higher than the claim. Next moving on to our second uh question that we need to answer which is test which form of market efficiency was violated. This function provides a real number to answer this question. So in order to do that the script would compare the peak price against the fundamental benchmark of $10 to $40 like I said earlier. And then as you can see in this output here, you can see that the price surged to uh $483 in January of 2021. Uh and that's a claim for the unadjusted price. As it says right here, the 44 for one split means the adjusted equivalent is $120.75. And so we found that the highest split adjusted high price for GME in January 2021 was $120.75 on December 20 uh January 28th of 2021. In terms of a conclusion, we can say that the $483 claim given in the question is correct as it corresponds to the split adjusted peak of $120.75. That's the second part of Okay. In terms of analysis two, we'll go back here. Let me find it real quick. Yes. So, in terms of analysis two, we just go in, you know, it just finds numbers for us here. So, for analysis 2, it finds the market price like I said earlier, that was in the earlier thing that I said, which is a peak of $120.75 as you see here with my cursor. And in terms of a benchmark, we find that the all public fundamental analysis put the estimate value at somewhere between $10 to $40. Then we found that the pricing peaked at three times its highest rational estimate. And so by that we can conclude that the uh weak form is violated as the squeeze was a momentum event based on past price action. Uh the semi- strong one was also clearly violated. Well, the first one was arguably. The second one was clearly violated as the price was completely detached from all public info. And then the strong form was violated as well as the price was driven by a mechanical squeeze and social narrative and not superior private information. Third, talking about analysis three here answers what evaluate whether rational investors could have profited systematically. This function provides the real numbers. There's this question and so just prints numbers from all the data that we had previously loaded through Y finance. So in order to do that we can see that the rational investor by EMA standards would value GME at about $10 to $40. Like I said earlier this rational investor would have shorted shorted the stock or stayed out leading to massive losses. uh a value investor buying in 2020 paid about maybe $2.13 per share from what I gathered and then the value investor could have sold at a peak of about $120.75. Uh and so conclude the answer to the question would be no and that the rational investor could not have systematically profited as the event was a singular anomaly and not a repeatable system. So next moving on to number four here it asks compare efficient market hypothesis predictions to observed behavior and so in order to do that we have to find the EMH prediction the observed behavior the gap and then the EMH prediction as like I said earlier just using those numbers again from back and then um let's see here from the code you can see that all we're doing is comparing EMH uh predictions versus the observed behavior. We can see that the price should be a rational reflection of the fundamental value. Um the observed behavior is that the price hit $125.75 as I said earlier on January 28th of 2021. In terms of the gap, the observed price was $80.75 higher than the top end fundamental estimate. So in terms of the prediction, we can see that the price adjusts instantly and biasly to new public information. The observed behavior is that the price built a low chaotic bubble bubble from September of 2020 to January of 2021, then crashed. This was a biased herd driven and inefficient adjustment. So next, moving on to the na last analysis section. Uh let's see here. It's right here. Assess behavioral finance explanations for observed anomalies. And so from this code here, you can see that the anomaly is explained by the price gap of $80.75, which is the difference between the $120.75% peak and the fundamental high of $40. EMH as we can tell here is the that EMH cannot explain this gap but behavioral finance can as a in terms of hurting and social proof as that the Wall Street bets were acting as collective the narrative fally which is the whole David and Goliath thing as it became more powerful than the company's balance sheet and then also a short squeeze as short sellers face unlimited potential loss forcing them to buy back at any irrational price to calculate their losses. And so to end all of this, uh, through all this, I learned that the, well, the first thing I learned was that the 4centent claim was incorrect, but the $483 claim was correct. Data clearly showed a massive quantifiable violation of the semi-strong image due to my behavioral factors. And then the last part I would say next another step that someone could take would be to analyze trading volume to quantify the 10-fold retail increase or the impact of the uh Robin Hood uh restrictions. Thank you.",
  "video_url": "https://youtu.be/0QRWw961Fcw"
}