{
  "student_name": "Shea Wickstrom",
  "org_defined_id": "034209490",
  "username": "swickstr",
  "video_url": "https://www.youtube.com/watch?v=SSOku88v7pM",
  "transcript": "Hi, my name is Shea Wickstrom and I will\nbe going through the session 11\nassignment. Um, I am at a dance recital\nright now, so I just wanted to warn if\nthere's any like music or yelling in the\nbackground, that would be why. So, I\napologize in advance.\nOkay, so to start this assignment, um,\nas always, I use Gemini. I'm going to\nyou move my little screen here.\nOkay. All right. So, this assignment is\nover making a decision as an analysis\nfor Apple um and if we should do the $90\nbillion uh share repurchase or if we\nshould take advantage of any other\noptions. So to start in Gemini um I\nstarted with driver. So define I said\nact as a finance and investment advisor\nand analyzing corporate financing\ndecision-m there are multiple\nstakeholders shareholders bond holders\nand managers I need to analyze each\noptions impact on the different\nshareholders\nblah blah blah blah um consider both\nfinancial metric metrics and incentives\nplease use the kiss method and then I\njust went on to give all the provided\ninformation from the problem itself\nThen I also have the\nrepresent.\nOh, right here. Okay. Represent. I said\ncreate a code that I can run in\nPython/colab\nto indicate outcomes of the different\noptions and allocating cash differently.\nI need to understand how the difference\nin decision affects each shareholder.\nand I need to find return on equity with\nleverage and degree of financial\nleverage for each decision option. Um,\nand I just wanted to get all of those\nmetrics so that I can easily compare\neach of the different decision options\nright off the bat when looking at the\ninformation from the problem itself. So,\nthis information here,\num, it looks as though Apple is doing\npretty well. Um they have $165 billion\nin cash investments as well as making\nabout h 100red billion annually\num in their cash flows. And I did do\nsome validation on this to make sure it\nwas correct. Let me see if I can\npull that up anywhere.\nOkay, it's not going to let me right\nnow, but I'll show you later on. Okay.\nSo,\noh, here it went. All right. So, after\nlooking it up, it does say that Apple\nmakes around $110 billion per year. So,\nthis is accurate. And what that also\ntells me is that\na hypothetical $90 billion share\nrepurchase is not totally crazy to think\nof. um considering that that $90 billion\nwould be paid back in less than a year\nif that were to be the option. Okay. So\nthen after inputting my\ndefine and represent it gave me with\nthis Python code here\nwhich I then\nadded into collab and ran and it gave me\nthese results.\nWell actually these aren't the original\nresults that it gave me. Um, at first it\nonly gave me options. It only gave me\nthe results for\num com complete buyback. So using the\nentire 90 billion for buyback, it gave\nme an option, an alternative of the $6\ndividend, the AI acquisition, and I\nbelieve that was it. That's all it had\nat first. it did not give me provide\nback any um values for a hybrid option\nor anything like that. So later on I\nwent into Gemini through collab you can\nsee here and I said add a scenario that\nallocates investments between paying off\ndebt and buying back shares and that's\nwhat this hybrid option is here\nin the code itself. All of this is just\nthe given information and then we move\nto the calcul the um actual\ncalculations. So using that given\ninformation here it is finding\nthe roe. So return on equity it's\nfinding\num\nwhere is it? Oh earnings before\ninterest in tax. Yes. Earnings before\ninterest in tax. Um, oh, here it is\nwritten all out a little bit clear. So,\nit's giving the roe, um, DFL, EPS, so\nearnings per share. I also found that,\num, earnings per share is one of the key\nthings that uh, managers or\nanalysts are looking at when deciding on\npurchasing shares or just decision-\nmaking in that sense. Um, I learned that\nEPS is a really big indicator, earnings\nper share, of whether it is something\nyou should or should not do. So, when it\ngave me the outputs here,\nhere, I'm going to extend this.\nWhen it gave me the outputs here, and I\nsaw that earnings per share for\nbuyback was the greatest at $6.66.\nUm, initially this would be my my number\none decision just because it does have\nthe highest earnings per share.\nUm, however, when I look further into\nthese values that I was given, the the\ncomplete buyback has a risk of 1.03.\nWhereas a hybrid option which has\nearnings per share of 6.65, only 1 cent\nless than that of a full buyback. and it\nhas um a risk of 1.02. So, a little bit\nless risky than the buyback option.\nUm because of this, oh, it also did give\nme some key insights down at the bottom\nhere. Um but because of this, my\nultimate decision that I would make is\nto do a sort of a hybrid option where\nit's not fully into completely buying\nback. It's not fully into dividends for\nshareholders. um not fully into an\nacquisition, I would recommend doing\ndoing a a a buyback of shares, but then\nalso using some of that $90 billion\ninvestment into um paying back dividends\nor\nacquiring a different like AI or VR\num technology.\nAll right.\nfor the shareholders. If I were to\nchoose this hybrid option for the\nbuybacks in particular,\num\nlet's see. I feel like I had this\nwritten down somewhere.\nOkay. Well, now it's not going to let me\nsee it. Um so for the Oh, here.\nAfter chatting with with Gemini a little\nbit more, it gave me this really nice\ntable\nright here.\nOkay. So, basically, if I were to do\nthis sort of hybrid option, so doing\nhalf in buyback and then I would also do\nhalf in debt reduction. Um, just because\nalways to clear get rid of some debt.\num for the buyback itself, shareholders\nwould\nor yeah so stakeholders or shareholders\nwho have already purchased shares in\nApple would consider this a positive\nthing. Um that's because with Apple\nbuying portions of their own shares, it\nmakes these stakeholders shares um of a\nhigher percentage or higher weight in\nthe company. Um so for stakeholders who\nalready have ownership in Apple this\nwould be a positive thing. Um for\nmanagement buying back is also a\npositive thing um because it is reducing\namount of shares that the public can\nhave while increasing your own amount of\nshares and it's also boosting earnings\nper share which we saw\nhere. It boosts earnings per share by\nalmost 20 20 cents. So big P plus for\nthe management and employees and then\nfor bond holders. So anyone who is\nlending money those who are lending\nApple this $110 billion in debt. Um if\nanything it would be a negative thing\nbecause it means for these um bond\nholders it would mean that the Apple's\nmoney is being used for different things\nrather than paying back their debt.\nHowever, like I mentioned earlier,\nbecause Apple does have 165 billion in\ncash investments plus a $100 billion\nannual cash flow, um bond holders\nwouldn't be too concerned at being able\nto um\nget their get their money paid back\nbecause they know that Apple Apple will\nmore likely than not make up that money\nin less than a year\nfor debt reduction because like I said,\nthe option I would choose is doing half\nin the buybacks and half in debt\nreduction. Um, this would take care of\nthat sort of bond holders issue of if\nbond holders were to be a little bit\napprehensive apprehensive of Apple's\nability to pay back their debt. um\npaying back some of this debt, so let's\nsay $45 billion of the $110 billion\nwould sort of indicate that to these\nbond holders that um they will be paid\nback and that Apple is\nI don't know good on their good on their\npromises of being able to pay things\nback for everyone else though basically\nin this debt reduction. So for the\nshareholders as well as management and\nemployees of the company, um this would\nbe viewed as sort of a negative thing\npaying back this debt just because\nyou're losing this this this\ncash that could have been used for other\nthings such as an acquisition, special\ndividends, buybacks, things like that.\nUm you're using that cash just to pay\nback debt. So it's not as\ninteresting. However, it is still a good\nthing to pay back your debt. So I would\nsay splitting between debt reduction\nplus the purchasing of their own shares\nwould be the best option for Apple as a\nwhole.\nUm stakeholder impacts it comes to\nconsideration value creation and value\ntransfer. Yeah. So in buying back their\nown shares, the value is sort of\ntransferring\nwell more value is being added to those\nwho are already shareholders in Apple.\nHowever, at the same time, um Apple is\nsort of for those who don't already have\nshares in Apple, they are now losing\nsome some portion of shares that they\nwould have been able to buy. Um so the\nvalue for those who have not already\npurchased stock in Apple would be\ndecreasing\nbut for those who are who are already\nshareholders they would be possibly\nimpacted.\nUm\nyeah I believe that that is all. Let me\nlook back at these.\nUm, for the dividends here,\num, this would be po this would be\npositively benefiting shareholders\nbecause they'd be getting an extra $6\nper share of what they already have.\nHowever, the company itself would be\nlosing money and also the shareholders\nwould have to pay taxes on this special\ndividend. So ultimately it wouldn't be\nthat much of a benefit. Um which is why\nI steered completely away from that. As\nwell as for the AI or VR acquisitions,\nI feel like I sort of have just a\npersonal bias against acquisitions. Um I\nfeel like large companies such as Apple\nacquiring more it it does give room for\ninnovation innovation and growth.\nHowever, I do feel like um there are\nother better ways to use that this this\n$90 billion investment rather than an\nacquisition.\nAnd in this scenario, that better option\nwould be to get rid of some debt and buy\nsome shares to increase the value of\ncurrent shareholders, management,\nand employees as a whole. So, I think\nthat would be about all. Thank you."
}