{
  "student_name": "Michelle Cheng",
  "org_defined_id": "037286470",
  "username": "cheng754",
  "email": "",
  "transcript": "Okay. So, hello. Today I'll be presenting an analysis of Netflix weighted average cost of capital or we call it like whack or WACC. The goal is to evaluate the hypo hypothetical $5 billion content investment and determine the financial impact on of funding um $3 billion of that through new debt. To ensure this rigorous recommendation, we're going to use the driver analysis framework. So, starting with the fine, um Netflix is facing a strategic decision. They need to fund $5 billion in new content to compete with peers like Disney Plus or Amazon Prime Video. Um the core problem isn't just raising money, it's understanding the cost of the money. We need to calculate the current hurdle rate and determine if issuing $3 billion in new debt optimizes this c their capital structure or adds too much risk. So moving to research right here um I validated the current market inputs. Um, we're high we're in a high interest environment with a risk-free rate of 4.5%. Crucially, Netflix has a beta of 1.3, meaning it is 30% more volatile than the broader market. I also noted that um while their stock price is high, their current debt load is relatively low compared to their $200 billion equity va value. So this suggests that they might be under leverage. Um so moving on to interpretation which is the calculations. In the interpret phase, I calculated the component cost first using the capital asset pricing model. Um I calculated the cost of equity at 11.65%. This is the return shareholders demand for that high uh veloity. Um second I calculated the after tax cost of debt because interest is te tax deductible um the effective cost of debt is only 4.58%. When we weight these based on Netflix current capital structure we arrive at a current um WACC of 11.22%. This is the baseline hurdle rate. So you can see we did the calculations here and then moving to phase four which is verify. Um to verify these results and model the impact of the new debt I moved from manual calculation to Python. So to ensure precision I implemented the the whack formula um into the program isolating the cost of equity and the tax shield by defining the inputs in code specifically the 1.3 um beta and 21% tax rate. The script confirmed our current whack of 11.22%. to 2%. Um but when I went to a step further to model this sensitivity, um I used the Python I used the um I use Python to stimulate leverage ratio of 0% to 50%. Crucially, the script implements the hammada equation inside a loop. This dynamically adjusted the equity beta for each scenario, ensuring the model accounts for the increased financial risk to shareholders as debt raises. So you see right here at the graph, the output generates this curve. It mathematically confirms that issuing the $3 billion in debt is value equative um it lowers the whack from 11.22% down to 11.13%. By effectively utilizing the corporate tax shield without pushing the company into a danger zone. So now it's like execute um by applying this to the business content. Currently Netflix 11.22% whack is significantly higher than Disney's 8.2%. Disney benefits from higher leverage and diversified revenue streams. By issuing this debt, Netflix moves slightly closer to an optimal structure. However, we cannot use 11.13% as the blanket rate. I recommend a tiered approach. Use the 11.13% rate as um for standard US content and then also apply a risk premium for a hurdle rate of 13.2% 2% plus for intentional projects to account for currency and geopolitical risks. And finally is our review. Um based on this analysis, my recommendation to the CFO is to proceed with the $3 billion debts um issuance. It lowers the cost of capital, takes advantage of the tax code, and remains well within the safety margins of the BBB plus credit rating. This investment structure creates the most value for all shareholders. So yeah, that's basically it for my assignment and thank you so much for watching.",
  "video_url": "https://youtu.be/uuiaGOocRns"
}