{
  "student_name": "Derek Seitz",
  "org_defined_id": "037482726",
  "username": "seitz23",
  "email": "",
  "transcript": "Hi, my name is Derek Sites and this is my session 8 homework assignment submission. And let me just start off by saying that the uh short squeeze for GameStop back in 2021 is one of my favorite just financial events of all time. So, this was a really cool project to get to work on. So for define and discover, I want to test how well the efficient market hypothesis explains the 21 or the 20 to 21 GameStop short squeeze and whether observed anomalies can instead be understood through behavioral science and market structure constraints. Before anything else, I verified the August 2020 price and the false claim was that it was4 and the actual pre-split price was $6.68. 68. So the split adjusted price was $167. And this is actually what GameStop traded for. And the research design, I will use the event timeline and key prices to create a simple parameterized event study. And I'm going to encode it in a Python script that accepts user inputs or defaults. Always like usual. This is how I always do it. Computes basic returns and profit scenarios. compares market prices to analyst value ranges and it applies simple rule-based logic to label possible EMH violations and it's going to use the tool to explore or we're going to use the tool to explore how different assumptions affect conclusions. So for represent to move from raw facts to analysis I represent the problem using three linked frameworks the em so we're going to use the weak form EMH where prices already reflect all past prices/ last volumes which means no profitable strategies from momentum or short interest screens. uh semi-strong EMH which is prices instantly reflect all public info and strong form EMH where prices reflect all public info but nobody systematically beats the market and the total compute returns and price gaps that feed into simple rules and I will conceptually model the hurting/fear of missing out this is all of the users piling in and the confirmation bias or the Reddit echo chamber on r/ /wall street bets and overconfidence and gambling or the yolo options where everyone was trying to buy in all at once and putting as much money as possible into the options trading and the limits to arbitrage. So the extreme short interest plus margin risk and the micro structure so clearing house collateral jumps and Robin Hood buys. So the actual collab itself, we have the verification of the 2020 price as described above where it was actually trading at the $167 price mark. And here are all the returns around like the most important key events. So the board announce or pre-event board announcement is around 63% from that $167. And this is peak squeeze over 2,000% jump from the bottom. And that's insane. That's unheard of. And now we have the postevent stabilization where it dipped all the way down to below 90 almost 90%. And the pre-event or the return pre-event postvent which was 163.16%. So comparison to an analyst bond values um so the analyst value band is about $10 to $30 and at peak market price that $160 heaven hit upwards of $483 per share and the peak price is about 16 times above the top analyst estimate. So the simple EMH assessment, weak form EMH goes through it. Semi-strong EMH again discusses all of it. And strong form EMH in practice, it rarely holds. And this is all just stuff we've talked about above. So the rational investor profitability is the pre- peak gains show big upside for early buyers, but this required recognizing the squeeze setup in advance. So being a part of that r/wall street bets group. Um surviving extreme volatility, selling near the top. So being able to time that time 16 point and just being able to realize that that's going to be the peak and shorting at the peak looks profitable in hindsight but carried massive risk of further spikes and margin call/force liquidation. So there were large potential profits but they were high risk and not easily repeatable. So validating even though the script is intentionally simple I still validate both the logic and the numeric. So sanity checks with default GME inputs. You put in 1943 or 48350 with that initial analyst band and the script produces very high preak return. So, it's over that 2,000% march with a large drop peak post and peak price. And that's the 10x analyst high. So, rule-based assessment flags, strong semi strong violations and likely weak form violations and these qualitative conclusions match the detailed research narrative. So, the conceptual validation. So alternative scenarios by rerunning this code over here and changing the inputs. Um if we were to do if we were to set the peak at 60 and the NS high the script would have given us extreme violations and conditions would fail that 5x rule. Uh or we just do no squeeze at all and the set short interest to 20 and the volume to one and script should not claim weak form violation. Momentum isn't large enough. So to evolve this, we could I could evolve the project further by having the Python code create a timeline of or a timeline graph that mirrors the real world data to show exactly where the stock prices rise above that 2,000%. And I could also implement a section where I let the user simulate more detailed paths well you buy at multiple dates or staggering exits. So reflecting uh building the KISS Python tool helped me understand the GameStop event more clearly because I could see the price jumps and valuation gaps and simple numbers. Translating EMH concepts into code made me realize how extreme the GME anomaly really was compared to normal market behavior. And running different inputs showed that markets are usually efficient, but they can break down when emotions, crowd behavior, and trading constraints take over. The project also taught me that even rational strategies can become dangerous when arbitrage is limited. Overall, combining theory with a simple programmable model made the entire event easier to understand and explain. And with that, that is my submission for session 8.",
  "video_url": "https://www.youtube.com/watch?v=j1dsSLUmmBk"
}