{
  "student_name": "Dylan Scheel",
  "org_defined_id": "037036066",
  "username": "dscheel",
  "email": "",
  "transcript": "Hi, this is Dylan Shiel and this is my session 10 assignment for management 310. Uh so this week we are looking at cost of capital analysis which is essentially net present value. And so the assignment overview we have evaluate star Starbucks proposed flagship roaster that requires a 10 million upfront outlay and is expected to operate for 10 years. use the firm's 8.5% walk as the or weighted average cost capital as the hurdle rate to determine whether the project creates value and to recommend and accept to re uh and recommend and accept slreject decisions supported by driver documentation. So we'll go over here and we'll look at my initial prompt that I gave the AI. I said I'm a financial adviser for Starbucks. My goal is to assess assess the implications of of a proposed flagship roaster that requires 10 million upfront outlay and is expected to operate for 10 years. The firm's walk or weighted average cost of capital is 8.5%. And I want to use this as a hurdle rate which I know to be the interest rate used for the required rate of return of a project to determine whether the proposed project creates value and then I will recommend and accept slreject a decision. And I told the I want you to act as an expert in all things financial advising with an expertise in time value of money as well as an extensive knowledge in Python coding and use the given information which I gave it down below. I want you to create a 10-year incremental cash flow schedule that includes revenue, operating cost, depreciation, tax shields, taxes, working capital, and terminal value. I then want you to use the time value money to calculate the net present value and internal rate of return of the project. Along with this, please calculate the discount period, simple payback period, and create a profitability index. For these values, please take into account all things like initial investment, working capital, revenues, operating cost, and taxes each year. And then I said, please create a Python code to compute to calculate all of these values. Please use the KISS method of Python coding. Keep it simple and stupid. And please ensure that the code can be easily explained to a non-technical audience. And then for the project parameters, we just have this is a given. So we have the initial investment is 12 million which is uh depreciated straight line over 10 years. So it's going to be even across the 10 years. Working capital is 500,000 deployed at launch and recovered in year 10. Revenues are 8 million in year 1, 11 million in years 2 to 5, 9 million in years 6 to 10. And then for operating costs we have cost of goods sold are 40% of the revenue. Labor is 2.5 million. Rent and utilities are uh 800,000. marketing is 300,000 in year one and 1 million year or 100,000 year after and then taxes the corporate rate is 25% and the terminal value of 3 million at the end of year 10. So we can come over here to my code and we can see so uh first thing it does is it's it's looking at the project parameters and then we have our operating cost we have a revenue schedule operating cost and it's creating the cash flow schedule. So we start in year one with zero um and then calculate the cash flows for year one. So we do operating cost before depreciation, earning before interest and taxes, taxes, net operating value. And we're just bringing all those things together. And then so for the financial metrics, we're doing net present value. So net present value is what we're doing as you can see by this. We're doing the uh project cash flows at the start times the net present value of project cash flows every year on. So basically what that's doing is taking your initial investment and kind of what we can think of it as is we're doing the present value of the initial investment but it's year zero. So it's uh basically just by one but for all the years after we're doing our present value formula. So 1 plus uh the math like the investment or I guess the cash flows times 1 plus i to the n. So for year one it's ne1 for year two it's -2 and so on. And then for the IRS are we're just doing a formula for the project cash flows. And then for the payback period uh the simple is the um it does not take into account the uh net present value. So that's literally just how long it takes us to get our money back. For the discount factor, we are taking into account present value. So, we uh discount all of our money back to time zero and then see how long it takes us back to get our initial investment, which I believe was 12 million. So, and then as we can look down here, uh where's my table? So, as we can look at our table here, uh I have it over in a doc that explained all this. So, I said the net present value of the project is 8.5%. and it's 3 million uh 3,22,515 which is greater than zero. So we want to accept the project there. And then the internal rate of return for the project is 13.25%. And that's important because that is the hurdle rate that is used for to make the net present value of the project zero. So if we can keep our uh if we can keep our hurdle rate below that, we're going to have greater values, which is is what we're looking for. So um and then we have our profitability index is $1.24. So um that means for every $1 that we put into the project, we're going to get $1.24 back. And that's important because when looking at if a project is we want to go forward with it, we want that profitability index to be greater than one because we want every dollar that we get to bring a return back. We don't want to lose money per our dollar. And then for the simple payback period, as I said before, that doesn't take into account the time value of money. So that's literally just when do our uh inflows uh equal out to our initial investment or outflow. So that's going to be after 5.28 to eight years. And then for our um for our discounted payback period, that does take into account the time value money. So, we're just doing the same thing. We're looking at when do our discounted uh cash flows equal back to our initial investment. And that's going to be after uh what did we say that was 8.21 years. So, when we're looking at a 10-year schedule, that's great because uh by the time we hit those two values, we're all we're going to be back in the profit because we're above our um we're above our investment. And so, next we can look at our cash flow schedule. So, as you can see, we have our revenue each year on the left and then we have our operating costs, our depreciation, our uh taxes, our um and then at the end we have our cash flow. So this is good to see because we can look at how much um our revenue is being taken out by our taxes, our depreciation and our operating costs. And so we can see really um how much money we are truly making. So like here we have for uh project cash flow in year one, it's our revenue minus operating cost. So and we're going to have $1.2 $2 million at the end. And then we can see in our final year, uh, we take into account the terminal value of taxes and all that stuff and our taxes each year. And we get our, um, we get our working capital back, which is good. And that's going to bump our um, project cash flows at the end. And so that's a nice way to kind of get to see our net present value in real time. And all of these values are being used for net present value. the project cash flow at the end is where we get those where we get those values. And so from the net present value with these original assumptions, it is very fair to say that we want to accept the project. Um the net present value is $3 million or over $3 million, which is great. We just all we want is that to be greater than zero because that means we're going to make money back. It means we're going to have a great return on our investment and that's fantastic. Another way to look at it is the by looking at the profitability index. Again, we said that's $1.24. 24 per every dollar spent, which is great. We want that to be greater than one because we want to we want to get our money back per dollar we spend. And so the next thing I wanted to look at is a sensitivity analysis. Uh and it I said this is the prompt I use. I said now I want to run a sensitivity analysis using the same information above. This is more of the evolve step I guess we could say. And uh I want to use now I want to create a sensitivity analysis using the same information above but first if the re and first if the revenue is reduced by 20%. So uh what will happen and then secondly what will happen if the walk weighted average cost of capital or the hurdle rate was plus or minus 2% from our original 8.5%. And then so I wanted to see how this affects the net present value and the internal rate of return on the project. And so I just told it to create another cell of code uh for the sensitivity table. And we can go down here and we can see we are calculating the net present values in all the same ways but our revenue went down 20%. For the original one and then for the second one we uh changed our walk. So it went up 2% or went down 2%. And we can see our wait one sec. Where are we at here? Our sensitivity table. So this is our base case right here. So that's our original $3 million 13.25% irrra. And then so our first case was what happens if our revenues reduce 20%. And we can look our net present value is -3,157,292. And that's really bad. That is not what we want. That essentially means that by doing the project we are burning $3 million of our earners equity which is not good because we have to pay that out of pocket. we're losing money and that is that we always want to reject that because um we we do not want to lose money. And then if we look here, the IRRa is 3.19%. Which makes sense because to get our net present back to zero, we have to discount our cash flows even less. We have because we need to get our present values back. And by discounting it less, that means technically we have more present money. And so we basically we always want to reject this uh project if our revenue goes down 20%. And the next two we looked at is if the weighted average cost of capital goes down 2%. Um and up 2%. So this is our hur hurdle rate that we use. And so when it goes down 2% we are net present value goes up to 4.6 million. This makes sense because we are discounting our money even less. we have a lower hurdle rate which means we have a greater um possibility for accepting the project. That's great. We always want to accept that. And then for our weighted average cost of capital when it goes up 2%. Uh our net present value is still positive but it went down. So we have 1.6 million. And this makes sense because our hurdle rate is higher which means we're discounting our money even more. um and we have because we have a higher hurdle rate, we have less wiggle room for um the project to fail, but the project is still positive and so we're still always going to accept it. And then for the IRRa of both of these, we can see they both stay 13.25%. This makes sense because for the internal rate of return um all all we changed in these two scenarios when we ch change the weighted average cost was we changed the hurdle rate and for the internal rate of return the hurdle rate has no impact on the IRRa because the hurdle rate is the interest rate used to discount the net present value when we just calculate net present value but for the IRRa we are finding the interest rate that would make our net present value zero. So basically what interest rate do we have to use to discount our money back to be zero. So those are going to be the same for both walk assessments and also for the base case because again it's all the same assumptions and we're finding the interest rate. And so overall um we can see that and we are going to accept if we ran it with the walk plus or minus 2% we're going to accept both. And so all in all with the original assumptions we should definitely accept the project as the net present value is greater than zero. And another way as I said before to check that is the profitability index is greater than one. This means we're going to be making money in uh over $3 million of what we need. One important thing to keep in mind when looking at the project is because you can't always just look at the expected values. You can't always look at the assumptions we're looking at. And one thing to keep in mind is if the project about the project is if there's a flagship store, this could take away the profit from other stores or the the other stores could take away the profit from a flagship store. People with something like Starbucks, this is something that people go to. This is part of their routine. In fact, I did this assignment at Starbucks. And so having a flagship store, yes, it could bring a lot of profit, but also people are adverse to change. People are adverse to trying new things. And so, as we can see from the sensitivity table, if our pro revenue drops 20%, which this could cost, we burn a lot of our equity. And so, over $3 million of equity, and we don't want to do that. We we um we need to make sure that when we run a project, it is always going to bring us money back because we don't want to lose money by building a project over these 10 years. And so, um, that's something to just keep in mind when we need to do this, uh, think about doing this project. Um, however, when we do with something like the weighted average cost of capital, it seems like with the assumptions we made plus or minus 2%. It's still going to bring us a profit. And that's great because if we change our hurdle rate to be higher, we're still going to make a profit. And but we're also going to that can change things like our cost of equity and other things like that. And so we can do some shifting around in the company to and still ensure that with things like equity, things like debt and and we can still ensure that our project will be profitable. And so it seems like here that revenue is the biggest thing to watch with the project. And so we should definitely accept it. And so to reflect, I think the biggest thing I learned in this is with a company the size of Starbucks, they have obviously a lot of wiggle room with their hurdle rates. Um, even if we upped it to 10.5%, which is relatively high walk, it's still going to be um it's still going to be positive net present value. It's still going to be a project that we want to work on. But uh with something like revenue and something with something like revenue that can easily change so much especially when adding a new store and changing the way people do things in their lives that can change our project's net present value a lot. And so there's a lot of things we need to look at with that and a lot of things that within the company they would need to keep in mind and make sure that things run smoothly and um to be able to accept the project. So yes, thank you.",
  "video_url": "https://youtu.be/GGFQhrQXEdY"
}