{
  "student_name": "Jake Patterson",
  "org_defined_id": "037362505",
  "username": "patte269",
  "email": "",
  "transcript": "Today I'll walk through a cost of capital analysis for Netflix using the DRIVER framework. We calculate Netflix's WACC, assess the impact of $3B in new debt, determine project-specific hurdle rates, and compare Netflix to Disney and Amazon. The purpose is to understand how Netflix's financing decisions affect investment strategy. This analysis supports evaluating a hypothetical $5B content project. The main goal is to compute Netflix's WACC and evaluate how leverage influences financing costs. We also need to see whether U.S. and international projects require different discount rates. Comparing Netflix to major competitors helps show whether Netflix's capital is overpriced. These questions guide the rest of the analysis. We use Netflix's $200B equity value, $13B in debt, beta of 1.3, and a 5.8% debt yield. Market inputs include a 4.5% risk-free rate and a 5.5% market risk premium. Media industry WACC is typically 8–10%. Disney is at 8.2% and Amazon at 9.5%, giving a benchmark for comparison. Cost of equity is estimated using CAPM, and cost of debt uses the after-tax yield. WACC combines these using market-value capital structure weights. WACC represents the hurdle rate for Netflix's investments. These concepts drive the full analysis. We identify the cost of equity, cost of debt, capital structure weights, baseline WACC, new WACC, and project-specific WACCs. We also need peer comparisons and a sensitivity analysis of leverage. These variables ensure a complete financial evaluation. With them established, we move into verification. Using CAPM, Netflix's cost of equity is 11.65%, reflecting high equity risk. This aligns with the volatility and competitive pressure in streaming. A double-digit cost of equity increases Netflix's hurdle rate. This is the primary driver of Netflix's high WACC. Netflix's pretax cost of debt is 5.8%, dropping to 4.58% after tax. This shows the benefit of the debt tax shield. Debt is much cheaper than equity for Netflix. This becomes important when evaluating added leverage. Netflix's structure is about 94% equity and only 6% debt. This is extremely equity-heavy for a content-intensive company. It also means Netflix isn't taking advantage of low-cost debt. This imbalance explains much of the high WACC. With these inputs, Netflix's current WACC is about 11.21%. This is well above industry norms and above both Disney and Amazon. A higher WACC means Netflix requires higher project returns. This makes content investments more expensive to justify. Issuing $3B in debt raises the debt share slightly to 7.4%. Because debt is cheaper, WACC falls to roughly 11.14%. It's a small drop but shows that leverage improves efficiency. Netflix has room to use more debt responsibly. As leverage rises toward 20–25%, WACC gradually declines. This suggests Netflix is currently under-leveraged. Moderate debt lowers the hurdle rate without pushing credit risk too high. This is an opportunity for capital structure optimization. U.S. content, with lower risk, has a project WACC of about 10.6%. International content, with higher political and currency risk, is closer to 11.7%. Different risk profiles require different hurdle rates. This prevents Netflix from under- or over-investing in specific markets. Disney and Amazon both have meaningfully lower WACCs than Netflix. Their diversified business models and stronger balance sheets reduce risk. Netflix, as a pure-play streamer, faces higher volatility. This reinforces the need for a more efficient capital structure. Netflix's heavy equity reliance drives its above-average WACC. Adding debt slightly improves efficiency and lowers funding costs. A lower WACC increases flexibility for large content investments. These financing choices shape Netflix's competitive position. Netflix should target a 20–25% debt ratio while preserving its credit rating. This range meaningfully reduces WACC without adding excessive risk. Project-specific hurdle rates should guide content investment decisions. Avoiding unnecessary equity issuance helps keep costs lower. Evaluating the $5B content project requires using the correct project-specific WACC. Funding part of the project with debt improves blended financing cost. Matching financing to project risk strengthens long-term strategy. This links capital structure directly to content economics. DRIVER provides a disciplined way to structure the entire WACC analysis. It ensures the work moves logically from defining the problem to interpreting results. This method strengthens financial reasoning and justifies recommendations. It also highlights how capital structure affects strategy. Netflix's WACC is currently higher than competitors, but moderate leverage can reduce it. Project-specific discount rates improve accuracy in evaluating investments. This framework supports better funding decisions for content growth. Questions? The Python code calculates cost of equity using CAPM, after-tax cost of debt, and Netflix's equity/debt weights. These values feed into the WACC formula to compute Netflix's current WACC, new WACC after additional debt, and project-specific WACCs. A short loop estimates how WACC changes under different leverage ratios. The script prints clean numerical outputs for direct use in the spreadsheet and slides.",
  "video_url": "https://youtu.be/WSVoDQ4wmPw"
}