{
  "student_name": "Sean Wu",
  "org_defined_id": "035909269",
  "username": "wu2053",
  "email": "",
  "transcript": "Hi, my name is Sean and this is my video for section A section A market efficiency and behavior finance. In this assignment, I'm going to test how well the efficient market hypothesis or EMH explains what happened during the GameStop short squeeze of 2020 and 2021 using the drivers framework. So, start with define and discover. Uh the question I'm exploring is did prices around the GameStop squeeze behave efficiently or were behavior behavioral forces driving them. So for the assignment I'm addressing five required analysis which is provided here. So first and you'll see each of them in my notebook later. So the first is to verify historical price data and document corrections. Second test which form of market efficiency like weak, semi- strong or strong was violated. Third is evaluate whether rational investors could have profited systematically after frictions. Four is to compare the EMH predictions to observe behavior. And the last one is excess behavioral explanations and limits to AR arbitrage. So for data I use GME for the stock and spy as the market is proxy and the timeline runs from June 20 2020 to uh March 2021 capturing the uh the runup peak and aftermath and the event date is January 27 20 uh 2021 and the date before Robin Hood imposed trading restrictions. Now um also the code I generated is all from CHPT and now let's look at the results of running after running the code in Google Collab. So first the first step is to do price verification um as as required by the assignment. So I begin with a quick data audit. So using the sto adjusted closed data and the GameStop trade did between um $1.04 04 and 1.67 um per share dollars per share in August 2020. So earlier figure of um the 0.04 um dollars appears to be inaccurate inaccurate across the major data vendors. So I'm simply documenting this clarification. So the GameStop was in a low single undigit territory around like one to$2 not 0.04 dollars and that fulfills like the first requirement to verify and record the uh factual corrections. Second step is to do volume analysis. I look at the trading volumes during August to September 2020. the GameStop average around about like 35 million shares per day. And in the week of January 25, 2021, the volume exploded uh roughly 447 million shares per day and 12.6 times increase and this is this confirms the massive surge of retail trading participation during the squeeze. Now going to represent section. In the represent stage I outlined the event uh study framework I used to test efficiency. So the estimation window covers 60 trading days until uh ending at like t= um1 and the event window is t = 10 to 10 uh to positive negative 10 to positive 10. And I estimated a simple CAPM with um RJME equals alpha plus beta * R MKT and and abnorm return equals R RME minus um bracket alpha like this this section alpha plus beta* RM and KT bracket and and sum those you can get the cumulative abnormal return which is C and if the market were perfectly semi- strong efficient abnormal returns would appear only on day zero and it disappear right after. So persistent drift after day uh zero would indicate a semi- strong form violation. Now going to an implement section. In implement state we regression the regression results uh show like the first is alpha equals 0 um 4766% per day and beta shows 2.235 and the residual standard deviation shows 6.51%. The R squar is 0.104 104 um and the with 59 days in the estimation window and a beta above two means um GameStop moved more than twice as much as the market which is a clear evidence of extremely high systematic risk. So the u from the result of the first chart and shows the price and volume um plot. This chart combines like the price in blue and the volume as a bars and you can see the price jumping from single digits to single digits to over like 80 um exactly at the event line like here and which with volume spiking past 400 million shares. And that pattern matches like a classic short squeeze rather than a rational reaction to um new fundamental information. And for the abnormal returns um this like this graph below these two graphs below in the top panel which is this one we see daily abnormal returns at day zero shows a huge positive bar um followed by a lingering positives on day plus one and plus two then sharp um then then sharp negatives as the price collapsed and in the bottom panel the cumulative AR rises to around um plus 400 um you can see 400 plus 400 basis points by day zero and peaks immediately after like which is this one and and falls back. So this drift indicates that not all information was absorbed instantly and a semi- strong efficient violation driven by a behavioral momentum and tension spillovers. So a quick uh significant check uh my simplified test shows the average post amount AR is from PL plus one to + 5 and of um a negative four a negative -4 a negative 14.279% and C of 0 to positive five of plus 68.42% 42% with a rough T stat of 4 uh 4.29 29 and that's stat statistically large but economically short-lived abnormal returns were quickly reversed as uh the trading con constraints it constraints hits for valid uh for validation um here's how I validated the findings first the statistical significance so the C around is around 68% t equals 4 definitely non zero second um economic economic significance. It's not easily exploitable because of Robin Hood restrictions and extreme um volatility. The third is persistence. So the drift collapsed within days and temporary mispricing, not a repeatable pattern. The fourth is risk adjustments. So a beta over two means part of the return was just high systematically risk. So even though the event looked inefficient in the short term, it was not systematically profitable once real world frictions are included. And for evolve to evolve analysis, I noted four next steps that we could make to study more robust. So the first is to shift the event date to January 28, 2021. and the um the day trading restrictions actually hit. And the second is extend the estimation window to 120 days to stabilize um beta. And third is to replicate the study for AMC as a pure case. And the last one is to add a bootstrap significance test for C to avoid normal norm normality assumptions. for reflection. Um my reflection is that the markets are mostly efficient efficient but when attention like social media and trading constraints collide and they can deviate sharply from fundamentals and the GameStop case illustrates how hurting like overconfidence and attention bias can drive temporary bubbles. So like for investors the lesson is to respect the market baselines but stay alert uh for rare moments when behavioral forces create short-term distortions and that's how behavioral finance and like the efficient market hypothesis come together in real time. Thank you very much.",
  "video_url": "https://youtu.be/6f_caPobRDk?si=C2HiFm1P8B6GoO3_"
}