{
  "student_name": "Lal Thang",
  "org_defined_id": "038073978",
  "username": "lbthang",
  "email": "",
  "transcript": "Hi guys, my name is Law and for today's um video we are on session eight market efficiency in behavioral finance. So our assignment is to investigate market efficiency using the GameStop GME ticker short squeeze event of 2020 to 2021 as a case study. Verify the accuracy of stated facts. analyze price behavior relative to efficient market hypothesis predictions and evaluate whether market an anomalies consuted evidence against market efficiency or can be explained within existing frameworks. So our first critical step is verify the statement GameStop traded at 0.04 cents in August 2022 against actual historical data. If incorrect, document the accurate figures and determine approximate appropriate documentation approach for correcting the professor. Event timeline August 2020 GME near bankruptcy levels September 2020 Ryan Cohen tree founder acquires 13% stake January 2020 Reddit Wall Street's driven price surge to 483 February 2021 congressional hearings on market manipulation present postevent price stipulations Short interest peaked at 140% of flow. So key data points are retail trading volume increased 10fold during squeeze trading uh restrictions implemented at peak on Robin Hood which is a broker hedge fund Miller capital sustained 53% loss requirement bailout analyst fundamental value estimates 1040 per okay let's verify all stated Historic price data and documents are correct. Test which for market is weak, semi strong, was validated. Evaluate whether rational investor should have probably profited systematically. Compare efficient market hypothesis prediction to observe behavior access behavior as finance components. Okay. Um Okay. So our assignment is to analyze the 2021 GameStop short squeeze um framed as a test of the efficient market hypothesis. I will be following the driver framework for this um analysis. So our first step is to verify whether GameStop traded at 0 or 4 cents in 0.04 cents in August 20. So I went ahead and asked Google Collab to verify that data using browsing from what's it called? Yahoo Finance and it came back saying that that is incorrect. Um, the lowest price in August was actually a dollar and with the assignment saying it traded at the lowest was 04.04 which is that would make it incorrect and okay so here are my notes that I will be going through. So the first stage is to discover um critical requirements is to verify that data which we just did um because the prompt claims that it was GameStop traded at 4 cents in August 2020. Um before I can test any theories, I would have to um implement the stage and pull the data directly, which is what we did for the discover. And so so that would basically kind of do the implement task before the R but we'll also do the implement as well. So to represent my analysis um so basically after doing that that brings me back to the represent stage which is this is where my um analytic plan is. First I'll visualize um the full event using the data and second I will validate um the data against three forms of um efficient market uh hypothesis and then thirdly I will um evolve the analysis by using behavioral finance to explain the what EMH can't and then basically Ally finally I'll reflect on that. So that is a basically walk through what we will be doing. Okay to the implementing stage here. So the chart that I showed here or I didn't really show it but the chart here is um shows the entire event from 2020 August of 2020 to 2021. and then of the basically how much the like how much the stock was getting traded at and such and such etc. Um so basically the green bar here to show you you guys the green bar here represents the $10 to $40 range that um analysts believe that the company was actually worth. And in January 2021, the price completely uh detached from the reality exploring to 483 in event driven by um social media fuel buying frenzy which I believe is like when people pump stocks. All right. So that is it for the stock. Okay. And then for the to validate this, you guys can also here read my notes, but I'll just kind of summarize the notes and go over it. Um to validate the the efficient market hypothesis against um this event. Um first the weak form. Let me see. There you go. The switch valid. Okay. All right. So, first the weak form was violated. Um the theory says you can't use past data to win, but Wall Street's bets community did exactly that. Um they looked at public historical number. the 140% short interest and correctly predicted a massive uh future price surge too. Um and then second the the semi- strong form was spectacularly um validated as well. The three the three says um all public information is already in the price but the 140 the with the 140% uh short interest was public for months and the price stayed low. the market failed to um incorporate this information allowing the an um just the anomaly to exist and the strong form which deals with private info is not really relevant here as this was a public um phenomenon. All right, last word validate. Here you go. These are basically short version. I'm just summarizing it going over the the notes here. Um so with our evolve is if not EMH then what? Um so this would explains uh to evolve this analysis if the market wasn't efficient what was it? This is where behavioral um finance takes over. So like we saw a classic hurting as millions of investors on social media act as one. We saw a powerful narrative apes versus suits that fueled the overconfidence game. But the most important concept is um limits to average adage. The EM uh relies on rational investors to quote unquote fix mispricing. But in this case, it was too risky. Um like Melvin Capital tried to be a rational investor and they were bankrupt for it. The risk of shorting a stock with this much momentum was infinite. The market can stay irrational longer than you can stay solvent and this allows the bubble to grow for to evolve. And then for the EMH model. So like I said, these are my notes that you guys could just look at and summarizing them for the reflection. Um the GameStop events um proves that efficient market hypothesis is a useful model not an unbreakable law. It shows that the market is not a cold rational machine. It is complex adaptive system driven by human psychology. So like could a rational investor have profited? Looking back it seems easy but at the time it was a pure gamble and like what this takeaway is that markets are are often efficient. They're not always efficient. And when human behavior, social media, and flawed market structure like the 140 short interest collide, the market can become spectacularly I guess irrational. And I think that is from my reflect. Yes, that is it for this assignment I believe. So yeah, here's my code and stuff to implement and validate as well. If you guys here the code and then as if you guys want to double check or to see you could also look at the the stock itself of GameStop for the time 2020 and 2021. Here you can see all the prices that it was um basically trading at as you guys can see low of one for example low into 2021. So, so here before 2021 like GameStop was trading around one is $1 to $6 range to um for that assignment. And that is it. Thank you.",
  "video_url": "https://www.youtube.com/watch?v=md8YLkRpO5k"
}