{
  "student_name": "None None",
  "org_defined_id": "036207648",
  "username": "garris26",
  "video_url": "",
  "transcript": "0:01\nHello, my name is Charlie Garrison and\n0:04\nthis is my mini project three. And for\n0:08\nthis assignment, our goal was to build a\n0:10\nmore advanced AI financial tool using NA\n0:13\nNAN, which is a tool that we used in\n0:16\nlast our last mini project um or other\n0:21\nanother platform of your choice, but I\n0:22\nused NAN for this project. Um and the\n0:26\ngoal was it should analyze, explain and\n0:28\nadvise on financial decisions using AI\n0:31\nas the brain. And so\n0:34\nthis is the my work um workplace. So my\n0:39\nAI financial tool and it's a goal-based\n0:43\ninvestment advisor version two is the\n0:46\nname of it. Um and basically what this\n0:48\ntool does is it uses artificial\n0:51\nintelligence um through open AI to\n0:54\nanalyze an investor's profile and\n0:56\nautomatically generate a personalized\n0:59\ninvestment guide. Um\n1:03\nso you can see here these are my these\n1:05\nare all the uh separate nodes. So, I\n1:09\nbuilt all of this inside of NHN, which\n1:11\nis what I used for the last um financial\n1:15\ntool.\n1:17\nAnd I did this by using multiple\n1:19\nconnected nodes to simulate an\n1:21\nintelligent decision mark making system.\n1:24\nAnd so, you can see I started here on\n1:26\nthe left um with the manual trigger. And\n1:30\nhere's my LLM uh pars profiling goals.\n1:36\nAnd then you can see on the other side\n1:40\nis LM number two which is the advisor\n1:44\nand explanation. So this is towards it.\n1:46\nIt kind of works in a line um with\n1:49\nmanual trigger at the beginning all the\n1:52\nway down to the render markdown which\n1:54\nI'll I'll look at look show you guys in\n1:57\na second. Um, and\n2:01\nthe first node basically acts as an AI\n2:03\nengine where the model selects an\n2:05\ninvestment scenario based on the user's\n2:07\ngoal. And then you can see for this\n2:11\nspecific\n2:13\nscenario, if I click here, the chosen\n2:16\nscenario is aggressive growth portfolio.\n2:20\nBut I'll show you later that you can\n2:21\nchange this um given the context uh like\n2:27\nyou can do conservative or you can do\n2:29\nmoderate as well and it changes the\n2:31\noutput. Um and so that's the second node\n2:35\nwhich is\n2:37\num basically explaining what the\n2:40\nportfolio fits for the specific investor\n2:43\num and then outlines tradeoffs and then\n2:45\nflags potential risks as well.\n2:48\nUm, and then what I showed here was the\n2:52\nthe render markdown node which basically\n2:54\njust takes all that structured data and\n2:56\nconverts it into a clean readable\n2:58\nfinancial report for the user. Um,\n3:03\nand you can see this is like the hard\n3:04\ncode that I put in here. Um, but it\n3:07\nactually gives you a table here. So this\n3:10\nis the chosen scenario.\n3:12\nUm, and for the aggressive port growth\n3:15\nportfolio, this strategy maximizes\n3:17\nlong-term returns by taking on higher\n3:19\nequity exposure. So that's what they\n3:21\ncame up with. And then you can see the\n3:23\ndifferent trade-offs here. So the higher\n3:26\nvolatility as well as the larger uh draw\n3:29\ndowns and recessions as well. And then\n3:31\nfor the red red flags, um there's high\n3:34\ncorrelation with tech sector, the tech\n3:36\nsector. Um and you can see the results\n3:39\nhere. These are the different stocks or\n3:42\ntickers. So like Tesla's weight is at\n3:44\n25%. And Apple's weight is at 30%. And\n3:48\nthat's just basically the allocation. Um\n3:51\nand then it has a disclaimer here. The\n3:53\npast performance does not guarantee\n3:55\nfuture results. And then additionally it\n3:58\ngives you next steps. So reliable uh\n4:01\nrebalance quarterly. And then you also\n4:03\nwant to moni monitor inflation and\n4:05\ninterest rate rates as well. Um,\n4:09\nand so I also ran this through. Um,\n4:13\nso this markdown text is transformed to\n4:16\na professional uh client style report\n4:18\nlike this. And you can see I put it into\n4:20\na Google doc as well. Um, so here's the\n4:25\nhere's what it would look like if you\n4:26\nwere showing it to a client. Um, so\n4:29\nbasically I kind of went over most of\n4:32\nthis, but uh this is just how it looks,\n4:36\nnot in that table form, but more of like\n4:38\na if you were giving it to an actual\n4:40\nclient pretty much.\n4:43\nAnd\n4:46\nthe tool that uh can also adapt to new\n4:48\nscenarios. Um so for example if the user\n4:52\nselects conservative income portfolio\n4:55\nthe report instantly updates with a\n4:56\ndifferent reasoning and asset mix uh\n4:59\nwhich proves that it can analyze and\n5:01\nadvise dynamically. Um so I can actually\n5:06\ngo into the render markdown here um and\n5:09\nclick this edit button and instead of\n5:12\naggressive growth portfolio I can edit\n5:14\nit to conservative. And then if I press\n5:18\nsave here and then go out. Click out.\n5:24\nAnd then at the bottom you want to click\n5:25\nexecute.\n5:28\nAnd you can see at the bottom right my\n5:30\nface is blocking it but it says workflow\n5:32\nexecuted successfully.\n5:36\nUm and so now if we click in here the\n5:40\ntable and now you can see it says\n5:42\nconservative income portfolio and then\n5:45\nit gives a whole different outcome here.\n5:49\nSo you can see the weight percentages\n5:51\nchanged and whatnot. So overall this\n5:54\nproject demonstrated how AI can explain\n5:56\nand guide real financial decisions\n5:58\nmaking personalized investment advice\n6:00\nmore accessible to people and scalable\n6:03\nas well. Um, this project took me 3 to\n6:06\nfour hours and I think it was very\n6:09helpful and thank you for listening."
}