{
  "student_name": "Robby Bergeron",
  "org_defined_id": "035626927",
  "username": "bergeror",
  "email": "",
  "transcript": "Today we're going to be talking about Starbucks and their decision to invest $12 million into a roastery project. So our goal is to determine if this investment will create revenue. The hurdle rate for Starbucks or the weight adjusted cost of capital is 8.5%. Meaning that's a rate of return that we need to get back in order to make money. And the project life is 10 years. So the financial environment that we have is for the first year they're going to make $8 million. For years two through five they're going to make $11 million. And then years 6 through 10, they're going to make $9 million off this investment. The cost of goods sold is 40%. Labor is $2.5 million. Rent and utilities are $800,000. Marketing for the first year for the project will be 300,000 and then sub subsequently $100,000 each year. Depreciation is $1.2 million per year. The working capital is we have 500k invested which will be recovered in the last year. Terminal value is $3 million and the tax rate is 25%. So looking at the represent we are going to build a year 0 to 10 cash flow schedule of showing where our money is going to be. The operating cash flow equals the net income plus the depreciation. We're going to include working capital changes. Add the terminal value at the end and compute the net present value, internal rate of cont return, payback and discounted payback and the profitability index. Then we are going to compute the financial situation in which the revenue is adjusted plus minus 20%. And the weight adjusted cost to capital is adjusted to 6.5% and 10.5% which is respectively plus or minus 2%. Then we're going to compare the net present value and internal rate of return across those cases. And then we're going to advise Starbucks if the project is good for them, if they should invest in it, if the project should be completed. Looking first at the um cash flows for the Starbucks roaster, we can see that year zero represents the initial investment which shows the large negative cash flow. So showing that they are going to be net negative in that year for that investment. But then years 1 through 5 show an inflow of positive money from the investment which is a good return automatically. Most projects take at least a couple years to get a return going. So the fact that this in year one already has above positive returns is a good sign. And then so we can see that the 11 million years drop down. The 11 million return drops off after year five. And in year six there is a less return. But then this sharp increase in year 10 is when the 500,000 is added back of the working capital. So that is a insight into how this graph reflects and even though we are losing a lot of money at the beginning it is an investment and we will gain money and be net positive for those quarters or years. So looking at the computed values, the net present value is going to be 3,22,514 which symbolizes that we are going to be making that much money off of this investment which is a good sign already. The internal rate of return is 13.25% which is very good higher than our hurdle rate which is a thing that we want to mention already. Profitability index is 1.252 252 a good above one simple payback period is in year six and the discounted payback period is in year 9. So if we look at the graph we can kind of tell or start to assume some things about the graph. When we look at year six we can tell that that these start to become the discounted payback periods where that might be why the cash flows go down also because of lack of money. But it shows that these are the best periods to pay back from year 6 to 9. As in year 10, the cash flow goes up again with the added back. So those are some calculations that me and Gemini worked on which was very helpful using the financial environment. I got to learn a lot about that. So that was great. So looking back on to our results, this the net present value is greater than zero. It is $3 million which means that the project will create value. In fact, it'll create that $3 million if the financial environment holds steady the way that we think it will. The internal rate of 13.25% is greater than the weight adjusted cost of capital of 8.5% which means that returns will exceed the hurdle rate which is another positive. The profitability index is greater than one which means that $1.25 will be returned for every $1 invested. Another good positive. As long as that is above one, that is often a good sign as we will be making money. The payback period of year six and the discounted year 9 are reasonable payback periods for a retail investment as this will give them time to increase their profits while also introducing other projects to pay back for the retail investments. And it gives them a good working time to figure out how they're going to pay for it. As Starbucks is a major company, they are very trustworthy to pay back their investments. So they probably work with a lot of different investment companies making it easier for them to get the funding. So the work and then working capital is recovered in year 10. So looking at the evolve with the 20% minus revenue, we can tell that if we lose revenue, we do not want to invest in this project as the net present value would lose us $3 million and the internal rate of return would be significantly lower than our hurdle rate, which would be apparent by the net present value as we do not want to lose $3 million. Subsequently with a 20% increase, obviously we would want to invest again as we'd be making even more money. The internal rate of return would be even higher and we'd probably be making even more net present value. But with the weight adjusted cost of capital, we can see either way, we'd still likely want to invest. But when the weight adjusted co cost of capital is lower, we will get a higher investment which is something that we already know as the hurdle rate will be lower signifying that we can get a larger return off of our investment. So something to compare with especially with Starbucks is their revenue volatility with the incoming tourism and branches. Sometimes Starbucks not may not be as popular there or might be more occasional such as their winter drinks or fall drinks might be more popular than their spring drinks or tourism in some of the countries that they provide or even for the United States tourists often like to go to Starbucks as it is a easy place and a cultural significance. So, and then also Starbucks has some high labor costs which could reflect negatively, but it also probably is for the better for their um budgeting results. They have a long-term fixed real estate commitment which is good for them as actually this could be a negative as they cannot move and they their headquarters are in the United States which is also could be a location risk with some of the politics but their hurdle rate is low meaning that their profitability is probably going to be higher so it's okay and then they're a premium brand which consistency is required obviously However, since they are such a big brand, they can take such hits and often get such rewards and they're very popular. So, they just have to remember who their audience is and still try to be a premium brand and not lower down their standards too much. So reflecting on the project, we would want to advise Starbucks accepts the project as the strong value net present value suggests they will make a large amount of money in the internal rate of return. Highly succeeds the weight adjusted cost capital with almost like 5% more for the internal rate return which is great. That often signifies something that they would like to invest in. It is a strategic alignment with their premium brand experience. They're giving more. It is going to increase their coffee which is at a premium for their users as Starbucks is not cheap compared to other places such as like the local mom and pop cafe shop. It might be a little the mom and pop shop might be a little cheaper, but Starbucks is known for its premium and overall professional environment. the reasonable payback horizon. They have a large window to pay it back. Especially for a company like that, they should be able to scrape together the funds and the capital and the sensitivities show resilience under downside assumptions which is the weight adjusted cost of capital. Obviously, if their revenue went down 20%. Something would probably have to happen or that would be a long-term effect. So with the weight adjusted cost of capital, we know that shortterm that they will probably be fine for their investment. And then overall my experience with the project was very positive. Gemini was very helpful and I learned a lot through the experience.",
  "video_url": "https://youtu.be/v1VSsk-KVZA"
}