{
  "student_name": "Tirth Patel",
  "org_defined_id": "037647601",
  "username": "pate2347",
  "email": "",
  "transcript": "Hello, my name is Truth Patel and this video I'm going to be using the driver framework to analyze the Netflix cost of capital for session 9 um using the WACCC. My goal today is to connect the capital market inputs to a real corporate decision whether Netflix should move forward with a hypothetical $5 content investment using um the driver framework. I will be answering the following questions um specifically stated in the assignment. First question is going to be what is the current Netflix WACC? Second thing is what happens to the WACC if Netflix increases on incre issues sorry issues an additional $3 billion of debt. Number three is what project specific um WACC should Netflix use for US content versus international content? What does Netflix um let me see that what does Netflix WACC compare to Disney's 8.2% and Amazon's 9.5% uh WACCC respectively? And finally, what are the questions uh what capital structure strategy should Netflix follow to optimize its cost and capital support content investments? So everything I just stated was in the discover phase defined discover phase of the driver framework the five questions the hypotheticals and the overall objective here are the key inputs for analysis these are also given by in the text uh in the textbook that's this is where I got them from and I'm going to be using hypothetical inputs provided in the assignment Netflix has $200 $200 billion market uh capitalization $13 billion of debt at market value, an equity beta of a 1.3, a bond yield of 5.8% and a corporate tax rate of 21%. A risk-free rate of 4.5% and a market risk premium of 5.5%. The media industry WACCC range is given as 8 to 10%. Disney's is 8.2% 2% with a capital structure of 30 70% equity and 30% debt and Amazon's corporate WCC is given as 9.5%. My objective overall is in this stage is to clearly define the decisions what Netflix's true hurdle rate and how should we guide a $5 billion content investment especially when we consider their risk and returns and capital structure as well. The next stage um I'm going to move on to represent framework and formulas. I'm going to start with the composing cost first. The cost of equity is calculated using the capital uh capm and then we can plug numbers into that and that's going to give us a shareholders require about 11.65%. Secondly, I calculated the after cost of debt. Netflix bond have a yield of 5.8% and interest is tax acceptable at a 21% rate. So effectively after tax cost of debt is approximately 4.58%. Then I represented the capital structure using the market values not book values because WACC should reflect under current investor opportunity. Netflix's equity market value is $200 billion and its debt market value is $13 billion. So total firm value is around $213 billion. This also implies the following weights. Um, let me see. That does not make sense. All right. Next thing I'm going to do, yep, right here. Sorry. Cost of equity 11.65% after tax. Cost of debt 4.58%. Equity weight is 93.7. Debt weight is 6.1 overall. And then this answers our first question which was uh what is Netflix's current WACCC? The current is around 11.22% 22% above 8 point above 8 to 10% industry range driven by high data and equity heavy structure which next thing I'm going to do is move on to using Python to help me better understand and answer further questions um stated in our assignment. So right here I have a Python script that I used AI to help me generate and understand. I'm going to go through briefly um so I can better understand it and also show you what some of it means. Right here we have we're starting off with input parameters. Most of these values are given already. These are functions that help us calculate stuff like cost of equity after tax cost of debt and WCC. This is basically a formula that showed earlier. All this is warped in and it gives us a value. This helps us create or calculate the current WACC. So I also calculated this by hand and I'm going to use um this to validate and see if my answer is correct. And then WC after $3 billion of debt. This also is calculated by this um code and then this also looks at post project or project specific US versus international and then this is something optional that yeah I like to throw in simple leverage sensitivity right let's run this code perfect it ran let's see what yep all these values are matching up all these values are accurate to what I had in the slides which I actually calculated these are calculated by AI. This is sort of moving onto the validation phase of my numbers are matching up with AIS, which is a good indicator that something's right. And then this is the WACC after $3 billion of debt. 92.58 equity rate and then debt weight is 7.41%. After debt insurance is 11 uh sorry 11.13%. Project specific is beta is 1.2. Cost of equity is 11.10%. WCC for the US is 10.62. International beta is 1.5. Cost of equity is 12.75. International WCC is 12.14. And then we this is hypothetical. As debt increases what happens to the WACC? All right. Our code validated some further aspects and my calculations. So we can move right here. Let's see. This answers our second question um that we are asked to answer in the GitHub is what happens when we add another $3 billion of debt to Netflix. The debt increases to $16 billion. The new WACCC is now 11.13 slightly lower slight decrease due to tax shield. And then the project specific one. Let me see what the question was again for that one. What project specific WCC should Netflix use for its US content verse international content? So the US content is 10.62, international is 12.14. This means different reflect different risks. One second. Yes. So the key idea is that different projects have different systematic risk. So they should not all use the same firm YWCC. I assume that the US content is slightly safer and assigning a debate of 1.2 into while international content is riskier due to uh currency risk, regulatory regulatory uncertainty, and competitive dynamics. So, I assigned the beta of 1.5 to international. Let me see if that was given just in case to make sure I'm doing this right. Nope, it was not given. So, all right. I think according to our calculations that the beta rates are good because of the risk and then doing this our WCC is 10.62 international is 12.14. So the US content should use a WCC at 10.62 62 international projects should use a WATC of 12.14. This demonstrates that if Netflix uses a single firmwide WATC around 11%, it would overpize penaltize safer US content and then it would underpen riskier international content if we use the same WACCC overall uniformly. And then now I'm going to move into validate the competitor comparison. So and this also is going to answer the fourth question we have I believe. I guess not. Let me see. Might have missed that question. Okay. Um in the value we're basically going to look at how Netflix's WACC compares to Disney and Amazon and why. My estimates show that Netflix's current WACCC is around 11.22% which is clearly above the industry WACCC range of 8 to 10% and above. Disney's WACCC is 8.2 and Amazon's is 9.5 respectively. Um three reasons why this could be different is the first is business risk. Netflix is essentially a pure streaming and content platform. So its cash flows are significantly tied to subscriber growth and engagement. And there is also increased competition and streaming which leads to a higher beta equity of 1.3 and a slightly higher required rate on equity about 11.65. Disney by consider Disney by contrast is highly diversified. that operates theme parks, consumer products, studios, streaming services, and even much more hotels, resorts. Um, this divi this diversification leads to a smoother overall cash flow and reduces systematic risk supporting a lower beta of 8.2 respectively. And then secondly, um Netflix is currently only about 6% debt by market, which Disney uses roughly 30% debt, which interest is taxdeductible. Reasonable amounts of debt can reduce WACC via the tax shield. Netflix's heavy reliance on equity makes it more makes it have a higher WACC more heavily driven by the higher cost of equity, which pushes its WACC above Disney's. And a third is the Netflix carries a BBB plus credit rating reflecting moderate risk. Disney's brand strength is overall higher leading to a tighter credit spread and lower cost of debt borrowing. This helps Disney's WCC be lower compared to Netflix. Overall, my validation stuff concludes that it's reasonable compared to Amazon and Disney and how they are more safer. They're more diversified and this leads to a lower WACC given the risk and structure of overall Netflix. Um, I'm going the wrong way. And let's see the fifth question was and what capital structure strategy should Netflix follow to optimize cost of capital and support content investments. Um, okay. For now, I'm going to move on to the V stage. In the V stage, um I will use the WACCC estimates to answer the fifth required question and what capital structure, what capital structure, um Netflix should follow. Right now, Netflix is financed with roughly 98% equity and 6% debt, producing a WCC around 12.2. using my Python script which I ran earlier. I ran a simple lever sensitivity analysis where I gradually increase the debt ratio from 0 to 40%. Um I can go back that to that just to show as a reference. Yeah, right here. While holding um component costs constant for illustration and the pattern emerges is annuity as debt ratio increases from zero towards around 20% the WACC declines because the firm takes more advantage of the tax shield on interest which is available for example around 20% debt and 80% equity. My simplified calculation shows that WCC would be closer to 10.2% 2% because Netflix is able to use the tax shield and this would put Netflix closer to the industry WCC range closer to Disney's 8.2, Amazon's 9.5. Based on this, my capital recommendation is that Netflix should gradually increase its long-term fixed rate debt to move about 6% debt towards a more moderate range such as a 15 to% 15 to 20% debt and a 80 to 85% equity. This would reduce the WCC by increasing the weight of relatively cheap tax advantage debt and still avoiding the high financial distress that comes from a very aggressive leveraging. At the same time, Netflix should continue using project specific WCC around 10.6% for US content and 12.1 for riskier international content. The strategy balances the benefits of of tax shielding along with risk of financial distress and aligns with Netflix's um business structure more closely with competitor costs of capital. Finally, in the reflex stage, let me go back to my slides. Um, I look back at what I've learned using the driver framework, shaping my analysis along with um using AI. The most challenging part of the assignment in my uh opinion was recognizing that WCC is not just a mechanical formula. That's a Marcusbased estimate that depends on assumptions of beta, the market risk, premium, bond yields, stack rate, and capital structure. Each of these components can dynamically change a lot with a WCC. And overall, this assignment showed me that mastering WCC is essential for making strategic capital allocation decisions for acting like a corporate finance professional and who can connect with the financial theory to a real world decision at a company like Netflix. That concludes my presentation using the driver framework and AI. Thank you for watching.",
  "video_url": "https://youtu.be/KHMf6Mysm38"
}