{
  "student_name": "Matthew Pelletier",
  "org_defined_id": "036151432",
  "username": "mpellet",
  "email": "",
  "transcript": "Hello and welcome to my session nine video assignment um about our whack which is our weighted average cost of capital um assignment and we'll talk about it here. So I'm just going to walk us through what we're going to be doing. We're going to be talking about a hypothetical um investment decision for Netflix and we're going to start with our define and discover um of the driver framework. Start with define and discover. Go down to represent. We're going to implement that using some simple Python code. Then validate that with it. And then we're going to evolve this. Take it one step further. And then finally just reflect u on some stuff. So let's start out with our define and discover. We have our information that we need to first define and that is this hypothetical situation that Netflix has uh encountered is their market capitalization is 200 billion. Their total debt right now is 14 billion. Uh their debt market value is 13 billion. Equity beta is 1.3. So it's not the most volatile thing ever but it is slightly. Um the bond rating is a uh B+ pretty much is what that means and the corporate tax rate is 21% and the current stock price is 450 which uh it's a lot higher in real life but that's the hypothetical. And then just some market conditions that we kind of uh need to touch over is that the risk-free rate. So if you put money in the treasury, you'll get uh 4.5%. The market risk premium is 5.5 and then the media industries whack range is 8 to 10. So um we'll get into what it actually is and if Netflix is inside of that. And then just for some context because we're going to be uh having some questions over Disney and Amazon. Um Disney has a 70% equity and 30% debt with a whack of 8.2%. And uh Prime Video uh has a whack of 9.5%. So they're in that uh industry range. And then Netflix is considering $3 billion additional debt uh for the excuse me for the investment. So um now we're kind of into the discover part of the define and discover. We're going to talk about some questions that need to be answered like calculating its current whack. Uh determine what the whack is before and after the $3 billion debt. Um, and then we're going to evaluate uh some project specific stuff with if it's going to be an international or uh in states kind of thing. And then we're going to compare Netflix to Disney. And then we're going to recommend the uh structure strategy. So basically if they should take the debt or not. Um so just some important formulas to note is the CAPM which we talked about and the whack. So to represent we we needed to get the formulas for those. So we have those right here. Um and then now we have the formulas and the variables. We needed to put that into a Python code. So at for my represent I show my uh prompt to the Gemini that helped me. So after giving it all the information I said could you make a Python code calculating the whack given um the information that I've given you and we use the keep it simple stupid principles the kiss principles that professor Jiang talks about in class and we are needed help with the questions that we just read off and then in a perfect world the code you write would answer all these questions uh all at once. So for implement we have our um our Google collab open. We it Gemini spit out a code for us and we went through looked at the variables and their uh match up. So we're good to move on. And so now just the uh implement part with the analysis of it. We have our cost of equity being 11.65 65 and our current Netflix whack is 11.22. So it is a little bit above that industry um rating which isn't the best thing because you need a higher rate of return uh to even follow through with the project. Um but our new whack after uh we get the debt would be 11.13% which is because that tax shield. Uh in class we talked about what a tax shield is. It's when you uh take on tax and the IRS basically is like oh you have tax so you don't you don't have to pay this certain amount for that. Um and then our whack for US is the 11.22 but our international one is 13.22%. Probably because it is a little bit more risky to go international. Um, and then the competitor comparison that we were talking about, uh, it's it's Netflix's 11.22 versus Disney's 8.22. And, uh, ne Netflix has a 3% higher whack. And we need to know why this is. And it's probably because Disney has more debt and then their beta is less volatile. So, um, we want to issue the debt for Netflix, but, uh, we do see that Disney has a better whack than Netflix because it has more debt and it's able to get more of a tax shield. Um so now now that we've answered the questions and seen the code, we go down to our validate stage uh which we have the questions up and uh we basically just go through what we just talked about and all of it matches up. We answered the questions. So um it does make sense. More debt means a lower whack because you need less of a return rate. And so to evolve this, I I asked the Gemini to make me a code that could talk about maybe what if the federal rates rose or anything uh like that or if people value uh Netflix or any of these providers differently. So uh I have this insight right here, but I'll show you this code first. Uh it has this nice piece of information right here. Um so uh the first insight shows how the whack ch uh how would the whack change if the fed rate rises or the beta rises which means Netflix becomes riskier. So uh the riskier it becomes and the more addit or the um the riskier it becomes and the more uh the more the Fed rate rises. We see in the bottom right 15.68%. We see that the whack increases. So it's a bad thing if federal rates rise and Netflix becomes risky. So our second insight is that um it shows what the perfect amount of debt would be to where they're not just taking on unnecessary debt. So, we want to look at the one with the lowest whack, which would be an additional 50 uh billion dollars, and with a 1.4 beta, that gets us a 10.38% whack, which is the lowest of the um uh of the wax given to us, and it does have the most savings. So uh finally for insight number three uh it shows the shareholder value uh and how it's created by the lower whack. So basically the firm values current whack is 53.48 billion and it's optimized would be 54.45 billion and it created almost a billion in value for the shareholders if we were to take on this extra amount of debt. So I thought that was very interesting. And finally, just to reflect upon all of this, um I didn't realize international projects would increase the whack. And I guess they don't always have to, but it's more than likely going to be that way. And then we learned um in class, Professor Jiang told us about Peter Lynch and his philosophy. Um we did learn that debt is a good thing. It it's a dual dual-edged sword. uh you can either use it as a shield or you can use it uh to get in debt and to then you go bankrupt. So if you use debt in the positive ways like we talked about in class such as the tax shield, you're taking on more debt so you get more of a break. That is a good way you want to invest in assets, not invest in stuff that's unneeded or like a liability. And then finally, Disney's debt did pay off in the long run. I didn't expect that. Um, just be initially looking at it, you think debt's a bad thing, but debt is not always a bad thing. And I think that's what we've really needed to hit home. And that if you have a little bit more debt, not too much, but if you have the right amount of debt, you can lower that whack, which then lowers the required rate of return needed. So I think uh overall I would just really want to emphasize that debt can be a good thing. Um it's not hard to grasp uh your head or grasp your head around that concept once you've uh learned the stuff like we have in class. So, I thank you for your time and thank you for listening.",
  "video_url": "https://youtu.be/CcSnUQZUDoA"
}