{
  "student_name": "Max Munkholm",
  "org_defined_id": "037076884",
  "username": "mmunkhol",
  "email": "",
  "transcript": "All right, this is my session 9 assignment. I'm going to go straight into the overview of what we will be doing. So, we're going to be calculating the weight weighted average cost of capital known as way a or wacc or whack uh for Netflix in connection with a hypothetical 5 billion uh dollar content investment decision. Our analysis must deterine determine the current whack uh evaluate the impact of additional debt financing, assess project specific versus firmwide discount rates and compare Netflix's cost of capital to industry peers. So we are given some hypothetical parameters here. I'm not going to read all of them, but there's uh numbers that have market capitalization, total debt debt, equity beta, and stuff like that. We have some market conditions here. And then we have some strategic context which I'll read. Uh the strategic context include that Disney capital structure is 70% equity 30% debt with a weighted average uh costs or whack of 8.2%. And Amazon Pride and Video uses Amazon corporate whack of 9.5%. And then Netflix is considering a three billion additional debt issuance for content investment. We have some required analysis here. So let's jump in and go to my analysis. So the first stage of define discover um you know now that we have read the scenario we know that we must determine the appropriate hurdle rate for a $5 billion content investment and assess the impact of raising $3 billion in new debt. To do this we must define our inputs based on current market conditions and Netflix specific uh risk profile. So the kind of the current financial snapshot of this is that we need to balance kind of two conflicting forces in our capital structure. We have the expensive component which involves the equity. Um Netflix has a market cap of 200 billion and a beta of 1.3. This high beta tells us uh tells us the stock is 30% more volatile than the S&P 500 meaning shareholders demand a premium return for holding our stock. We also have a cheap component which is the debt. We have a relatively small debt load of 13 bill which is of 13 billion market value compared to our equity. This debt is cheap uh being a 5.8% yield and tax deductible. Um the macro environment we're in has a risk-free rate of 4.5% and a market risk premium of five 5.5%. So kind of the key discovery of all this is that Netflix is currently underleveraged compared to peers likeness Disney which may be inflating their cost of capital. So now to the represent stage we're you know before we run the numbers we're going to represent the relationships mathematically. Um and we're going to do this by using two primary models. Uh the first one is going to be the cost of equity equity um which is going to be calculated use some kapm. So we're going to use the capital asset pricing model which is K APM to to determine the return shareholders demand for the risk they are taking. The formula is RE which is cost of equity equals RF plus B which is beta time parentheses RM minus RF. Um RF is the risk-free rate and parenthesis RM minus RF is the market risk premium. The other uh formula or equation we're going to use is the whack equation. Um this equation is where we're going to blend equity and debt. However, debt has a unique advantage, the tax shield. Um because interest payments are taxdeductible, the IRS effectively sub subsidizes our debt. And we're going to represent this mathematically by multiplying the cost of debt by 1 minus t. So the formulas can be w acc= partheses e / v * r e plus partheses d / v * rd * another parenthesis 1 minus t and then close that parenthesy. That's the formula. And the components of this uh equation include E, which is going to be the market value of equity. Um D is going to be the market value of debt. And then V is just going to be the total value. So it's just E plus D. And then lastly we have t which is going to be the corporate tax rate of 21%. And it is important to note that the tax shield b that there is a tax shield benefit here. And basically this formula is going to be used to calculate the weighted average cost of every dollar of capital Netflix uses. So now let's implement these formulas using a python script. Um this calculates our baseline uh wacc and models the scenario where we issue 3 billion in additional net debt. So I had Google Gemini write up some code for me to calculate. So let's go to Google Collab where it's put. So as you can see here um it gets the inputs from the hypothetical data that I did not read but mentioned at the beginning and basically it uses that to calculate the cost of equity km cost of debt. um it calculates current weights and then uses that to calculate current uh WACCC and then also calculates new weights assuming equity value is compent and debt is increasing. So now let's look at the EP output from these steps. So step one like I said it's going to calculate component cost. This includes the cost of equity using KPM. So it uses the formula the the risk-free rate plus beta times the marker premium to calculate it. So the um the calculation gets the cost of equity to be 11.650%. Which is this is the return shareholders demand. We're also going to calculate the cost of debt um which is labeled RD after tax. And the formula for that is the pre-tax yield times the one minus the tax rate. And this calculation gives us the cost of debt after tax to be 4.582%. And interest is taxdeductible here. And then step two, we're going to do the current WACCC calculation which is the baseline. Um so for the capital structural weights, we're going to find the total firm firm value um by doing the equity plus the debt to get um 200 billion plus which is 200 billion plus 13 billion to get 213 billion. We use that 213 billion to find the weight of equity and weight of debt by divide for equity we divide the equity given by the total firm value. And then for debt we uh divide the debt given by the total for firm value to get the weights. And then we use those weights in the final um ACC calculation where we in parentheses times the weight equity uh by the cost equity. And then we add that to the weight debt times the cost debt and then this gives us a current WACCC of 11.2186% which rounded that's 11.22%. Um and this is going to be our baseline hurdle rate. Now let's go to step three, the scenario analysis. So this is post the three billion debt issuance. Um so the new structure after adding three billion in debt is the new total debt of 16 billion which changes our new weight equity to 92 5926% and the new weight debt to 7.4074%. So this gives us a new weight calculation of 11.1264% or 11.13%. Um now step four we're going to compare and conclude everything. So the current WACC that we calculated was 11.2186%. The new WACC is going to be 11.1264% and then the difference between those two is9.2 basis points. Um so to conclude um from all this information we can see that issuing debt lowers the WACCC because the cost of debt of 4.5% 4.58% is significantly cheaper than the cost of equity of 11.65%. And adding debt shifts the weight slightly forward uh slightly toward this cheaper source of capital. So now now that we've implement and found the numbers um we we'll just do a little recap that um that the code has calculated the cost of FB to be 11.65%. And then um it also has calculated the cost of debt and the current future WC. So now let's validate um these numbers have been rounded so they might be not they're not to the four decimal points um which what I was saying earlier. So let's look at these numbers generated by our model. So the current WAC is going to be 11.22% while the post is WACCC is going to be about 11.12%. So let's analyze these results. Um this shows us that we have a high cost of capital. A WACC of 11.22% is significantly higher than the media industry range which is 8 to 10% and Amazon's 9.5%. Um this is driven by the 1.3 beta and the 94% equity weight. equity is expensive and Netflix is using uh a lot of it. We can also see a leverage effect by adding three billion debt. We shift the mix slightly because the cost of debt 4.58% is so much lower than the equity 1165%. Uh adding debt lowers the overall WACC by roughly 10 basis points to 11.12%. um the tax shield um the tax deductibility of interest saves us roughly 1.2% on the cost of debt further incentivizing the bond issuance. So now let's go to the vault stage and think about you know how do we make this analysis faster and more robust for next quarter. So we can do this by using automation. So instead of hard coding inputs, we can build a Python script that pulls live beta and treasure yields uh via the Bloomberg API or Yahoo Finance. Um we could also evolve the model and include a sensitivity table. For example, if beta rises to 1.4 or interest rates drop to 4.0%, how does WACCC change? So this was would give us some dynamic sensitivity. Um for projects uh specific WACCCC we could more focus on whether it's domestic or international content content. So for the domestic content we would just use the calculated WAC of 11.12% and the risk profile matches our general corporate operations. Um but for international content we should not use 11.12%. U this because international production involves currency fluctuation and geopolitical risk. So we need to add a risk premium of about like plus 2%. And so that would make kind of like the hurdle rate for international shows around uh to be around 13.1%. Um if a Korean or Brazilian production doesn't yield 13.1% it destroys value. So now let's go to the LA uh the reflect stage and just reflect on the data. And uh well by reflecting on the data we can draw three main conclusions. So we have a a little comparison first. So the diff the Disney difference says Disney with the 8.2% uh WACCCC uh they utilize 30% debt while Netflix was 11.22% WACCC only utilizes only six they only utilize only 6% of debt. Why is this? It's because Disney optim optimizes this capital structure better. They use cheaper debt to fund operations. Netflix is paying for safety by relying on equity, but it costs shareholders more in required returns. So that's why there's that uh Disney difference is what I'm calling it. Um now let's move into some strategic recommendations. So we need we should approve the debt issuance. The $3 billion issuance is financially sound. It lowers our WACC from 11.22% to 11.12% and takes advantage of the tax shield without significantly increasing bankruptcy risk given our low leverage. Um we should also be aiming to gradually increase our debt ratio closer to the industry standard. So that would be perhaps like 15 20%. Uh this would further drive down WACCC towards the 8 to 10% range making some content projects net present value positive. And lastly, for the hurdle rates, we should use 11.2% as a hurdle rate for the new 5 billion investment package. And if the content is international, we need to adjust this hurdle rate to 12.5% to 13% to account for the forex and geopolitical risk. So basically from all this our final verdict verdict is going to proceed with the three billion debt issuance to fund the content as it is the most efficient use of capital which is what our Python code has showed us based on the WACCC numbers and everything else in the hurdle rates. So thank you for listening. That is the end of my presentation.",
  "video_url": "https://youtu.be/B0aHuTOGNPU"
}