{
  "student_name": "Michael Thorpe",
  "org_defined_id": "037454602",
  "username": "thorpe11",
  "video_url": "https://youtu.be/qPE3hOz-Hkk",
  "transcript": "This is Michael Thorp and this is my session 12 driver analysis um which is the business valuation and financial modeling uh regarding KKR and uh their acquisition of Panera and to start we'll go to our define and discover um and in this what I did um like I always do is I inputed a prompt and I said I'm working on a valuation of Panera Bread um for a potential KKR takeover uh using driver framework which my Gemini is uh familiar with and I need you to act as a very patient guide and teacher in my uh discovery in uh this market. And so\n\nwhat I needed was to determine a defensible bid range uh for Panera Bread that KKR uh could afford and um made sense to both them and Panera. I needed to uh balance the financial discipline of KKR against their strategic biders like Starbucks and McDonald's. And I went ahead and copy and pasted the prompt. Um it's numbers. Uh and so we have a scale $6 billion revenue growing 8%. uh 900 million EBI TDA uh 400 million net income across 2100 stores digital sales are already 50%. Um then there's market references. Uh the industry PE is 22x precedent. Uh EBITDA multiples of 12 to 15X. Uh and then Chipotle trades at 35 times their PE and McDonald's is 25. And so uh the capital assumptions um the industry WACCC is 9% management wants the 10% rollover and then there's strategic biders like Starbucks and McDonald's that closing in um and there's growth uh 500 new stores in 5 years a digital mix to 70%. There's a dinner and catering expansion and early stage international\n\nAnd so\n\ngiven all this, I moved on to phase two uh which is represent. And so what we need to do um what me uh in general determined was that we need to calculate the uh DCF valuation. what's the base, the upside, the downside uh using free cash flow projections. And then we also need to calculate relative valuation using uh trading comps and ratios and relevant transactions.\n\nAnd so knowing this um I went into Gemini um and said I need a Python code implementation uh for this acquisition. I wanted to provide a DCF buildup which will show the free cash flows each year. Like I mentioned in the represent stage uh we need the DCF valuation. Um it also provides a a valuation uh bridge between uh enterprise value into equity value and finally share price. And so this here\n\nI was able to generate this code um which when ran will generate these reports. Um report number one is the DCF intermediate calculations for the financial buyer which is uh as we know the financial buyer here is KK and it shows revenue every uh year in uh millions. It shows the EBI, TDA, DNA, um free cash flows, the discount factors, present value, the uh future free cash flows. Um and then report two shows mathemat mathematical valuations um for each of the buyers. Um and so as we can see the equity value um for kicking is 8.5 billion and it would be 11 for 11.4 for uh a strategic buyer such as Starbucks or McDonald's. And with this code,\n\nI scroll down here in Python.\n\nUh the first the DCF table we started with revenue. We applied the 15% EBIT TDA margin and then applied the 25% tax rate and this just proves that cash flows are strictly operational. And then I also displayed the discount factor to verify that cash flows in year five are worth significantly less uh on the dollar than in year one. Um which shows the time value of money there. And then report two um just bridges the gap between the theoretical DCF and the actual bid price. Um and what's important here is that the terminal value represents uh the majority of the enterprise value which is uh standard risk in DCF modeling which is why I used a conservative 3% growth rate uh rather than aggressive. Um\n\nand then from there um I wanted to validate and uh with the DCF validation um the present value of the terminal value is around 65 to 70% of the enterprise value um which is standard for a mature company like Panera whereas 90% model would be too sensitive. to longterm and 40% would be too focused on short-term. So 70% um confirms that uh the model I generated is is balanced. And then uh for numbers um the output here shows the financial buyer in premise value of $14 billion which when we divide that by the 900 EBIT TDA it's an implied multiple of around 15x uh which aligns with the uh transactions given here in the market references which is 12 to 15x in the assignment. Um so yes the DCF is is pretty grounded um in market reality. Um and then for my evolve um this model can really be utilized in in many different ways and I'm sure I can't really cover them all but um it could be flipped um and utilized on the seller side. So if you were Panera and looking um looking at PKR and and uh trying to see what you can get out of this transaction, um you can use these valuations to reject offers from buyers who are trying to lowball, who aren't uh meeting the requirements that uh that this shows the uh valuation is. So, and then we could also use the model and scale it down to value like internal projects like say there was uh 500 new stores. Um we could get their their values if we have their information. Um and so after uh generating this code um my final\n\nuh recommendation here would be\nfor the financial buyer uh which is KKR um we need to not overpay um and so know that the DCF was on improvement and so uh we should cap the bud at 14 times the EBI TDA um which is 12.6 6 billion. Um, anything higher requires uh expansion. Um, and then the management role, keeping the 10% equity is really important uh because it will um align the incentives for the uh IPO exit. And then for the strategic buyer uh like McDonald's and Starbucks, you know, they can pay more because uh they can cut some of the overhead costs like uh human resources and um it supply chain. They already have that and they can they can keep using that and so that threatens KKR uh because you know they they have more to spend on this. they can bid at 16 to 18 times the EBITDA which would be over 14 billion which is just too much. So KKR can't win that price war. Uh they really need to focus on the speed of this purchase and execution and keeping that management autonomy. So my final recommendation would be for KKR to open um at 12 billion which is uh what Jim and I uh and I have collaborated to come together and find which is 14x uh 14 times that EBI TDA. Um, I think honestly, uh, maybe even going down to 12 billion or a little less and seeing just where, uh, they were at for the acquisition. Um, and, you know, hopefully starting lower. Uh, we can walk away at around 14 billion. Um I think anything over that is a little bit too much uh given what we've discussed but you know anything anything we can do to acquire it for less if we have to start lower to maybe drop them um but at 14 billion the returns drop below the 20% uh threshold unless there's um unrealistic factors come into play. So my final recommendation recommendation for KKR would uh be to put in the purchase price of $12.5 billion. That would be a good acquisition at that price. But if it gets above 14 billion, I think that's where it becomes too much."
}