{
  "student_name": "Gavin Hannon",
  "org_defined_id": "035642219",
  "username": "ghannon",
  "email": "",
  "transcript": "Hello, I'm Gavin Hannon and I'm here for the session nine assignment. Uh so the assignment for the today would be we need to calculate the weighted average cost of capital for Netflix in connection with a hypothetical 5 billion content investment decision. Your analysis must determine current WACC. Evaluate the impact of additional debt financing. Assess project specific versus firmwide discount rates and then compare Netflix cost of capital to industry peers. So we have the following uh information for Netflix. The market capitalization is 200 billion. Total debt is 14 billion. The debt is 13 billion. Equity debt is 1.3 or equity beta is 1.3. Bond rating is BBB+. The corporate tax rate is 21%. The current stock price is $450. The market conditions, we have a risk-free rate at 4.5%, market risk premium of 5.5%. And media industry um WACCC range of 8 to 10%. So strategic context we have Disney's capital structure is 70% equity 30% debt with a WACC of 8.2% and Amazon Prime Video uh uses Amazon corporate which has WACCC of 9.5% or%. And Netflix is considering a three 3 billion additional debt issuance for content investment. So our define and inter define and discover stage. Our objective is to perform a comprehensive financial analysis for Netflix regarding a hypothetical $5 billion content investment decision. This require this requires calculating the weighted average cost of capital under different scenarios to to determine the appropriate discount rate for evaluating the profitability of the investment. We have some key constraints. All calculations must use the specific hypothetical values that were provided. Uh the post financing uh calculation must specifically incorporate a 3 billion $3 billion additional debt issuance. The cost of equity must be calculated using the CAPM model and the analyst must consider the stated WACC and capital structure of industry peers. In this case, we're doing Disney and Amazon. To be successful, we need to uh calculate accurately the WACC and we must be and they must be mathematically correct. The completeness all five required analytical components must be addressed. We need to do the current WACCC WACC after the three $3 billion debt issuance the evaluation of project specific WACCC comparing it to then compare it to Disney and then give a recommendation the benchmark uh internal consistency check we we need to ensure the calculated cost of equity is higher than the after tax cost of DAP and that the WCC falls between these two costs. We need to compare the calculated Netflix against the provided industry data. And we need to compare Netflix's resulting capital structure against the competitor to formulate a data driven recommendation on the optimal leverage. So important important information before getting started is to we need to calculate Netflix's current WC. This determines the company's current cost of financing using the capital asset pricing model for the cost of equity and the after tax cost of debt. uh cost of equity. It tells us the price a company pays for using shareholder capital and conversely the minimum return shareholders should expect to justify their investment. Cost of debt, it represents the return acquired by company's creditors to compensate them for the risk of lending money to the company. And it's important to know the tax shield effect in this problem. It refers to the reduction in a company's tax payments that results from deductibility of interest expense on debt. This makes the effective cost of debt cheaper than its nominal interest rate. Now we go to the represent stage and this is where we are going to outline our our strategic analysis. So first we are going to input data and component calculation. We need to gather all the financial parameters that were given here. And we're going to use that to calculate uh the cost of equity using this uh equation and then the after tax cost of debt using this uh equation. Then we're going to do calculate the current WACC calculation for Netflix. We got to determine its current weights. Right now the only uh weights we have is 21% uh for the tax rate and the total firm value is 213 billion which was 200 million plus the 13 billion debt that we Netflix had. And then we're going to use this formula to calculate the WACC. And then for the new WACC calculation, we're going to determine the new weights, which is when we incorporate the $3 billion debt increase. And then we're going to calculate the new WAC formula using the same formula up here. And then after all that's said and done, we're going to we're going to argue for risk adjusted rates. Uh we're going to compare the calculated uh WCC to Disney and Amazon's and explain the differences. and then finally give a recommendation based on those uh differences. So now we're here in the implement stage. So here I did a code in collab to show my analysis. First step is to define a discover stage. So this stage is going to define what our objective is as shown down here. It says calculate Netflix's current and new WACC then evaluate project specific WACC and then compare then. So I got that right. Uh stay step two is represent. I'm just going to go down a it created a list for me to follow and follow so I know how to analyze my data uh in a correct way. And then finally is a step next is a step three the implement stage and this is where it does all the calculations. So here you can see it calculated the cost of equity using this formula the after tax cost of debt using this formula. uh we then it then it went on to calculate Netflix's current WACCC using those two formulas or those two what it got from those two uh formulas and it you and it did here's the calculation for that which is right here the WACC current equals W current time the RE plus the WD current time the RD ET and then it would it's going to calculate Netflix's new WC after the three $3 billion debt issuance. So it's going to take the $3 billion debt into account and then calculate using the same formula and then it's finally going to evaluate project uh project specific WACCC which is the uh the US content versus the international content. So here we can show that the code worked that it the cost components for Netflix. So the cost of equity I calculated at 11.65% the after tax cost of debt 4.58%. Uh Netflix's current WACC was calculated as 11.22%. Which is relatively high. And then it's going to do Netflix's new WAC after a $3 billion debt issuance. And it's got a new equity weight of 92%. And a new debt weight of 7.41%. And it's new WACCC is 11.13%. Next, it took in the project specific WACC uh examples. So it put US content had a beta of 1.1. So it had lower risk and had WACCC of 10.11%. And the international content uh had a higher beta of 1.5 and a WATC of 12.14%. So it's the international content has a much higher risk than the US content. To validate this information, uh, Collab was able, uh, validated the data by comparing the baseline firmwide WACC of 11.13% to the current WACC of 11.22%. No new debt. So since 11.13% was less than 11.22, 22. This is logical because new debt is cheaper than equity due to the tax shield. And this validates the economic logic that if debt is cheaper than equity, adding a small amount of debt should decrease the overall WACC. So if the cost of new debt is less than the original, so this shows that the cost of new debt is less than the original WACC. It also compared the project WACCC of 12.13% to the U content 11.13 higher rate uh correctly reflects greater international risk. This val validates the strategic risk logic and it projects with greater risk that projects that greater risk uh investments should have a higher required rate of return uh to compensate investors for that risk and having the international content be more than the US contest confirms this. Next is the evolve stage. This is where it's going to calculate um the Amazon and Disney's WACC here. It's got the calculations here for Disney and Amazon here. So, as you can see here, the calculated WACC for Disney was 7.41 or was 8.2. 2 and for Amazon it was 9.5. So, so we we need to now compare those. So, Netflix WACC was at 11.22%. This is because it had a high beta of 1.3 which leads to a higher cost of equity which had 11.65%. And this reflects high perceived business risk and stock volatility. So compare that to Disney's WACCC of 8.2%. The lower WACC is due to more capital structure which has because it has 30% debt and it like likely has a lower beta. So it benefits significantly from the interest tax shield. So when comparing these we were able to determine that Netflix is at a competitive disadvantage compared to Disney and Amazon and it requires a higher return on projects to create value. So what my recommendation would be would be I would advise Netflix to increase its le leverage to capital capture the tax benefits of debt targeting long-term debt weight to I would advise it to get at least to around 15 to 20% of its capital structure because it's currently sitting at 6.1%. So an increase would lower the WACC and closer align its financial policy with the industry industry's optimal optimal leverage profile while also maintaining flexibility and lower risk than its competitors. I can also see that here that the visualization that uh Collab created for me that Netflix is current currently here at 11 just above 11 below 11.2 two and if it were to incorporate more debt which would be the more optimal WACC and you can see that it would decrease the WACC if it had more debt debt to capital ratio. So to reflect what we learned was that we successfully determined key metrics for Netflix and the benchmarks them against the industry of like Amazon and Disney and we were able to determine that the current WACCC for Netflix is too high. The high cost of equity is the main driver and it needs depth to lower the WACC. My key takeaway uh takeaway is that understanding that Netflix's WACCC of 11.22% 22 2% created a significant competitive disadvantage against its peers like Disney and Amazon. And I I find I took away that companies need to find a find ways to reduce their WACCC so that they can have a higher firm value and have a competitive advantage against their competitors.",
  "video_url": "https://youtu.be/sjgCS-5jn1c"
}