{
  "student_name": "Michael Gjorseski",
  "org_defined_id": "036015839",
  "username": "mgjorses",
  "email": "",
  "transcript": "Okay, so this is my session 9 assignment and I'm going to be bouncing around a little bit, but here we start. Um, so we want to calculate the weighted average uh cost of capital WACC for Netflix in a connection with a hypothetical $5 billion content investment decision. Uh, we must determine the current WACC or I don't want to call it whack, but WACC and evaluate the impact of additional debt financing. um assessing project specific versus firmwide discount rates and comparing Netflix's cost of capital to peer uh industry peers. So we have a lot of these numbers which we will come back to but I'll just go through them really quick. Our market market capitalization of 200 billion our total debt uh the book value of 14 million the debt market value of 13 billion equity beta of 1.3 um bond rating of PBV plus uh 5.8 8 corporate tax rate of 21% current stock price of 450 and then our market conditions are um risk-f free rate is 4.5 market risk premium is 5.5 and media industry range is 8.8 if I move my camera here um Disney's capital structure is 70 um% equity 30% debt the WACC of 8.2 two and Amazon Prime Video uses um Amazon corporate WACCC of 9.5 and then Netflix is considering a three $3 billion additional debt uh issu issuance for content investment. These three at the bottom right here for strategic uh content we will come back to and obviously all the rest of the numbers we will use again but those we'll come back to in a second. Um so our represent stage just to go through a couple of the um principles that we'll be using and a couple things that will come up in the implement stage. The WACC principle is company's cost of capital um company's cost of capital equals the weighted average of debt and equity cost. So like we'll come back to that later like the $200 of equity that we have compared to the 13 million or 13 billion debt. That means that currently in Netflix we have 94% equity and 6% um debt. So that's kind of where that comes in. And then the formuling components, this is the overall equation that blends all the other components together. And we'll obviously go through that cuz we're going to calculate that in a bit. Cost of equity using the CAPM. Uh this kind of answers what return do our stock shareholders demand. So like if we if if if they're demanding a certain um if they're demanding a certain percent of return and we're below that then they're risking our own stock. If we're above that it's almost paying for itself. The cost of debt answers what is true what is the true effective cost of our debt after account uh economy for tax savings. Capital structure analysis answers how does our mix of debt and equity financing affect our WACCC which we'll talk about later as well because um that number is used directly in calculation. So if it's higher or lower it will change everything. Tax shield is the reason why we care about the after tax cost of debt. This is tangible value created by the interest deduction. So this is kind of a um this is kind of money that we save from our tax shield from debt which we will talk about again at the end which will show like if we increase our debt a little bit it's a good thing because increasing our debt can save us some money using this tax shield effect but if we increase it too much we can almost go bankrupt which I'll bring I'll touch on again later and the hurdle um as a hurdle rate it's the it's the ultimate application of the um WACC or weighted average capital cost of capital And this is kind of the uh go or no go decision. This kind of talks about where the sweet spot is. So yeah, these are all the components that we're going to talk about. And then I'm going to leave this for a second and go into show. So I had um I had AI which I'll show up Gemini build me this code. So it defines the uh defines a variable calculate cost of equity which shows the risk-free rate the beta and the market premium which we'll come back later. This returns the risk-free rate plus beta times the market risk premium. And then we also calculate the uh WACC which shows the bottom. And this does run which I'll come back to. But yeah, this kind of shows our initial calculations. The value is the equity plus the debt and the uh weighted equity is the equity divid by the value and the weighted debt is the debt divided by the value. the after uh tax cost of debt which is R uh is our R&D which we showed sorry which is the um oh I'm blanking that's not the risk rate sorry I was going to go here anyway the R&D is the cost of debt and the R&D is the cost of equity my bad um yeah and so then here's the calculation here's the full calculation too. I was going to switch back and forth here because I think this screen right here is easier for me to understand once the numbers go in, but this is the full weighted average cost of capital um uh formula which is shown in the collab. And yeah, so these are all this this is all the main this is all the number. Risk rate is 4.5. Uh market risk premium is 5.5. Equity beta is 1.3. Market cap is 200 billion. Um market value of debt is 13 billion. Cost of debt is 5.8%. 28% tax rate is 21%. And then these are kind of all where they fit in. And then at the bottom it shows that the cost of equity RV is uh it uses these numbers the 4.5, the 1.3 and the 5.5 to get the cost of the cost of equity of 11.65. And the this one uses these numbers the 200 billion or the 9.4% as we said of the market share 13 billion which is the value of debt which is a 6.6% 6% pre-tax cost of debt and the after tax cost of debt. And it uses those to get a total um WACC of 11.2. But here, this kind of shows it a little better, I think, cuz it shows where these numbers come from. So the RE um comes from the risk-free rate plus the beta times the market premium risk. So it's 4.5 * 1.3 * uh 4.5 + 1.3 * 5.5 um which is 4.5 + 7.15. And we'll recalculate this later when we have a $3 billion increase in debt. But this gives us an R&D of 11.5. And then here are all the numbers again. The weight of equity E of like we showed 200 the value which I can touch on is um 200 billion of the um equity that we have plus the debt. So it's 213 billion. So the weight of equity is 200 plus 213 billion. And then the weight of debt is 13 billion divided by 213 billion. And then to calculate this, all our numbers go in here as we show, which I don't really I don't really like that it changed some numbers into percent and some numbers not. But when I checked it, I I changed them all into the same. But this is the 93% from our weight of equity. This is the RF and then the 6.10 is the uh weight of debt times the 5.8 which we had before which is our R&D times 1 minus the 21 which is our tax RT here. And that's where that gives us those numbers. So yeah, this is my Google Cloud for that. And then then I talked about the impact of the $3 million additional debt. And give me one second. It's a little loud in here. This is the second um this is with the $3 billion increase in debt. This is the um this is the additional $3 billion in debt. So this is it's it's pretty much all the same. Um compared to this one, most of the stuff is very similar. Um but the weight here like the value stays the same, the calculations stay the same, the after cost all stays the same, the calculation for WACC stays the same. Um the only thing that really changes here is maybe a little bit. The only thing that really changes here is the beta, which we'll go through the calculation on this. Like I said, I think it's just easier. So this is how it shows the beta calculation. So the unlevered beta. So it uses the one it plugs the 1.3 in to do the 1 + 1us the tax rate times the debt to equity ratio. So it's 1.3 / the 1 + 1 -2 * 13 / 200. And it uses this to get a beta of u of 1.2365. So now it uses this to plug it back in and it shows the new debt is 16 billion. So the new debt to equity ratio is 16 billion divided by 200 which is 008 instead of the 61 or 0061. So then the new beta is the U that we found. So the 1.235 365 times the same but instead of the 61 or 0061 it's the8. So even though it's a very very minor switch uh it does change the entire calculation very very slightly. But um so now we're calculating the new cost of equity ratio which is the 4.5 plus the new beta times 5.5 which is 4.5 plus uh 7.23 which is 11.65 which is higher than the or 11.73 which is higher than the 11.65 previously given. Then now we're going back through here and calculating the new weighted average which again gave it half in um um half in the um percentage half in the knot. But yeah it gives us the um 0.92 which is a new equity to value ratio the 200 divided by 216 and the 16 divided by 216. So it gives us new values here and then um calculates all that through um and yeah and so it changes it by it lowers it actually by 100th the 11.22 versus the 11.21. So there is a small benefit from adding a cheaper tax yield from the tax shield which I talked about earlier because this um more the more debt the more the tax shield is in effect and the more we have in like savings quote unquote um yeah and so that's where this comes into play and this shows all the new parameters and then um there is a new cost of debt percent it's assumed increase of 2 to 6% from five yeah from 5.8 eight and then this kind of shows a new unlever of beta. This is all the calculations the relever of beta all the calculations and then this also runs through. So step one is to unlever the beta to get a new beta of 1.2 2 and then plug it back in with the new debt to equity ratio to um 1.3147 to get the new cost of equity the R re and to plug all that and then to plug all that back in uh with the new equity weight and new uh debt weight and then to get our final calculation of 11.21 instead of 11.22. So then going back to that was our infancy to go back to valid datas to talk as we said we'd come back to the previous companies. So our WACC hypothetically was 11.2. Our um our equity was 94% and our debt was 6%. Disney's is WACC was weight of uh average cost of capital is 8.2 and their debt or their equity 70% compared to their 30% debt. Amazon is the 9.5 and their um equity debt ratio wasn't given. The industry average is eight or 8% 10%. So the reason why ours could be higher is because we're a very um high growth high-risisk industry like it says here. Um we have the one like way of going like we have our structure and we do streaming like we don't really do a lot else like Disney like Disney's um Disney's risk is a lot lower because they're so diversified. like they have so many other ventures and they're such a big company that like they're not going to have as much risk cuz if one thing fails like they have other sources of revenue coming across across so they're stable so their risk is blended so they have a lower overall lower beta and then Amazon um is masked by low risk because of their high margins um but yeah so that's why ours is higher and ours is allowed to be higher and it's higher the uh industry average because we have more because we're so straightforward like we do Netflix doesn't do other things they're starting to do other games. They're starting to add themselves into the uh um live TV and all that like other companies have, but right now they're just a streaming service and that's all they really provide. So yeah, that's why our numbers are still in a good range and they still make sense compared. And then to evolve this um we can use this uh number that we found for the WACC to um give to an analyst or an investor or the company. If someone's trying to find the enterprise value or the total value of a business, they can use a dis discounted cash flow model to find this using the numbers that we give them. And then the goal of um the goal of CFO's objective is to find the optimal mix of debt and equity um that minimizes the WACC because as we said, if that number is lower, if that if we have um if we have an incoming equity of less than that, I got to go through it right here. A lower WACC means a higher company valuation. So adding, this is what I talked about before, adding some debt is good. Um, it's cheaper and has a tax shield, so it lowers our percentage, but adding too much debt increases bankruptcy risks, which um makes both new debt and equity more expensive. Our beta goes up um causing the um when average cost of capital to rise. Like I said, this is our central metric used to find the sweet spot. And then this is what I was talking about before just to kind of wrap it all back together and just kind of show why it's uh important. So we accept projects that have that their percent is greater than WACC. So you're generating a surplus of return. The market is charging you 11.2 for capital. That's our weighted average cost of capital. So um if we found a way to invest it at 15% for example that means we have 3.78% spread is new. That's a tangible value that we've created for our shareholders. That means that we're showing that it's the the project is almost paying for itself in a way because that extra money that we made, it's it's kind of just paying on its own. And then rejecting the projects, anything that's lower than the 11.2% is something that we would reject because in the eyes of our shareholder, it's showing that we're not actually making money on this and we're failing and that um we can either go bankrupt or we can lose money or they can lose the share price can go down. So for them um having this number as it says here kind of takes away the gut feeling um cuz you have numbers that show so it shows a clear financially driven logic for the entire organization. So every dollar of capital that we deploy must u earn to keep by clearing this hurdle. So that's where we talk about the um that's where we talked about the price hurdle here. It's a go no-go decision not just a what if. So, if we have something that's lower than than our um weighted average cost of uh capital, we shouldn't do it because we're obviously going to lose money. But if we think it's going to be higher than that, our project to invest, then we should cuz then we're um going making money. And then this is also something that um Google Gemini gave me to kind of just show it in a in a visual way. Um, and it gave me some points here, but it gave me all of our data that we put in and this the minimum WACC is given. But, uh, yeah, it shows the purple line is the weighted average cost of capital. Uh, cost of equity, the R& after cost of debt after tax cost of debt is there. Um, the cost of equity is always increasing as the leverage goes up and shareholder demand a higher um, return for the increased risk. And after cost of debt, stays very low at first but then jumps um as high high debt levels increase um making credit rating uh sorry as high debt levels lead to uh credit rating decreasing making borrowing way more expensive and then the uh weighted average cost of uh capital is the U-shaped curve the purple one and it originally falls as sheep debt is added and it rises the cost of financial distress um higher R& R&D overwhelms the tax benefits So this is kind of just a visual I can show and this is kind of cool because you can change all this increase everything decrease everything and you can use this to find uh to graph out anything for different companies as well. But yeah so going back after all that um that was my driver method and that was me doing the calculations for Netflix and comparing it to the rest of the market with the increase and decrease of debt. still. Yep. Thank you.",
  "video_url": "https://app.screencastify.com/watch/MTCzqzqcbTemH2PKZsYn?checkOrg=6f011b1b-d4b6-4119-b7c9-d036b6594800"
}