{
  "student_name": "Ella Brummet",
  "org_defined_id": "037237297",
  "username": "ebrumme",
  "video_url": "https://youtu.be/LOIZ7QN8N50",
  "transcript": "Hi, my name is Ella Brummet and today I'm\ngoing to be filming my session\n11 assignment. So, let's go ahead and\nlet's get started. So, for the session\n11 assignment, I'll be using the driver\nframework to um frame my analysis of\nthis case. So essentially the objective\nof this is the decision analysis is\nmeant to make the final recommendation\non whether Apple's hypothetical $90\nbillion share repurchase creates value\num\num relative to the specified alternative\nuses of cash. Basically it needs to\nbalance the goal of creation value as\nwell as the practical considerations.\nUm so that's generally kind of just like\nthe overview of what I'm going to be\ntalking about today. The scope and\nhorizon, the unit of analysis that we're\ngoing to be using is Apple. Um the time\nframe is going to be the buyback is\nproposed over one year, but the analysis\nmust also consider the long-term capital\nallocation\num discipline and strategic fit for all\nof the alternatives.\nFor whom exactly are we doing this for?\nAnd this is for the um basically the\nindependent analysis for those who are\nneeding a clear datadriven insights and\ntrade-off company and trade-off\ncomparisons.\nSo the constraints in this is that the\nmaximum buyback size is 90 billion which\nhas to be compared against the existing\n165 billion liquidity and 100 billion\nannual cash free flow.\nUm the share structure that must account\nfor 15.5 billion shares outstanding 6%\ninstitutional ownerships and management\nholdings as well as employee stock\noptions and then we have the success me\nmetric. So essentially this is going to\nbe um getting precise quantification for\nstakeholder outcomes a clear uh creation\nof this and to deliver the correct\nrecommendation.\nSo here's like a little bit of a\nbenchmark for what we're doing. We have\nlike the ESPS\nimpact, the leverage shift, and the ROCI\nstrategic fit. So this essentially is\nlike different things we're going to be\ncalculating to base our decision off of.\nSo for this video, um I'm going to be\nusing the driver framework as I\nmentioned before to really take a deeper\nanalysis into this and be able to give a\nproper recommendation. So first I'll\nstart with the defined stage. So the\nobjective is to determine whether\nApple's hypothetical 90 billion share\nrepurchase creates value um relative to\nthe specified alternative uses of cash.\nUm the final recommendation must balance\nthe value creation the stakeholder\nincentives and other things that we\nalready talked about. So the key\nconstraints for this is going to be the\ncapital limit that there is um which\nbecause the buyback alternatives like I\nsaid um is a little bit um\nlike the like the liquidity in it is a\nlittle bit um different than what we are\nworking with. Does that make sense? Um\nthe stakeholder structure. So basically\nwe know that it has to account for 15.5\nbillion shares as well as institutional\nownership the managerial and the\nemployee options. That's very important.\nAnd\num basically the data inventory that we\nhave here is just the core data that we\nwere given um but also specific\nassumptions to the acquisition\num and R&D\nneeds to be defined. So the analysis is\nsuccessful.\nUm and then here's a little bit more\ninto the benchmark plan. Um\nso yeah, next is more of like the key\ninputs and assumptions that we're\nmaking. So this is more of the discover\nstage. Um, so we have, like I said, the\nmodel, the $90 billion buyback, the\nshares repurchased, which we're going to\ncalculate this using the 90 uh billion\ndivided by 180\num million equals\num the 486.5\nmillion shares. New shares outstanding\nwas also calculated um by 15.5 billion\nminus 0\nuh 0.4865\nbillion which means be about 15 uh\nbillion shares give or take. So from\nfinancing we have to assume that the\nbuyback is financed entirely with\nexisting cash or liquidity um leading no\nimmediate change in debt. And then we're\ngoing to assume that employee options\nlike the strike 170 are currently in the\nmoney and will have an impact\num on diluted ESTs calculations\nespecially if the share price rises. So\nnext go into the represent stage which\nis the second stage of the driver\nframework. So we have our baseline\ncalculation\num or baseline case I'm sorry. Um and\nthis is just those three things I we\ntalked about using the formula wise. Um\nthe scenario setup basically want to\nknow the to we want to be able to toggle\nbetween the five. So we have buyback um\nwhich is going to decrease our shares\noutstanding the special dividend which\nis going to decrease cash as well as the\ndividend output\nuh or payout I'm sorry acquisition um\nwe're going to decrease cash increase\nour assets and goodwill um assumed the\nnat\ndebt reduction we're going to decrease\ndebt as well as decrease the interest\nexpense\nand then in R&D See, we're going to\ndecrease cash. So, some of our core\ncalculations. Um, these are some of the\nnew ones that I learned. I wasn't\nactually aware of some of these. So, I\nthink it was really interesting to be\nable to dive deeper into this. Um, so\nfor example, this is like some of the\ncalculations that were in the implement\nstage. So the third stage, so we know\nthat the current net income and the\nmarket cap and this is how we calculate\nit here on the screen. Um so essentially\nwe're going to assume that the uh P like\nE of 30 is base\nsorry and the EPS/ the net income which\nwe will normalize. So we're going to use\na simplified net income. So our shares\nrepurchase is 486.5\nmillion new shares outstanding. Um again\nthis is what we calculated before above\nthat we were just talking about. Um so\nthe key calculations so the debt\nreduction impact we can assume that the\naverage interest rate on um 110 billion\ndebt is 4%. The interest savings are 90\nbillion times our 4% which gives us our\n3.6 billion. Um after tax savings, we\ncan assume a 25% tax rate um because\nthat's usually just the company or like\ncorporate standard\num is the 3.6 billion * 1 minus the 0.25\nwhich equals 2.7 billion. So therefore,\nour new um new net income is going to be\nuh 95.6 billion plus the 2.7 billion and\nwe're going to get 98.3\nbillion.\nAnd then we have to do our new EPS\nincluding the debt reduction that we\nhad. So we have to go ahead and divide\nit by that debt that we accumulated\nthroughout this which is going to equal\n6.3 billion or 6.34 billion.\nUm and then again this is the leverage\nshift. So this is the new debt that we\naccumulated. Um so this would be the 110\nbillion minus the 165 billion equals\n55 billion to then it goes into this. So\nmeans the less net um leverage. So\nessentially here for our validate um\nthis was um basically it was saying\nwe're just making sure that our EPS um\nmakes sense. So, we know that this the\nbuyback is slightly more um EPS\nassertive in the short term. This makes\nsense cuz Apple has a negative debt\nposition, meaning its cash interest is\nlikely higher than its debt interest\nexpense, making the share count\nreduction the dominant factor, which I\nthink that was like super important to\nput. Um, and then we know that the\nbuyback increases the financial\nleverage, which is typically negative\nfor bond holders as the risk increases.\nSo um I feel like this is all really\nimportant and therefore it validates the\ninformation that we have given. Um so\nbasically we said that the results align\nwith the expected financial theory\nregarding leverage and bond risk.\nSo um on to the E stage of the driver\nframework we have evolved scenario. So\nwhat if the stock price increases by\n10%. So, this is just something that I\nwas thinking about um and I was able to\nkind of work with AI here a little bit\nto come up with this. Um so, basically,\nif you were to kind of redo some of\nthese calculations, we could conclude\nthat the increased share price makes the\nbuyback less efficient. So, there's\nfewer shares required or retired\nresulting in a slightly lower EPS um\naccretion. So this demonstrates that the\nmanagement timing of the buyback\nexecution is a critical factor in value\ncreation.\nUm and then to reflect on this, I didn't\nknow a lot about the agency\nimplications. I thought that was really\ninteresting to learn about in this\nassignment and then this chapter a\nlittle bit. Um so essentially like we\nsaid, the buyback presents a clear\nagency conflict. It benefits the\nmanagement and employees\nand essentially um which supports the\noption value and reduces\nthe diluted share count at the expense\nof potentially foregone strategic\ninvestments.\nSo after completing this assignment, I\nhave learned so much more about\nfinancial management. Um, I think some\nof these concepts are kind of hard for\nme to dive into a little bit. Um,\nbecause sometimes I'm I think it's a\nlittle over my head in a way or I\nstruggle understanding it. Um, but I\nthink after really trying to embrace the\ndriver framework a little bit more, um,\nnot only just in this class but in my\nother ones too, I feel like I definitely\nam getting a deeper understanding of the\nassignments. Um, and I'm very grateful\nfor this class and the semester because\nit's really impacted the way that I\nthink and I'm hoping that um I can\ncontinue to translate all of this into\nmy future um career and everything like\nthat. So, I just wanted to say thank you\num for being such a great professor thisyear. Um so, yeah, goodbye."
}