{
  "student_name": "Matthew Sant'Anna",
  "org_defined_id": "037006517",
  "username": "mwsantan",
  "email": "",
  "transcript": "All right. Um, this is my session nine assignment. Um, so my assignment, I'm here to break down a Netflix's cost of capital. The goal is to figure out the minimum return or hurdle rate Netflix needs for a massive $5 billion content investment and see what happens when they add a $3 billion in debt. And I'm using the driver framework to help me define and calculate this along with Gemini which is creating the code of Python for me that you are looking at right now. So first looking at the basics I'm using the market values of $200 billion in equity and 13 or 13 billion in debt. Key inputs are net Netflix's high equity beta of 1.3 which you can see all them right here. I'm about to say 1.3 of equity beta and the 5.8% 8% yield on their bonds and the $21 of corporate tax rate which is crucial because it gives us the tax shield uh benefit. Um so the run of of the analysis um looking at the cost of equity um using the CAPM I found that because of because Netflix is perceived as volatile uh the cost of equity is quite high. So the 11.65 65 which you can see right here. Um this is the return demanded by the shareholders and the after tax cost of debt thanks to the thanks to that tax shield where interest payments are deductible. The actual cost of borrowing drops significantly and the after tax cost of debt is only 4 uh 58 which you can see right here. And the current WACC the current capital structure is C super conservative which is around 90 around $94 or 93.9% and six around 6% which you can see 6.1 um and my resulting WACC is 11 it stands at 11.22%. Uh this is the minimum return the new content projects must be clear to create value. Um, and looking at the implement uh section, uh, let's look at the impact of the $3 billion debt insurance. Because the debt is so much cheaper than the equity, adding it actually helps. My new W my new WACCC drops slightly to 112%. Right here, um, which is our updated hurdle rate. uh and I created the I always ask Gemini to provide some visual representation. Uh it's key this this graph is key for the tech part of the assignment. Um and just for my understanding as well it shows that our WACC sensitivity to leverage you can see how high our current WACC which is the green dot is. It confirms that we are underleveraged. The curve slopes down because adding cheap debt initially lowers our average cost. And this plot is essential for guiding our financial decision making. And you can see the again I really think it's amazing that Jim and I can uh create this with code just to help our calculations out a bit more. Um ne going to our evaluate evaluate section. When I compare Netflix to competitors, my WACCC of 11.22 22 is high. Disney runs at 30% debt which gets a WACC of just 8.2%. The difference is the leverage. Netflix is missing out on billions in tax savings by being too debt averse and a single 11.12% WAC is inaccurate for everything. It's too high for lowrisk projects like uh US st like like stable US content causing us to reject good deals and it's too low for high-risisk projects like international markets make making us potentially accept bad deals. We need a project specific WACC based on actual risk of content. And basically to wrap up or my R stage, my analysis confirms that Netflix is way underleveraged. The optimal strategy is simple. Strategically increase debt up to 20% to 25% debt to value. This will drast drastically lower the WACC, making it easier and cheaper to finance massive projects like this 5 billion content investment. This will maximize shareholder value which is what every big company like Netflix should desire. But um yeah that's my assignment. So thank you",
  "video_url": "https://youtu.be/7L8pLSy1os4"
}