{
  "student_name": "Brock Oros",
  "org_defined_id": "036147335",
  "username": "oros0",
  "email": "",
  "transcript": "Hi, I'm Brock and for our session 10 assignment today, we're going to be doing the cost of capital analysis and we are going to be um evaluating Starbucks. So for the assignment overview, um evaluate Starbucks's proposed flagship roster that requires $12 million on front outlay and is expected to operate for 10 years. So that means we're going to create a graph that shows 0 to 10 years for the free cost rate. And then we're going to use the firm's 8.5 WACC as a hurdle rate to determine whether project creates value and recommend an accept or reject decision supported by the driver documentation. So for the project perimeters, the initial investment is going to be $12 million and that includes the building equipment and training and that's going to be depreciated straight line over the 10 years. And the working capital is $500,000 deployed at launch and recovered in 10 years at year 10, sorry. Revenues is $8 million in year 1, 11 million year 2 through 5, and then 9 million in six and through 10. And the operating cost is COGS 40% revenue. Labor is 2.5 million. Rent and utilities is8 million. And then marketing is.3 million in year one. And then 0.1 in after. And then we're going to have the taxes rate of 25% corporate rate and the terminal value and it's going to be 3 million at the end of year 10. So we're going to focus our analysis on producing a transparent cash flow model. That's going to be the free cash flow model of the 10 years starting with year zero and going all the way to year 10. Um some specific requirements is financial analysis requirement is build a year 10 0 to 10 incremental cash flow schedule that includes revenue operating cost deep ratio test yields taxes work and capital changes and terminal value. And you're going to calculate the MPV, IRR, discounted payment back period, simple payback period, and profitability index using Starbucks's WACC. And then we're going to run a sensitivity analysis for a revenue uh reduced by 20%. And WACC plus or minus 2% and then summarize the impact on the NPV or IRRa. And then finally, provide a recommendation that weighs financial results, strategic fit, plan implications, and key project risks. For the technical requirements, it's using Python obviously and then permitize assumptions that revenue, cost, discount rate inputs can be updated easily and then visualize the cash flows. So first off, I'm going to scroll up here. We're going to be talking about some values. So the key concepts are here. So um NPV is net present value. It is the present value of a project cash flows minus the initial investment. The internal rate of return IRR which we're also going to be talking about is discount rate that makes NPV equal to zero. The payback period is the time required to recover an initial investment. And then the profitability index is present value of cash flow divided by an initial investment. And then lastly the hurl rate is the minimum acceptable return. And this is typically the same as the WCC. All right. So now I did that. We are going to I've actually plugged all this in the chat GPT and it got us a Python code. So we're going to be going to that going full speed on this. I'm just going to run it just for the future. So we have our uh budgeting model. Goals is to create a clean clash for model. So let's start with the discover and design. So here is going to be all the project um units and the assumptions that we are we could change if we wanted to. So you got the initial investment working capital the project life in years the WACC the 8.5 hurdle rate tax rate and then terminal value at the end of year 10. So that's what it is to terminate. We got the revenue assumptions year 1's 8 million year two is 11 million and year six is 9 million. And we got the costs here. We got the marketing year one, marketing after year one, labor per year. All right. So now for the defining the functions build cash flows this creates this is going to build the cash flow table and then the calculate the NPV IR payback. So this is the get annual revenue. This is what we get to get the annual revenue and it returns the revenue for a given year with the scaling factor like the 20%. So for year zero it's always going to be zero. So this is going to build the cash flow schedule and we have the years here the number of years and this is going to include the revenues, operating cost, appreciation, taxes, working capital, terminal value and free cash flow. We got that straight line depreciation over the project life. And this is the yearly values on that revenue for the year. All right, we're going to keep scrolling down here. So, we have the working capital changes. This is if year zero, it's going to be negative cash flow. If year 10, it's recovering terminal value only the following year. If year A is project life else, nothing. All right. This is just building all of our code. And I'm going to scroll. This is the final step. This is the prints the ready summary. So this is what we got. All right. So here is our base cash flow table. The first 11. So 0 to 10. So we start at the revenue is $0 here. So that means as you can see all the way down here, our free cash flow is going to be a lot minus a lot because obviously we're having no revenue come in because it's the first year and then you can see this slowly revenue build right here and then it starts decreasing a little bit. We got the COGS, the labor stays the same, rent utility stays the same, marketing drops, and then here's our free cash row. So you can see it's very bad at the very beginning and then it starts increasing a little bit and then decreasing at the very end once everything is done. It goes up a lot. So we're going to go to the executive summary. So our decision today is going to be reject or or more specifically revise it because the project does not clearly create value at the 8.5 hurl rate. MPV and IR are not strong enough to support the green light without changes to design. So these values aren't going to be strong enough in order to greenlight it. So we would need a higher um a lower hurdle rate or a higher amount of profit. Profitability index is 1.24. Simple payback in a year is going to be 5.28. So, we still hit our payback, but it's not as much. It's not it's not really that worth it. So, if fall 20%, NPV becomes negative 3,000. Uh the NPV at WACC is 2%, it's 4 million, base WAC is 3 million, and then plus 2% is 1.6. So for a strgic and brand fit. So it supports the Starbucks premium brand positioning with the high profile and experimental flagship location. It acts as a living showroom for innovation, bracelet training and global tourism. And it can uh reinforce pricing power and loyalty by showcasing craftsmanship and product quality. The risk factor of this is there is there's going to be a demand risk. The traffic may not reach the revenue levels that it originally wanted to andor have those competitive periods of time. The cost risk is labor, rent, and construction costs could be higher than planned and especially in urban markets. Brand risk, if the execution is poor, there's long lines, maybe not enough marketing, and consistent experience, it could harm the premium brand instead of enhancing it. And then the concentrated risk is a large single chain investment. honestly is not that worth it because you're trying to increase exposure to everywhere instead of just one single area. And then the next steps is we could do a stress test. Um we could downside scenario. So like places with lower foot traffic, higher operating costs, and consider building onto other Starbuckses. We could um build KPIs for the roaster. It's like a way to get like data. wicked visitor count, spend visit experience scores to monitor performance versus the actual plan and then explore options to leverage the uh grocery content which like digital mark merchandising training to amplify the value beyond just having the site sales. All right. Thank you very much.",
  "video_url": "https://youtu.be/Oq7Z61ABcys"
}