{
  "student_name": "None None",
  "org_defined_id": "037551940",
  "username": "mangal2",
  "video_url": "",
  "transcript": "Hi, my name is Adrian, and today I'm going to be showcasing my mini project. So I made an AI investment thesis generator. I coded it myself using React to help with Gemini. I use the Gemini 2.5 Flash API and the Google search tools. It's not NAN, but it's a custom coded software. We want to give users personable explained theses with both sides, the bear side, the bull side, and it uses all-time real data, intent, analysts, projections, risk scores, stocks, whatever data it needs to kind of give its analysis so it graphs it. So first I'm talking about my driver loop number one, which is the basic AI, and I want to talk about the discover. So what I realized was that a lot of these financial problems need explanations instead of just numbers. So I can go and search the NVIDIA stock price and I know what the company does, same with Tesla. But a good investment right now is such a hard thing to answer with just numbers or just on the internet. Or same thing with should I buy NVIDIA?\n\nAnd we often need a pool of data and research to kind of make it a good question or a good answer. And again, we don't need a price code, but we need a lot more information like what's happening right now, what's behind the scenes. There's so much news that goes on that you wouldn't even know if you just looked at the stock price. You just see the number on the screen. So my tool, first we accept the natural language input. We Google search to gather live market data, new sentiment and price history with Gemini. So we get all the relevant resources. We identify what the user's intent is, not just the ticker symbol or the price. And then we basically discover using the context of financial decisions. So how do we make this analysis smarter? So we use multi-step reasoning. So first we interpret the user query. We fetch real-time data from Google. We kind of compress the data and send it to the AI and analyze the sentiment.\n\nAnd then we'll create a structured investment thesis as well as some graphics on the bull case, bear case, key drivers, current valuation context, risk score, et cetera. And then we convert them to JSON. So we're explaining why, not just what, behind the personal insight explanation. And the greatest thing about the tool that I built, which I'll show in just a second, is that users can type any natural language query on there. It doesn't have to be preset. It doesn't have to be just stocks. You can do literally anything you want to type. So we use Gemini's Google search tool. The workflow gets stock price, news, sentiment, and expectations. It gets JSON, and then it projects a React chart, a risk reward gauge, and a structured thesis explanation. And it uses multi-step logic, which we've said already, which is the user message ticker, Google search API, structured data, and using the Gemini received JSON and render visualization. And we're using Gemini 2.5 Flash for this model.\n\nWe don't have this risk profile set up yet, but this is something that we want to do in the future. And we have guardrails like hard-coded disclaimers, refusal triggers, and we also have cost controls. So now in the verify, I wrote some verification steps using TryGPT, but I actually want to show in working and live. So first I'll go over my code, which I use Google Studio for. So this is the Gemini services basic part. You can see we're using Gemini 2.0 Flash for speed and tool use. And we made a system prompt where we have ticker, third price, sentiment score, JSON scheme structure. So you can basically generate a lot of data. And we start off with $100 per year. This is the query that I already ran of analyzing Bitcoin's risk for the next two years. As you can see, first you're given an investment thesis. we're given an estimate of risk is high with a market resentment of 65 out of 100. We have the key catalysts, which are things that we believe are going to be bullish.\n\nAnd we have key risks, which are bearish, right? And these kind of stack up. So you can see the bullish makes the stock price or the analysis go up. We have 600 bulls and 90 bears, and we have the bullish on the bottom. And then we have the kind of baseline in the middle, which is the base case. So we can kind of graph the bull case or the bear case arguments. Then we have strong arguments for both the bull case and bear case on both. And this is generated just because we're talking about Bitcoin's risks. So these are generated on the spot by Gemini. And I'll show a different example shortly over here. And as you can see, it uses real sources such as this, such as this to analyze the kind of intent of the market. As you can see, and these are extremely recent articles, like this was published very, very closely today, basically like 12 hours ago, which is extremely recent. Um, and this is another website. They all work. They're all perfect.\n\nThey all very, very, very up-to-date data with Gemini polls from the search tool. So it functions like that. And this is the version two, as you can see, which we've changed already. And then I'll show another one, which I didn't, we're comparing Apple versus Microsoft for long-term growth. Um, as you can see now, this is a different, slightly different, um, chart. So over here we have Microsoft's current price and Apple's current price. And you can actually double check this with the confirm Microsoft price is 477. Yeah, 73 cents. And then Apple's stock price is, let's double check over here, 284.15, which is exactly what Jen and I pulled. We have our investment thesis. We have the market risk. We have the market sentiment. We have key catalysts, key risks, projections with a base case of 100, and a bull case and a bear case. You can do anything. And then let's say we want to do 10K risk low at all. So let this generate while we go over some of the code.\n\nSo we just have simple four pages for the front end. We have our index.html. We have our services. We have our Gemini key, which I'm not going to show over here. We have this. We have our app components. So overall, a fully functional, full stack app, including a backend. And then as you can see, we have 10K low-risk tolerance. So this isn't really an investment thesis, but we're not giving it a ticker this time. We're asking it, where should I put a ticker? Can you find me a ticker? And I found Spived. If we check SPY stock price, that is SPY versus 63, so it's a bit off kind of the same thing. We find that there's a low risk. Market sentiment is a bit low as well. We see the projections are kind of similar. We have a bull case, bear case. We have sources of information. We have key risk and key catalyst. So overall, a full stack app, which basically does everything for us. So yeah, overall, that's my mini project three. Now I'll go over some of the loops that I shipped.\n\nSo first, V1, we were using data, external data. We were using whatever the AI could surface from its training models. We were using free text. We were using no visualization, a static prompt, and minimal guardrails. V2, we added that Google search. It was a sentiment parsing, which we showed below. So we had the bear case, bull case. We added strict JSON. We actually added that projection chart, which we showed. We had full sanity checks and disclaimers. And then we had a full thesis, bear case, bear case, drivers. So reflecting is what we realize is that you don't design the rules, but you design the reasoning system behind it. So instead of building the building, which is the way I like to think about it, we're building the architecture for the building, the blueprint. We're not actually creating the building, which is what AI is helping us do. We're creating the architecture for it. So we need to focus on the business logic.\nWe need to focus on what's going behind the scenes because AI is smart enough to code the front end and what's actually shown on the screen. And this is a tool I would trust as a research assistant, research partner, but not a standalone financial advisor, which is something the tool clearly shows. And again, we went over driver loop two, and driver loop three is something that I do want to add as I continue to develop this project in the future. So yeah, thank you. That's my project."
}