{
  "student_name": "Sean Wu",
  "org_defined_id": "035909269",
  "username": "wu2053",
  "email": "",
  "transcript": "Everyone, my name is Sean and this video I'm going to walk through a full driver uh driver analysis for Starbucks proposed flagship roy uh using an 8.5% uh WACCC and I'll move stage by stage. So from define and discover. So our goal for this um home assignment is to build a transparent year zero through year 10 cash flow model for Starbucks roster computing an MP uh MPVR paybacks and profitability index at a WACCC of 8.5% and then run sensitivities and the required um elements in scope are revenues operating costs depreciation it's taxes working capital timing the terminal value in a set of capital budging metrics plus a sensitivity test for a 20% revenue downside and for uh walk shifts of plus or minus 200 basis points and we have the given information we had uh initial um investment is 12 million working capital 500,000 deployed at launch and recurve in year 10 and revenues 8 million year 1 11 million in year 2 to 5 and 9 million years 2 6 to 10 and operating costs COGS uh 40% of revenue labor 2.5 million rent and utilities utilities 0.8 8 million marketing 0.3 million in year 1 then 0.1 million thereafter and taxes 25% corporate terminal value 3 million at end of year 10 and now we're going to go into represent and the code generate uh the code is generated by chacht and now going to represent section and here's the modeling framework I'm using year zero captures the 12 million um cap capex and the 500,000 working capital outlay. And for years 1 through 10, operating cash flow is revenue minus COGS, labor, rent, and marketing and minus straight line depreciation. So I applied the 25% tax rate and then add back depreciation to convert earnings to cash. And year 10 also includes the 3 million terminal value and the recovery of the half million in working capital. So every cash flow is discounted at star uh is discounted at Starbucks walk of 8.5% and from that schedule I computed the MPV IRR the profitability index and both simple and discounted payback. Now going to implement now let's look at the base case results produced by the code. So the MPV is positive at um at MP is positive at $3.02 million and IRRa is 13 IR is 13.25% the probability index is 1.242 simple payback the simple payback is 5.28 28 years and discounted payback discounted payback is 8.21 years. So those figures imply the project clears the company's hurdle rate and creates value in the base case. And now um looking at this first chart, this box plot, this chart shows annual free cash flow from year 0 to year 10. So you can see the large initial outflow at time zero and then steady positive operating cash flows and a final step up in year 10. Then from uh from the terminal value plus working capital recovery and here's the scenario comparison for MPV this third graph here um the base case at 8.5% um WACC is about positive 3.0 Z and if revenue underperforms 20% across the horizon, NPV flips to approximately negative 3 uh 3.0 at 3.16 million which is like 3.0 million and IR falls to just over 3%. So revenue realization is the primary risk driver. And this second graph here, the MPV versus WACC, a chart plots MPV against WCC from 6.5 to 10.5%. So expect as expected, the MPV declines almost linearly as this discount rate rises and about 4.6 million at 6.5%. So down to roughly 1.6 million at 10.5%. But the crossover to negative negative is well above this brand and which gives us some cushion on the cost of capital. Now going to validation. So to validate I first confirm the completeness. The model includes the kax the operating cash flows the operating cash flows uh taxes with a decreation tax field working capital timing and a terminal value. And second is methodology. I'm using after tax operating cash flow and I'm discounting out WCC which matches it's this one which matches the which matches the capital budgeting practice. And third the reasonable uh the reasonleness IRR of about 13 and a quarter% is above the is above the 8.5% hurdle and the consistent with a positive MPV and an accept decision. And finally I stress uh key uncertainties. So the revenue downside test shows that uh the sign of MPV can flip and the WCC sweep test discount rate uh risk by plus or minus 200 basis 200 basis points which is this point here for evolve. The next steps uh the next steps to strengthen the analysis is to add scenarios packages for rent escalators labor uh labor inflation or a phase ramp in revenue and create a tornado chart to rank um drivers like revenue COG percentage a COGS percentage WACC and terminal value and align the WACC term structure with the project horizon. I'd also add a waterfall view of discounted discounted payback to show the yearby-year climb to break even. For reflection, here's a takeaway. Uh the capital budgeting discip uh disciplines the strategy conversation with the current inputs. The roaster clears the hurdle and the positive MPV and a double digit IRR. But the project's success is highly sensitive to realize the the demand and in the 20% revenue downside the value turns negative. So marketing and um traffic risk is the a pivotal focus for execution planning. And given this my recommendation is accept with uh guardrails proceed but pair approval with milestones on revenue traction and cost control and monitor against the sensitivity thresholds we just viewed. So so this um this is my assignment 10 with the complete drivers method and the visualizations with the code uh generated with chatgpt. Thank you.",
  "video_url": "https://youtu.be/chGAg3BONow?si=yr27oVtiwwtpiGW3"
}