{
  "student_name": "Yanxi Liu",
  "org_defined_id": "038231480",
  "username": "liu4186",
  "email": "",
  "transcript": "Hi, I'm Yanxi. This is my Session 10 Assignment. And I followed the DRIVER framework. At the Define & Discover stage, the analysis begins with a clear strategic question: whether Starbucks should move forward with investing $12 million into a new flagship roastery project. To frame the decision analytically rather than intuitively, the study sets both a financial goal and formal decision rules. The project will be considered value-creating only if two metrics support approval. First, the Net Present Value, or NPV, must be positive, meaning the present value of all future cash inflows must exceed the cost of the investment today. Second, the Internal Rate of Return must be greater than or equal to the firm's cost of capital, defined here as an 8.5 percent Weighted Average Cost of Capital. Together, these two tests distinguish a viable project from one that destroys shareholder value. If the project satisfies them, it passes into the category of financial acceptability. If either one fails, the project is not recommended, regardless of brand appeal or non-financial benefits. Before calculating cash flows, several essential assumptions are established, because capital budgeting lives or dies on the structure of the model beneath it. The total initial cost of the roastery is assumed to be twelve million dollars, paid entirely at year zero. The project will operate over a ten-year lifespan, which means revenues, operating costs, and taxes must be forecast across each of those years. The tax rate is assumed to be twenty-five percent, and depreciation is calculated using straight-line methodology, which means the investment is expensed evenly, at 1.2 million dollars per year. The discount rate, representing the opportunity cost of capital and risk of the investment, is fixed at eight-point-five percent. In addition, the project requires a half-million dollars of working capital up front, money which is tied up operationally but recovered at the very end of year ten. Finally, the project is assumed to generate a terminal value of three million dollars at the end of its life. With these inputs laid down, the model becomes numerically coherent, and the valuation process can begin. At the representation stage, the analytical focus shifts toward developing a cash flow structure capable of testing profitability. For each year, incremental free cash flow is calculated by subtracting taxes, capital expenditures, and changes in working capital from operating cash flow. Operating cash flow itself is computed starting with revenues minus costs minus depreciation; then, after tax is applied, depreciation is added back because it is a non-cash cost. Although depreciation reduces accounting profit, it creates a tax shield, which means it lowers tax payments and therefore increases actual cash inflows. The depreciation tax shield is simply depreciation multiplied by the tax rate, and in this model, that shield appears every year for the full life of the project. These formulas act like the skeleton of the analysis: once free cash flow is produced for every year, the discounted results can be summed to reveal NPV, IRR, payback period, and overall value creation or destruction. At the implementation stage, here is the Python code, but let's go directly to the result. Here is a full ten-year cash flow. In year zero, the company spends 12 million dollars in capital expenditure and an additional 500 thousand dollars in working capital, resulting in an initial free cash flow of negative 12.5 million. From year one forward, revenue begins flowing, starting at 8 million dollars, increasing to 11 million in years two through five, and gradually stabilizing at 9 million beyond that point. Operating costs scale proportionally with revenues, depreciation remains fixed at 1.2 million annually, and the model calculates earnings before interest and taxes for each period. After applying taxes and adding back depreciation, annual operating cash flows range from 1.2 million to 2.7 million dollars depending on the year. Nothing unusual happens until year ten, when working capital is returned and terminal value is realized. That final year, cash flow jumps significantly because the business not only earns operating cash but also recovers previously invested capital. Once these cash flows are discounted at Starbucks' 8.5 percent cost of capital, the results show that the present value of benefits outweighs costs. The final computed NPV is roughly 2.56 million dollars, and the internal rate of return is 12.45 percent, exceeding the 8.5 percent hurdle comfortably. Although the project requires more than five years to reach payback, and nearly nine years to reach discounted payback, the investment is financially justified under baseline assumptions. However, financial decisions cannot be made responsibly without questioning the strength of these assumptions, so a sensitivity analysis is introduced to evaluate how fragile the project is under different conditions. The first scenario tests the effect of revenue declining by twenty percent. In that case, instead of earning between eight and eleven million per year, revenues shrink materially. When this reduction is applied, NPV collapses dramatically into negative territory, around negative 3.62 million dollars. This is an alarming signal because it shows that just a moderate downturn in sales eliminates all financial gains and turns the roastery into a net destroyer of value. The second set of scenarios modifies the discount rate. When WACC is reduced to 6.5 percent, the project becomes substantially more valuable, with NPV rising to over 4 million dollars. Yet when WACC increases by only two percentage points to 10.5 percent, NPV falls to approximately 1.17 million, barely above break-even. The sensitivity chart visualizes this volatility clearly: the baseline result is positive, but the project sits close to the decision boundary, meaning small unfavorable changes trigger a shift from accept to reject. In short, the project is profitable, but not resilient. Based on this evidence, the recommendation is a conditional acceptance. In other words, Starbucks is justified in moving forward, but only if management acknowledges and actively mitigates risk exposure. The base case demonstrates that the project meets both capital budgeting criteria: NPV is positive and IRR exceeds the firm's cost of capital. These results imply that if forecasts are reliable, the investment will create genuine shareholder value. However, the sensitivity analysis also proves that the outcome is highly dependent on revenue strength. A twenty percent decline produces a negative result, and even a small increase in discount rate materially reduces returns. Decision makers must therefore treat the projected financial upside cautiously and not as guaranteed. The recommendation encourages Starbucks to proceed only if strong market validation confirms demand and if risk controls are established to protect against revenue fluctuation and cost escalation. At the validation stage, calculations are reviewed mathematically. The depreciation schedule is consistent with asset life, working capital outflow and recovery are correctly timed, and the terminal value appears in the final period rather than artificially inflating earlier years. Both IRR and NPV calculations align with standard corporate finance methods, and the consistency strengthens confidence in the initial acceptance decision. Nevertheless, validation does not eliminate sensitivity. Instead, it confirms that any risk identified reflects reality rather than error. At the evolve stage, as the project evolves conceptually, attention must shift beyond pure numbers into forward-looking managerial planning. Because the findings reveal that the roastery is sensitive to both revenue and the cost of capital, Starbucks should conduct deeper market research before final authorization, particularly for early-stage revenue projections. The roastery's financial success relies heavily on achieving strong customer demand, premium pricing, and elevated foot traffic consistent with a flagship concept. Strategically, the project is attractive: it enhances brand experience, elevates Starbucks' premium positioning, and strengthens its cultural identity in global markets. These brand benefits are real, but the financial margin of safety is narrow, meaning they cannot be used as justification in isolation. Strategic upside may complement financial value, but should not be assumed to rescue the project if financial performance weakens. Reflecting on the analysis, the underlying lesson is that a positive NPV does not automatically mean a low-risk investment. The roastery generates value only within a relatively narrow band of conditions. A modest drop in revenue or a conservative upward revision in discount rate quickly flips the conclusion from acceptance to rejection. Management must therefore weigh whether the strategic benefits of flagship presence, customer immersion, and brand equity creation are worth the financial fragility revealed by sensitivity testing. If Starbucks is willing to reinforce the project through marketing investment, contingency planning, and competitive differentiation, then the roastery can become a high-impact asset, both financially and symbolically. If uncertainty is left unmanaged, however, the exposure could erode shareholder returns. The final conclusion is that Starbucks should proceed, but only with deliberate caution, revenue verification, and rigorous risk governance. Thank you.",
  "video_url": "https://youtu.be/QlCVjS5uC34"
}