{
  "student_name": "Shea Wickstrom",
  "org_defined_id": "034209490",
  "username": "swickstr",
  "email": "",
  "transcript": "Hi my name is Shea Wickstrom and I will be going through the session 9 assignment um where we are looking at the cost of capital for Netflix. So to start I started with Gemini as always um let me go up to my prompt here. Okay. So to start my driver process um I said I am a finance student analyzing the financial parameters and cost of capital for Netflix. For this analysis I have been given a hypothetical fund of 5 billion. uh please act as my financial advisor specializing in CAPM and WACC which is the cost of capital um to create a code that calculates the desired measures follow the KISS principle okay so to start I have my define/discover I just put all of the given information that was straight from the problem here uh so the market capitalization total debt um debt market value etc etc that was all in my define and then for my represent I said identify how additional debt finance would impact my figures and decision-m uh the difference between project specific in this scenario uh project specific being the US and firmwide discount values so in that we compared firm um cost of capital project specific which is US, Netflix and then international and then to end my represent I said assume that I will hold this investment for at least 5 years please include a timeline that represents the cash flows over this period. Um, you will see later on that I ended up getting rid of the timeline that it output uh because it was just not what I was really looking for and it was returning values um that just wasn't my goal. But I will show you that in just a second. Okay. So from that it gave me this Python code which I then plugged into Collab. Um and this is my implementing of the process. So here at the start of the code, it just defines everything that I gave it earlier in my inputs. So again, we see the risk-f free rate, market risk, premium, etc., etc., all of the given information. Here we see the actual calculations happening. Um, here I'm going to move this to the side. Here we see the actual calculations happening. Um because I'm looking for the weighted average uh cost of capital, I need to know the cost of equity. And to find that I use the cap m um and you can see that right here. So at the start of calculating Oh, where did that go? Okay. So at the start of calculating the cost of capital, we see the cost of equity here using that CAPM m formula um with the risk-free rate beta value um is here which is essentially showing the risk and the market risk premium. I did the exact same thing for the cost of debt um using the weights and then here's that actual uh weighted average cost of capital formula being used here. Um, something that I did think was interesting and I made note of it is that Netflix's beta is 1.3. Uh, this is a pretty high beta. Um, indicating that uh, market investors typically would view this investing in Netflix stock as a little bit riskier. Uh also I made note of this bond rating here of a BBB+ which let's see my notes um indicates a sta stable credit quality. So even though they have a higher risk they are also known for having stable credit um giving investors a little bit more reassurance. Okay, back to my code. And then after it got all of the basic calculations, it is running the excuse me different scenarios. So here it's running just the input scenario from the start, the original scenario. And then here we see it running a scenario of adding that additional 3 billion debt issuance. It goes on and on. Here you can see is that 5-year timeline of cash flows. And I will show you the output that it gave me for that. All right. So, here is my outputs for the cost of capital analysis. Um, gave the cost of equity using that CAPM model of 11.65. Um, the cost of debt at 4.58. This is using that um beta that we used earlier. And this is um this is what is it after tax cost of debt after tax. And then our current weighted average cost of capital, I got a return of 11.22%. So essentially that's saying Netflix um requires a rate of return of at least 11.22% in order to make their profits. They were if they were to be making um ROIs, return on investments that is less than that percentage um then it would not be indicating good things. All right. And then the project specific hurdles. So this is talking about the um firmwide cost of capital uh cost of capital just for the US and then um in contrast for international work. So we see here that the international cost of capital is 13.22. So that is the riskiest. Um that would kind of make sense to me. I would imagine that expanding your organization and your demographic, audience, customers, whatever it may be, um I would understand why it would maybe be a little bit riskier just because you maybe aren't as familiar with different um cultures, customs, things of that nature. Here is the timeline that it gave me. Um it was all right. It just wasn't really showing. I guess it wasn't as valuable as I anticipated it would be. Um, so it's showing I gave it a hypothetical 5-year timeline just to see what um the different cost of capitals would look like over time, if that would change, etc., etc. Um, it did give me these discount factors here. We see that changing over time and decreasing, which makes sense. And then the present present value of cash flows here. Um, all of this is helpful but maybe not as helpful for this problem. So then I went into Gemini here and I asked it to edit the code. Um, I wanted to remove that timeline and I also wanted to see I wanted to add in the element of comparing Netflix to their competitors. Um, here in the given output at the start it didn't have any indication of their competitors. So, I wanted to add that into the code. Um, after making these adjustments, it g output me with Oh, well, something that was fun is it gave me a little visual, which I've never had it do that before. Um, anyways, so here I will go back to the code at the start. It looks basically exactly the same as before. So, all of the just given information. Um the only real difference in the code here is you see that it is inputting that competitor data and then from that let's see it is oh I guess here it is just um showing the visualization of that cost of capital comparison. Okay so the output for that at the start it's going to be all the same as it was before for Netflix cost of equity 11.65 65 cost of debt 4.58 um same cost of capital which is 11.22 22. Um, and then it showed the after debt cost or after that additional $3 billion of debt um, being at 11.13% and I will I will go a little bit more into that in just a second. Um, but to finish off the comparisons between Netflix and their competitors, um, this is what I was really looking for. So, this is just given from the problem. It didn't really give me any sort of like ratios of comparisons, but other than just a visual comparison. Um, but just based off of looking at this and I'm going to pull up my little notes here. Okay, so based off of just looking at the weighted average cost of capital, we can clearly see that Netflix is higher than both Disney and Amazon. Um let's see what I have here. Okay. Yeah. So the N the Netflix uh cost of capital um which is also indicating its hurdle rate or what it would need in returns um is higher than their their competitors. Uh I said that this could mean that they could have a higher perceived risk. Uh we did see earlier that it does have a 1.3 beta. So it already does have a pretty high um uh risk in the eyes of investors. Um so the higher cost of capital could be a reflection of that um in comparison to places like Disney or Amazon. However, that doesn't necessarily mean that they that Netflix is doing any worse than their um comparable industries. Um Disney and Amazon have a more diversified um profile or portfolio. Um they have more in physical assets and tangible things like capital. Um so they have like parks, retail, uh they have their media, but then they also have like music. So they just have a lot more diversified um options for what they're offering. um the the more diversified assets for these competitors. So, Disney and Amazon is giving giving them a lower risk, thus a lower beta, which has a trickle down effect than a lower cost of capital. Um, however, like I said before, even though Netflix has a higher cost of capital or a higher perceived risk, it doesn't necessarily mean that they're doing any worse. um it just means that they have a higher uh return on investment that they would need to achieve in comparison to their competitors in order to jump their hurdles and make profits. Um so after running all of that, I talked with Gemini a little bit on how I could possibly lower this cost of capital. Uh so here I have um one way that we could lower it is by reducing either the cost of equity or the cost of debt. Um lowering either cost of equity or cost of debt would be would mean lowering the beta. So less risk. However, this is a little bit tricky because um lowering risk or beta is very strongly dependent on the investor's perception of Netflix. So Netflix um could do their best at attempting to change per market perceptions, but that would be a little bit difficult. Um the next option would be to make debt more weighted because of that tax shield. Um and yeah, that I will go back to my code with that. So we saw here that um Netflix's current cost of capital was 11.22% 22% but with that additional 3 billion in debt. Um it is lower with 11.13%. Um this is because of the tax shield. Uh so acquiring that more debt it is becoming more tax exempt. Um yeah so more weighted would decrease that cost of capital. Um the because of this I would honestly maybe recommend uh receiving that issuance for 3 billion in debt because as you can see it lowered cost of capital which means that it's lowering the hurdle rate of the required rate of returns that Netflix needs. Um which seems to be a good thing. Um let's see if I have anything else. All right. I think that that is all for this assignment. Thank you.",
  "video_url": "https://www.youtube.com/watch?v=ZtAOybJ0cRA"
}