{
  "student_name": "None None",
  "org_defined_id": "037036066",
  "username": "dscheel",
  "video_url": "",
  "transcript": "Hello, this is Dylan Sheiel and this is my management 310 mini project 3. So recently we've been working on um cap uh capital budgeting and things like net present value and internal rate of return and this resonates with me a lot as an extra science major. Uh last semester I took a class specifically on interest theory. So we did a lot with net present value, internal rate of return, um, annuities for investments and things like that. And so I one of what I wanted to create was a capital budgeting um, helper. And so the prompt I gave the AI is I'm a financial accounting student who hates calculating the necessary factors of capital budgeting. I want to create an app that can take inputs for capital budgeting and solve them with ease. I want this app to be simple but effective so a nontechnical audience with little to no accounting experience can understand it. So this is the initial thing it gave me. Um we have our initial investments we have our project life years uh things and then we have our analysis AI gives us. So it works it works well. One of the things that's frustrating with it is this is how you move the numbers up. um which is an issue and but it does it calculates and analyze our data. It gives us an AFI finish analyst that's great but one of the biggest things I wanted to be able to do well but we'll go to our final. So this is my final and so the first thing my first thought was with things like uh investing we want to be able to compare two different projects. So I had to add a comparison dashboard. So if we go into our inputs, we have our project A and our project B. And so you and then I also changed the sliders to make this a little bit more user friendly. And we're still having our analyzation from the AI. Still having our annual cash flow timeline, which is very easy to see. It changes whenever you do project years. See, we have now has six years. Um so we can now compare. So for the analysis we can see each um project individually and then for project and then for compare we see them together and it gives us a little which project is better based on each um factor. But the other thing I wanted to do because there's a limitation, one of the biggest limitations with the AI here, um the AI helper that it's going to give us in the analysis is it's great, but another one of the biggest setbacks is taking into account the outside factors other than just the money or the numbers. That's another uh thing with the net present value is yes, we're looking for a net present value that's greater than zero obviously to reject or accept a project, but especially when we're comparing two projects, we want to look at the actual real life implications, the pros and the cons, if you will. So I added a little um you can name the project and say uh software update software upgrade and then it'll go to in the compare it'll have software upgrade and um but so you can put pros and cons for each project and then whenever we go to the comparison analysis here I reset so let's see potential potential uh We'll go to 124,000. And for project B, we'll do low potential. Oh, wait. We'll say that as a con potential. And then when we do the comparison, the AI will take into account those pros and cons to kind of counteract the idea that the AI doesn't really know much about the project. And so when we compare projects, we can try and give it as much information as possible to limit or to get rid of the limitations of the AI. And also again with the AI, a major limitation with it is it's just pulling from all previous information. It doesn't know what's happening in real life. It doesn't know the ins and the outs. And so what I'm trying to do with the pros and cons and things is trying to limit them as much as possible. We can see it gives us a deep dive analysis. talks about the net's value, talks about the pros and cons. And so, yeah, this is my capital budgeting tool, which I think would be very helpful, especially in the last couple weeks of class, but also in something like actuary where we're doing pricing and we're looking at models. And so, yeah, thank you."
}