{
  "student_name": "Caleb Brunton",
  "org_defined_id": "034423095",
  "username": "cbrunton",
  "email": "",
  "transcript": "is my session 8 assignment for manual 310. In this video, I'm going to walk through my driver analysis of the GameStop short squeeze using my Python notebook as the main visual. Starting with the defined part of driver, u the decision goal for this project is to figure out whether the GameStop or GME short squeeze in 2020 through 2021 was just crazy but still still consistent with market efficiency or whether it actually looked like a violation of the efficient market hypothesis hypothesis. Um the core question is did the GME short squeeze provide evidence against the weak, semi-strong or strong forms of the efficient market hypothesis. The scope of the analysis is the time window from August 2020 through February 2021 with a little extension into April. For context, um I focused on daily prices, returns, and volumes plus a few major public events. For risk adjusted performance, I compare GME to the S&P 500 using CAPM. And my success metric is whether I can measure abnormal returns and and cumulative abnormal returns in a clean way. Use those to say something meaningful about weak, semi- strong and uh strong EMH and correctly fact check the specific claim that the GME traded at 4 cents in August of 2020. Um in the discover section, I laid out what data and facts I need. um historical prices and and volumes for GME and the S&P 500 from Yahoo Finance, Yahoo Finance, a timeline of events uh which is Cohen joining the board, the January price spike and the Robin trading restrictions and then u basic inputs for CIPM, a reasonable beta range, a tiny risk-free rate and using S&P 500 as the market for portfolio. Um I also flag three EMH forms the weak form which is which addresses you know do pass Prices and returns help exp happen semi- strong. Do prices react efficiently to public news or Reddit post or in the strong form? Would you have needed insider style information to consistently profit? And I finally reminded myself to think about behavioral biases like hurting, FOMO, overconfidence, and limited arbit arbitrage. Um because uh those are all all over the G story. Moving on to the represent section. Um I designed the structure. This is where I I designed the structure of the analysis. Um first I built an event study timeline with four different windows. Um a pre-event window from August to December uh 2020 to establish normal returns quote unquote normal returns and volatility. Um a normal buildup window in early January 2021 when retail interest and short interest awareness started to ramp up. And then the main event window roughly late January to early February, early February where when we see the actual spike and a postevent window where the price comes back down and the market tries to re re-equilibrate. Then I map that onto an EMH testing framework. Um, for week forum EMH, I'm mainly looking at how extreme the returns and volatility get and whether anything in the past data would have obviously predicted this. For the semi- strong form, um, I focus on abnormal returns around specific public events, Cohen's board announcement, the peak squeeze day, and the trading restriction day. Um, for strong form EMH, I I ask whether it looks like only a small privileged group could systematically profit or whether a lot a lot of retail traders are able to ride the wave. Um, next I lay the financial modeling modeling approach um where I compute daily returns for GME and the S S&P 500. I use the capm to an estimate gi expected return on each day and then I compute abnormal returns as actual minus expected and uh c as the cumulative sum events. I also sketch the visualization plan um four key charts that I'll point I'll point to later. The uh GE price versus market price over time, GM trading volume and millions of shares. a scatter of Gme versus market daily returns with the um CAPM regression line uh car curves around Curves around the three key events. And finally, I uh wrote out the hypothesis down here. Um H subzero is um no systematic abnormal returns and H sub one is significant AR and C that don't line up with EMH and instead look behavioral. So that is the R part of the driver method. Moving on to implement. Um down here you can see all of my code. We have the setup and then the question one. I'm running it here to see the output. All of it is in one script. Um and this is the output down here. Um so I start by importing um a variety of things. You can see up here that includes numpy, pandas, y finance, mapplot, lib and uh stats models. And then I downloaded the uh daily data for GME and the SP500 from July 2020 to April 2021. Um for question one, I filter the GME data down to August 2020 and compute um down here can some puts um I compute the number of trading days in August which is uh 21. The first trading day price which is about a dollar4 the last day trading the last trading day price was about $167. Uh minimum adjusted close in the month was uh one $14 and the maximum was 167 and average was about 120. Then I explicitly checked whether the price ever hit 4 cents and whether it fell ever fell below $1 in August. Both answers are no. So the conclusion is, you know, the statement that GameStop traded at 4 cents in August 2020 is not supported by the data. It was trading around $1, not pennies. Um, going down to the price table here, I also show a sample of daily prices. Um, so here I can I can point out specific rows like August 3rd through August 14th and visually reinforce that the prices are just are all just over a dollar. Um, and this is like the first part of the implement section. Going up to what I did for what I called question two. Here I align GE and S&P prices and compute simple daily returns for each. Um, moving down here to the output. Um, here you can see the returns of the see the returns DF data frame with two columns. um GM return and then market return. Then I calculate some basic summary statistics uh which is here. Uh the number of trading days is 208. GM's average daily return is about 3.2% while the market uh the markets is about 0.15%. Um GM's volatility is about.188 versus 010 for the market. So GM is roughly 19 times more volatile. uh the correlation between GME and the market is around negative.10 basically uncorrelated uh but next is kind of some of the key visuals for this part uh this chart this chart shows the normalized price math where both GME and the market start at 1.0 in mid 2020. Um you can see that for months that for months GME moves slowly then suddenly in January 2021 it explodes upward to almost 80 times its starting level while the market the market line barely moves. Um that's our first visual here. Uh that's our first visual evidence that GM's behavior is wildly disconnected from ordinary market moves. Uh going down to the volume chart, we have uh GM trading volume in millions of shares. Again, for most of the pre-event period, volume is relatively modest. Um then we see huge spikes around the squeeze, hundreds of millions of shares in a single day. Um so these two plots together kind of show that a dramatic price decoupling show a dramatic price decoupling from the market in extreme trading activity consistent with speculative behavior and um hurting. And that sets up a CAPM test for question three, which going up to the code for what I call question three. Um, I run a simple CAPM uh regression where the dependent variable Y is Jimmy's daily return and the independent variable X is the market's daily return with a constant for the intercept. Um going down to the output for question three uh the results are alpha is 0.0349 or 3.49% per day with a t stat of about 2.65 which is statistically significant. Um the beta is.19231 with a t stat of.147 which is not stat statistically significant at the 5% level. Um r squared is 0.0104 014 meaning the markets explains only about 1% of Jaime's day-to-day variation. Based on that I I can compute that CIPM predicted returns and abnormal returns um which is here you can see that for each state I have the actual G return the market return the predicted CAPM return and the abnormal component which is the residual. But going down to the scatter plot, this actually shows the the GME daily returns versus market daily returns with the red CPM regression line on top. The key visual insight here is the huge vert spread around the red line. Even when the market return is close to zero, Gme's return can be anywhere from big negatives to huge positives. So the interpretation is uh capm produces a small r squar a weird negative beta and a large positive alpha. That means traditional market risk is not doing a good job of explaining gam most of the action is idiosyncratic and abnormal. Um but these those abnormal returns feed directly into kind of the part the event study I did in question four. Um going up to my code for question four. Um, I use those abnormal returns to build an event study in this in this part of the code. So, I defined three main events. Um, Cohen joins the board January 11th, 2021. Peak squeeze day, which is January 27th in 2021. Um, Robin Hood training restrictions, which is January 28th of 2021. Um around each of these dates I take a plus minus 20 day window and then I compute the cumul cumulative abnormal return or c by summing up the abnormal returns in that window going down to my output. Um this figure sorry this figure here shows the three C curves on the same plot with vertical dash lines in at the event dates. So after Cohen's announcement on 111 car starts the C starts drifting upward which suggests the market is reacting positively to that news beyond what CAPM would predict. Um going into that 127 127 the peak squeeze uh C spikes sharply upward showing big positive abnormal performance not explained by the market and then after 128 trading restrictions sorry after 128 trading restrictions um after the 128 trading restrictions C begins to fall which aligns with price prices dropping once the platforms u limited buying. So the C curves behave exactly how we would expect if these events contain surprise information and if behavioral dynamics and trading constraints were driving prices rather than a smooth efficient incorporation of public data. Um so that is the implement section of my driver framework. Moving on to valid validate up here. Um, putting it all together, question one showed that the that viral 4 cent GME claim is just kind of false. The data itself is the first line of a defense for efficiency. Uh, question two or my code for question two showed that GME had massive average returns, 19 times the volatility of the market and almost no correlation with the index uh with price and volume completely decoupled from normal market behavior. Question three showed a small R squar significant positive alpha and a strange non-significant beta meaning capm does not explain GM's returns and then question four showed that C around key events is a is large and structured not random noise. So from an EMH standpoint weak form EMH doesn't look great here. There's that kind of classic momentum and reversal behavior that is that a purely random walk wouldn't predict. Semi-rong EMH uh is most is most challenged. Uh publicly visible events and Reddit coordination produce substantial abnormal returns, not just tiny blips. Strong form EMH is always a stretch in practice, and this episode um doesn't rescue it. There's no sign that only Insight has profited. Retail traders also rode the wave, at least if they timed it right. Um but that's my validate section. Moving on to evolve. If I had more time to evolve this project, I'd focus on four different things. um richer risk models. Uh swap swap that single factor C capm for a FMA French or momentum model and see if GM's abnormal returns stay larger after controlling for size value and momentum factors which is something I um learned when I did some more research on this um topic. Um, I would use better benchmarks. Compare that GME to a retail ETF or a meme stock basket like AMC and BlackBerry to see if GME is unique or just the craziest member of a broader phenomenon. I could look at intraday and liquid liquidity data, pull uh intraday quotes to study bid ask spreads, order flow and liquidity drying up um around the peak. could also look at sentiment and flows. Inte integrate the Reddit, Google, Reddit and Google Trends options options volume um and short interest to formally connect narrative and positioning to abnormal returns. Um I'd also tighten the communication by turning this notebook into a short executive level slide deck with just the four key charts and a oneep one page summary. Um but that's something I would do in maybe an internship or a job which is just something I've been thinking about lately. Uh but that's uh the evolve section. Moving on to the last section. Um on the finance side, this project made EMH and CAPM feel much less like textbook acronyms and much more like tools with limits. Um seeing that tiny R squared and weird data in a real data set drove home that models are approximations. They work in in quiet markets but can break down an interesting retail driven episodes which is something that I've thought about lately, especially in finance and and in some of my other classes as well. Um, on the analytic side, I got more comfortable using Python from end to end, pulling data, cleaning it, um, engineering returns, running regressions, computing say, and building visuals that actually tell a story. It's something because I'm a BAME student, it's something I do pretty often. So, um, but this has made me feel a lot more comfortable doing it specifically in finance. Um, debugging the notebook, which I had to do a handful of times, forced me to con constantly do sanity check, sanity check my shapes, indices, and assumptions. Um, On market behavior, the GME story, at least through this lens, looks less like a prices are always right and more like a combination of coordination, constraints, and narratives pushing prices around. Public information matters, but the way people process and act on that information can create huge temporary deviations from what a model like CAPM would call fair value. Um, so going forward, it's a very fascinating structure um to look at the situation that happened in 2021, 2021 with the G stock price. But that is my session 8 assignment.",
  "video_url": "https://www.youtube.com/watch?v=uLlrN69t8uA"
}