{
  "student_name": "Vihaan Dave",
  "org_defined_id": "037519354",
  "username": "dave59",
  "email": "",
  "transcript": "Hello everyone, my name is Vhan Dave and today I'll be walking through a full weight and average cost of capital analysis for Netflix using the driver framework. The goal of this analysis is to determine Netflix's current WACCC analyze how adding $3 billion of debt affects effects at WA WACC apply project specific discount rates compare Netflix to Disney and Amazon and finally uh recommend an optimal capital structure. So, first for the actual uh what's it called? Like the Gemini prompt. So, I just decided to use Gemini this time because the Gemini on Collab it was being really weird and funky. Wasn't really doing what I wanted to do. So, I decided to just use Gemini instead and then export it to Collab from here instead. So, all I've done is that I've just thrown in the given information here like this overview in general and sorted to use Python code as well as to make it as use principle which is to keep it as simple as possible basically. And then I've exported it here to collab which is where all my code is here. Now I'll walk through the driver framework and how we use driver to uh go and connect the W uh ACC analysis. So first things first we have the define and discover uh which pretty much is just talking about like where where would we where would you where uh are we trying to go right? So in the define in the define and discover stage the objective is to fully understand the financial question and identify all the raw inputs we'll need. WACC is extremely sensitive to assumptions. So this step ensures everything is cons consistent, clear, and traceable. So we're going to be answering four main key questions here. The first one being what is Netflix's current WACCC? The second one being uh how does WACC change after $3 billion of new debt? Third, how uh what discount rate should Netflix use for the US versus international projects? Fourth, and finally, uh does the proposed $5 billion content investment meet the meet meet the hurdle rate? Uh so in order to do that, we uh we first must gather accurate and complete financial inputs. So these inputs include macroeconomic assumptions like the risk-f free rate and market risk premium, firm specific inputs like Netflix's beta market capitalization and debt load as well as uh project specific details with the $5 billion investment size. So here here we can see here is the exact code defining those inputs. So we could see here uh the risk-free rate is given here the market risk premium is given here the equity beta the market value of equity market value of debt and all these variables here we're going to use later on to connect our analysis and to find the just connect analysis using driver right so this step just gives us the raw material we need to calculate the cost of equity cost of debt capital structure weights and eventually Netflix's wcc See, so now moving on to represent which uh which pretty much is just here here's the root overview, right? So in the in the represent stage we are we are to translate the financial problem into formulas. So the power of this step is that we convert corporate finance theory into code we can reuse for multiple scenarios. So instead of plugging in numbers into a calculator, we can build a a clean and reusable WACCC engine. So in this stage, we're going to define the CP the CA PM formula for cost of equity, the after tax cost of debt, the uh capital structure weights and finally the WACCC itself. Now here's the exact code that represents these formulas mathematically given uh pretty much just here in the represent stage. So we can see the the code here for returns the cost of equity using CPM is this formula here. The this code uh this formula here returns the after tax cost of debt and so on so forth. So we use all these formulas here and the variables given earlier on that we've defined to calculate for each uh for each formula in the stage here. So next we're going to move on. So pretty much so this so in the actual uh represent stage this gives us a road map and we now have everything we need to implement the math test scenarios and compare Netflix to its peers like Amazon and Disney right so now moving on to implement which is pretty much just start driving follow follow the blue line right so in the implement stage we execute the formulas that that we've that we've defined and uh found beforehand in the R stage of driver Right. So here we're going to calculate the cost the cost of equity using the CAPM the after the after uh tax cost of debt the current uh wcc and wacc after adding $3 billion of new debt. Right? So this is all uh the code here where we're just calculating for each uh equation given beforehand. And here's what each of these calculations mean. Right? So the cost of equity is higher is higher because Netflix has a beta of 1.3. The after tax cost of debt is much lower because interest is a is tax is tax deductible. Uh Netflix is extremely equity equity heavy which makes this WACC higher and adding $3 billion of debt lowers WACC because debt is cheaper than equity. And this gives us our first major result which is current WACC is high because equity dominates and new ACC is going to slight is going to be slightly lower due to the new added debt. And now we're going to move on to the validate stage which we're pretty much just uh finding that are we on the fastest route. Right? So in validate we benchmark our WACCC against peers to demonstrate whether our results are realistic. So Disney uses a 70% equity 30% debt structure and has a WACC around 8.2%. While Amazon on the other hand uses a corporate WACC of around 9.5%. Right? Netflix with extremely low debt naturally sits at the high end of this range. And here's the comparison uh chart code here. So it's given uh in this part here where it says where uh the Disney's uh WACC is 0.082%. Amazon's is 0.095 and Netflix's current is WACC current and then Netflix's raw debt is is equivalent to the ACC new. So this is how we compare it to the peers and we're going to now actually make a graph that shows and compares the different uh the different companies and how they stack up against each other which we're going to see in the output of the code later on in this uh whole analysis here. Right? So this validates that our calculation is consistent. Netflix has the highest WACC because it has the lowest debt percentage ratio. Disney Disney benefits from leverage benefits from leverage and Netflix pays a premium for staying low risk in its debt policy. So now we're going to move on to Evolve which pretty much we're what we're trying to just find that if we can find a faster route. All right? Or if we can optimize further in other words. Right? So in Evolve we're going to test how WACC behaves under different capital uh structures. we can simulate debt ratios from fi from from 5% up to 35% and track how the WACC changes over that over that percent change period. So this allows a this allows us to identify a potential optimal uh capital structure. Right? So this is part one of the code where we are calculating the initial risk premium which we set it as 2.5% premium for international projects. the project WACCC for the US equals to the equals to WACCC for new and so on so forth for part one. Uh and part two we are we're going to we stimulate the debt ratios from 5 to to 35%. Which uh the all the code calculation is shown here. And here we're going to plot the sensitivity curve which we're which we'll show later on in this uh what's it called in the output of the code here. And then in part we're just going to quantif we're just going to quantify the value of it. So how much do we save on the $5 billion investment by moving from 11.22% 22% to 11.12%. And uh basically uh the curve shows that increasing debt uh up to around 25 to 30% lowers WACCC. Beyond that point, credit risk penalties credit risk penalties uh raise borrowing costs. Right? So Netflix today is is roughly at about 6% debt, far below optimal, right? And for uh US projects, we're going to use the new WACC. Whereas for international projects, we're going to add the risk premium to reflect currency and political risk. Now, we're going to move on to the reflect stage, which pretty much just stands for like save this route. So, in reflect, we summarize our results and conver them into into a strategy. Here, here's a clean table of our final values, which is all just uh given here basically. And so here are the final strategic here are the final strategic takeaways. So first things before I get into the main takeaways right this is the graph for uh the Disney with 30% a day Amazon Netflix current and Netflix new a new new WACC and and uh we've validated that Netflix has the highest WACC because it it has the lowest debt load uh and that Disney benefits from a 30% uh debit debit uh mix here. All right. Now, it showed us the actual full uh graph. Before it didn't show the full thing, showed partially. So, it's better to show it now. Uh and Netflix is paying a safety premium by staying at almost 95% equity and uh yes, so this is uh this is again for evolver the sensitivity analysis. So, this comparing the debt ratio versus the WACC. So, the current state is is about at around 6%. Negative. Yeah, it's about at 6% but the potential stake could be about 30%. And it shows the change in how that's going to affect the debit versus the uh WACC, right? So, by issuing the the $3 billion in debt, WACC drops by 0 uh by 0.09 bps. And on a 5% and on a $5 billion uh portfolio, this saves around uh 4.61 million annually in fin in financing cost. The optimal ACC at around 30% debt is approximately 9.59%. So now we're going to reflect reflect stage where we're where we're just going to just go over each of the what's it called the the strategic takeaways. Right? So the first thing that we should do is we should uh green light the $5 billion the $5 billion content investment. Right? So WACC decreases with new debt improving uh project economics. We should also issue the $3 billion in new debt. It's it meaningfully reduces the WACC. Uh third, we should also target a uh long-term 20 to 25% uh debt ratio. This minimizes WACC without uh significantly raising credit risk. And it's not mentioned here, but we should also we should we should also finally uh use different hurdle rates. So for US projects, we should use the W the new WACC. And for international projects, we should add a risk premium. So yeah, thank you for your time. This has been my Netflix WACCC analysis using the driver framework.",
  "video_url": "https://youtu.be/ZWYRl2HGD2M"
}