{
  "student_name": "Caleb Piekarski",
  "org_defined_id": "037218585",
  "username": "cpiekars",
  "email": "",
  "transcript": "So today I'm going to be going over the session 9 section six assignment uh which is the cost of capital analysis. So just going over the assignment overview which is going to be um our define and discover stage. Um, we're going to calculate the weighted average cost of capital WACC for Netflix in connection with a hypothetical 5 billion content investment decision. While the analysis analysis must determine current WACCC, evaluate the impact of additional depth financing, assess project specific versus firmwide discount rates, and compare Netflix uh cost of capital to industry peers. So just hypothetical Netflix financial parameters uh market capitalization is 200 billion total debt 14 billion debt 13 billion of market value the equity beta being 1.3 bond rating uh BBB plus yield 5.8% and corporate tax rate 21% with current stock price at $450. And looking at the market conditions, we have risk-free rate of 10-year Treasury as 4.5% market risk premium of 5.5% and media industry WACC range of 8 to 10%. And then some strategic context, Disney capital structure is 70% equity, 30% debt, WACC is 8.2%, 2% the Amazon Prime video uses Amazon corporate WACCC 9.5% and Netflix considering 3 billion additional debt uh issuance for content investment. So just looking at uh the required analysis what we're going to be looking at today is we're going to calculate Netflix's current WACCC determine WACCC after 3 billion debt insuence uh evaluate projects uh specific WACCC uh compare Netflix WCC to Disney explain differences and recommended optimal capital structure uh strategy. So looking at the define and discover stage uh given we just went through all the information given to us um what I can like pull together and what uh I can discover is Netflix is highly equityheavy. Um so WACC is driven mostly by equity returns. Um adding three billion debt slightly increases leverage but won't dramatically change WACC and international content is riskier and needs a higher discount rate. and Disney has cheaper capital because it uses more debt and is less risky. So going to the represent stage of the driver framework. Um looking here, we're going to be looking at the formulas that we're going to be using which is cost of uh equity capm r= rf plus beta * mrp. uh the after tax cost of debt which is RD * 1 - T the capital structure weights of WE is equal to E / D plus E and then W is equal to D / D plus E and then WACC equation W E plus WD minus or * 1 - T we have our beta would be um beta L equals beta U uh time uh or like in parentheses time 1 + in parentheses d minus e * 1 - t. So looking at the implement stage, I'm going to be going over python coding to show all of these. As you can see, we have all the inputs here. Mark cap as 200 billion, the debt is 13 billion. Um the new debt as 3 billion and beta equity 1.3. Basically, all these values are given to us uh in the instructions. Looking at the functions, we're defining the cost of equity uh with beta returning risk-f free plus beta times market risk premium defining the function after tax cost of debt yield rate um returning yield rate times 1 minus tax rate and then defining WACC um E is equal to equity equity value D is equal to uh debt value and then V is equal to both these combined the W is equal to E / V WD is equal to D uh divided by V. RE is equal to the cost of uh equity with beta RD after tax cost of debt bond yield returning we * RE plus WD * RD and defining the unlever beta with beta L um debt equity returning beta L / 1 + debt divided by equity plus 1 minus the tax rate. Uh same down here beta U debt equity returning beta U times 1 plus the debt divided by equity very similar up here times 1 minus tax rate and calculating the current WACC current WACC is equal to the um WACC with market cap debt and beta equity and then looking at the new WACC after the 300 billion debt uh with the um variable new total debt that is equal to debt plus uh the new debt. And then looking at the unlevered beta uh beta unlevered unlevered beta beta equity debt market cap down here uh step two using the relever beta using the new debt level. Um and then down here new WACC with updated beta plus the debt. So this is going to get you that value right here. And then looking at the project specified WACC uh with these beta uh US um for the US and 1.25 25 and WCC of the US uh using this with or WACCC with market cap beta US up here and then we have the international content with beta international and WCC international uh given the values and putting it into this function down here just going to print the outputs of all these um using fst strings and rounding to decimals putting in all the values and down here we have the outputs It's um basically showing what we got for values. So our cost of equity capm would be 11.65%. The after tax cost of debt would be 4.58%. Uh the current WACC would be 11.22% with new WACC after the 3 billion debt as 11.2%. The univered beta 1 uh 237 levered beta 1.315. And then the project specified WCC down here the US content WCC would be 10.96% the international content of WACCC would be 12.2 uh 12.25%. So after going through um or implementing all the given information and using the formulas using Python coding um we can move on to the next stage which um would be validate and uh just checking to make sure that the numbers make sense here. So um the industry WCC uh 8 to 10% uh Netflix above um industry makes sense uh riskier and the Disney WCC uh 8.2% 2% lower because it has more stable well like which is lower because it has more stable cash flows and the Amazon as 9.5% diversified business lowers risk and the beta increases slightly with leverage which would be in fact correct and adding 3 billion debt barely moves to WCC um which is expected due to low debt levels. So everything does align with um real financial logic here. Um looking at the next stage uh the evolve uh just to explain what all this means explain the analysis. So Netflix does have um room to take on some debt without hurting WCC. Um high WCC means Netflix needs high return projects to justify investment. Uh the US content should use a lower hurdle rate uh with and US uh international content must earn higher returns to be worthwhile. Um and to lower long-term WCC, Netflix could slowly add more debt um but must protect its BBB+ um rating. And going down here to the last step in the driver um in the driver um function um we're going to look at reflect um just looking at final insights of this and first off WACC is Netflix's minimum required return to satisfy investors. Netflix's capital structure is extremely equity heavy or heavy which keeps the WCC high. Um adding the three billion debt increases leverage but hardly changes WCC. Disney has a competitive advantage because it finances with cheaper capital. Uh Netflix should use moderate debt financing but stay cautious to maintain um flexibility. And then project specified WCC is important um as different content types have different risks. And that is this entire session 9 assignment um gone over using the driver framework",
  "video_url": "https://www.youtube.com/watch?v=c6rlp4A8MHY"
}