{
  "student_name": "Ryan Swann",
  "org_defined_id": "037338799",
  "username": "swannr",
  "email": "",
  "transcript": "Hello, my name is Ryan Swan, and today I'll be presenting my Cost of Capital Analysis for Netflix using the DRIVER framework. DRIVER stands for Defined Research Interpret, Validate, Execute, and Reflect. I'll use this structure to calculate Netflix's weighted average cost of capital, evaluating the impact of additional leverage, assess project-specific discount rates, compare Netflix to its industry peers, and recommend an optimal capital strategy for a $5 billion content investment. Starting in our define, uh, where we're going to define the problem, Netflix is evaluating a $5 billion content investment. And leadership must determine Netflix's current weighted average cost of capital, uh, the weighted average cost of capital after issuing $3 billion in new debt. Rather, the company should use a project-specific discount rate. For example, Netflix's cost of capital compares with Disney and Amazon Prime Video, and what capital structure best balances cost of capital and financial risk. Ultimately, the goal is to determine the correct hurdle rate for investment decisions and understand how leverage affects shareholder value. For the research and discover part, to begin the calculations, here are the key financial and puts provided for Netflix. The market capitalization is $200 billion. The market value of debt is $13 billion. The proposed new debt is $3 billion. The equity beta is $1.3. The bond yield is 5.8%. The corporate tax rate is 21%. And the risk-free rate is 4.5% with a market risk premium of 5.5%. Uh, weighted average cost of capital is between 8 and 10%. Uh, Disney's weighted average cost of capital is 8.2% with Amazon's being 9.5%. These inputs allow us to calculate the cost of equity. Using CAPM, the after tax cost of debt, and capital structure weights using market values, which is the correct financial standard. Getting right into our, uh, implement standard. We use the help of Gemini to create us a Python code that can help assist us in our analysis. To do that, I gave it the prompt, uh, please help me create a Python code that is easy to use, and rated average cost of capital, which represents the minimum return the company must earn on its existing asset base to satisfy its creditors and owners. It achieves this by executing a series of financial formulas based on key market and corporate inputs. Here is the code that we used in today's assignment, uh, and our analysis, with it giving us these outputs. Uh, The calculations of Netflix's weighted average cost The cost of equity via the CAPM formula, which yields $11.65 billion. and the after-tax cost of debt, which accounts for the tax shield, resulting in 4.58%. It then uses the market values of equity and debt to find the current capital structure ways of 93.9%. And computes the current weighted average cost of capital of 11.22%. Finally, it, uh, recalculates the weighted average cost of capital with the proposed $3 billion in new debt, slightly lower shifting the weights to 92.6% equity, and resulting in a marginal decrease to a new weighted average cost of capital of 11.13%, before concluding with an asses- assessment of the project-specific risks by adding a 2% premium for international content. Taking this one step further, it gave us back the cost of equity at 11.65%, the after-tax cost of debt at 4.58%, the current weighted average cost of capital at 11.22%, the weighted average cost of capital after the $3 billion, uh, new debt calculation, which gave us 11.13%. And for project-specific, uh, weighted average cost of capital, uh, the international, you could say 2% premium, boosting it to 13.2%. Therefore, Netflix should use 11.2% for U.S. and 13.2% for international content projects. Using Python, I also generated a weighted average cost of capital, uh, sensitive chart across varying debit-debt levels. The curve shows the weighted average cost of capital decreasing until approximately 20%. After which, rising credit spreads increase the cost of capital. Uhm, moving into our comparison of Disney and Amazon. Amazon Netflix's weighted average cost of 11.2% is much higher than Disney at 8.2% and Amazon at 9.5%. Higher beta means Netflix's equity is more volatile. The lower leverage, Disney benefits from larger profits. The lower Disney benefits from larger The lower leverage, Disney benefits Perceived risk. This combination places Netflix at the upper end of the risk spectrum in the media industry. I will validate the model using three methods. Uh, the recalculation by hand. I recalculated the CAPM cost of debt, um, and the weighted average cost of capital all by hand, to which it matched the outputs that our Python code gave us, reassuring that our code worked. The second thing I did was beta re-leveraging check. I tested how beta increases as leverage rises. With moderate debt increases, beta rises slightly. With high leverage, beta accelerates quickly, confirming a rising weighted average cost of capital beyond safe levels. Uh, pure comparison, Netflix's weighted average cost of capital of $11.5 billion. $11.2% is significantly higher than Disney and Amazon. This validates that Netflix faces higher business risk largely due to concerned revenue in streaming, higher equity beta, lower credit rating, and less diversified cash flows. The numbers align with financial expectations for a high beta tech-leaning media company. Uh, moving into our Execu. Increased leverage. Moderately. Target 15-20% debt weight. This brings Netflix closer to media industry capital norms, a lower weighted average cost of capital through tax shields, better balance between risk and return. Protect the bond yield credit rating. Do not exceed the leverage point where it spreads wide and sharply. Beta accelerates. Refinance. Increases. And then we're going to use project specific discount rates. So for us content, we'll use the 11.2% international content. We'll use the 13.2% and for the firm wide. Weighted average cost of capital after new debt. We're going to use 11.1%. This ensures project reflect their true geographic risks. Uhm. And then to match our financing to our assets, issue long-term debt aligned with long-term content amortization schedules. This stabilizes free cash flow and supports predictable investment planning. For a Quick summary, Netflix's weighted average cost of capital is 11.22%. The weighted average cost of capital drops to 11.13% after issuing $3BD. Netflix's higher weighted average cost of capital reflects high beta, low leverage, Concentrated business risks, the optimal strategy is moderate leverage expansion while maintaining credit quality. Weighted average cost of capital is more than a calculation, it is the bridge between financial theory and strategic decision making. Shaping which projects get greenlit and how companies grow. Thank you for watching my analysis.",
  "video_url": "https://youtu.be/slPrQ79ozyA"
}