{
  "student_name": "Sean Wu",
  "org_defined_id": "035909269",
  "username": "wu2053",
  "video_url": "https://youtu.be/vZFeW5IRMLc?si=b5vDJzgHgErGlx9a",
  "transcript": "Everyone um my name is Sean. So this is my session 12 assignment business val uh valuation and financial modeling where I value panera bread using a full drivers framework and I'll walk through uh the define discover represent employment value involve and reflect and then end with a clear bid strategy. So first starting with define and discover. So first what are we solving? So we need an um executive ready valuation for a potential KKR take private of Panera. So I'll triangulate a value with three methods. The first is DCF then trading comps and then percent uh percent transactions then overlay strategic synergies and summarize everything in a football field to recommend an opening bid and walk away price. So the key target context implied current revenue is about 6 billion will justify WCC terminal growth and synergy capture along the way. The output we want is an EV range for a financial buyer and a higher range for a strategic buyer that can realize operating synergies. Now going to um going to our represent section. So first of all all my codes here are generated with chat GBT and here's the plan I coded and then executed. So I modeled three five-year operation cases and the first is downside the slower uh the first the first is downside a slower storage ramp less operating leverage and conservative margins. Second is base which is a balanced growth with margin expansion from scale and digital. Then um last is upside faster store ramp and a higher digital mix lifting margins. So each case pushes through a standard free cash flow DCF with its own walk and terminal growth. For relative value uh I used trading um P anchors industry uh 22 times McDonald's uh uh times 25 Chipotle 35 times and percentant uh EBI aida multiples at 12 to 15. So now going to implement part let's walk the outputs exactly as they printed. um in my notebooks. So first is the DCF values which the downside DCF EV is 7.31 billion using walk with a 10% and G equals 2%. The base DCF EV has um 11.5 11.59 billion using walk 9% and G equals 2.5%. And then the last one is the upside DCFEV which is 12.26 billion using uh using a walk of 8.5% and then G equals 3%. So these three anchors our interestic value range across operating scenarios. Now going to multiples triangulation industry PE is 22 times translates uh to an EV of around 8.8 billion. The McDonald's PE of 25 times anchors EV around um 10 billion and Chipotle's PE 35 times to a million to a premium growth comp anchors EV around 14 billion and the president deals at around 12 to 15 times ITA imply EV around 10.8 to 13.5 billion. The next is the strategic synergies. I modeled I beta synergies of around 1 point uh 105 to two uh two 210 million uh 210 million and captured 70% of that range to be conservative capitalized at 12 times and the synergy EV ad is roughly um positive 1.26 billion to 2.52 billion. That's what a strategic can rationally pay above a pure financial buyer assuming the synergy realization and integration risk are acceptable. Now looking at this football uh football field chart on the football field you can see the DCF downside um base base and upside and the president low high and trading anchors and the gray overlay marks on the width synergy lines for a strategic acquire. Now going to validate uh I sanity check the DCF mechanics. So the PV uh terminal to over to EV sits at 71% in downside and 78% in base and 81% in upside right in line with restaurant sector profiles where long run cash generation dominance value and the first year to fifth year FCF's rise appropriately as margin scale to the downside FCF around 4 481 million and to FCF of 650 57 uh 65 657 million. The base FCF um is about 511 million and into FCFS of FTFS of um 1061 million. So finally I cross check that president 12 to 15 time sits largely inside inside the DCF space to upside corator corridor which it does. So our approaches overlap reasonably they're going to involve so putting it together the financial uh the financial buyer no synergy should anchor bids where presidents and DCF base overlap about 10.8 8 billion to 13.5 billion EV. That's the band where underriting returns can clear at 9 to 10%. And walk with realistic execution risk. The strategic buyers with synergy can justify basic DCF plus synergy ad that pushes the range to roughly 12.85 billion to 8.78 billion billion EV depending on capture and multiple. I also translated the base DCF to equity per share using placeholder net depth and share count about 015.91 per share. That's just a bridge metric for equity holders. So the bid strategy opening um opening bid um financial poster of one 11 billion EV low end of presidents supported by our downside safe case. The target deal zone with an 11.8 to 12.8 8 billion EV where base returns clear underwriting and sellers still see a premium to industry PE 2020 uh uh 22 times anchor and the walk away price is 13.38 or 13.3 billion EV top end of the no synergy range beyond which we need concrete concessions or seller roll over to keep returns intact if we pivot to strategic positioning with credible synergy plans and integration teams Dazzling can extend into the mid- teens EV but only with risk adjusted synergy credits and a stage earn outs. Now going to reflections here's the takeaway. So first we triangulated value with three methods that agree DCF at 7.3 to 16.3 billion presidents at 10.8 to 13.5 billion and trading anchors at 8.8 to 14 billion. The strategic synergies are meaningful positive 1.26 to 2.52 billion EV but not free. They require integration execution and deserve a haircut which I applied via 70% capture. For financial buyer the discipline lane is around 10.8 to 13.5 billion EV with a walk away of 13.3 billion. For strategic the justif just justifable range stretches to 12.85 85 to 8.78 billion EV with governance integr integration risk and control premium as the gaining items. So next steps I'd show the IC a short underwriting memo with uh the three DCF cases, the comm's president's tables, the synergy bill with KPIs, and the football field you see on on screen, plus a financial a finance financing plan and a negotiation scripts that sets our opening bid, our tradeoffs, and our walk away. So that completes my driver walkthrough and recommendation for Panera. And thank you for watching my video."
}