{
  "student_name": "Leon Francis",
  "org_defined_id": "037379655",
  "username": "franc103",
  "email": "",
  "transcript": "This is my response for the homework gate assignment and let us start off with the define and discover stage. So my goal for this assignment is to evaluate the market efficiency based on the GameStop short squeeze event of 2020 2021. So let us look at the key information that is provided to us. Um and if we look at the textbook, we have told that this is the assignment overview and we are trying to investigate the market effic efficiency using this case study of GameStop or GME as a ticker um to evaluate the market efficiency as I said and here are some of the important information that are given to us. We have the event timeline. So what exactly happened in this case study? So, we have GME nearing bankruptcy levels, there being a significant uh stake that's been bought by Ryan Cohen. We have the Reddit um Wall Street bets driven price search to $483. And we have congestional hearings on market manipulation and then postevent price stabilization. Here are the key data points. So we have um some data points that will be used within the uh analysis as we go through it. Here is the required analysis and there are five different aspects that we are required to analyze and I'll be going through them within the represent eval implement and evolve stage. So let us first start off by looking at the represent stage. And what I wanted to do in the represent stage is basically have a summary or foundation of the information that we have uh to help set up the implement and evolve stage just to have a great basis to work upon while also looking to validate some of the information that is provided to us especially the the statement. So the GameStop traded at 0.04 in August of 2020. So here is the represent stage code and it's if I just run the code it is going to give us um y there we go it give us a quick summary of the information provided to us. So we have the timeline we have the key data points but we also have the validification or verification of the that statement that we I just showed. So the game start stock price in Novea 2020. So Python has actually looked back into Yahoo Finance. So here's the Yahoo Finance um um aspect of the Python code and it's going to check the price at the given um date. So after checking that price, we see that the claim is invalid. The verification status is invalid and the actual cost was actually $1.04 on 2020 August uh 3rd of August 2020. And then yep, here we go. We have a quick summary. The statement is highly inaccurate. The actual price in the first trading day August 2020 was $1.04 and is roughly 26 times higher than the stated not. 04. So we now we have a a base to work upon as we have a clear understanding of the information provided to us and we've even taken the step to validate some of the information that was provided to us to get the best out of the analysis that we're going to start. So let us move to the implement stage. In the implement stage I will be focusing on essentially testing the efficiency of the market. Now the efficiency of the market is an aspect or concept that refers to the market being perfect and yeah the market it so what this essentially um the idea of the efficiency market hypothesis states that the market is always perfect and there are no unexpected changes that can occur in the market because um there's free information and everyone has access to the same information. So there's no chance for unexplained or yep unexplained price or abnormal returns or abnormal um changes or fluctuations in the stock prices and that's the and if we go to the textbook uh we can clearly see what the actual definition is. So stock prices fully reflect all the available information making it impossible to consistently achieve abnormal returns through analysis of publicly available data. And these are the three forms of market efficiency. So we have the weak form, the semi- strong form and the uh strong form. So what these three forms of market efficiency tell us is that there are different levels of what doesn't work in terms of in the weak form technical analysis doesn't work to give you a advantage in um you know prices or returns. So prices reflect all past prices and volume information. Whereas for semi- strong uh firm the prices reflect all publicly a available information. Therefore fundamental analysis doesn't work. And for strong firm prices reflect all the information including private information essentially stating that the insider trading doesn't work. Now let us move to the code again. So here the code is actually going to run all test all the three um market efficiency types and see which one is in violation which one the GME um case study violates. So first off to test the weak form EM violation we see how the condition is that um here's the clear calculation of it. So autocorrelation of return should be near zero and that is the condition that's required for a weak firm uh economic market hypothesis violation. So after the code runs the I we'll see it towards the end but this is the setup for the weak form violation. we have the semi- strong EMF violation and for the CA the condition for this is that the total uh C which is accumulated um abnormal return should be near zero and this is the way it's actually looking at the real-time data and the code is calculating the values. Now here are some of the equations. So the expected return equation is actually um the alpha plus the beta times the return of the market. And we know how the beta and alpha values are used to measure how the stock actually moves relative to the market. Now the abnormal return is actually calculated um these are two different equations for the abnormal return and cumulative abnormal return. So we have the expected return which is the alpha bliss beta times the event data. So get it from the real time Yahoo finance data itself. For equation two we have the abnormal return and this is the actual return of the market minus the expected return from the market. And then we have the cumulative abnormal return. So which is the cumulative product of 1 plus the abnormal return minus one. Now and then we have lastly the strong from EMH violation where the condition is that the strong from EMH is violated if the insiders cannot earn abnormal returns. As we know this form of this type of market efficiency is based on having access to insider information. So if you run the code we see quite a lot of data but we we have clear u conclusions to be made from the uh analysis and calculations. So first off you know we the the Python code tells us the data download was complete but secondly we see that the weak from EMH violation was violated as there is a higher autocorrelation value which suggests that past prices could predict future movements during the squeeze. This is in violation of the weak form as we saw that the past prices reflect all prices all prices reflect all past prices and volume information. Therefore, technical analysis shouldn't work whereas here technical analysis would work could predict the future moments during the squeeze. Semi strong was massively violated as there is a large um accumulated uh abnormal return which shows public information and this goes back to the spread of information in Reddit and that's was not reflected efficiently and these um the uh the aspect of spreading information of Reddit can link back to behavioral financial challenges such as behavioral biases including anchoring. So over relying on the first piece of information received and hurting. So following a crowd behavior rather than independent analysis. And now for strong em violation was well strong em form em was also in violation as public information caused a massive abnormal return and strong and then here is the analysis volume analysis and behavioral prep. So we see the volume factor the peak volume is actually 16.3 times larger or yeah 16.3 times the prevent average and this is the peak that we see and this is the accumulative abominal return for the GME company. You can see how there's a clear peak during that squeeze and then this balances out as said in the represent stage. So impos the we get the final statement implement stage is complete weak semi- strong and strong from EMH were all empirically or logically violated. Now to validate this um it goes back to the um implement code actually because the red line that we see is the concept of how the market should be in terms of the economic market hypothesis or efficient market hypothesis sorry as there should be no price fluctuations because perfect information is available to all users within the market. Now if we look at the actual data in uh Yahoo Finance, we see the same peak being resembled around the August of 2020 or between 2020 and 2021 and that is the similar to the cumulative abnormal returns. So it correlates well and shows that this is a valid assumption or valid finding from the data. Now let us move to the evolve stage. The evolve stage is more conceptual. It's not uh really um you know quantity or value based. So if you run the code as the evolve stage I primarily focused on the rational investor pro profitability analysis and the theoretical implications. So this code is just to you know write down a clear um analysis of what is actually going on at uh in this squeeze or GME uh case study. So evaluation of systematic profit opportunities. So we see that there will be for under EMH prediction so efficient market hypothesis there should be no systematic profit for a rational investor. However, in reality, we see a cumulative uh um cumulative abnormal return, sorry, of actually 303.89 and this was actually calculated right 3%. So, we see how the estimated alpha for the abnormal return was 0.0044 0044 and the estimated beta was 1.16 which is quite high. So we see how the total accumulated this is back referring back to the implement stage code. So we see there's a 313% um C value and that just shows how deferring or how deviated that the market is moving compared to the EMH philosophy or concept. Then we get to the X on tier and before the fact. So systematic profit was highly unlikely because there was a high risk and unpredictable duration before the fact that the actual you know peak actually happened which is not rational investing and we have the analysis of risk adjusted returns and limit to arbitrage our arbitrage. So the risk is that the high volatility estimated by the standard deviation of approximately 0.35 means that returns were not truly risk adjusted for the unique market microstructure risk and the limits to arbitrrage were that rational hedge funds could not profit by shorting due to the high stock borrowing costs and the marginal costs and the risk of infinite loss is a major limit. If he and if I want to provide a clear explanation of this, I have Gemini right over here. So what that is essentially telling us is that the exante before the event a rational investor could not plan for this as this is a completely unexpected um spread of information and the profit required extreme risk and as the duration was totally unpredictable. The limits to arbitrage essentially tells us how they f the people investing faced a risk of infinite loss if the price kept rising along with high borrowing costs. Now let us move on to the um assessment of information advantages. So we have the primary advantage was not insider data but the publicly available data and this connects back to the idea of anchoring and hurting and how there's information or manipulation of information in uh Reddit and other um social uh media or not social media but public um information pages. Then we come to the theoretical implications. So we have the EMH versus the behavioral finance framework comparison. So EMH failure we have the massive you know 313% um accumulated uh abnormal return and the price peak far above the analysis analyst fundamental value demonstrates the failure of the concept to explain price formation. Behavioral finance is actually successful here because concepts such as hurting driven by the 16.3% volume spike and the fear of missing out successfully explain the disconnect between the price and the actual value. And this connects back again to the learning and anchoring processes and other behavioral biases resulting in such peaks. Now let's move on to the active versus passive management implications. So under the active management the event proves that the cross in efficiencies exist but exploiting them requires extreme risk tolerance because you wouldn't know what exactly would happen in such a unpredictable period. So you need perfect timing and high risk tolerance. Then we have passive management and this event reinforces the principle that while extreme anomalies occur, the associated extreme risk and unpredictability is not worth taking because they're unsuitable for the long-term rational systematic profit. Lastly, we have market efficiency policy implications. So for market uh microstructure regul regulators must address the liquidity clearing risks demonstrated by the training halls to ensure that the market can handle extreme volatility driven by the retail coordination for transparency. This calls for this calls for faster and more frequent reporting of short interests to provide the genuine public information reduce the market fluctuations and frictions which are exploited by coordinated buyers. This again goes on too uh more specifically the anchoring process or bias because once someone picks up on the information and tries to follow it, they will likely gain momentum because other people are seeing how the prices of the stock is fluctuating and how that's impacting the interest from other investors. So you need to have clear transparency in terms of information so that people don't fall for you know false signals and this comes along with the manipulation aspect of it as the case this case highlights the difficulty of policing policing decentralized on social media platforms under existing market manipulation laws. again referring back to the what exactly happened in Reddits and what caused this peak for GameStop Corporation in the first place. So to reflect, determining market um market efficiency is quite a complex process, but I thought it was a very clear um process to implement that helps us understand why prices are not uh prices do not align with the efficient market hypothesis. As we cannot control what others do and there's always going to be you know spread of misinformation and you know high risk tolerating people or low risk or yeah high risk tolerating people who will try to take the extra risk to get the most the highest profit margins that they can gain. And the idea of profit margin is completely ignored in the EMH policy because they believe that the um pro you know prices will not fluctuate when all perfect information is available. So for GameStop Corporation, we see that market efficiency was not met during that case or during that period for the case study. And that it was interesting to see how many different aspects such as you know behavior biases, uh market policy implications, passive management, um and risk adjusted returns. how much different things that can go into the market efficiency concept and how much all of them interlin to give us a better understanding of what is actually going on in the market and how we should understand it. Thank you.",
  "video_url": "https://youtu.be/2Wry_mcdAlI"
}