{
  "student_name": "Galiena Colon",
  "org_defined_id": "037271356",
  "username": "colon34",
  "email": "",
  "transcript": "Hi everyone. Today we're going to be doing session 10 and we will be using the driver framework to guide us through the problem. So our mission today is to evaluate Starbucks's proposed flagship roaster that requires a 12 million upfront outlay and is expected to operate for 10 years. We're going to be using the firm's 8.5% whack as the hurdle rate to determine whether the project creates value and to recommend an accept or reject decision. And then below we have some of the project parameters that we were given, information about the in initial investment, working capital, the revenues, the operating cost involved, and the tax rate and the terminal value. And we'll get into all of this later. On to define and discover. The objective today is to determine whether Starbucks should accept or reject the proposed flagship roaster project. For the scope and horizon, we will be using the incremental cash flows of the proposed roastery project to calculate the project's MPV, IRR, and other metrics to make the decision. Our time frame is the 10-year operational period from year 0 to year 10. And then this analysis is for Starbucks management and executives. Some of our constraints is that we'll need an investment, initial investment of $12 million. Our hurdle rate is whack at 8.5% and we'll be using this for the discount rate and it it'll be a benchmark for irr. And then our depreciation method is straight line. For data inventory, we were given all the necessary data to calculate the for the core cash flow model. And for the calculations and to make a decision on this investment, we were given information on the initial investment, working capital, revenues, operating cost, tax info, and the terminal value. So we have everything we need for the su success metric. The primary success metric is MPV and our success condition will be when NPV is greater than or equal to zero. As for the benchmark or sanity check, the NPV sanity check will be the IRR. The project should be accepted if the IRR is greater than or equal to whack. For a standard project, the NPV and IRR rules should lead to the same accept and reject decision, but if they conflict, the NPV will result will prevail. But the conflict should would signal a need to check the calculations. And then the payback period sanity check if the discounted payback period is significantly shorter than the 10-year project life. Check if we need to check if the discounted payback period is significantly shorter than the 10-year project life. And then if the payback period is close to or longer than 10 years, it is a sign of a very marginal project even if the MPV is slightly positive. So onto the represent stage, we need to map the complex cash flow structure. And first I just want to outline some of the numbers that they that were given to us for this situation. The initial investment is going to be that $12 million. The working capital is going to be $500,000 and it's going to be deployed at launch and recovered at the end of the project. For revenues, year 1 is $8 million, year 2 through 5 is 11 million and year 6 through 10 is 9 million. For the operations costs, we have cost of goods sold is 40% of the revenue. Labor is 2.5 million. Rent utilities is 0.8 million. Marketing is 0.3 million for the first year and 0.1 million for year 2 through 2 through 10. For the depreciation period, it's 10 years and we're using the straight line method. Terminal value is 3 million. Corporate tax rate is 25% and then the whack is 8.5 like we said before. So onto the equations. The main equation that we'll be using throughout this is the incremental cash flow equation ICF. So for this equation, we'll be needing the initial outlay for time period t, the operating cash flows for time period t, and the nonoperating cash flows for time period t. And then how do we find the operating cash flows? This equation is the revenue minus the operating cost times 1 minus the tax rate plus depreciation time the tax rate. And this is the tax shield coming into play. And then the depreciation is equal to the initial investment divided by the number of time periods that we have for the scenario. In this case, it's 10. And then for the operating cost, it'll be the cost of goods sold plus the labor plus the rent and utilities plus marketing. And that cost of goods sold again is find found by the 40% times the revenue. And then how you find the taxes, it's the revenue minus the operating cost minus depreciation times the tax rate. And then for the nonoperating cash flows, it is the terminal value minus taxes on sales plus the working capital for year 10 only. And then a little look into our capital budgeting timeline. Here I've calculated out year zero and then what year 1 through 10 would look like. And then year 10 would also include that terminal recovery. And then for our core capital budgeting metrics, we're going to be doing the MPV calculation, which is our initial outlay plus the sum of our operating cash flows discounted by our whack. And then our terminal recovery also discounted by our whack. And then we're going to be calculating the IRRa also the profitability index. And then the payback period we will also be finding for the payback period we will be finding the simple payback period which is the time t required for the cumulative undiscounted cash flows to equal the initial investment. And then we will also be finding the discounted payback period the time t required for the cumulative present value of cash flows to equal the initial investment. Now on to the implement stage. Let's jump through the code. And this is just a little outline of everything that my code is going to be doing. So to start off, this code just calculates everything for the base case scenario and then gives us a graph of the cash flows. So to start, it gives us all the parameters like the assignment asked and this would be helpful if we wanted to switch something out and see the calculations and how they changed. So to walk through the code, the first thing it does is calculate the depreciation, which is just the initial investment divided by the depreciation period. And then it goes into cash flow construction. It finds the initial outlay for year zero and then calculates the year 1 through 10 calculations and then it's finding the operating cost here, the earnings before taxes right here using this equation. Revenue minus operating cost minus annual depreciation. And then it's finding the taxes. the net income, the operating cash flow, which is that net income plus annual depreciation. And then it's finding the nonoperating cash flows, taking that terminal value into account and the working capital change. And then it's finding the tax on sale here and also the non-operating cash flows. Again, that terminal value plus working capital recovery. It goes into finding the incremental cash flows. And then here it is doing the core capital budgeting metrics where it's going to find the NPV. It's going to find the IRRa and it's calculating the profitability index and then also that simple payback period along with the discounted payback period. And then it goes into an analysis on all the functions. And this is really just for the output here. It's creating the visual for us of those cash flows. And yeah, just kind of printing everything out. And then here is our output. So the decision that it says is that it's going to accept it. And it says based on the core financial metrics and the base case, the Starbucks flagship roaster projects project is expected to create shareholder value and should be expected. And then it just gives us the net present value is 2,690,000. So this is positive. And then it basically just says that it's since it's positive like we can accept the project. And then for the IRRa it's 12.84% and it says the IRRa is substantially higher than the 8.5% whack providing a healthy safety margin and affirming that this project is value creating. And then for the profitability index it is 1.22 and it's supposed to be greater than one. So here it passes that test. And then the discounted payback period is 1.21 21 years and it says that this is also acceptable and then it gives us a chart of all the core capital budgeting metrics the MPV the IRRa and so on and it lists those there for the base case and then we have the incremental cash flow schedule where we can see all those cash flows laid out for us and I also created a graph and here it shows us in year zero because we have that initial investment that's why we're in the negative but then for all the rest we are in the positive this code is now for our sensitivity analysis and I'll run through it quickly just so I don't take up too much time but this is the sensitivity analysis for the revenue - 20% and then for our whack. So just to point out a few things it gives us our parame parameters in the beginning just in case we want to change anything and then we go into it and here it shows us what our sensitivity is. It's going to be doing a sensitivity analysis on the revenue when it's down 20%. And then for whack, it's going to do a sensitivity analysis when it is down 2% or up 2%. And here it's just doing the visuals. And then here is our output. And then in the output, it gives us the base case analysis again. And then also gives us a graph showing all the core capital budgeting metrics for each of the different scenarios. the base case the reduced revenue and so on. And so here we can see that for the revenue reduced scenario it the MPV is in the negative which means that it is very this scenario is very sensitive to the revenue reducing and the whether we accept or reject is very sensitive to the revenue reducing but for the whack when it's down 2% or up 2% you can see that the MPV is still in the positive which means it's not as sensitive and so this kind of outlines it here basically saying that this scenario is very sensitive to the revenue decreasing but is not so much for whack. And then down here we have a few graphs just to kind of visualize some of these sensitivity analysises. And we have the MPV sensitivity to whack change. And we can see that the MPV throughout these whack percentages is still in the positive. But for the revenue decreasing we can see that for the base case the NPV is positive but when the revenue decreased the NPV is in the negative and then here over here we can see that for the base case it does meet the whack and is the IRRa is above but for the negative 20% revenue the IRRa is below and it does not meet that whack percentage. So for the validate stage, first we're going to check the model integrity and we're going to do this by checking the year 2 calculations on Excel. And then we're going to do a sanity check, confirm the primary decision metrics, follow the rules. Do NPV and IR lead to the same decision? So let's go check that out. So just to make sure that the code did the correct calculations, I did the year 2 calculations, the cash flows by hand on Excel. And we can see that the output is 2,700,000 and the code has the same output, year 2, 2,700,000. So here we're going to do a sanity check for the base case calculations. So the MPV must be greater than zero. For the base case, it was 2,60.69. 69 and then for the IRRa it has to be greater than whack at 8.5% for the base case it was at 12.84 and then for the payback period for the discounted it has to be less than or equal to the project life and in this case it was and then also for the simple payback period it was also less than the project life and then for the profitability index it has to be greater than or equal to one and for the base case it was at 1.2 And so what does this all this means? Positive MPV confirms value creation. IRRa is 1.5 times than the whack indicating a strong return. And then for the payback periods, the investment was recovered quickly minimizing liquidity risk. And then for the profitability index, it will be returning $12 of the value of value for every $1 invested. For part two of this scenario, let's take a deeper look into the decision robustness and we're going to be looking into the stress test for negative 20% revenue and for the whack. So here are the different sensitivity tests that we have done and we can compare them easily. We can see that the MPV for the base case was positive like we said for the revenue one it was negative and for the wax it was also it was positive. And then for the IRS, the only one that changed was the revenue scenario. And so the revenue scenario shows us that a 20% drop in revenue causes the MPV to become significantly negative, indicating the project is highly sensitive to sales and would be rejected under this adverse condition. But when the whack changes and the MPV is still positive, it shows us that the scenario is not sensitive to the whack changing. And then lastly, I just wanted to see how much margin we had with the IRRa and whack and then what our margin was with the revenue and how much it could decrease before we started getting into the negative NPV. And so I did run code to find the break even revenue. And here it gives us a chart showing us what the annual revenue would need to be when it when the MPB breaks even and equals zero. And so it also does give us the percentage that it can decrease annually. And that's 9.3% that it can decrease and then it will break even. And then here is the break even whack analysis. And we can see that we have a margin of 4.34%. And so a margin of 4.34% for the whack suggests that the project's acceptable that the project's acceptance decision is highly robust against changes in general economic conditions or the risk profile of Starbucks as a whole. But as for the margin for the revenue, 9.32% really isn't the best that it could be because competition, tourism drops, or shifts in consumer behavior could easily cause a 9.32% revenue shortfall, especially in the early years. And so to continue on with the validate stage, I just wanted to look into what are some other reasons that would cause us to reject this scenario and reject the investment. And so for increased initial outlay, some potential scenarios that could cause an increased initial outlay would be like construction delays or cost overruns. And then for decreased operating cash flows, this is our most common failure for this scenario. Some things that could cause decreased cash flows would be market competitors coming in, operating inefficiencies, economic downturn, and so on. And then for the increased discount rate, this wouldn't be as big of a problem as we saw in the sensitivity analysis because we weren't as sensitive to the whack increasing or decreasing. But if the whack was to get higher than 12.84%, the NPV would start to become negative and this would be bad. So from the validate stage, I have discovered that our biggest sensitivity for this scenario is that revenue dropping causing our NPV to be less than zero. Onto the evolve stage, I found that one of the limitations of the capital budgeting is that it ignores the non-monetary benefits and risk. So I just wanted to have dive deeper into some of those benefits and risks. So the first one would be brand elevation. And this would just the roaster would cause customers to have a positive perception of the brand as a whole and it would just signal high quality and it would justify higher prices across all standard retail locations. The second benefit would be that it would be an innovation hub and this roaster would allow Starbucks to test new methods without kind of disrupting that core chain. And then lastly, it would be a competitive differentiation. So for some of the risks that we'll want to keep in mind, the first one is cannibalization of core business. So we'll want to make sure that we're not pulling customers away from some of our other lowerc cost Starbucks locations because this wouldn't be good. And then brand alienation is the roaster concept, is it too expensive and exclusive? And does it really fit our brand image? So we want to make sure that it does. And then executional and operational complexity. This roaster is definitely a complex operation and any operational failures are highly visible and could tarnish the brand's image. And then long-term strategy shift risk. The project does make us commit $12 million to a specific high-end strategy for 10 years. And if the consumer tastes shift away from the elaborate coffee and experience, then the roaster could become a stranded asset. So the last stage is reflect. And this is the executive recommendation for the Starbucks flagship roaster project. So my recommendation is that we accept but with mandatory risk mitigation strategies. So coming back to what we calculated and just proving why this is a good decision. We have all of our core budgeting metrics and they did pass all of the tests. Yes, we are creating value. Yes, the return is higher than whack. Yes, we're getting paid back faster than the project life. And yes, our profitability index is greater than one. So, we are creating more value for every dollar invested. Yes, the MPV is greater than zero. However, the small magnitude of NPV relative to the $12 million investment indicates that its acceptance should be heavily weighted by strategic and non-monetary benefits. So, for strategic fit and brand implications, the roster project offers significant non-monetary value that justifies the marginal financial result. And we did look at some of those benefits in the evolve stage. Just to name a few, we have brand elevation, innovation and R&B, DHUB, and the competitive differentiation. It's separating itself from competitors. So yes, this roaster is a strategic fit because the flagship roaster aligns perfectly with Starbucks's premiumization strategy, shifting brand perception towards high-end experiential coffee. And then for brand implications, it enhances brand equity and serves as a global showpiece driving intangible value that's not captured in the financial model. So in accepting this investment decision, we're going to want to keep in mind the key project risk and required mitigation. So the sensitivity analysis revealed that the primary threat is revenue volatility. Through the sensitivity analysis, we saw that for the revenue shortfall, that 20% drop in revenue causes the MPB to become negative leading to rejection. So the mandatory conting contingency is that we'll need institute tight revenue monitoring. If year one revenue falls below 90% of the projected 8 million, management must activate an option to abandon plan. Next, we'll need to keep in mind that if management does choose to use a project specific whack that is greater than 12.84%, the project would be rejected. And so, we're going to need continuous val validation. Conduct quarterly market surveys to confirm the risk profile and cost of equity remains stable relative to the initial 8.5% whack assumption. Then we have the risk of operational complexity, the high risk of cost, overruns, and failure to deliver the premium experience due to complexity. So for this, we're going to have an execution focus. We need to dedicate a top tier project management team with experience in high-end retail construction and food service to prevent delays and ensure operational excellence. And then for the non-financial project risk mitigation that we and some of the risks that we looked at that are non-financial that we saw in the involve stage for the competitive risks we should use the initial launch period to aggressively capture brand loyalty positioning Starbucks roaster as a experience and then for the risk of cannibalization of core business we need to strategically locate the roaster in an area where local Starbucks's concentration is low and there is a distinct customer demographic. And then for the brand alienation and image risk, we should use marketing to frame the roaster as the source of innovation that benefits all stores. So it's not an exclusive club. And then for the long-term strategy shift risk, we should design the facility with highly marketable non-specialized elements that can be easily repurposed if we did need to liquidate or use that option to abandon. And then lastly, we should negotiate favorable lease terms that allow us for midlife strategic exit. So for the final conclusion, we are accepting and while the financial return is marginally acceptable, there is other non-financial monetary benefits that outweigh the moderate financial risk. And then although we are accepting we must it must be contingent upon the implementation of robust risk mitigation strategies focused heavily on that immediate revenue performance and the project should be treated as a strategic option where failure to meet early stairs target should trigger an efficient exit plan. Thank you.",
  "video_url": "https://youtu.be/aCdYTHNotAk"
}