{
  "student_name": "Caden Mainville",
  "org_defined_id": "037229244",
  "username": "cmainvil",
  "email": "",
  "transcript": "Hello, this is management 310 assignment nine. We are tasked with calculating the weighted average cost of capital for Netflix and then also connect it to a hypothetical $5 billion investment decision and perform an investment analysis. So the analysis will go as follows. First we will have to determine our weighted average cost of capital. Then we'll have to evaluate an impact of additional debt financing. We're also then going to assess project specific uh versus firmwide discount rates and how that differs. And we're also going to compare Netflix's cost of capital to industry peers so we can get a good comparison. And then to wrap it all up, we're going to recommend an opt optimal cap an optimal capital structure strategy for Netflix. More specifically, um, we're going to have to look at a $3 billion debt issuance. We're then going to have to look at the project specific specific whack and do a UT uh, US content versus an international content evaluation. And then we're going to compare Netflix to Disney. And then lastly, uh, the optimal capital structure strategy. So here's the data we are given. So we're constrained to only this hypothetical data. But to go ahead and run through it, we're seeing a market capitalization of 200 billion. We have total bet total debt of 14 billion for book value. And then the market value of the debt is 13 billion. We got an equity of one or equity beta of 1.3. And then along with all these other details that we're going to use to do our analysis, let's go ahead and move into our represent stage. So this is going to be our analytical approach. So a brief overview of what we're doing. Basically, we're calculating the weighted average cost of capital. We're analyzing and recommending an optimal strategy. So to start, we're going to calculate the whack and the CAPM. Um from there, we're then going to evaluate and discuss what it means and how it plays into the specific um investment analysis. to get a little more specific into the weighted average cost of capital. It's the weight of equity multiplied by the cost of equity. Same thing on the debt side all multiplied by uh one minus the tax tax rate. And we'll be doing a little more calculations with that later on in our model. Next, we're going to model the impact of a $3 billion debt increase. We're going to find the new debt level and evaluate from there. We're then going to evaluate project Pacific um whack which is going to show us the US content versus the international content and we are going to assume the US has the same beta while international has slightly higher and that would make sense because international we would be taking on more risk. Uh to move on we are then going to compare the whack to industry peers more specifically Disney. We're then going to uh compare and explain the differences and um analyze both of them in their own ways. Then we're going to discuss additional factors such as tax shield weights and um other characteristics that play in to our whack our whack estimation. And then to wrap it all up, we'll be finding an optimal capital structure for Netflix. and we'll explain why. To add on, we'll also be performing a sensitivity analysis to leverage and uh looking at different leverage scenarios and then being rational and looking um on the outside to then make a decision. So to firstly define weighted cost of or weighted average cost of capital, it's basically a benchmark that investors would be okay with of hitting um to actually want to invest and make it worth their while. So let's go ahead and dive into this first section. We're going to be determining the current weighted average cost of capital and also the CAPM. We're going to start on the CAPM side because we need that to further calculate um our weighted average cost of capital. So we have the existing parameters here which I fed into the code and then it has the formula which is the cost of equity given here which is the risk-free rate plus beta times the market risk premium. And once it does all that calculations we get a CAPM of um 11.65%. to bring it back up to whack. So, we have our same parameters here all given so it knows how to calculate. Here's that CAPM calculation we just did. So, the first thing we're have to do is calculate the cost of debt after tax. After we do that, we're going to have to determine the market value of equity and also debt. Next, we would want to calculate the firm's total value. From there we then calculate the actual weights of equity and the weights of debt. And then from there we can complete the whack formula as seen here like we talked about earlier in our represent stage. So after all of that we are given a calculated whack for Netflix of 11.22%. So this value would represent the average rate of return that Netflix would be expected to pay its investors to finance its assets. This number can also be used as a discount rate for evaluating new projects or even other evaluation purposes. Uh obviously we have to make sure our calculation is right. So let's go ahead and do a quick verification of that. All right. So as seen here, here's our CAPM calculation that we did earlier. We have the uh cost of equity uh plus the beta times the market risk premium. Then we're going to find the after tax cost of debt. We're then going to find the market value which is basically just the equity plus debt. And then we can find the weighted averages between those. From there, if we plug it into the formula, as we said earlier, and once we do this calculation, it does come out to 11.2, which is what we got in our model. So that all checks out. So we're good to move on to the second part of the analysis. So let's do a little scenario analysis. So now let's say we have a $3 billion debt issuance. How would that change our weighted average cost of capital? So moving into the second part of our model, we're basically just going to calculate the new debt level. Just adding on the $3 billion extra. We're finding the new values, finding the new capital weights, capital structure weights, and then we're just simply recalculating the whack after that. So the current whack, as said before, was 11.2. Now it sits around 11.13. So the change in whack would be a 0.09 percentage point difference. So for this scenario, we can see that the cost of capital has decreased by a small margin. But this is a common outcome as a when a company takes on more debt. Um so now let's touch a little bit on what a tax shield is. So the tax shield effect specifically refers to when a reduction in the company's taxable income due to interest payments on the debt. So then since interest and expense is tax deductible, it would reduce the amount of income subject to the corporate tax which effectively lowers the actual cost of debt for the company. So for a like a real world example, this would be um this would be good in a cost of capital calculation because it would reflect the actual tax advantage uh given by the calculation. So while this seems good and it might seem like a smarter way to take on debt, but there are trade-offs involved. So as increasing debt can initially reduce the cost of capital by leveraging the tax shield. Um it can also increase the company's financial risk in total. So basically this means that higher leverage means more fixed interest payments and a more risk of default if the company faces financial difficulties. So basically it really just comes out to finding a good balance to create an optimal capital structure for whatever company you're involved with. So now we can dive into the third step of our analysis. Let's evaluate the project specific cost of capital. So to really get into this um we are first assuming the same risk as regular businesses for within the US and then for international we are assuming higher risk which just increases the beta. So once that's done, uh the US cost of capital would be the same as we've been doing because we're assuming the same beta, but the international content um increases. These numbers basically act as the hurdle rate, which we'll get a little bit into right after this next visualization. So right after here is basically the exact same code as we wrote before, but all the uh difference that is doing is putting it into a visualization. So we can really see the uh difference between the two. We can see that international we would have a higher hurdle rate and with a US we would have a lower. So this is a good v visualization because you can kind of think about it like you have to jump over this in order to kind of make it or make it justifiable. But as said earlier these act as hurdle rates for capital budgeting uh decisions. Basically what a hurdle rate is is the minimum acceptable rate of return for a project or investment. um it's basically basically in order to be considered value adding it needs to exceed the expected rate of return but for what we actually calculated we can see that uh for within the US it's the exact same and it would be taking on the exact same risk and return but for international it would be a little bit different since a higher beta signifies greater systematic risk so basically this risk translates directly into a higher cost of equity and basically a higher overall cost of capital and that's how the uh US content versus international plays into cost of capital. All righty, let's dive into step four of our required analysis. We're going to compare Netflix's cost of capital to Disney to Disney's sorry, excuse me. So, we're already given Disney's cost of capital and our data and what we were given and we already calculated Netflix's. So, let's go ahead and compare the differences. We can see that Netflix has a significantly higher cost of capital than Netflix. Um, the difference is about a 3% uh is about 3% sorry, excuse me. But let's talk about why these differences are actually happening. And it's actually attributed to several factors. So first it's it applies into the business risk. So Netflix operates primarily as a streaming ind industry which is very very competitive and always evolving. Disney is a bit more foundational and it has a significant streaming presence. Um and it has just a great business model that includes other things besides just uh streaming. So it has other stable cash flows. So the diversification leads to lower business risk which results in a lower cost of capital. We can see that there's some leverage differences. Uh the mix of debt and equity that is um so Disney Disney's capital structure has about a 70 to30 equity to debt ratio. um which would indicate a more conservative approach to leverage and a more optimal balance to minimize cost of capital. But the current model for Netflix has a higher proportion of equity which would result in a higher cost of capital. So that also plays into a difference plays into the differences. So as mentioned before the diversification uh Disney has more assets and the different revenue streams compared to Disney or compared to Netflix. So that being said, it's more stable and a less risky company in general. And then as far as the credit ratings go, it's not explicitly modeled here or said in the analysis, but I wanted to touch on it a little bit. But overall, we think that Disney is a little bit more financial stable and trusted within the business world. So it might have a stronger credit rating than Netflix. And that could also play into the risk differences into the cost of capital. All right. So before we dive into the optimal cap capital structure strategy for Netflix, I wanted to touch on some additional considerations when we're talking about cost of capital. Firstly, let's talk about well the difference between a market value and book value. So the market values for equity and debt should o should should always be used um rather than book values. The market value in general reflects the current investor uh perception of the company and its future. Um so it basically provides a more accurate representation of the cost of capital. as far as book values goes, um they don't accurately reflect the current economic re uh reality of the company. So that's the differences between the two and it's definitely important when we're thinking about cost of capital. So the difference between the target rates and current weights um ideally cost of capital should be calculated with the target structure weights rather than the current ones. This is because the target weights would reflect the long term while the current ones reflect the short term. So it might be might be better to get an idea of where we're aiming and if projects are sustainable and if the cap capital structure will stay maintained. Now let's look into some special securities. We see that for companies in more complex structures, cost of capital must also account for special securities such as preferred stock or convertible bonds. So a preferred stock for instance um has a distinct cost and would and would be included as a separate component in the cost of capital um formula. Convertible securities are a little bit different but um there is a point where they become equity and it's similar um to preferred stock. But when doing very detailed analysis, it is very important to look to see if the companies have either of these two and also how it plays into your um investment decision. I'm just going to quickly touch on this one. The effective tax rate should be used um instead of the statutory rate. And then also the interest tax shield is critical when debt financing um because interest payments are taxdeductible. So it would reduce the cost of debt. So let's go ahead and look at offbalance sheet debt and content commitments. It's absolutely vital to consider these uh because it plays plays a different role um outside of the cost of capital equation. Basically uh what these do is represent future financial obligations and they also effectively increase the company's financial leverage and risk. So that's because they have other obligations outside of this and they're committing to things that they are saying that they need to get done. So investors are expecting that. So while that doesn't play too much into this analysis, it's also good to know uh looking forward. And then we touched on this a little bit earlier, but a company's credit rating uh directly impacts the cost of debt and overall financing flexibility. I mean, if you think about it at a in a intuitional or um if you think about it intuitively, um a company with a higher credit rating would signify less risk and if they had a lower credit rating, it would have more risk. So, you would trust the person with a more credible resume. So, that's some other considerations to look into when we're doing cost of capital estimations. Now, let's go ahead and look at the optimal capital structure for Netflix. So, before we make any decisions, we're going to have to look at some uh scenario sensitivity analysis. So, I went ahead and made this small graph to look at different cost of capitals and how it plays into leverage. So what it did was was plot some hypothetical cost of capital and what we can see from this graph is we can see that the higher uh debt to capital ratio would mean higher cost of cap or sorry lower cost of capital. So for our examples we can see the uh the current debt weight and the new one we can see how taking on more debt would lower our cost of capital. And if we did that all the way down, we can see how that could um change things. So this is some good uh scenario analysis to get a good idea of cost of capital sensitivity in relation to leverage. Now that we have the visual, let's actually put this into a table. So what we're doing is making some hypothetical scenarios and we're going to compare cost of capital to leverage and see how that changes um our actual cost of capital. So we have the same market conditions throughout and um the same cost of equity and cost of debt that we've been using for Netflix. The only real differences would be shown down here which is uh the increases in debt um growing as we move on. So we have the two examples that we went through here and we can see as we keep adding on more debt our cast cost of capital um continues to get lower and we can see that the scenario with the lowest cost of capital would be the one with the highest leverage. So you might be thinking lower cost of capital might be better because it's a lower hurdle to get over but there's also some trade-offs we have to consider. So, while it would be the lowest um if we had a 40% debt to value ratio, that level of leverage could trigger credit spreads, could have some more ratings pressure and require um a higher return on equity, which are effects that are not captured in this simple model that we have to take into account. So for a grow a growth oriented business like Netflix after taking into those real world constraints a more balanced target would be probably around the leverage percentage of 15 to 25. So being in this range we can see that the cost of capital is lower than what we have today. So it would capture a more meaningful tax benefit along with a cheaper weighted cost of capital while also remaining um below high a highly leveraged capital structure that would basically compromise the financial flexibility of Netflix. So this would basically put us in a good spot. To sum it up, we would target a 15 to 25% debt to value ratio. I think that would make most sense and put us at a um cost of capital between We'll say around 10%. But we can do this because Netflix currently um underleveraged and has some room to lower the cost of capital, but it also stops short of aggressive leverage levels where a financing risk could come into play. Uh so quickly before I dive into the reflection, I wanted to run through my Gemini logs. So basically told it to act as a financial analyst and tutor to determine the cost of capital. Gave it all the data that it needed to do and uh I told it how to put it out in a clean manner to which it did. And then we uh also extended the analysis to um account for the $3 billion debt increase. Um had to do some more work with it to make it what I wanted. Uh then we had to estimate the project specific cost of capital with this prompt. Um and then we had to do um I had to change some of the wording within to hit some of the talking points that I wanted to cover. Uh then we had the new section where we compare the cost of capital to Disney. Uh gave it all the data that it needed for that and And then to finish it off, um I told it for the optimal capital strategy section, um how to go about the scenario analysis. But that being said, uh to go ahead and reflect on the assignment that I've done, um definitely have a better better understanding of cost of capital and how it actually plays into the business world. Also have a better understanding of how equity and debt weight play into um estimating the cost of capital. Um in general, I have a better understanding of how financial risk is accounted for. And then I also learned more about how capital is structured within a company on the equity and debt side. So definitely a good assignment to work through and I learned a lot with Gemini and outside resources. But that is my assignment nine. Thank you.",
  "video_url": "https://www.youtube.com/watch?v=2Mo3Iw4D8_M"
}