{
  "student_name": "Robby Bergeron",
  "org_defined_id": "035626927",
  "username": "bergeror",
  "video_url": "https://youtu.be/9AxxTeVp0Mc",
  "transcript": "Okay, so today we're going to be talking about Apple and their consideration to invest $90 billion shares at around a 10% market cap. The goal is to determine whether the buyback will create a long-term value versus alternate uses of their cash. The alternate uses we're going to be looking at are a 6% $6 special dividend, debt reduction, incremental R&D, and acquisition. Key stakeholders here are retail shareholders, institutional holders, which is mainly Birkshshire, employees with stock, management, and bond holders. The CEO would be included under management. So, the main questions we're going to be asking is what will create value and what a good capital allocation is and if this is a good one. So our discover stage we're going to be looking at Apple's finances which is a 60 165 billion in cash or investments $und00 billion annual cash flow a share price of $185 30 PE which is price over equity shares outstanding 15.5 billion dividend yield of.5% and a debt of 110 billion the proposal is 90 billion buyback over one year and again the stakeholder ownership with real percents this time is 6% Birkshshire the CEO has 3 million shares retail investors average 100 shares each and employee stock options are about $170 formulas that we're going to be looking at today are the shares repurchased equal the buyback money divided by the share price new share account equals current shares minus the repurpose repurchase shares. EPS impact equals net income divided by new share count. And the leverage impact equals debt divided by equity and debt divided by EBITDA.\nSo looking at our represent stage, our inputs are going to be the buyback size, the share price, the net income, debt and interest rate, and the alternative scenario, which we'll see outputs are the EPS, the new share count, ownership percentage changes, leverage metrics, and the stakeholder gain or loss. So really what the results that we're looking for the visuals that we're going to show are this scenario comparison chart EPS change chart and we did not get to this it didn't not matter necessarily for our scenario implement buyback calculation. So here we're going to be doing looking at the buyback all the math looking we have a 90 billion buyback size approximate share purchased of about 90 billion divided by the 185 share price equals 486 million shares the new share count is 15 billion shares from 15.5 billion and this increases the EPS because the denominator of our share price is sinking and Apple's require required to repurchase these below the intrinsic value. Looking at the alternative scenarios, the special dividend which is $6 per prepare per share is going to be $93 billion cost. So almost a whole year of revenue does not have a large EPS benefit. Slight but not large. Direct cash to the shareholders which would be good and the tax implications would not be clear yet. If we go with the debt reduction option which Apple has 110 billion and if they paid down to 9 billion they would reduce their interest expense and if we look before they would have this is if they add more debt in the display they would lose their purchasing power. So if they did reduce their debt they would have more purchasing power but they would need to wait for the correct buyback period. Looking at the acquisition scenario, this is going to boost the long-term growth of the company if chosen. It integrates strategically but has a higher execution risk. The incremental R&D increases into the innovation capacity, has a high ROIC potential, but does not have an immediate EPS benefit. So based on all this information, we are going to pursue that they do not we're going to recommend that they do not pursue the whole 90 million buyback as there are better options as we saw that you can do a smaller buyback and these shares are going to remain below. You should only do the smaller buyback if the shares are going to remain below the intrinsic value like how I was saying. And then we should split up our investments along some of the options that we looked at. So we could invest 20 billion towards the R&D expansion as we saw, 20 billion towards the strategic acquisition pipeline and 10 billion to debt reduction as we could have more purchasing power. And the reason is this could be balanced to stakeholders, reduces the government agency concerns, maintains an optimal strategy and creates a substantial long or sustainable long-term value that could be substantial. So here looking at the um application that I made for EMS, we could do a we'll just put some\n\nwe'll fill out some information.\n\nSo I made this in conjunction with Nan and it actually came in handy a couple times. It was very useful.\n\nOkay. I didn't realize I was in millions. I was not paying attention.\n\ncash available. I'm just doing an imaginary scenario to show you\n\nhow it works.\n\nSo, we're going to do a debt buyback\n\nand then I'm going to go back here and it's going should analyze and compute the finances for us and then display them. All right.\n\nSorry for the delay there. That's kind of the problem with working with AI, which I would get to in my reflect, especially with N. It's very touchy and if I accidentally reload the wrong side, it will redo all my progress, which is not cool. So here it should display\nthe Okay, we should be back. And this is perfect for the reflect is as I realized adding AI to Nan always makes things easier to work with. So here we have the repeatable steps for the EPS where we'll just click this follow this link right here paste it in here and then as soon as we start the program we'll able to fill it out and repeat the process. So that's awesome and then that perfect leading into the reflect stage as EPS does not guarantee value creation as we learned from our experiment. I would also like to reflect on nan and the experience as I learned a lot from the AIS. So that was very helpful. I also learned that buybacks shift wealth as the long-term holders win if the shares are undervalued and the short-term seller benefit if it's overvalued. Agency issues are the CEO with the large equity incentives often prefers buybacks. So that means that the agencies would be concerned with some of the other options as I mentioned and the governance rits which means who constitutes the most ownership and reduces struct strategic flexibility. So if we bought back we might see a lot of shift in the CEO having power or the board losing power. So to maintain value we should invest in other ways and buy back under the appropriate circumstances."
}