{
  "student_name": "Matthew Baratian",
  "org_defined_id": "034214748",
  "username": "mbaratia",
  "video_url": "https://youtu.be/xF3EKaFm5uA",
  "transcript": "Hello, my name is Matthew Bation and this is my session 11 assignment. So in this assignment, our mission is to evaluate Apple's hypothetical 90 billion uh share repurchase using our driver framework. Uh in addition to this, uh we need to act as an independent analyst and must determine whether this buyback actually creates value relative to alternative uses of cash while still balancing our stakeholder incentives. So take a look at a snapshot and overarching view of this scenario. Um our liquidity is at $165 billion in cash and our investments and we have 100 billion annual free cash flow. Uh for the market context we're sitting at $185 uh per share with our uh P/E sitting at 30 and our dividend yield is at.5% with 15.5 billion shares that are outstanding at the moment. Uh moving on to our balance sheet, we have $10 billion debt with our Birkshshire or Birkshshire owning 6% CEO holds 3 million shares while retail investors average 100 shares while employees have $100 $170 uh in strike options. Um so our proposal would be a $90 billion buyback executed over, you know, a year. um with alternatives being a $6 special dividend, a strategic AI/VR acquisition, a debt reduction, and finally an incremental R&D option. Um so the overall goal again for this project uh is or assignment is to deliver recommendation that explains our stakeholder impacts agency uh considerations in the value creation versus the value transfer outcomes. So firstly here we have our define and discover uh stage of our driver framework in which we set the baseline data and our key assumptions which the goal is to model whether Apple's $90 billion buyback actually creates value for the company relative to these alternative uses of cash. Um so here we have our baseline market financial data which was given the problem which I had stated previously. Um then we have our buyback size uh sitting at 90 billion. Um we have an ownership structure for our stakeholder impact. um as well as the assumptions that we can choose from um and as well as uh the return on uh incremental the ROIC assumptions for acquisition R&D um as well as finally the WACC for NPV like intuition. Uh next we can move on to a representate a represent stage in which we can derive our baseline metrics from the given data that we had. Uh first thing being our earnings per share which is the price divided by the PE uh with our current share price sitting at $185 which you can see right here. Next thing will be our net income which is just our total earnings in which you know for this it's our uh earnings per share divide or times our shares outstanding. Uh moving on the market cap, we can see you know the price is it's price times shares outstanding and then we have the buyback as percentage of market cap and that is all printed here below where you can see it's $185 for our current share price. Our PE ratio is sitting at 30 with the shares outstanding sitting at 15.5 billion and our earnings for shares at roughly 6.17 uh net income sitting at roughly $96 billion with our market capitalization sitting at 2867.5 billion. Um and our buyback budget as a percentage of that market cap is sitting at 3.14. So now with all that we can go into our implementation uh stage which we can build our scenario functions. The first one being our scenario buyback in which uh we use that $90 billion repurchase uh the the shares at the current price. We're going to assume our net income is unchanged uh in this short run and the shares we purchased ended up coming out to 480 million shares. Moving on to a scenario dividend uh scenario scenario dividend. Um, again, we're going to utilize that $190 billion to pay onetime cash dividend in which the dividends per share is at 90 billion divided by our total shares, which comes out to 5.18 uh or 81 per share. Um, in this our shares at SA does not change uh nor does the net income. Um, our price uh drops by that dividend per share on the X dividend date. So, the sharehold stay roughly uh the same near this term. Um, in addition to this, uh, our earnings per share ended up staying, uh, the same due to the fact that earnings and shares remained unchanged. Uh, moving on to the next scenario being the AI/VR acquisition. Again, we're going to utilize this $90 billion to buy an asset that earns an assume we're going to assume the rate of return uh, on invested capital sitting at 12%. uh and which incremental net income that we have is going to be the ROIC times that investment with our shares unchanged debt also being unchanged. Uh and through this after this uh you know scenario is run through determined that you know our new uh annual net income sitting at $10.8 billion with the raise total net income to 106.38 uh billion from that and our EPS had been raised to 6.86 86. Moving on, we take a look at the scenario debt reduction. Uh we use that $90 billion to pay down an outstanding debt with our interest uh expense saved equaling our debt repaid times that interest rate. Um you know, after tax savings equals our interest saved times uh one minus the tax rate with the net income increasing uh by after tax savings by approximately $2.84 billion. Uh the final scenario being a R&D scenario is when we spend 90 billion of that dollar of that money on R&D. Um so in the short run uh you know this R&D is going to be expensed you know pretty much immediately. So the net income will drop you know because of that initially. However uh in the long run we're going to assume that this R&D generates an ROIC of 15% on that 90 billion. So with that R&D ends up adding $3.5 billion in new net income. Uh and you know in this we're going to report both the year one earnings per share and our long run uh earnings per share to have a little bit of comparison. Um and through this uh it was determined that you know the highest long uh the highest long run EPS was 7.0 uh 038 uh dollars and that was for the R&D scenario. So through this uh our validate end up running the scenarios and then showing this output which I just explained which comes down to here. Uh the key takeaway from here is that only the a the AI VR uh acquisition and our R&D uh long run scenarios actually increase our total our total earnings. Uh from here you see in the long run sitting at 1 point or $ 109.08 billion with the net income after for the acquis AI acquisition is sitting at 1 point or one point sorry my bad my eyes are bad uh 106.38 billion. Um so now after that we can move on to our evolve stage in which we can put these results into a data frame and create our comparison bar chart to end up seeing this uh a visualization of what I just explained. So you can see here with our bar chart we have you know the R&D long run and the AI VR acquisition having the highest earnings per share. Um the buyback was sitting at uh 6.36 approximately. Our special dividend was sitting at 6.17 with our AI acquisition sitting at 6.86 with a debt reduction at 6.35. And finally, the R&D long run sitting at 7.037. So, our key takeaways here from looking at this visualization is that R&D scenario generated the highest long run EPS which I previously stated um with the AI VR acquisition being a close second to it. Um in addition, the buyback, dividend, and debt reduction scenarios all reduced our our earnings per share. So, now that we've gone through all that, we can reflect on this assignment and this scenario and to have our key takeaways from this. So our goal here with this reflection is to utilize you know this analysis and bar chart visualization of these various scenarios determine our key takeaways being one that uh the EPS growth doesn't actually equate to the true profitability growth. Um this can be seen from the baseline buyback earnings per share sitting at $6.17 with the buyback uh buyback EPS after that sitting at 6.37. Um however the buyback net income remained unchanged and sat approximately 95.6 6 billion. Secondly, next takeaway would be that our best financial decisions uh prioritize long-term competitive advantage over short-term gains. Um so to back this up among these different strategies, like I previously said, R&D long run did have the highest earnings per share sitting at 7.03 uh8. Uh finally, you know, dividends and buybacks will primarily transfer exist already existing value. uh you know to reiterate this you know the special dividend uh earnings per share was sitting at $6.17 however you know the buyback EPS afterwards was $6.37 and the net income in these both scenarios remain unchanged and sat at $95.58 billion. So after all this, we can come to our final analysis recommendation being that Apple should uh actually reject that $90 billion buyback. Instead, focus on prioritizing a blend of AR AI VR acquisition and R&D investment."
}