{
  "student_name": "None None",
  "org_defined_id": "034076668",
  "username": "dejesus3",
  "video_url": "",
  "transcript": "Hey everyone, it's Arturo. Here's my Mini-Project 3 — my advanced AI finance tool built in n8n.\nSo let me show you how it works.\n________________\n\n\n1. What the tool does\nThe user just types something like:\"I'm 21, make $2000 a month, have $3000 saved, and I want $15k for a car in 2 years.\"\nMy tool takes that message and:\n* pulls out all the important info\n\n* turns it into clean JSON\n\n* analyzes your goal\n\n* and gives back real, personalized advice.\nTrigger Node\"This first node starts the workflow when I click Execute.\"\n________________\n\n\nEdit Fields — User Inputs\"Here I enter the user's financial situation — age 21, monthly income two thousand, three thousand in savings, and a fifteen-thousand-dollar car goal in two years.\"\n________________\n\n\nMessage a Model — AI Processing\"This node sends that information to OpenAI and asks the model to extract the goal and financial details in clean JSON format.\"\n________________\n\n\nEdit Fields1 — Pulling the Text\"This node takes the AI's response and pulls out the raw text so the next step can process it.\"\n________________\n\n\nCode in JavaScript — JSON Cleaner\"The AI returns JSON as a string with escape characters, so this code cleans it up and converts it into real JSON the workflow can use.\"\n________________\n\n\nFinal Output\"And here you see the final structured data: the goal details on the left and the financial information on the right. This proves the tool is correctly understanding natural language financial inputs.\"\n\n\nWhat It doesThis tool solves the problem of turning messy user financial info into clean structured data using AI, which is the first step in building intelligent financial advisors.\"\n\n\n\n________________\n\n\n\n\n________________\n\n3. Why it's \"advanced\"\nIt's not just a single chat response.\nIt:\n   * does multi-step reasoning\n\n   * extracts data cleanly\n\n   * validates the JSON\n\n   * and then gives smart, personalized recommendations.\n\n________________\n\n\n5. Wrap-up\nThat's my Mini-Project 3.\nAn AI finance tool that actually thinks instead of just calculating.Thanks for watching."
}