{
  "student_name": "Colin Crean",
  "org_defined_id": "037433259",
  "username": "creanc",
  "email": "",
  "transcript": "How's it going? My name is Colin Crean, and this is my session 9 assignment about college. So, So, first for my D, my degree. And then find My primary objective is to calculate Netflix's weighted average cost of capital, or the WACC, or the WACC, in connection with a hypothetical $5 billion content acquisition. Specific required calculations are the current WACC for Netflix, and a WACC after a $3 billion additional debt issue. And then the required analysis and evaluation is to evaluate the impact of additional debt financing and calculate Netflix's current WACC, assess the use of a project-specific discount rate, and WACC U.S. dollars. content versus international content versus a firm wide rate, and then compare Netflix's WACC to Disney and other industries. I also touched on Amazon throughout this, and explain the differences, and then recommend optimal capital structure. So the provided info I'm giving is Netflix's financial parameters, market capitalization of $200 billion, total debt book value of $14 billion. Debt, market value of $13 billion, equity beta of 1.3, bond rating of BBB plus, yield of 5.8%, corporate tax rate of 21%, current stock price of $450. And then the market conditions, risk-free rate with a 10-year treasury of 4.5%, an MRP So for the strategic contents, context to Disney's capital structure, 70% equity, 30% debt, WAC 8.2%, Amazon Prime Video uses Amazon corporate WAC of 9.5%. And Netflix is considering a $3 billion annual additional debt issuance for content investment. So for my represent section here, so the core formulas we are using are the WAC, which is E divided by E, E over E plus D, times RE plus D over E plus D, times RD to the, times 1 minus D. And so for these variables, E is the market value of equity, D is the market value of debt, RE is the cost of equity, RD is the cost of debt, and T is the corporate tax rate. And then for the CAPM to find the cost of equity, which we need. for this equation up here, we have RE equals RF plus B times RM minus RF. So RE is the cost of equity, which we know, RF is the rate risk free rate or the 10 year treasury. B is the equity beta and RM minus RF is the market risk premium or the MRP. So our first calculation we made is for the cost of equity and it's R-U-I which is the cost of equity equals 4.5% plus 1.3 which is the beta times 5.5% and we get 11.65%. And then now we want to calculate, so that's the cost of equity. Now we want to calculate the after tax cost of debt. So it's Rd, parentheses, 1 minus t and we're given that Rd is the cost of debt. That here, or is that Rd, 1 minus t, and t is the corporate tax rate. So 5.8% times 1 minus .21 and you get 4.58%. Now we want to determine the capital weight of the company. So E equals market cap divided by market value of equities. So we're given D equals market value of debt, which is 13 billion and V equals total market value, which is 230 billion. So for the weight of equity, it's 200 billion divided by 213 billion, which is 93.90%. And for the weight of debt, it's 13 billion divided by 213 billion, and we get 6.1%. So to calculate the current WACC, you put, we are just going to plug it in all the numbers we found from the previous steps, so that 93% goes in here, times 11.65%, plus 6.10%. Times 5.8%, multiplied by 1 minus .21, and you get 11.22%, so that is the WAC for Netflix, the current WAC. Now we want to calculate the new WAC post-issuance, so the $3 billion dollar issuance, and we're going to assume RE and RD cost the equity and the cost of debt remain unchanged. So for the new debt, it's $13 billion plus $3 billion, you got $16 billion, and we just need to find the new weights. Oh, well, yeah, and then the new market value, you add the $16 billion to $200 billion, you get $216 billion. For the new weights, we do the simple calculations and we get 92.59% for equity and 7.41% for debt. So, the new weights. You plug those in and you get 11.13%. So, for our project analysis, including comparison to Disney slash Amazon, uh, so for the U.S. content potential, which is potential for small risk, if the risk of content investment in the U.S. is lower than the firm average, then the project, should have a discount rate, which is less than 11.13%. The international content, which is potential for larger risk, If the content involves a riskier international ventures, for example, currency, political, or unfamiliar market risk, the discount rate must be larger than 11%. So now for our comparison, Disney slash Amazon, Netflix's current WACC, 11.22, Netflix's new WACC, 11.13. Disney's WACC, 8.2, Amazon's WACC, 9.50. So Disney and Amazon are both lower than the current and new Netflix WACC. And then the debt weight. 6.10% for the current Netflix, 7.41% for the new Netflix. Disney is 30% and Amazon doesn't have a debt weight. So here are the explanations for that. So Netflix has a very high whack due to the fact that they have a very equity heavy structure and equity is their most expensive source of funding. So for the Netflix new, it's very similar, but slightly lower because the tax shield benefit of the new debt lower the whack. Now for Disney, they have a much lower whack because they use a smaller significant amount of cheaper debt financing and potentially lower beta or business risk. And Amazon, the whack is lower because it has a very diverse. Mixed structure. So for my recommendation, Netflix should aim for a capital structure with a higher percentage of that debt is significant. It's significantly cheaper than equity and after-tax debt is 4.58% and the equity is 11.65%. The tax shield benefits are 9.5% and Netflix has a BVB plus bond rating, which is good and means that they have significant capacity to take on a larger amount of debt before their cost of debt may start to rise . Aiming for a capital structure with a higher debt percentage will minimize Netflix's whack and lower its hurdle rate and increase its shareholder value. So now for the implement section. I'm going to prompt AI to give us a code that outputs the calculations we talked about above. Python is going to simplify this for us and show us any errors out there. So here's the code right here. So the financial analysis of Netflix costs of capital whack, we got the input parameter. So they're dividing. Defining the same parameters, Netflix specific parameters, capital structure parameters, market data, additional data, all that stuff. And here are the calculations. So we'll go down to the output here. So what did output is cost of equity already is 11.65%, which we got. After-tax cost of that is 4.58%, which I also found the current WACC calculation. So the total current value, 213 billion. The weight of equity, 93.9%, current weight of that, 6.1%, which we found, and the current WAC is 11.22%, which we found. Now the WAC, after the $3 billion debt issuance, the new total debt is $16 billion. And the new total value is $216 billion, which we found the new weight of equity is 92.59% and the new way to debt is 7.9%. Which we found all up here, all of these numbers line up 6.10, 7.41, 1.2, 1.3, even up to here. So, and then the WAC post-issuance is 11.3. So, the impact of additional debt, WAC decreased by 0.9 percentage points. This marginal decrease confirmed. This confirms the value of the tax shield at this level of leverage. So, now for my validate section. First, for the validate section, I want to check and see if my Python code given to us by the AI matches up with my work that I did. And after looking through, which we just did, all the numbers match the cost of equity, the after-tax cost of debt, the current wag, and the whack after the $3 billion issuance. They all match up with the work I did. So we're good there. But next I wanted to validate these numbers logically. So I know the whack must fall between the lowest cost of capital, which is 4.58% and the highest cost of capital, which is 11.65%, which it does. It's at 11.22 and 11.13% increasing the debt from 6.10% to 7.41% should increase the whack which it does. Or, sorry, should decrease the whack which it does. And this is logically consistent with the tax shield benefit and the debt's lower cost. And now comparing to Disney and Amazon, Netflix's whack of 11.22% is higher than the media industry range at average of around 8-10% and higher than Disney at 8.2% and Amazon at 9.5%. This would suggest that Netflix obtains a higher risk for more equity heavy capital structure, which we already established that it does. Now for my evolved section, we have already concluded that increasing the debt issuance by 3 billion will slightly lower the WAC This confirms that Netflix is operating below its optimal leverage level and should continue to increase debt to minimize its cost of capital. My recommendation is for Netflix to strategically and gradually increase its debt per capita. For now, I'll see you in the next video. In involved section, I'm going to prompt AI to output a Python code that explores increasing the dat and gives us a visual to see what combi- the combination- what the combinations provide the minimum whack for the sample given. So we can see here it's a Netflix Optimal Cap. It'll structure simulation. So we're doing a simulation with a bunch of different numbers here, and we'll just see what it outputs. So you can see there's d to v ratio, a bunch of different d to v ratios, a bunch of different rd's, a bunch of different rd's, 1 minus t, a bunch of different b's. beta levels, re and WACC. And we can see that the minimum given is 11.18% and it had an re of 12.24%. Beta of 1.4, and then 5.14 here, 6.5 already, and 15 D to V ratio. So the option, so this is what the code also gave us. An optimal strategy recommendation. The minimum theoretical WACC 11.18% occurs at the D to V ratio of 15%. In words, the strategic goal. Netflix's current leverage, 6.10% D to V, is suboptimal. So, it's suboptimal. The optimal WAC curve suggests that increasing that up to 20 to 25% would maximize the value before the high cost of financial distress begins to take And four. So as you can see, my recommendation was right. And increasing the debt using a strategic goal can provide a WAC. Lower WAC. And then for my reflect section, as you can see, the analysis confirmed Netflix's current WAC of 11.22% is inflated by an under leveraged capital structure with a very equity heavy approach. This strongly recommends a strategic shift towards 15-25% debt to minimize the cost of capital. Lower the content investment hurdle rate, and maximize shareholder value. Overall, I learned a lot about cost-to-capital analysis through this project, and paid a lot of attention to it. So, thank you for listening, and this was my Session 9 assignment.",
  "video_url": "https://youtu.be/qkQ7hqTi6nk"
}