{
  "student_name": "Katherine Schmelz",
  "org_defined_id": "035859682",
  "username": "kschmel",
  "email": "",
  "transcript": "For session 9, we're looking at the cost of capital and the weight adjusted weighted average cost of capital for define and discover. Uh the first thing I wanted to define was the goal of this. And the goal is to um complete an analysis to determine if Netflix would benefit from making the $5 billion investment using the cost of capital measurements and relating them to the market and industry companies which would be within the 8 to 10% walk range. Um, additionally, we want to analyze uh the similar situation if they were to uh have the additional option of um get uh adding a $3 billion debt issuance. Um so then for discover the questions we're starting to ask uh we're using the weighted average cost of capital formula uh which is market value of equity divided by total value of equity. So it's that's the weight of equity uh multiplied by the cost of equity rate um which we are is given to us from the um CAPM section. Uh and then do the same thing for the market value of debt uh with the cost of debt after tax. Um and then we multiply that by one minus the uh corporate tax rate. So those are the things I wanted to define and sort of learn about and make sure I understand the definitions of everything. Um and during the cost of debt calculations, we also want to take into account um how when we're doing this interest the the interest that you are accumulating does not count towards the debt. Um essentially it's a tax shield effect. uh when you are calculating you're listing out the cash flows um uh the interest payments will be a negative cash flow uh and then you have your income. So then when you take your income minus the payments that you're making uh that will give that will decrease your net operating income and then your net operating income is then taxed. So your overall tax will be reduced. Um and then the overall goal is to the first step of the goal is to calculate the weights. Um and we're also going to be comparing the market value but versus the book value. So the book value will just be straight up what numbers we are given and how those are going to compare within the corporation. And then the market value is how these calculated values uh size up next to the market and um other competitors. And uh we can also you we also note that we want to use the weight average cost of capital rate as the hurdle rate. That's going to be the rate that we use as interest rate if we're accumulating different values um for sake of future and past comparisons. So for the represent section of driver uh I decided to break it down into three into several different steps um to make sure I have a timeline straight. So first um we want to calculate the cost of equity and debts. So the cost of equity and the cost of debts uh using the capital asset pricing model. Um, and then after that, we're going to take that information and we're going to find the walk for Netflix in both the scenarios, both the $5 billion investment and the $5 billion investment with an additional $3 billion of debt. And then after that, the next step will be evaluating project specific walk and content. Um, so they'll be just looking at uh what different investments might look like depending on like a region or uh specific content and audiences for that from the perspective of Netflix. Um, and then the fourth step of this will be to analyze and compare the walk with Disney and Amazon and then finally compare all this information for a final suggestion. So with all of this in mind, um I started to implement the code uh in Python. So here we're defining all of our variables for the hypothetical Netflix situation that we were presented with. Um and then here we are starting our analysis in code. Uh we have the calculation right here listing out the formula in Python. Uh and then here it is listing the cost of equity after tax cost of debt and the final walk calculation. And then it moves on to calculate the same things for Disney and Amazon which we are also looking to compare. Um so here is where it lists those calculations. Um same steps as before. Um so now we can come down here and we can see that the cost of equity for Netflix is 11.65%, the cost of debt for Netflix pre-tax is 5.8% and the cost of debt after tax is 4.58%. So then taking that finding the walk uh before taking on any extra debt. So this is just the $5 billion investment. Um the equity weight is 93% and the debt weight is 6%. Um 93.9% and 6.1%. And then that leaves after plugging that into our formula that Python is that is in Python. Um the current walk the current walk is 11.22%. Um, and then if we include the $3 billion debt issuance, um, that changes the market value, the debt market value to 16 billion. So the current would be the book value. So the book value version was 11.2%. And then taking the market value, uh, the new weight will be 92.6% and 7.4% for the debt weight. And that brings the new walk or the market value walk to be 11.13%. Um which is a little bit lower than the book value. So then comparing uh this in investment decision this investment evaluation compared to the media industry as a whole we know we want it to be between that 8 and 10% um ideally to be competitive. Uh and we can see both the 11.22% and 11.13% are both higher than that 8 to 10% range. And we can see that the Disney and Amazon walk are both lower than they're in that range. Disney is at 8.2%. And Amazon is at 9.5%. Um so to validate this, moving on to the validate section, um I did check uh some other data and several websites confirm that the uh overall average walk across industries stand at around 8.5% which is slightly above previous years. Um and so it was really interesting to look at a lot of different data of how um some other um industries such as the such as the software industry um are a little bit lower, a little bit higher. Some are at like 7%, some are at 12%. Um so that was interesting to compare, but this is this makes sense. uh and then to further validate um also comparing different content. So as an investor um wanting to uh if you're going to spend $5 billion, you want to understand where you're spending it. Um so for international for US versus international content, um US content would be a lower risk. So, uh, you'd use a lower discount rate for this and that means your the firm overall would have a lower walk. Um, and then for an international content or like something that's new or like not as familiar, it's a higher risk because you don't necessarily know if that'll be a valid source of revenue. Um, so then you'll probably want to use a higher discount rate when incorporating that into your walk calculations. Um and overall using a single firmwide walk for all projects would be underinvesting in low-risk projects and then overinvesting in high-risisk projects. Um in other words, uh you would be rejecting good projects because you're too afraid of taking on new things in the US, but then internationally you would be taking on worse projects because just to meet your your numbers. Um, so that's a very important thing to take into account. And you compare that to Disney and Amazon Prime who are already well established. They have lots of different outlets. Netflix is just a streaming service, but Disney has parks. They have merch. They have lots of different brand deals. And Amazon Prime has a storefront, they have the streaming service, and they have music. They have lots of other ways to distribute that risk. to move on to evolve other ways you could think of uh really keep growing with this and apply it to other situations. Um the first thing I thought about was how you want to find the required target rates to make sure that you hit the target walk range. Um so obviously with the 11% range with Netflix right now, we want to be able to get that down to fit into the range before we take on any other investments. So, first you'd want to set up systems of equations through Python and solve for different combinations that would meet that 8 to 10% range. And then second, you would analyze how that would affect the IRR, the internal rate of return. Um, and how realistic that range would be to obtain. Um, because if that's not like realistic to achieve, then maybe you're not ready for that, uh, maybe you should do some other research and find some better investments. And then another alternative method for investment decision- making, another aspect we could look at would be consider evolving the discount model, the DDM to project cash flows further into the future and analyze how it changes over time and using the walk to project that more. Um, and you can also consider purchasing annuities to increase assets rather than to take on more debt from bonds or to use annuities to balance out that risk. So, you're getting a constant form of uh intake in of income instead of just uh spending it all and hoping to get it back. So, that's a more secure investment in that situation. Finally, to reflect, uh the overall recommendation would be that Netflix should increase its utilization of debt financing to move towards a more stable structure closer to its peers like Disney with the uh lower uh 8% uh weighted average cost of capital or closer to the industry norm. Um the debt is significantly cheaper than equity uh with 4 5% versus 11.6% and the current debt issuance but a very small change to the walk reduction. Um so a more aggressive move towards the 15 20% debt could lower uh the walk further making more valuable projects like the $5 billion content investment uh acceptable and increasing shareholder value. However, the company must be able to m maintain its beta value. uh it had a beta value of 1.3 which shows that it it's a little bit more risky than the uh industry average but it's still pretty close to one. Um but you want to maintain that rating to avoid a sharp jump in the cost of debt. If you get too risky then you're going to take on a lot more debt. However, it's given current low leverage Netflix has significant capacity to take on more debt safely. Um, so it's it's all about a tricky balance with this. Uh, overall, uh, final thoughts, it's nice to see how all the pieces are starting to come together. We're incorporating concepts from several sections in order to better understand the business investment industry and how to read, interpret, and manipulate financial data. And we also are starting to see other sides of the real world using debt and sort of weighing that with assets and how realistic it is when you're looking at equity versus debt and how to balance that in a more realistic way.",
  "video_url": "https://youtu.be/QlD0CruGmsY"
}