{
  "student_name": "Joe Dragoni",
  "org_defined_id": "036050644",
  "username": "jdragoni",
  "video_url": "https://youtu.be/_I5ggxuYIkQ",
  "transcript": "Hello there. I'm Joe Dragoni. This is my management 310 uh session six assignment for session 11, the corporate decisions and incentives um section, the second to last video for this class. Um and today for this assignment, we'll be going over the corporate financial decision analysis for Apple. So the financial decision for Apple is um we have to evaluate Apple's hypothetical $90 billion share purchase using the driver framework. act as an independent analyst who must determine whether the buyback bet creates value relative to alternate uses of cash while balancing stakeholder incentives which we'll go over in a little bit. So our snapshot of our capital allocation that we have with Apple right now. So our liquidity is $165 billion of cash and investments. We know Apple is a very big company. So this makes sense. and they have hundred billion dollars of annual cash flow. Uh every year that they innovate with a new MacBook, a new iPhone, AirPods, all that hundred billion is earned from that. Uh the market context is there's $185 share price in the market, a price to earnings ratio of 30, dividend yield of.5% then 15.5 billion shares outstanding in the market. Um they have a hundred billion $110 billion of debt um on the balance sheet. Uh, Berkshire Hathaway owns 6% of the company. The CEO of Apple owns 3 million shares. Retail investors average 100 shares and employees have $170 strike options. The proposal that we're looking at here is a $90 billion buyback executed over one year, which is around 10% of the market cap. Um and some alternatives we can look at um to get rid of the debt um in place of a $90 billion share repurchase or buyback is we can do a $6 special dividend for the investors strategic AIVR acquisition so acquiring the company um reducing debt and also doing some incremental research and development. So what we want to do here is use driver to deliver a recommendation that explains stakeholder impacts the agency considerations and value creation versus value transfer whether or not this buyback would create value or transfer value around. So looking at our driver framework here starting to define the define in the discover stage. So our goal that I've determined is that we have to determine if the riskadjusted return on investing in Apple's own equity. So Apple buying back into the company is superior to the risk adjusted return of external investments, capital return via dividends or balance sheeting derisking like reducing the debt or doing some incremental research and development. So we were given the information that they have price earnings ratio of 30. So Apple's returns are roughly 3.3%. Um, and then just looking at the agency risk, kind of figuring out what this means beforehand, uh, we must determine if the capital allocation is designed to maximize long-term shareholder value or to manage short-term per share metrics, aka earnings per share, to satisfy executive compensation structures. So, how does this out outflow of $90 billion or doing a $90 billion buyback impact each group based on their incentives? So, each group of the shareholders. So first looking at the insiders which is the CEO or the management then the executives and also the employees. So just all people associated with working for Apple. The CEO has 3 million shares um and their incentive is highly aligned with stock appreciation. So an outflow of $90 billion supports the price making earnings targets easier to hit. So they would be in favor of the buyback. However, employees have the $170 strike option, meaning that their earnings are highly sensitive to price drops and the dividend of $6, which is one of the alternatives, would be bad for the time money, time value of money of their holdings. Um, so they would be they would support the buyback since this supports the share price and doesn't associate with mechanical price drop associated with dividends. Now for the shareholders or the retail investors, people like you and me who own shares of Apple from the market. Um first off looking at Berkshire Hathaway they have the 6% ownership and their incentive is capital efficiency and tax deferral. So buybacks are better than dividends since it avoids the immediate tax liability of dividend payout. Um Warren Buffett who is CEO of Berkshire Hathaway, you know, is very much in favor of trying to be efficient with his taxes, not pay as much tax on his investments. So a dividend payout would be worse for him than the buyback would be since there would be more tax liability associated with that. Retail investors own an average of 100 shares and they have the incentive for income and want stability. So the retail investors will prefer a $6 per share special dividend um because it would be $600 check if they own an average of 100 shares. Um and this just because of the immediate yield they would get from that even though the price price appreciation from the buyback is also beneficial. Then looking at the the firm which is you know the balance sheet operations the debt holders or the lenders who have the hundred billion $110 billion in debt have the incentive of solveny and credit rating and they would prefer reducing the debt which is one of the other alternatives but a $90 billion outflow increases the net leverage risk which is also beneficial to them. So then again just looking at the kind of exploring the different alternatives that we touched on a little bit um what they just kind of comparing what they would be what they would do and what the agency outcome would be. So first looking at the $90 billion buyback this would retire around 486 million in shares or around 33 3.1% of the shares. So this would increase the earnings per share mechanically because and it is tax efficient for holders. But um the agency outcome is that it potentially transfers value from the corporation to existing shareholders at a high valuation uh 30 times the earnings which is what the PE value or the PE ratio is. Looking at the $6 special dividend um there's immediate an immediate $93 billion cash outflow and the stock price adjusts down by around $6. So and it is also a tax taxable event for all holders. Um but the agency outcome of this is that there's value realization um and it forces capital discipline but hits employee options and creates tax bills and the retail shareholders also get their immediate yield which they would be in favor of the strategic um M&A the acquisition of the AIVR company. Um this is a high execution risk and there's potential for nonlinear growth for the company which would be very beneficial but it is an aggressive strategy that could potentially increase earnings but also be very risky for the company. So this would be an example of value creation because of the high risk and high variance. If it's successful it justifies the high price earnings ratio but if it fails there is a massive destruction of capital and of the reputation of the company. Looking at the debt reduction, this would save the interest expense um look on balance sheet and the value value is neutral to destructive if the return on interest capital is greater than the cost of debt. Um agency outcome here is that is there is there a safety because of the removed debt, but it is likely an efficient use of capital given Apple's high credit quality. Then the last option we had here was the research and development which is dilutive. Um it's high risk but it signals ambition. Um and you know shareholders like to see growth in the company. Um so this is another potential area for value creation because it it it attempts to expand the total value of the firm by creating new revenue streams here. So kind of helping using help from Google Gemini to learn about all these different alternatives and how they might affect the company. Um the buyback was determined to be the path of least resistance for the large shareholders being Burkshire Hathaway and the CEO. Um but it may not be the mathematically optimal use of cash given the high price earnings ratio of 30 or the high valuation. So that is the define and discover stage kind of setting the standard for our analysis here. So moving down to the represent stage kind of looking at the outflows and the impact on earnings per share and the balance sheet for all five of these different alternatives we looked at in the deed discover stage. Um, we knew already there's 15.5 billion dollar or 15.5 billion shares outstanding and $10 billion in debt. And we want to visualize how the $90 billion moves through the financial statements and where it ends up and also how it um affects the earnings per share. So the buyback of the shares is the $90 billion share buyback. It's $90 billion to the market. Um the share count is reduced by 3.1% as we already talked about. Um it's supportive of the share price impact because of the buying pressure and the higher earnings per share. Um which and we said the earnings per share increases because the denominator of the formula in shrinks making that number larger. And then on the balance sheet this is a lower cash number because it's a cash outflow and there's lower equity um for Apple or lower equity um for the shareholders um because we're buying back more of the stock. Looking at the dividend, it's calculated to be $93 billion purchased to or $93 billion to shareholders. Um, so it's an outflow of $93 billion for Apple. The share count is unchanged because we're not doing any exchanges of shares. Um, the price impact would drop because of the $6 drop on the um, Xiv date. The earnings per share is neutral and the balance sheet there al there is also lower cash and lower equity. Now looking at the acquisition of the company also another $90 billion outflow. The share count is unchanged here. The share price impact is volatile um because of the deal risk pricing of merging with the other company. And then the earnings per share talked about it being dilutive because of the integration costs and amortization um because it dilutes earnings to the shareholders. Um, and the balance sheet, lower cash here because we're again spending that money to merge with the company, but higher goodwill, which is an intangible asset on the balance sheet. Looking at the debt reduction here, another $90 billion spending to the creditors who are the debt holders. Again, the share count is unchanged. Um, the share price remains neutral because we're not really dealing with the market here, the shares of the company. Um and the earnings per share because we don't really deal with that is ultra al also neutral because interest savings equals interest income lost. And then looking at the balance sheet again another spending of $90 billion but lower debt on the balance sheet which is good thing to see for the investors. Then lastly looking at the R&D here another $90 billion to the operations department or research and development for innovation. Again, the share count is unchanged because we're not dealing with the market here. But, um, in the short term, the share price would be negative just because they're not really focused on short-term earnings, but rather for the long-term growth of the company. So, again, this is another big expense hit. So, the earnings per share in the short term crashes. Um, and there's lower cash and lower equity on the balance sheet because of this because we're investing in another revenue stream. So that is looking at how the different alternatives compare and mapping out the calculations with help from Gemini for the represent stage. So now we'll move down to the implement stage where I helped or I had the use of Gemini to really compare the earnings per share in a seable model or a viewable model. So run this first section of code here. It gives us the different scenarios here. the earnings per share after spending the $90 billion or $93 billion um and how that would affect the earnings per share. So we can see you know not doing anything in this case gives us the highest earnings per share along with the merging and acquisition and the debt reduction. Um, and then we can see that the buyback decreases our earnings per share a little bit, but it's still supportive of a higher earnings per share. And the dividend also decreases it a little bit um because of like we talked about earlier here. Um, it's dropping because of the $6 drop on the dividends because of the dividends we're paying out to our shareholders. But it doesn't, you know, drop as crazy as research and development does in the short term like because we talked about that being a big uh expense to cover in the short term because we're not really investing in our shareholders but rather an innovation here. Looking at this code some more, it shows us the earnings per share change percentage. So baseline M&A and debt reduction don't have a change, but the buyback does decrease it by, you know, a very small percentage. the doing the dividend 3.8% 8% change in the earnings per share, but the incremental R&D being a very large earnings per share decrease in the short term. Um, the share price, you know, stays the same except for the dividend, but like we talked about already how the dividend is paying out to the shareholders. So, it makes sense the share price will decrease here. And you know the buyback gives Birkshshire high a little bit of a higher stake in the company um because this method favors the higher ops the companies or the investors with the higher voting power within the company. So Bergkshire ST will stay the same except for the buyback here. um also shows our option value here um and how that only decreases for the dividend. And then the net debt um in billions of dollars, you know, is positive except for not doing anything or reducing the debt. So if we don't do anything to reduce the debt, then that will decrease our debt. But otherwise our debt will stay the same and we have to consider other methods of reducing our debt or buying back in the company to create slashtransfer value. So this is the first part of the implement stage was doing a scenario comparison um with the earnings per share you know the share price the stake in the company the option value and the net debt which was calculated with all the different Python function functions here with um assistance from Google Gemini. And then the second step of my implement stage was creating a vis visualization using the mapplot lab at pandas libraries in python with help from Gemini. So it helps we can see the leverage shift and the earnings per share impact um for each of the different strategies. As we can see here, the earnings per share impact for the baseline not doing anything and the M&A merging and acquisition and the debt reduction stays the same, but the earnings per share decreases for the buyback, the dividend, and especially for the research and development in the company since like we said a few times already, we're not really looking at earnings per share for our shareholders, but rather investing in another revenue stream. And then looking at the leverage shift that Apple would have for each of these scenarios, the baseline, not doing anything and reducing our debt significantly decreases our leverage that we have in the company. Um, so they're less risky options. But all the others buying back stock, giving a dividend to our shareholders, merging and acquisition and research and development have you know over $20 billion close to maybe $40 billion in a shift in leverage. So these four options are riskier but still have the potential for more growth within the company. So that is my implement stage. Um this part we don't need this is from earlier. So now we go down to the validation stage here. Kind of looking at the earnings per share for buyback. Even though we said it was supportive, buying back stock is technically dilutive to earnings per share initially because the foregone interest income is higher than the earnings saved by retiring shares. So just kind of looking at whether or not based on the implement stage if each case is actually good for us. So we discovered at the implement stage the buyback is significantly or slightly not significantly only slightly diluted to earnings power. um but accredited share count. So does this align with what the shareholders really want? So for the CEO and managers, their preference is risk aversion and hitting their earnings per share targets and keeping the stock high so that their investment is valuable. So looking at the buyback, this this would be highly aligned to what the executives or the higherups in the company want because the buyback is the safe path to compensation maximization for specifically for them. For the employees, however, with the options, the strike options, their preference is wealth protection and they're highly sensitive to price drops and against dividends because that would drop the price of the stock. So, the buyback would they would be highly aligned to the buyback because this internalizes the pressure for the stock um you know supporting the value of their investments. for the 6% um ownership from Berkshire Hathaway um they want tax efficiency as stated already. Warren Buffett prefers buybacks to avoid double taxation of dividends. So because the buyback is not dividends, um this is also Birkshire would also be highly aligned with the buyback because um they want to avoid the dividends because of um like we said the drop in the stock price and they're very sensitive to price drops. Then looking at retail investors, their preference is income. So they would prefer cash and hand over abstract ownership accrediting. um not accretion being accredited with cash in hand or having the cash in hand being rather than being accredited with the ownership of the stock. So they are misaligned because they would much prefer the dividend and having that $600 if they average 100 shares. Um however they lack the voting power to force the dividends because the CEOs, the employees and the main shareholders like Berkshire Hathaway have more voting power within the company. So the three most powerful voters are perfectly aligned with the buyback as we can see here. So then looking at political feasibility check um will the option get approval from the voters? We saw already that the buyback has a high probability and it's the path of least resistance and satisfies the large shareholder. The incremental research development however has a low probability because the board will rar rarely approve of a strategy that creates a guaranteed 74% drop in earnings per share. Like we said, even though it's in the short term, not having a drop almost a 75% drop almost in earnings per share does not look good um for the investors. They would not want to see that. For the dividend, however, there is also a low probability because you know the retail investors don't really have much voting power um and doesn't support having a positive growth multiple but rather a value multiple and tech companies like Apple you know want growth and innovation within their company. But then looking at the merging and acquisition and the debt reduction um there's both low probability those will happen as well since um they don't provide much opportunity for growth but rather burning cash um trying to grow their company to um not grow their company maybe but you know have another source of income from a different company like an AI or VR company or in the case of debt reduction just reducing debt and becoming a safer investment. So then looking at the signal theory here um and how the public views each option the for the buyback management believes the stock is undervalued. So that's why they would buy back the stock um you know to have more scarcity the stock and give it more value for the dividend management admits grow growth is slowing. So they want to have more um retail investors that would value the dividend and help to drive the stock price eventually. For merging and acquisition um the signal theory would be you know management is desperate for growth. So they're adding on another company that would be another source of income for them. And you know just a those are just a couple of examples. Um and this is not a good way to go about this we determined. Um but you know a better way to look at it is what way will limit the most damage and give shareholders shareholders the most value for their investment. And then just looking at whether or not this was value creation or value transfer for the buyback method. Um we determined that this was a value transfer method because um we're transferring the value from the corporation to existing shareholders in the form of cash. Um you know when the company buys back the stock from the shareholders. Then there's also transfer value value transfer from the public to insiders. Um long-term holders like Birkshire Burkshire Hathaway and the CEO own larger slice of the future cash flows from this. And one might think value creation as earnings per share goes up or yeah one might think this would be an example of value creation as the earnings per share goes up um and the stock price holds but no new economic value is created um because no new products markets are created only earnings transferred to shareholders from the you know the retail investors. So that is the validation stage kind of looking at you know how this aligns with the shareholders want or how each alternative would align with what the most amount of people want and whether or not this is a creation of value or a transfer of value. So going down to the evolve stage um you know just seeing how this idea of like we said capital corporate decisions and incentives um how they rule in other investment you know finance decisions. So like we said in the case like Apple we can see the decisions are often driven by incentives you know with agency theory rather than pure mathematics like calculating the rate of return and the net present value of an investment. Um even though those still go on, there's a lot of other things that go on behind the scenes. So what other corporate decisions rely on stakeholder analysis? There are many examples that especially the ones that we've looked at in class. You know, for example, capital structure, which we did, you know, last session. Equity holders like the CEO of Apple and Bergkshire Hathaway might like one incentive that the general shareholders, you know, like the retail retail shareholders might find unfavorable. Settling the conflict between the higher leverage and lower leverage with safe cash flows is another thing that has to be considered in this idea. You know whether whether to go with a more risky growth focused decision or a safer decision with lower leverage. The incentive here is that debt holders force management to sign contracts, covenants, contracts or covenants uh restrict restricting buybacks or extra debt um which can prevent behavior that was seen in the Apple case where you know the management gets more power than the re retail shareholders and acts in their best interest rather than the best interest of the most amount of people. So looking at mergers and acquisition mergers and acquisitions as well the conflict of upper upper level management building an empire versus providing value for shareholders. You know is there real problem that has many different alternatives to consider here. You know an example of this is that many CEOs favor merging and acquiring companies because running a larger company justifies a higher pay and prestige even though the deal could destroy their value because they're spending so much to acquire a different company. you know, they're trying to maybe build an empire. The incentive though here is that um CEOs can be incentivized to sell, you know, by governance or some other form of restriction. Um they can be incentivized to sell since they receive massive payouts if the company is sold. Um and then deals often include earnouts or future payments based on performance. um so that buyers will invest in the stock which gives another incentive for CEOs to sell more share in their company or just sell the company off as a whole. Then another um evolution of this idea can be in strategic businesses decisions in finance like in capital budgeting or investment decisions like in session 10. You know, the idea behind this is choosing between feeding the cash cow of the growing business, you know, spending more money to grow the company or working on new ventures like innovating like the next iPhone or the next MacBook in Apple's case. So operators and management know they need to innovate to stay competitive while investors are unhappy judgmental with loss losses of earnings in the short term. So, kind of just finding the balance there. And the incentive here is that CEOs can use super voting shares to ignore the short-term incentives of public shareholders. Um, so they don't, you know, get in trouble in the short path or in the short term. And this allows them to choose an innovative path without being fired for loss of earnings per share in the short term. You know, really not have to worry about the criticism that they're getting from the markets or the media. So, these problems can be seen as trying to achieve a governance equilibrium. you know, the idea of sort of not being overly dominated by restrictions, but you know, finding that balance where there's not one party that's really winning. It's more of whoever who can make the most amount of people the most happy. Um, you know, this is we said this could be a governance equilibrium as there must be a system of actions and processes in place to control actions and decisions. Um and it's fought between creditors and shareholders working in their best interests um but still wanting to be the but still wanting the best for the company and their investments. So that is how this idea can evolve to some of the other things that we've looked at in this course. And then looking at the reflection stage, the last part here um basically uh a recommendation that can be made or the long story short here is that the buyback is likely the course of action um because it makes the most amount of people the most happy but in this case being the investors or the decision makers with with the most voting power within Apple. So some of the key insights taken away from this analysis is that business leaders must balance the needs of customers, employees, communities and shareholders equally to be successful. Um and there might not be one right method for restructuring like the buyback might not be the only option to take. Maybe they can there can be many options to appease all the parties. So it doesn't have to be just one choice here. Um stakeholders are also prioritized based on their power or their ability to fire the CEO as well as the urgency to you know create value within the company or transfer value. We saw that Birkshshire and option holders like the CEO or the management team won because they have the power to replace the board. Um and future employees who would have been hired as well as society which would benefit from innovation like a new iPhone or a new laptop don't really have as much voice and vote in the matter. um at least in this case and then capital allocation will always be gravitating towards the stakeholder group that controls the tenure of the management team. So in this case Burkshire Hathaway um or other you know high-profile stakeholders here some financing or another thing to take away from this is that financing decisions create zero sum outcomes when no new wealth is created but rather just transferred around. So basically one party gains exactly what the other loses. um like the buyback and the dividend options within the case. So there's you know like a zero sum outcome. So but win-win outcomes are when value is created. So the firm solves a new problem, customers get a better product and shareholders get stock appreciation. So we want to get the win-win outcome here where there's actually some winning happening rather than just value transfer. Um corporate incentives are often skewed towards zero some certainty like buybacks rather than win-win risk which is like innovation. Um but this is something really to investigate and for companies to look at to try and appease the most amount of people. So the role of regulation here, you know, governance or the agency guardrail, regulatory responses to a case like Apple might include exercising taxes on buybacks to provide less incentives for executives or mandate that executive stock grants must be held for 5 to 10 years, creating a vesting period or you know a time an employee must work for a company before they gain full ownership or certain benefits. So in the case of like the whole company a time that you know the stock must be held before gaining the benefits from that from the investment. So looking at an actual recommendation based on this analysis um we would want to approve this 90 90 billion buyback um but with some strategic covenants in place. Um, as we saw through this analysis, you know, the buyback is the most efficient method to return excess liquidity that the firm cannot profit profitable profitably reinvest at this moment. Um, the agency compromises that employees retain option value. Shareholders gain tax efficient ownership and this option aligns with management compensation structures. But the buyback should also be approved um only alongside a dedicated governance mandate to identify high-risisk high reward research and development targets for the next allocation cycle so that there's not a zero sum outcome that comes out from this. So trying to also grow and create good things for the retail investors even though it seems in this case you know the upper level management is the group that's winning with this buyback. So then just kind of to wrap things up here I know this video has gone pretty long. Um the main learning points from this case is that finance is psychology and you must consider how each option might impact the shareholders and their earnings and how decisions are made from that. Um finance is entirely about trade-offs. You simply choose which risk you want to take. Um you know all the different alternatives. There are tons of trade-offs with those. Um you know like we said the trade-off of risk waste risking wasting money on a failed product with innovation. Um, but you might invest you might invent the next big thing like the new groundbreaking iPhone or the trade-off would be avoiding failure today but you risk becoming irrelevant in 10 years because you didn't innovate. So just selling the iPhone 17 for example for the next 10 years but it eventually becomes obsolete because you know Samsung or Motorola are creating the next big phone. And then just the last thing to take away from this is that uh the CFO can't make shareholders happy. uh they have to choose which shareholders to make happy and usually they choose the ones with the most voting power. So like in the case of Apple the buyback appeased the Berkshire Hathaway the CEO and the upper level management more than the retail shareholders but it it just eventually it we found it to be the most beneficial for them um even though the retail investors might not have been unhappy with that. So lots to take away and lots to digest from this but it was very interesting to look at this analysis. So that is my session 11 assignment. Thank you for watching."
}