{
  "student_name": "Gillian Johnson",
  "org_defined_id": "038893789",
  "username": "john3952",
  "email": "",
  "transcript": "Hi there. So, my name is Jillian and today I will be covering the driver framework specifically with market efficiency investigation. So, I'm testing EMH, excuse me, using GameStop short squeeze as a case study and my very first task in driver is to verify the facts before any analysis. So, the statement GameStop traded at 0.04 cents in a August 2020 is incorrect. So its split adjusted historical data showed that GME closed at about $167 on August 31st, 2020. And I will communiate communicate and hopefully fix this correction um respectfully and be respectful to the sources that I'm citing. So, next, GME's all-time trade uh high in trade day during the event was $483 on January 8th, 2021. And some sources also note that pre-market um quotes were slightly above $500 that day. So, it just depends on what source you're going by. Um and then short interest peaked at around 140% of the float. So um which explains the sort of mechanical possibility of extreme squeezes via reending chains. Then trading corrections or trading restrictions were imposed um by Robin Hood on January 20th to January 29th 2021. uh it's discussed in February 18th um the house financial services hearings at the house um and detailed in the testimony. So Melbourne Capital reported a 53% loss for January 2021 and took outside capital infusions and later the firm closed in 2022 and then on volume trading jumped roughly 10 million for a pre-event to peaks near 200 million which is a well over 10% increase. So how I will correct the zero 04% um claim. So for example, I might say like, \"Professor, I verified the split adjusted data. So GME closed at $1.67 on August 3rd or sorry, August 31st, 2020 with the pre-split being around $6.68. The figure $04 appears to be a misread of split/deimal data, which can be common. Um, and I'll footnote the sources being Yahoo Finance, making sure our timeline stays precise. So moving on to R. So my plan was that I'd have event windows being the first um an way of an analyzing this discrepancy in data. So our estimation window is going to be 150 to 30 trading days before January 13, 2021. And our event window is going to be January 13th to February 5th, 2021 with sensitivity checks being January 25th to January 29th and January 27th to fe February 2nd. So our data um it's going to be that we're going to include is our daily GME prices and volume. SPY is going to be our market proxy. So that's our ETF measuring the S&P 500. And then our risk-free via threemonth T bill if available. So all else we're going to set the RF equal to zero for ultrashort windows. And then our model is going to be a market model or cap mle sorry cap m beta from estimation window. So we're going to compute abnormal returns which is ar compute uh during event windows and then test any significance tests non-parametrics etc etc. Next we're going to compare observed reactions to semi-strong form predictions. So the speed and accuracy of incorporation, check weak form uh via short horizon predictability patterns and discuss strong form v trading interactions and constraints. So moving on to event or sorry implement. I'm going to run the code and I'll GME and spy data and estimate beta from the pre-event window. I'll compute AR and C for multiple windows. Visualize the prices, volumes, ARs, and CS. So, here we go. We're going to run this. Hopefully, it works. Um, it's working. Yay. Here we go. I'm actually so excited for this. Hopefully it works. It's taking a while. Here we go. Perfect. It looks like there's an error. So interestingly enough, okay, this is interesting actually and we need this. So in order to further um improve the code that we already have, I'm going to ask Gemini to can you please tr my code and fix the issues present. Let's see what it says. This can happen and I'm honestly glad this happened because it is gives me a good place to sort of um step back and improve the design a bit and evaluate where I'm falling short. Here we go. It looks like key area blah blah blah. Oh, okay. I understand. Accept and run. Okay, cool. That's so helpful. Okay, see what's going on. It's still working. It's still blinking. Okay. So, I guess while that's not working still, the code is just tells us a story. So really what we're trying to get at here it that um so our weak form so extreme momentum and reversals over hours and days suggest that there's a return of patterns that would not be reliably exploitable by typical investors because of execution frictions holds borrow and locate constraints trading restrictions etc etc semi- strong form um prices that reacted to violently to public signals. So that could be Ryan Cohen's involvement, social amplification, etc. And the sheer scale and speed suggest information processing bottlenecks and microructure stress rather than than clean instantaneous assimilation. With strong form, the episode is consistent with no guaranteed rents for any group once constraints are included. Many retail investors and some shorts lost money. A few actors profited, but systematically exploiting this ex auntie was hard. So the bottom line is apparent anomalies challenge the letter of EMH, but they can potentially be reconciled with EMH when we model these frictions and limits to arbitrage. So my conclusion is that this episode does not outright fault by EMH, but it sort of highlights the conditions. So those conditions include concentrated source short interests, rehypotheation, collateral shocks and platform restrictions under which prices can deviate sharply and temporarily. For investors, this implication favors passive strategies for most contexts. While active strategies may add value, but they specifically understand micro structure, borrow dynamics and regulatory plumbing. For policy, we suggest that we focus on transparency of short interest, clearing house collateral mechanics, and orderflow risk management. Um, and that's extremely important when we're talking about anything related to it. Thank you so",
  "video_url": "https://youtu.be/vNN2oMfAmZk"
}