{
  "student_name": "Anamika Mitra",
  "org_defined_id": "037556874",
  "username": "mitra69",
  "email": "",
  "transcript": "For the social assignment, we're going to be uh determining the weighted average cost of capital or walk for Netflix to establish a hurdle rate for um a $5 billion content investment. And we must also analyze how um adding a $3 billion debt um affects this rate and compare Netflix's cost of capital to its competitors like Disney and Amazon Park. So, we've been given a couple of key values within our um scenario. We have our market cap or our equity as $200 billion. Our market value of debt as $13 billion. The cost of debt debt pre-tax is uh 5.8%. Um and this is based on the bond yield given a tripleB bond rating. Our corporate tax rate is 21%. Our equity beta is 1.3. Our risk-free rate is 4.5% and our market risk premium is 5.5%. So essentially we are going to use market values like equity and the value of its debt because they reflect the current opportunity costs for investors and the actual price to buy back or issue new securities today. Essentially book values are historical accounting figures that um do not reflect current econ economic reality and we calculate walk to ensure that return on that $5 billion content investment exceeds the blended cost of the money used to pay for that. In terms of the represent stage I'm going to start off by determining the cost of equity through capital which is uh using the adding the risk-free rate to the beta multiplied by the market risk premium. Essentially logic behind this would be to tell us the return investors demand for bearing a volatility risk. Our risk-f free rate is 4.5%, beta is 1.3, and risk premium is 5.5%. Um, and this is going to give us our cost of equity. Then I'm going to determine the cost of debt after tax, which is going to take the pre-tax yield, multiply that one by one minus the tax rate of 21%. And our yield is 5.8%. And this is essentially telling us that the interest is taxdeductible, making the debt cheaper, and it gives us the effective cost of the debt. Then I'm going to determine the market weights using the formula V is equal to E plus D, which is our total firm's value. I'm going to break it down into the proportion of it uh to that's done through equity financing and the proportion of debt. And our equity here is $200 billion. Uh debt is uh $13 billion as given in our scenario. And this essentially controls the percentage of funding that comes from equity versus what comes from debt. And then lastly, I'm going to Oh, you can't do that. Okay. And lastly, I'm going to blend this into the uh weighted average cost formula walk, which uh I'm going to it's going to be displayed on the next slide, but um we're going to uh calculate walk given all of these steps. Um so then for the uh implement stage uh we're going to primarily be using the weighted average cost of capital formula block that I can show on my other other slide but it's this formula here where we take the market value of equity divide that by E plus D which is your total firm value and multiply it by your cost of equity plus uh D over V which is your debt value um multiply that by the cost of your debt and multiply that way your tax rate and this is the main formula that we're going to use. So the Gemini code that I got for this was here and I ran it and I got these this output. So in terms of the cost of equity using the calc formula we got a pretty high cost of equity of 11.65% 65% which is calculated by taking your uh risk rate 4.5% plus your beta 1.3 multiplying that by your uh market risk premium of 5.5%. And you get 11.65%. Netflix considering it has a beta of 1.3 indicates the stock is 30% more volatile than the broader market. Investors perceive Netflix more as a growth risk. Therefore, they demand significant return of uh significant premium of 11.65% 65% to hold that stock and essentially this is the most expensive form of capital that Netflix possesses but conversely it has the cheaper cost of debt after tax of 4.58%. So the bond yield we have is 5.8% but the effective cost to the company is only 4.58%. Um it's because of tax shield because interest payments are taxdeductible. the government essentially subsidizes Netflix's debt for every dollar of interest that's being paid. Um they save about say 21 cents in taxes and this creates a massive spread between the cost of equity of 11.65% and the cost of debt of 4.58%. And this is our tax shield benefit of 1.22%. That comes from both. Now in terms of there's there's a little bit of a waiting imbalance considering that Netflix of 94% um equity weight compared to a debt weight of 6.1%. So the Netflix's current structure is heavily skewed at 93.9%. Um of equity compared to its debt weight of 6.1%. Because almost the entire weight of walk of the walk calculation is pulling from um the expensive equity bracket bucket of 11.65%. 65% and the final block remains high at 11.22% because of that. Um however in the given the current 5 billion investment scenario but given the scenario that we have we're in $3 billion of debt issuance um the debt weight increases slightly from 6.1% to 7.4%. And um the walk dropped slightly to 11.13% from 11.22%. While this does seem small on a mult on a multi-billion dollar scale valuation, a reduction of about 9ish basis points in the discount in the discount rate increases the present value of future cash flows significantly. And this confirms that shifting the mix towards a more towards dead which is a lot cheaper lowers the um walk or the hurdle rate. In terms of uh validating um whether this 11.22 uh% walk under the initial scenario uh that whether that makes sense we have to look at uh comparing it to competitors. So Netflix has a walk of 11.22% 52% which is high and reflects a pure play uh streaming model which is higher reliance on hit content and low debt usage. Disney as given in the scenario has a 8.2% cost of equity from the cath. It's a lot lower. Disney is a conglomerate so it has a different uh revenue streams from its park, its cruise, its ESPN network, studios, movies etc. uh they have a much more diversified revenue stream thereby a lower beta and utilize more debt uh which is like 30% versus Netflix is 6%. Which drags their walk a lot lower. So uh Netflix's walk is 8.2% whereas uh sorry Netflix's walk is 11.22% whereas um uh Disney's walk is 8.2% 2% because of the difference in uh which company utilizes more debt as opposed to equity. Um and in comparison to say Amazon Prime which has a 9.5% walk, Amazon has a massive diversification just like Disney via their AWS networks, their retail browsing um AWS I'm pretty sure is the hub, the cloud computing hub. So their risk profile compared to Netflix is a lot uh lower. So I would say that the calculated 11.22% is reasonable for Netflix but the it but high compared to its competitors because um I I consider it being accurately explained by Netflix's choice to be financed almost entirely by equity and um the walk for the for just content being its main revenue stream is 11.22%. So in terms of just like a sensitivity check, I would say that if interest rates rise by say 1%. Uh the cost of equity would jump to about 12.65%. Pushing walk significantly higher. And this essentially indicates that Netflix is highly uh sensitive to macro interest rate changes because its valuation relies on distant future cash flows discounted back to today. In terms of evolving, uh I would look at a capital structure strategy for Netflix. Uh in the sense that Netflix is currently underleveraged by carrying 6 to 7% debt, they're failing to maximize the tax shield uh benefits that Disney which has a much higher debt of 30% enjoys. So the issuance of that $3 billion of debt is financially sound. It lowers the lock without significantly increasing bankruptcy risk given that Netflix has a large market cap. They could also likely withstand even more debt to further lower their cost of capital. Um I would also look at something like a project specific walk where uh we could look at whether we should actually use 11.22% for the of walk for the entire $5 billion invest investment. In terms of just domestic content, you could use 11.2 22% as this matches the firm's average risk profile. But for more international content and emerging markets that Netflix also operates in, the risk here is a lot higher in terms of the currency the regulatory risk. So I would assume that we apply a risk premium of say plus 2% 3% to the walk raising that walk rate to about 13 14% for international projects due to the difference in risk in both the markets both the domestic and international markets um just reflecting on the overall process the walk trap I would say is that there's a very common u mistake of thinking that we that a company has a lot cash. So the money is essentially like something that's free and you can use it. However, walk analysis just using that value to uh analyze different projections say that Netflix's equity capital is actually very very expensive at 11.65%. Um so as a CFO I would say that the $5 billion content investment must generate a return greater than 11.22%. which is um our walk um to create any type of value. If the project only returns say 9%. Um it destroys shareholder value completely even if it generates a profit um because it fails to meet the return um threshold demanded by investors given the risk that they're bearing by uh main shareholders. Um I would say in future sessions or in f if I were to use this in the future I would say we'll take this 11.22% walk rate and use it to as the denominator in our discount cash flow model um to calculate the net present value of the content library and just make a much more sound decision.",
  "video_url": "https://youtu.be/GgwqBuB3gMY?si=ghzuUxpN7dUWwGLR"
}