{
  "student_name": "Evan Sleeth",
  "org_defined_id": "038072973",
  "username": "esleeth",
  "video_url": "https://youtu.be/J8P0SPQ-ISs",
  "transcript": "For my final project, I built an interactive AI-powered investment memo generator using n8n and OpenAI.\nThe goal was to solve a real finance problem: analysts and founders spend hours writing first-draft investment memos, even though most of the structure is repetitive.\nMy tool automates that first draft so users can focus on judgment, not formatting.\nThe problem I'm solving is that early-stage analysts, bankers, and founders need fast, clear investment memos, but writing them from scratch is time-consuming and inconsistent.\nThis is especially painful when you're screening multiple deals or startups.\nI built something I would personally use in finance roles — a tool that turns raw inputs into a professional memo instantly.\nI used n8n as the workflow engine and OpenAI's language model as the reasoning layer.\nThe workflow has three core parts:\nA webhook that accepts user input\nAn OpenAI node that generates the memo\nA response node that sends the result back to the user\nEverything is live and interactive — no hardcoded text, no fake outputs.\nLet me walk through the actual code logic.\nFirst, the Webhook node creates an endpoint called /investment-memo.\nThis allows anyone to send a POST request with basic financial inputs like company name, industry, revenue, growth rate, margins, valuation, and risks.\nNext, that data flows directly into the OpenAI node.\nIn the system message, I define the role of the AI as a professional investment analyst.\nIn the user message, I dynamically inject the webhook inputs using n8n expressions — so the AI is reasoning over real user-provided data, not placeholders.\nI also explicitly tell the model what to produce:\na business overview, an investment thesis, key risks, and a recommendation.\nThis mirrors how real investment memos are structured in banking and private equity.\nFinally, the Respond to Webhook node returns the AI's output as a clean text response.\nThat means the tool works instantly in Postman, a browser, or a front-end app.\"To test it, I sent multiple real scenarios through the webhook — SaaS companies, different growth rates, different risk profiles — and the memos adjusted correctly each time.\nThe responses were coherent, structured, and usable as real first drafts.\nThis can easily scale.\nI could add PDF uploads, financial statement parsing, valuation sensitivity analysis, or even export directly to Word or PDF.\nBecause it's built in n8n, I can also connect it to databases, CRMs, or deal pipelines.\"The biggest thing I learned is that building with AI isn't about prompting — it's about systems.\nThe hard part wasn't the model; it was wiring inputs, handling failures, and making something that actually works end-to-end.\nThis project taught me how AI fits into real financial workflows, not just theory.\"This isn't a demo or a mockup — it's a working product.Someone could use this today, and that was the goal.\""
}