{
  "student_name": "Kevin Sales",
  "org_defined_id": "033940131",
  "username": "kfsales",
  "video_url": "https://www.youtube.com/watch?v=7DYvFmpLf7s",
  "transcript": "Okay, everyone. Hey, my name is Kevin SS and today I'll be going to walk you through Apple's 90 90 billion dollar share repurchase decision using driver framework. And don't worry if you're not familiar with finance, I'll explain everything in simple language as we go. So to keep this project organized and easy to follow, I use a process called driver. And it's basically a step-by-step method that makes sure I think through the problem clearly. So define what is the problem that we're going to try to solve. What information assumption do we need? R is how will the analysis or model be set up? I actually run the numbers in scenarios. B make sure everything um will be validating. So we make sure everything makes sense. E will be evolve and this will be thinking about the bigger picture and long-term impact. And R which is reflect is going to be looking back and summarize what I learned. And this just helps me keep the story clear and logical. So core question is how should Apple allocate $90 billion buybacks versus dividends versus debt reduction versus acquisition versus R&D to create value and balance stakeholders insensitive. So there are several options. So they can buy back their own shares. They can pay one big dividend to all shareholders. They could pay down some of their debt by another company. This could be like an AI AI firm or a VR software firm or things of that nature or invest heavily in research and development. And my job is to figure out which is the best both financially and strategically and also who benefits from each option. So to understand Apple situation, let's look at the basics. Apple has a lot of cash $165 billion. They also make a lot of money every year about 100 billion. Their debt is around 110 billion which for a company their size is very manageable. A single share of Apple stock costs about $185. The company has over 15 billion shares in total. We also look at who owns the company. Birkshshire halfway owns about 6% and the CEO owns about 3 million shares. Employees have stock options that become valuable if the share price rises. And all these decisions help explain who is affected by Apple's decision. So hypothesis. So before doing math, I outlined a few expectations. If Apple buys back their own shares, each remaining share becomes more valuable because there are fewer shares to split the profit. If Apple pays down debt, the company becomes safer and more stable, which is good for lenders. If Apple decides to invest in R&D or buys another company, it might be helpful long term, but it takes time. If Apple pays a big dividend, shareholders get an immediate payout, but the company loses cash flexibility. These basic ideas will help guide the analysis. So key insights. So different groups care about different outcomes. Here's a simple way to see it. Regular investors like steady returns and lower risk. Birkshshire Halfway loves buybacks because the percentage ownership goes up without them buying more shares. The CEO and employee benefit when the share price increases because of their stock and stock options. Bond holders bond people who lend money to Apple. preferably the company to pay down debt and stay financially safe and a certain understanding first what each group wants us to evaluate will be essential in coming to the decision. So the model architecture. So here's here's so now that we know the key players in questions, here's how the analysis works. We take simple inputs like Apple's cash, number of shares, profit, debt, and the size of each scenario. Then go into scenario model. Basically is going to be Python. Google Python is what I'm going to be utilizing. And this is going to be showing option changes are important like earnings per share, cash left over, risk, and how each stakeholder is affected. And this will in turn let us compare the five options fairly and consistently. So here are five scenarios that compare buyback. Apple pays or Apple buys 90 billion of its own shares dividend. Apple pays each and every shareholder a big one-time cash payout debt reduction. Apple pays off a big portion of his debt acquisition. Apple pays or buys another company for growth or R&D investment. Apple invests heavily in innovation. Each scenario know regardless of what it is is going to be utilizing the same money but different outcomes will be um will be found. So before comparing the scenarios we need a baseline and how things look today. So using Apple stock price and variation and valuation, we can estimate that the company earns about $617 per share. Multiply that by all the shares and Apple owns roughly $95.5 billion a year. And this baseline is just going to be essentially utilized to help us understand how scenarios change things. So what happens if Apple spends 90 billion buying back its own shares? Apple will remove about 486 million shares from the market. With fewer shares, the total profits are spread across fewer people. So, earnings per share rise from about $6.17% or $6.17 to about 6.36 or $6.37. And that's about a 3.2 increase without Apple actually earning a penny more. That's why buybacks are such a popular financials too. They instantly make the numbers look better. So the slide compares all five options side by side. Buyback which is best for quick earning per share improvement. Dividend which gives shareholders immediate cash but doesn't change earnings. Debt reduction which lower risk and slightly increases earnings by reducing interest. Acquisition doesn't boost earnings right away but could fuel future growth. R&D is a similar story and helps long-term innovation but not immediate numbers. So each option has different strengths depending on what the company values the most. And if we look closely at the EPS, we can see that buyback is the most um how would you say is the most appealing. But as we mentioned earlier, it it may be a 3.2 increase, but that's only on paper. So keep that in mind. So here's how each group reacts to each option. Realtor investors like the dividend but aren't hurt by the buyback. Breer strongly prefers the buyback. CEO and employees prefer anything that lives to stock price. Bond holders prefer debt reduction. And the key point is that buybacks are great for shareholders but not necessarily for lenders or long-term innovation. And if you want to take closely here, we can see that the base is 18.5. The buyback is at 19,000. dividend is at 18.5 debt reduction 19,000 acquisition 18.5 and R&D 18.130K and this is the breaker plug which is essentially the base stake value of 172 billion and after buyback would be roughly around the same percentage of 172.05 billion. So next I checked the results and I made sure they made sense. So the buyback's percentage boost to earning matches the percentage reduction in shares. This confirms the math is correct. So when the share price is lower, the buyback is more effective and that also makes sense. And paying debt reduce interest cost and this will in turn increase earnings slightly. R&D and acquisitions don't change earnings right away as expected. And this step just ensures that nothing unrealistic or unusual is happening. So this slide here shows how the buyback result changes depending on Apple stock price. If the stock price is cheaper, the same 90 billion buys more shares, meaning earnings per share jumps more. If the stock is expensive, the effect is smaller. And this tells us timing matters. Buybacks work best when the stock price dips. So looking beyond the simple decision, it's important to think about Apple's long-term strategy. Ideally, Apple should balance its capital across multiple goals, returning money to shareholders, investing innovation, maintaining a strong financial foundation, and staying prepared for strategic opportunities. And it's not about choosing only one, but about choosing the right mix over time. So, final recommendation. So, after evaluating all five options, here's my conclusion. Apple should approve the $90 billion buyback, but also continue strong R&D spending. The buyback provides a reliable short-term boost to earnings and shareholder value. Meanwhile, R&D ensures Apple stays competitive in the long run. This combination balances short-term performance with a long-term innovation. So, finally reflecting on driver process, it helped me break down a large complicated question in smaller clearer steps. It forced me to think about before I calculated it, which made my model more effective and accurate. It also helped me understand the difference between creating value and simply shifting value between groups. Overall, this project strengthened my ability to analyze financial decisions clearly and logically. And I hope you guys enjoyed my slides. Thank you so much for listening and I hope you guys have a good one. Thank you."
}