{
  "student_name": "Silas Bowman",
  "org_defined_id": "036111483",
  "username": "bowma177",
  "video_url": "https://youtu.be/k7rev1_FTo4",
  "transcript": "All right to start. We are looking to um.\nSilas Cameron Bowman 0 minutes 16 seconds\nUse the driver framework analysis for the KKR's potential acquisition of Panera Bread. My goal is to determine a winning bid range that satisfies KKR's financial discipline while remaining competitive against strategic buyers. We'll begin in the with the defining discover phase. The target Panera Bread is strong asset with 6 billion in revenue and 900 million.\nSilas Cameron Bowman 0 minutes 36 seconds\nAn EBITDA. The problem is valuing this company is a tale of two buyers. So first the financial buyer, us. We have a strict cost capital at 9% whack and we rely on operating improvements to generate returns. Second, the strategic buyer, something like McDonald's, they have synergies.\nSilas Cameron Bowman 0 minutes 54 seconds\nMeaning they can cut costs by merging supply chains, which allows them to pay more. With my objective, I will use to build a discounted cash flow DCF model to calculate exactly how much KKR can afford to pay and then compare that to what a strategic buyer might offer and.\nSilas Cameron Bowman 1 minute 10 seconds\nMoving to the represent phase, I'm structuring my analysis using a Python class called canary evaluation. I chose an object-oriented approach here for the specific reason parameterization. Instead of hard coding values, I've defined variables for WAC or hard rate, growth rates, and exit multiples. Crucially, look at the strategic sceneries.\nSilas Cameron Bowman 1 minute 28 seconds\nUm.\nSilas Cameron Bowman 1 minute 30 seconds\nStrategic synergies or synergies parameter. This is a toggle that allows me to inject extra EBTDA or EBITDA into our model. This lets me simulate a strategic buyer's perspective.\nSilas Cameron Bowman 1 minute 46 seconds\nInstantly without rebuilding the whole model now for the implementation. So this is where the actual math happens. So I generated A5 year projects operating projection and let me explain the logic line by line. So currently I take the current 6 billion.\nSilas Cameron Bowman 2 minutes 2 seconds\nRevenue and grow it by our base case assumption of 5% per year. I apply a 15% margin.\nSilas Cameron Bowman 2 minutes 10 seconds\nIf I am modeling A strategic buyer, this is where I add the synergy dollar amount and and amount directly to the bottom line and then for three unlevered free cash flow. So this is the most critical calculation. The EBITDA is just an accounting number. The FCF is an actual cash available to pay.\nSilas Cameron Bowman 2 minutes 29 seconds\nDown the depth we'll use.\nSilas Cameron Bowman 2 minutes 32 seconds\nUsed to buy the company. To get this, I take EBT EBITDA subtract taxes at 25% to drop capital expenditures for the operating for opening those 500 new stores and subtract the networking capital. This gives us the true.\nSilas Cameron Bowman 2 minutes 47 seconds\nDistributable cash flow. So that's shown here. Revenue build, UTI build, the FCF build, unlever free cash flow, et cetera. So in the calculate validation.\nSilas Cameron Bowman 3 minutes 2 seconds\nFinally, in the calculate validation function, I discount those future cash flows back to today's dollars using a 9% wax for the terminal value, which represents the value of Panera beyond year five. And I'm using the exit multiple method applying a 14X EBITDA multiple which aligns with industry peers.\nSilas Cameron Bowman 3 minutes 21 seconds\nSo now that's shown in this first running the sensitivity, simplifying the FCS and continuing on to the next part which moves on into our next part of the code, the validate. We need to check if our engine is working and through this we run the projections, the validating scenarios, the buyer scenarios and create a summary table.\nSilas Cameron Bowman 3 minutes 41 seconds\nFor that. So in year run we see revenue starting around 6300 million or you know 6.3 billion but and an EB ITDA at 945,000,000 and in row 5.\nSilas Cameron Bowman 3 minutes 57 seconds\nAs you can see here, we the revenue has grown to around 7658 million and generating 1149 million in EBITDA with the cash flow check. Most importantly, look at the unlevered FCS column.\nSilas Cameron Bowman 4 minutes 14 seconds\nAs you can see here, it grows from around 394 million to 479 million. This confirms the business generates healthy cash to service our debt. So now for the validation summary, the output in this. Valuing the final valuation figures, this summary table tells us the story of the deal.\nSilas Cameron Bowman 4 minutes 33 seconds\nSo the KKR base case, the model outputs an enterprise value of around 12,130 million or 12.1 billion. This implies a 13X EBITDA multiple. This is our fair price base on our required 9% return.\nSilas Cameron Bowman 4 minutes 51 seconds\nThe strategic buyer. Now when we toggle on the synergies, the value jumps to 13, 13,332 million or 13.3 billion. The insight is that there is around a 1.2 billion gap between what we can pay and what a strategic buyer can pay. This confirms that if we get into.\nSilas Cameron Bowman 5 minutes 10 seconds\nTo a bidding war on price alone, we will lose now for the evolve stage.\nSilas Cameron Bowman 5 minutes 21 seconds\nAs you can see here, it creates our chart, defines our ranges, plots our bars and creates this visual output here. So for the first first for the football field chart.\nSilas Cameron Bowman 5 minutes 34 seconds\nHere on the left, our recommendation bid in the red dash line sits at 12.1 billion. You can see this falls squarely within the president transactions.\nSilas Cameron Bowman 5 minutes 48 seconds\nAs you can see here, the president transactions the second bar from the top, which ranges from roughly around 10.8 billion to 13.5 billion.\nSilas Cameron Bowman 6 minutes 1 second\nAs you can see here, this gives us a confidence that our bid is defensible in the market. However, notice a strategic buyer.\nSilas Cameron Bowman 6 minutes 11 seconds\nFar below it. It shifts the right starting at around.\nSilas Cameron Bowman 6 minutes 16 seconds\nYou can see here.\nSilas Cameron Bowman 6 minutes 19 seconds\nStarting at around 1314 billion, essentially setting a a floor that is higher than our base bit.\nSilas Cameron Bowman 6 minutes 29 seconds\nAnd second, we have the sensitivity heat mat on the right. So here I'm testing wax vertical axis against terminal growth horizontal axis. Now this heat mat uses the Gordon growth method. This is a perpetuity calculation. It yields lower values around 8 billion to 9 billion in the orange slash yellow center compared to our.\nSilas Cameron Bowman 6 minutes 49 seconds\nMultiple approach. Now why does this matter? It highlights a risk if the market crashes and we cannot sell Panera for a 14X multiple in five years and instead have to hold it forever. The value of the firm drops significantly and this visualizes the exit risks we are taking.\nSilas Cameron Bowman 7 minutes 6 seconds\nNow.\nSilas Cameron Bowman 7 minutes 8 seconds\nThe recommendation. What does this all mean? So find the reflect stage based on the model outputs there. This is our executive recommendation. The evaluation range. Our analysis established establishes evaluation range around 12.1 billion to 13.3.\nSilas Cameron Bowman 7 minutes 24 seconds\nThe floor is at 12 billion. It is ground in our financial constraints at KKR and the ceiling is around.\nSilas Cameron Bowman 7 minutes 33 seconds\n13 point around the 13.3 to 14 billion, which represents the maximum a strategic buyer could pay by factoring in synergies. The winning bid strategy. We recommend an opening bid of around 12.1 billion, which is a 13.5 X EDI TDA. This lines perfectly with our base case valuation ensures a.\nSilas Cameron Bowman 7 minutes 52 seconds\n9% WAC return. Now for the new negotiation cap, we advise a hard walkaway price after the 12.8 billion. So after a price of 12.8 billion. Bidding beyond this erodes our returns and chases a valuation that only a strategic buyer can justify.\nSilas Cameron Bowman 8 minutes 8 seconds\nNow for the positioning rationale, the financial versus strategic, we acknowledge that at 1.2 valuation gap against strategic headers like McDonald's, we cannot win. So we must win on structure. So for our strategic positioning, a sale to a strategic buyer eliminates management's control and creates integration risk.\nSilas Cameron Bowman 8 minutes 27 seconds\nBut for the financial positioning, we position this deal as a partnership. We offer speed, autonomy, and crucially, a 10% management rollover. This gives the founders a second bite of the apple upon our future exit, a wealth creation opportunity that a strategic buyer simply cannot match. Now for the final conclusion, submit the LOI at 12.1.\nSilas Cameron Bowman 8 minutes 47 secondsBillion secure the deal not by overpaying, but aligning with management's long term financial interests. Now this concludes the driver analysis. Thank you."
}