{
  "student_name": "Om Janamanchi",
  "org_defined_id": "037320344",
  "username": "ojanaman",
  "email": "",
  "transcript": "Hi, my name is Om Janmunchi. This is my Management 310 Section 6 assignment cost of capital analysis. So here in our assignment, we are told to evaluate Starbucks' proposed flagship roastery that requires $12 million upfront outlay and is expected to operate for about 10 years using 8.5% weighted average cost of capital as the hurdle rate to determine whether the project creates value and to recommend an accept or reject decision supported by our driver documentation framework. So let's just get straight into it. Here's our CoLab notebook. D, we have define and discover. All our libraries are already imported. So for that, we have very simply, let's put in a little bit of context. So obviously, we have Starbucks as our company. we're taking into consideration the investment of capital for flagship real street our whack is 8.5 percent our time period is 10 years our project overview is basically strategic initiative with starbucks being that it has a premium brand experience center and we're trying to elevate starbucks's brand and coffee enterprise the initial investment we have our building equipment 12 million working capital 500k total outlay a 12.5 million depreciations we're using the straight line depreciation method over the 10-year time frame and annual depreciation is expected at 1.2 million in uh annually uh revenue projections we have um for year one eight million to year two to five 11 million per year six to ten is nine million per year and then across the total sum of 10 years around 96 million or close short to 10 million dollars 100 million dollars sorry our annual operating costs where our cost of goods sold is 40 of our revenue labor is 2.5 million which is fixed rent and utilities 800k fixed marketing um for the first year 300 000 and then years two to ten will be 100 000 as soon as we get the push out there we can cut back on the marketing uh corporate tax is 25 percent terminal value um at year 10 will be three million working capital recovery is again 500k and uh the decision making criteria we're taking into consideration is net present value in our problem we're keeping WAC in mind and the decision rule if net present value is greater than zero and IRR is greater than WAC is our decision factors so options and under consideration well we have two options either invest in flagship grocery or don't invest critical questions we have is basically about the mpv irr um is this um an investment that in the long term will actually be worthwhile and give uh our shareholders value next we have r which is represent as well uh represent we know our project parameters all the values that we have in consideration so to take our cash flow model structure and represent we're seeing that um year one has a revenue of eight million years two to five is roughly eleven million and six to nine ten is ten million nine million each um and we just have the other considerations to take given that revenue take off our operating costs giving us EBITDA and then once we find our EBITDA value for each of the years tack off depreciation getting us earnings before interest and taxes then we take off our taxes is getting our net operating profit after tax and then add back the depreciation subtract the capital expenditures that we put into the project and take out the change in working capital and add the terminal value giving us our free cash flow so if we go by that formula in year one our total free cash flow will be 1.2 million and uh the cash flow table structure we have here just outlines um by at least year one year two to five and year 10 that we'd have a total free cash flow of 1.2 2.7 and 5 .3 million respectively in the year set provided so the key insights that we find from just a represent step is that year zero has a large negative cash flow due to our initial investment of 12.5 million year one will have a very low revenue with a modest positive fcf year two to five will be peak revenue where we're at the strongest of our capacity and then year 6 to 10 once the system and the improvements have been you know standardized and mass-produced our revenues will decline and take a short hit and year 10 will get a significant boost from the terminal value and the working capital recovery that we make in the end and And our depreciation tax shield is saving 300K in taxes annually. So that's all we have as per context for the representation of how our cash flows are going to span out over the next 10 years at Starbucks. Next, we have I for implement. In this case, we have building the cash flow model. So here we actually have the itemized bill that I've calculated for obviously based on the years, the revenue, the cost of goods sold, labor, rent and utilities, marketing, and the rest of all the calculations that we have giving us the cash flow values here. so obviously our first year we have minus 12 .5 million since that's our initial investment and then obviously we can see that it slowly gradually goes up and increases as the years go on so calculating the valuation metrics for this um our net present value is going to be um three million and a little over three million dollars at our 8.5 percent weighted average cost of capital which means we can accept that this investment creates value that our internal rate of return same thing since our internal rate of return which is 13.25 percent is greater than our rate average cost of capital we accept it since the returns exceed the cost that we put in profitability uh we see that it creates a 0.242 dollars per one dollar invested so that's green for us accepted a simple payback period is that the cumulative cash flows will turn positive in year six for us so only six years a little halfway down the project timeline we will be in the positive and made back what we have already put in discounted payback period for any deaths we have um will be turned positive in year nine so we'll have in our 10th year a good standing balance so we can accept that as well where our key insights basically give us the numbers that we're looking at right now present value total undiscounted cash flows now we can try to validate are all our accepts and agreement and all these factors um valid or is there something that we may have not considered from v our validate step so obviously we can see that we run analysis on the five checks the tax yield initial investment the year 10 terminal items and the NPV calculation and total cash flow sum and comparing them all with our expected results and what is very likely to happen they all match up so we are good to go and then we just have the very basic pros con comparison in terms of us with all these financial um factors of either option one invest or option two don't invest where it shows that pretty strongly that we should invest into this this uh 12 .5 million expansion into flagship roastery and our overall evaluation is saying that since we passed four of the four tests uh the model we've chosen supports the investment and uh a starbucks into this new market so it's a good decision now we have e for evolve the next step of a driver um for e evolve i've just run a few sensitivity analysis where one is like revenue reduction say we have a revenue reduction of negative 20 percent over the 10-year span so our base we have our base case of NPV and IRR and the downside if we had a 20 percent reduction in our revenue which shows that unfortunately yes the project can sustain but the project becomes unviable in this case where it wouldn't be the best decision to go forward or offer us where we see in our detailed revenue sensitivity table when we're calculating against how much our actual revenue values are it basically says that if we dip below 80 percent of our return being revenue it's a very bad decision to go down this investment path so we need a very hefty amount of revenue that we would like uh across our 10-year span second we have our weighted average cost of capital variation if it increases or decreases um two percent which this more or less does not change much we have the optimistic base case and the pessimistic of good case okay as neutral and the worst case scenario and our basic revenues stay more or less consistent here than up and down so we're good the key takeaways from this step is um basically that our project in either worst case or best case is a very fragile financial profile but we still end up with a strong net head present value in both cases that allow us to continue forward with this decision finally we have step r for reflect where in our reflection we just answer our critical questions from the beginning where um our project's net present value is three a little over three million dollars Our internal rate of return is 13.25%, which is greater than our WAC, so we're in good standing. It'll take approximately investment to recur within six years of this project. How sensitive is net present value to revenue fluctuation? Well, our NPV is very vulnerable to revenue shortfalls, So if we do have a hit in our revenue, it will affect the 10-year at the end of the road shareholder value basis at the end. And then what are the risks and how do they have an impact? So obviously, we have all the basic risks you can consider, such as we talked about before. revenue risk which is all dependent on the operations marketing financial risk and how strategically we place our products um and then finally does this align with starbucks basic brand uh objectives and allocations which in all these cases it does it's just still at the end of the day it's a very huge amount of capital to consider for 12.5 million that we're locking down that could fund very close to 40 to 50 um standard starbucks stores and then uh comparing it to our financial scorecard that we uh calculated here which is just comparing npv irr profitability payback period revenue stress test and weighted average cost of capital stress test we pass five with the six tests we've failed revenue as we told said before as revenue takes a hit our mpv will also take a hit so five out of six is roughly 83 percent um confidence in this strategy so because of that uh my investment decision would be to give um this 12.5 capital allocation into starbucks a very strong acceptance and for the company and the business and move forward with this so overall that would be my decision so starbucks flagship roastery project should be a strong approval and moving on into the plant execution and distribution stages uh for the company all in all that was my management uh 310 session 10 assignment which I found was very interesting and very exciting to do in terms of taking a very local product such as Starbucks and thinking about obviously the amount of capital they have to allocate for their future projects, endeavors, etc., which has been a very cool assignment to me to do. So thank you so much.",
  "video_url": "https://youtu.be/bmPfWAcO8pE\nhttps://983291-6.kaf.kaltura.com/media/t/1_pffl2jgz"
}