{
  "student_name": "Sri Pinnamaraju",
  "org_defined_id": "036238865",
  "username": "spinnam",
  "email": "",
  "transcript": "Assignment number nine. This is management 310 cost of capital. And today we are going to be using the uh driver method which is define, discover, represent, implement, validate, evolve and reflect. And today I'm going to be presenting my full WACC or WAC analysis for Netflix, including the current cost of capital and the impact of adding $3 billion in debt and some specific project discount rates. And I'm going to then compare how Netflix compares to other companies like Disney and Amazon. So um using this driver method I'm going to define and discover and then represent and build my plan and then I'm going to implement some calculations in Python and validate my results and then finally like evolve and reflect on um what my project is about. So as you can see we have to calculate the vaded average cost of capital so whack for Netflix in connection to a hypo hypothetical 5 billion content investment decision and my analysis must determine the current whack of um the current whack and evaluate the impact of adding debt. So that is the $3 million in debt. Um and financing assesses project specific versus firmwide discount rates and compare Netflix cost of capital to industry peers. So moving forward to the define and discover. In the define and discover stage, I am going to establish some core financial like core financial problem and gather like all the necessary inputs and conditions we need before doing any calculations. So these are all the required inputs. We have the Netflix financial parameters which are all hypothetical. The market uh capitalization is 200 billion. Total debt looks like 14 billion. We have the debt of the market value which is 13 billion. We have the equity beta. We have bond ratings. We have corporate tax. We have current stock price. Then we have market conditions which are important to think of. And we have a risk-free rate um of 4.5, market risk premium 5.5. We have immediate industry whack range which is between 8 to 10%. And then we have our strategic content context. We have Disney capital structure which is 70% equity 30% debt. Amazon Prime Video uses Amazon corporate walk of 9.5. Then we have Netflix considering a three billion um additional debt insurance for content investment. Moving forward, these are our financial parameters and market conditions and our strategic um content. So we have our bond summary. So Netflix is evaluating a 5 billion content investment with um while also considering a three billion um in new debt. The company has to determine the current whack the whack after the high leverage and the project specific whack for the US and international content. So, some of our market inputs are going to be our um 4.5 risk-free and our 5.5 MRP and our beta value as 1.3. We have our capital structure and that's going to be uh 200 billion equity value and then 13 billion market debt and 21% tax rate and a 5.8 bond yield. We have our scenario input which is are going to be our uh $3 billion debt insurance and um our project risk inputs which are supposed to be comparable betas the US versus international risk adjustments. So basically Netflix is evaluating a five billion content investment and you know considering um three billion in debt. My job is to basically determine Netflix's current um whack and its whack for after the leveraging up amount and the separate wax for the US and international content. And I just went over all of the key inputs, the risk-free rate, market premium, beta values, 200 billion in equity value, 13 billion market debt, 21% tax rate, and 5.8 bond value. And all of these values and inputs are going to be going into my calculations. So now we're moving on to our represent stage. And in the represent stage, I'm laying out the full blueprint of my analysis before I'm going to do any calculations. So it's to map out the exact steps I'm going to take. And some of those steps are collect all the numbers we need and then figure out Netflix's cost of equity debt. Netflix. Then we have to find Netflix's capital structure mix, calculate Netflix's current whack, and then model what happens if Netflix add $3 billion in new debt, calculate the whack for different types of projects, and compare Netflix's whack to its competitors. And I want to test how sensitive the whack is to some assumptions, and then finish with recommendations for Netflix. So these are some of the exact steps I will be taking to compute Netflix's cost of capital and understand how leverage affects risk and determine the correct discount rates for each type of content investment. So this stage basically helps me organize all of the steps that I need to make. And um as mentioned before in my previous slides um I collected all of the financial inputs needed for uh the whack. And those include the 4.5 risk free rate, the 5.5 market risk premium, Netflix's beta of 1.3, a $200 billion equity value, 13 billion market value debt, and a 21% tax rate, and a 5.8 bond yield. So getting all of those market based inputs is important because our whack reflects the current opportunity cost demanded by our investors. So collected all the market inputs, collected all the capital structure inputs and uh then we have our scenario inputs which is good and then we have our project risk inputs. Moving on to our represent uh to more of our represent slides. These are a couple these are two of the equations that we'll be using. Um we're going to use the cost of equity um formula and the cost of debt formula. And the KPM uh sorry the CAPM uh equation tells us how much return investors expect based on the risk-free rate, the stocks beta and the riskiness of the market. And um we can't compute whack without knowing cost of equity. So we need that. And then we need the cost of debt because Netflix pays interest on its debt. But interest is also taxdeductible. That means debt is sometimes cheaper than it looks. Um after the tax formula, the after tax formula captures the tax as like savings and that is called the tax yield. So whack must use after tax debt cost because this will reflect Netflix real cost. So we need to calculate that. Next we need to do our market values. So whack is a weighted average. So we need to know what percent of Netflix is financed by equity and what% is financed by debt. Right? So, we must use market values, not book values, because the market values show what investors actually think Netflix is worth. And book values are just not going to give you that accurate representation. Then, they're going to be outdated accounting numbers. And next, we want the weighted average cost of capital. And um you need that because whack is basically a company's hurdle rate. It's the minimum return required on a project. So every major decision in this um scenario depends on the wax. So Netflix should accept the five. So like all these questions, should Netflix accept the five billion content project? Does adding three billion debt hurt or help Netflix? How does Netflix compared to Disney and Amazon? And like should domestic versus international content use different discounts rate. So once we figure out that value of whack, we'll be able to answer all of those questions. Next we have our beta un unlevering and relevering equations and we need it because when Netflix add debt the company's risk will change. So the beta must be unlevered to remove the effect of the current debt. So this basically gives us um the company's true bisness risk that is not affected by financing and you need to adjust the beta before adding new debt. So when Netflix adds the three billion of debt, the financial risk increases and then that means the equity will become riskier and the cost of equity increases and you have to calculate a new beta to compute the new cost of equity and new cost of whack under the new leverage scenario. We need the project specific whack because we need to know the whack for the US content and the whack for the international content and for this project one demonstration or one equation of whack is not appropriate. So we need to calculate it because domestic content which is normal like Netflix risk and international content um could be different. Right now we say that domestic content is equal to Netflix's normal risk and the international content would be higher. So we need a different beta and different re and that's going to basically show us our different wax. So we need to have these two specific types of uh project specific wax because we'll be understanding our discount rates. Last but not least, we are going to be going and looking at our sensitivity analysis formula. And we need this because the sensitivity analysis formula tests how sensitive our whack is compared to um the changes in our beta, changes in debt, changes in the market risk premium, and changes in our cost of debt. All right. Now, we're going to be moving on to our implement section. And what I'm going to do is I'm going to take you through my collab notebook. And we have a lot of different parts in this Netflix analysis notebook. So we have our input variables right over here. We have our company uh different values um of 20 $200 uh $200 billion in equity, $13 billion in debt. We have our debt information. We have our project specific betas. And then we have all of our different functions. So over here we have the cost of equity. We have our base uh whack formula, our beta unlevering formula, our beta relevering formula. And then these chunks of code are going to be computing all of those equations. Then we have our component cost calculations. And then we have the capital structure weights calculation, our base case uh W calculation, our scenario 2 calculation where we'll be able to reassess all of these formulas based on the increase of $3 billion of being in debt. And then we have the um updated weighted capital. Then we have the scenario 2 analysis again. And uh we're going to be printing out those values using this code right over here. Then they have the project specific uh whack. And then we're going to have the sensitivity analysis down over here. And then that is going to give us our output showing us all of the different values for every equation. Then we have this validation area. So this validation basically goes and checks if the values make sense. But uh our first slide of our input section as you can see we have our inputs and setups. This sets the core financial inputs used for all of the wack calculations and uh other calculations that we mentioned which is like CAM and then we have another area we have our core functions. So this is another area defining our core calculations and functions. Then we have our cost calculations and this basically computes the cost of equity and after tax cost of debt required to basically calculate our base whack um equation. And then we have our market value weights um and this computes our capital structure using market values. And we have um another section of the code base case whack. So this calculates Netflix currents whack and that is required for a deliverable and then we have a scenario where we add $3 billion in debt. So that implements the leverage scenario when we have the unlever beta and the relever beta and then that's how we're going to get the new cost um of equity and new cost of whack and that's required for another part of our assignment. And then we have our um project specific whack that we also get to um describe and that computes domestic and international content for discount rates and that's required for um our project as well. And right over here we have the sensitivity analysis for our eight part of our code block. And that basically tests whether the whack is un works uh under different betas and depth levels. And uh then we have our last part of the code which is the validation block. And that automatically checks if the whack logic, the beta effects and the risk effects and sensitivity behavior are all correct. And um we can go over here and we can say we seeing that check that the whack is between the cost of debt and cost of equity. If that is true then the base whack is between after tax cost of debt and cost of equity is correct. If not it says check inputs and we have those validation checks over here. And we have our analysis right over here. So the base whack is between after tax cost and depth of cost of equity. We have our real levered beta increased after adding debt. So that is also correct. The cost of equity increased with higher leverage. Correct. The international whack is higher than domestic. So that is correct for higher risk. And then we have that the whack increases as beta increases. So that's correct sensitivity behavior. And then the whack decreases slightly as depth increases which is correct because of the tax shield effect. So we have all of that and we see all of that um uh all of those descriptions get supported by these values over here. So this these are our results and over here I'm basically showing my results from the Python code that I described earlier and over here I calculate the Netflix base cost of equity using the c um equation which came out to be around 11.65% 65% and then the after tax cost of debt which is around 4.58%. And um because Netflix is mostly equity funded the capital structure weights are about 94% and the equity and uh in equity and 6% in debt and then using those inputs Netflix base whack was um 11.22 and that is our hurdle rate. So then I modified um the scenario and I models the scenario where Netflix added $3 billion in debt and when I unlever and relever the beta the risk to equity increases slightly. So the new beta rises to be about 1.31. Okay. And the cost of equity increases a little as well. But even with this extra debt, the whack barely like moves. It stays around 11.2 meaning Netflix still has a room to use debt without raising its overall cost of capital. So then I calculated the specific project whack domestic content basically stays the same at the base rate while international contact actually has a higher required returns around 12.25% because it actually carries more risk. Finally, I moved on to showing the outputs for sensitivity analysis and that shows that the whack increases as beta increases which is expected in the relationship and the whack decreases slightly as debt increases because of the tax shield. Overall, the code confirms that the model behaves correctly and supports all the financial conclusions for Netflix overall investment. Moving on to our validate portion. I mentioned this previously, but this little output basically shows us um how we are validating all of our inputs and recalculating the key relationships and comparing it to industry benchmarks to see if our whack results are actually logical. So all of our base whack, our leverage whack and our project specific whacks have all behaved as expected and the sensitivity analysis confirms that the model responds correctly to changes in key assumptions. So that basically means that our whack outputs are valid and reliable for use in capital budgeting decisions. So that's great. In the involve stage, I'm basically focusing on what the results mean uh strategically for Netflix. So first our whack about for having a whack around 11%. Um that becomes the company's hurdle rate. So this means any project whether it's a constant creation or a market expansion it must exceed this percentage to actually create sharehold value. Second when we model the 3 billion in depth increase the whack barely changed and that tells us Netflix still has room to use moderate leverage without increasing its overall cost of capital. So basically because of their stable cash flows um this happens because of Netflix's stable cash flows and tax shield. Third using u project specific wax okay is really important because domestic content can be evaluated with the base of having a whack of 11% but international um projects requires a higher rate because the risk is actually higher. So this prevents Netflix from underestimating the global risk that's involved. Another thing is comparing results to Disney and Amazon basically shows that Netflix's whack is a little bit higher. Meaning that the company needs higher returns to justify investments. So this reflects Netflix more because it's a concentrated business model and there's not that many like different types of segments within the company. Finally, I want to talk about how this wack analysis basically sets up the foundation of making any future decisions like NPV calculations, capital budgeting evaluations, and capital structure planning. So, whack isn't just a number. It becomes a big financial decision for um a big financial value for Netflix to make long-term strategies. And one other thing I wanted to talk about is maybe to evolve this project, you can um make the wax for different content markets. So like basically Netflix should use like a lower whack for US content and a higher whack for international content because as mentioned the international whack is higher than the domestic whack and that happens because the global markets um are more risky. So keeping that in check will prevent um Netflix from investing in something that's too risky. Moving on to our reflect. For this reflect stage, I think my biggest challenge was trying to understand and seeing how all of the components work together. The beta, the CAPM, the cost of debt, and the capital structure um and how it all fit together in the WAC formula. But working throughout the code, it kind of helped me understand how sensitive WAC is to changes and leverage risk. I also realized the importance of using different discounts rates for domestic versus international content because project r project project risk is not uniform across all like different geographic locations or segments. So something that surprised me though is how little the whack changed when Netflix added to $3 billion of debt. And I think that basically means that the company has a lot more debt capacity than I thought of. So basically, if I were to improve this analysis, I would kind of like run the additional sensitivity um sensitivity test and kind of see and adjust the tax rate and compare um that with other companies. But overall, the assignment helped me understand why WAC is such like a big part of figuring out future work in capital budgeting and valuation and strategic finance decisions. And one thing I wanted to mention is Netflix's cost of equity is relatively high due to its beta value which reflects a higher um volatility in business risk compared to their other diversified competitors such as um Amazon or Disney. And so one thing I also wanted to mention is the company's current whack is approximately 11 to 12% which is above the media industry average of 8 to 10%. This is a higher whack. So that indicates that Netflix must earn higher returns on current content projects to create value compared to companies like Disney and Amazon. Um as mentioned before Disney's capital structure is around 70% equity and 30% debt. That produces a much lower whack of 8.2. too. And that's happening because of Disney's diversified um revenue like from parks and consumer products. And that's similar because Amazon is being looked at as like a whole corporation. So Amazon Prime Video relies on Emirates corporates whack of 9.5%. And that also um benefits from like basically stabilizing their cash flows. And that's why um it's keeping its risk and therefore its hurdle rate lower than Netflix's. So basically when Netflix did add $3 billion in debt, two things will happen. The beta will increase because there's more leverage raises in the firm's equity risk, but the cost of debt increases slightly due to higher borrowing risk. Um, but despite these changes, Netflix's whack still doesn't move as much because the tax deductible of interest payments offsets the increase in equity risk. So, this basically means that Netflix still has moderate debt capacity and can add some leverage without like materially like having to uh without having to like worry about their high hurdle rates. But overall, I will say Netflix's whack is higher compared to its peers. And that is because it's more content dependent and risk intensive. Meaning that the company has to have higher return rates on their TV shows or projects, especially if they're going to be working internationally to remain competitive. All right, thank you so much for listening.",
  "video_url": "https://youtu.be/dXda63W_KSA"
}