{
  "student_name": "Isabella Corrales",
  "org_defined_id": "037007344",
  "username": "icorrale",
  "video_url": "https://youtu.be/rL5s1dHin9o",
  "transcript": "Hello, my name is Isabella Corrales, and today I'll be analyzing Apple's proposal, the $98 billion share repurchase using the Driver Framework. My goal is to evaluate whether this buyback creates value compared to alternative uses of cash while considering the impacts on all key stakeholders, which include retail and institutional shareholders, management, employees, and bondholders. And some of the different alternatives that we can do, like uses of cash, is a special dividend, debt reduction, a strategic acquisition, and incremental R&D, which is seen here. So I'll be doing this, you know, looking at the EPS, ROIC, the leverage ownership concentration, and also considering agency and governance implications, which is just essentially who benefits and who bears the risk of each scenario. So to kind of go over this information here, we have the 165 billion in cash investments, 100 billion annual free cash flow, the 185 share price with P/E 30, dividend yield 0.5%, 15.5 shares outstanding. And then we have balance sheet information. which is 110 billion and so on, pause to look at it all, but the proposal being the 90 billion buyback. So really the main question here is does this buyback create value, like economic value, or does it just kind of redistribute the value among the stakeholders that we discussed? So to kind of represent the different choices here and like guessing of what they could do or not guessing because it's. It's like generally what they do. You know, we had the buyback, the debt reduction, strategic acquisition, R&D, and then the special dividend. You can kind of look at this now, but we'll get into it further later just to lay it out here. It will make more sense later though, so I would probably just come back to that. I guess again, whatever. So, buyback reduces shares outstanding increases the EPS and concentrating ownership among the remaining shareholders. And the debt reduction improves credit metrics, benefiting bondholders, but slightly limiting the immediate shareholder upside. Strategic acquisition carries the long-term growth potential, but may reduce short-term EPS, R&D carry long. So that's the same thing with that one. And then the special dividend distributes cash directly to shareholders, providing immediate returns, but reduces cash reserves and limits the financial flexibility. So, you know, just to kind of like represent every what we are finding, but we're representing like what we're comparing it to, which is that the different alternatives. So to kind of get into the implementation, we will be going over to the collab and since um I didn't say Apple's net income explicitly I just um for the Baseline did the 90 you know billion which is what our um you know the purchase is so um for that you can see all this information here we have our proposed repurchase amount at the 90 billion. And so down here, I told it to calculate the baseline EPS, which gave me $6.17. And also, as you can see, this baseline net income rose up to almost $96 billion. So, you know, with that $96 billion in the EPS, I wanted to, you know, find the new EPS. So for that, we have 6.37 dollars. And as you can see up here, we also have 486,000 or million shares, which does reduce the share count of about four reduces the share count. by like 3% and then to calculate the share price after the repurchase it shows you that which I just used the P/E that you know we discussed the 30 P/E ratio but you know under these circumstances, this, the changes in EPS translate like proportionally into the changes in share price, they both go up. So this isolates that mechanical effort of the buyback while holding market sentiment constant. So as well as, or like, however, this price increase does not reflect new value. being created at the firm, it reflects earnings being spread. So in other words, you know, this buyback just increases the per share metrics without increasing total company earnings as of what we're looking at now. And also under this 90, you know, billion dollar buyback, We are looking at the fact that the total amount of shares, as you can see, the shares outstanding is, but 15, what is that billion? And 50 million or 15.5. And it's, it's new shares outstanding is now just almost straight at 15. So that did decrease. And then we also have that, Right here, the initial cash on hand was 165 billion and it went down to 75. Billion and so as you can see, that is a direct use of cash to repurchase. To repurchase its shares. Or yeah, for the repurchase share and. While, you know, Apple, as you can see from this, is highly liquid, this reduction in cash does lower the financial flexibility in exchange for that higher per share ownership concentration. And then I also wanted to look at leverage. So for that, we do the debt to equity ratio before. So this is the before. And then I did after buyback and it's, there's still 0.04. So there could be, it could be like rounded and if we had a little bit more numbers right there, there's might be minuscule fluctuation, but overall it does remain the same. And that is because this buyback is funded with existing cash as we just saw rather than the like new debt. So the total debt does not increase. So yeah, just roughly unchanged. And that indicates, though, that this buyback increases the EPS, as we saw, without meaningfully increasing the financial risk. So that is what all that information means. And then, yeah, a share buyback does not increase the ROIC, and this is because it does not change operating profit or invested capital used in the business and improves this per share metrics, but does not improve the operating efficiency as we have been talking about. So to kind of compare this with other other scenarios, I have down here for the the six, the $6 special dividend. over here we can see that it changed the um the remaining cash on hand after to 72 billion so I'll go back up to see it was 75 so really I mean 3 billion is a 3 billion but in these terms it doesn't really change it drastically. So, and it also down here does not directly impact the EPS. So that was that situation. As we talked earlier, the debt reduction just improves earnings modestly through the interest savings and, you know, can strengthen like Apple's balance sheet really, and then the acquisitions or acquisitions and R&D can generate just higher long-term value, but only if you know returns obviously of Apple's cost of capital does or if the returns exceed Apple's cost of capital, which is just kind of uncertain. So to go back we need to you know obviously I did validate and in terms of work and numbers I validated those numbers through multiple AIs the easy calculations you know do them on your phone very easy but to kind of validate what all of this information means and it's like uh impact and stuff and just um you know, from like a value creation sort of perspective, this buybacks EPS increases, you know, comes entirely from the denominator management. So that kind of means it's not, like I said, improving operating costs or operating performance, because that's on the top. And yeah, unless shares are just like undervalued or something, this buyback primarily represents value transfer rather than value creation. So from the stakeholders, I think they're... So to look at these outcomes from the stakeholders, I'd say that, you know, the buyback clearly benefits existing shareholders and management, particularly those compensated, you know, with the stock or EPS linked incentives. Institutional investors benefit from this higher EPS as well because, you know, their gain is increased. Their ownership gain is increased without having to invest new capital. And That's the same for retail, although they can only gain if the share price does rerate. And then management benefits through this higher EPS as well. And the buybacks do support stronger performance linked compensation. You know, employees possibly, or do not have it up. Yeah, like employees with the $170 strike options benefit from higher market prices just with future dilution risk. So there's that. And then bondholders also do experience a little benefit, but they face, they're bearing some risk there since cash is reduced without lowering the outstanding debt. So Yeah, to kind of evolve, I would say it would be good to kind of scale back or scale the buybacks based on valuation, maintain a conservative leverage target as we did, and maybe combining them with some R&D and selective, strategic acquisitions, just the combination of it can be a nice approach to reduce agency risk while preserving that long time, long term competitive competitiveness. And I say this because as earlier, you know, that we looked at investments in R&D or strategic acquisitions may reduce short term EPS, but have the potential to create long term value if they do generate above the Apple's cost of capital, as was shown in that little representation box. Compared to the other alternatives, though, I'd say a special dividend, you know, provides the immediate cash to shareholders, but does not improve the per share metrics. So debt reduction, you know, might just materially like lower that financial risk and benefit the bondholders, though it offers, you know, limited short-term upside to equity. And to focus on the ROIC, a dividend similarly does not affect the ROIC as it represents a distribution of excess cash rather than an investment in operations. The debt reduction can modestly improve ROIC by lowering invested capital and reducing interest expense, unless I guess your leverage is excessive. And then the investment in R&D or acquisitions have the potential to increase the ROIC, which is return of invested capital. And if these returns, if the returns generated exceed the Apple or Apple's cost of capital, then the ROIC can be increased. However, these investments may lower the ROIC in the short term before benefits can actually be realized. So it is important to know that it's more of a long-term effect there. But to sort of reflect and give a recommendation, I would say that the $90 billion buyback modestly increases the EPS, as we saw, but does not clearly create new economic value. This buyback just benefits shareholders through the higher EPS and increased ownership concentration while largely leaving that operating performance and long-term growth prospects unchanged. And, you know, like a balanced strategy with smaller valuation-driven buybacks combined with, you know, reinvestment and balance sheet strength, sort of, you know, like I said, strategic acquisition and so on, can better align with shareholders, employees and creditors that creditor interests while also preserving Apple's strategic flexibility. So a good healthy balance of it all would be nice. But so yeah, that is my conclusion. Thank you."
}