{
  "student_name": "Anvitha Mandhadi",
  "org_defined_id": "036568738",
  "username": "amandhad",
  "email": "",
  "transcript": "Hi there, my name is Anuta Mandari and in this video I'm going to be presenting my cost of capital analysis for Starbucks proposed flagship roaster investment. So the purpose of this analysis is to evaluate whether Starbucks should invest $12 million today in a new flagship roaster that will operate for 10 years. I use this firm's 8.5% whack as the discount rate and hurdle rate to determine whether the project creates stakeholder value, shareholder value. Throughout this presentation, I will explicitly walk through every stage of the driver framework, including define, represent, implement, validate, evolve, and reflect. And I will connect my reflection to the driver as six principles of awareness essay that Dr. Zang shared with us via email. And my goal is to clearly demonstrate a transparent cash flow model and the core capital budgeting metrics, multiple sensitivity test and the executive ready recommendation that weighs both financial and strategic considerations. So I will begin with the define and discover stage and this is the most critical gate of the entire assignment. Right? So the decision problem I'm solving is whether Starbucks should invest $12 million at time zero in their flagship roaster that operates for 10 years given a cost of capital of 8.5%. The main objective is to determine whether this investment creates shareholder value. I do this primarily by calculating the net present value using Starbucks's whack as the discount rate and applying standard NPV decision rule which states that the um let me show you where this is. So here are all of my assumptions and then here is where I do the calculations. And so this states that a project should be accepted if the NPV is greater than or equal to zero and rejected if NPV is less than zero. I also compare the project's internal rate of return must be greater than or equal to the cost of capital in addition to the NPV and IRR. I evaluate the simple payback period and so the discounted payback period and the profitability index as supporting capital budgeting metrics. The scope of my analysis is strictly on incremental cash flows which is generated by the Rosary project and the project has a 10-year life and requires a $12 million initial investment and that is depreciated straight line over 10 years. Working capital of $500,000 is deployed at the launch in year 0 and fully recovered in year 10. Revenues are projected to be $8 million in year 1, $1 million in years 2 to 5, and $9 million in years 6 through 10. The operating costs include the cost of goods sold at 40 at um let's see how much this is. The cost of goods sold at 40% of revenue, labor of $2.5 million per year, rent and utilities of $800,000 per year, and marketing of $300,000 per year, followed by $100,000 per year thereafter. The corporate tax rate is 25% and the terminal value at the end of year 10 is $3 million pre-tax and is taxed at the corporate rate. And so here is where you can see all of the assumptions. Um I think I briefly went through this before and this is all of the numbers clearly mentioned. So the majors uncertaintities that define the risk profile of this project include whether the roaster can actually achieve the projected revenue levels, right? So particularly the $11 million per year in years 2 to 5, the potential cannibalization of nearly of nearby Starbucks locations and realiz real realizable terminal value of highly specialized flagship asset after 10 years and the broader macroeconomic risks affecting discretionary consumer spending. In terms of the drama framework and the essay that the professor shared, the defined stage reflects the discipline of awareness of the real problem. And I'm being intentional and not simply solving a math problem, but instead focusing on true business decision, whether this investment creates value at the firm's cost of capital. So here, this is the cash flow metrics that we've kind of talked about. Um, we're looking at the payback, the discounted payback, and the profitability as well. Next, moving on to the represent stage. This focuses on translating the problem into a clear structural model before touching my code. So at time zero, the project generates negative cash flow of $12 million for the initial investment and negative $500,000 for the working capital. From year 1 through 10, the project generates revenues based on the assigned schedule from which I subtract the operating cost and the depreciation to arrive at EBIT. Taxes are then applied to EBIT where positive depreciated positive depreciation is added added back as a non-cash expense and changes in worker and capital are incorporated and in year 10 after tax terminal value and the recovery of working capital are added. The flow of value moves from the revenue to operating cost then to EBIT then to taxes then to operating cash flow and finally to total free cash flow. The free cash flows are discounted at the 8.5 present whack to compute the NPV and this represent stage embodies the awareness of structure described in the essay that Dr. Zang sent. And by laying out the full timeline and logic of the free cash flow before coding, I'm able to see the order and the relationships instead of treating the project as a collection of connected numbers. So after represent, that's when I get into the actual implementation stage. And here is where I have all of my code. And so I'm able to translate this conceptual model into a fully automated Python code. So here at the top I have all of the paramise assumptions dictionary. So this includes everything from project life to initial investment to working capital to terminal value to tax rate the whack the revenue schedule and all operating cost assumptions. This parameters and assumptions ensures that if any inputs change then the entire model updates automatically and remains fully reproductible. So I also define annual depreciation as the $12 million investment is divided by the 10 years which equals to $1.2 million per year. Next, I implement my own custom NPV and internal rate of return functions rather than relying on the ones that Numpy allows. But the NPV function discounts each cash flow at the given discount rate, including time zero. So, the IRR function uses bisection search to find the rate that sets the NPV equal to zero. And writing these functions by myself ensures full portability and transparency in how the financial metrics are actually calculated. I then go into the cash flow model inside of the cash flow calculation function. And so revenues are assigned based on the provided schedule and can be scaled using a revenue modifier for sensitivity analysis. Cost of goods sold is calculated at the 40% of revenue. Labor, rent, utilities, and marketing are added as fixed annual costs according to the assignment. Depreciation is applied at $1.2 $2 million per year for years 1 through year 10. The EBIT is calculated as revenue minus the total operating cost minus the depreciation. Taxes are computed at 25% um when taxable income is positive and I explicitly compute the depreciation tax shield as depreciation is multiplied by the tax rate. So its contribution to value creation is clearly visible for grading purposes. And the net operating income after tax is calculated as EBIT minus tax and operating cash flow is calculated as NOAT plus depreciation. And so when working capital is modeled as a negative $500,000 outflow in year 0 and a positive $500,000 inflow in year 10, the terminal value of three-year dollars is taxed at 25% producing an after tax terminal value of $2.25 million in year 10. The final free cash flow in year 10 is calculated by the operating cash flow plus the working capital changes after tax terminal value. The year zero zero free cash flow is explicitly set to $12.5 million to reflect both the capital investment and the working capital deployment. So here you can see all of those. I then go into calculating the capital budget metrics. So here is the non-operating and terminal cash flows and then here are the metrics that I was talking about. So this here I'm using the metric calculation function. So the NPV is calculating using the 8.5% whack as a discount rate and IRRa is solved using the custom IRRa functions. So the simple payback period is identified as the first year in which the cumulative undiscounted free cash flow becomes positive. The discounted payback period is calculated using the discounted cash flows and the returns never if the discounted cash flow never turn positive. So the profitability index is calculated as the net present value of the future free cash flows is divided by the absolute value of the initial cash flow. So under the base case the model produces a net present value of approximately $2.69 million and an internal rate of return of approximately 12.84%. So the simple payback return occurs around year six and the discounted payback occurs around year 10. So here we have the base case and so the discounted payback period actually occurs year 9 apologies. So the profitability index is approximately 1.32 meaning the project creates about $1.32 32 of present value for every dollar invested. So these results indicate that under the base assumptions the project is a value creator at the 8.5% cost of capital. I also produce a bar chart of free cash flows from year zero to through year zero from year 0 through year 10. And this visualization clearly shows that a large initial outflow at time zero followed by a moderate positive cash flows during the operating years with a noticeable increase in year 10 from the recovery of the working capital and the after tax terminal value. So this satisfies the technical requirements to visualize the cash flow. Next after implementation I go into the validation stage. So here I'm reflecting the discipline of awareness of being wrong through the different productive self-doubt. So, first I perform a sign check on year zero cash free cash flows to confirm that it's negative and the $12.5 million which verifies that both the initial investment and the working capital outflow are currently captured. Next, I manually verify the terminal value tax calculation by confirming that a $3 million pre-tax terminal value taxed at 25% yields an after tax terminal value of $2.25 million and that this exact amount appears in the model in year 10. Finally, I perform a manual discounted cash flow check for the year two by taking the year 2 free cash flow of $2.7 million and dividing it by 1.855 8.085 squared to confirm that the discounted value matches the NPV calculation is using internally. So this validation checks verify that whack, tax, terminal value and discounting logic are all currently implemented directly satisfying the financial accuracy and require financial accuracy requirements that are in the rubric. So after this I go on to the evolve stage and this is concerned with the future awareness and sensitivity testing. So this assignment requires sensitivity analysis for a 20% reduction in whack in revenue and for whack changes of plus or minus 2%. So I first run the model with revenue reduced by 20% across all years while holding cost and whack constant. And in this downside scenario, the NPV falls to approximately -3.49 million and the internal rate of return drops to approximately 2.41%. And the profitability index falls below one and this means the product project becomes a clear value destroyer if revenues underperform by 20%. I then see and then I go ahead and test the affecting um changes in the discount rate. So here you can see is where I'm looking at all of the whack and then yes going to the discount rate. So when whack is reduced to 6.5% holding all cash flow constant NPV increases to approximately 4.24 to $4 million when whack is increased to 10.5% and NPV NPV fails to approximately falls to approximately $1.35 million but remains positive. Importantly, irr remains unchanged because it is the property of cash flows themselves and these results show that the project is significantly more sensitive to revenue risk than a reasonable changes in the cost of capital. I then consolidate all of these scenarios into a sensitivity table which reports the NPV and the IRR in base case and the revenue downside case in both WAC scenarios. I also create a bar chart. Um, sorry, give me one second. Let me just double check that I'm recording. Perfect. I then go ahead and create a bar chart that visualizes that visually compares both the NPV across all scenarios and the integration of the Python automation, the financial logic and the visualization that demonstrates requiring the integration of finance and technology. And it also shows that the future versions of the model could easily extend um could easily extend and really just show um how the um tornado charge and the Monte Carlo simulations align through the forward thinking spirit of the evolve stage. So here I'm showing you the base case um and here are more tables um and so on and so forth. So finally I move on to the reflect stage and this connects directly to the driver as the six disciplines of awareness essay that the professor shared with us via email. So in the email it framed driver not just as a procedure but six ways of staying awake in our work and in this project the defined trained me to focus on the real decision of value creation instead of just performing calculations. Represent trained me to see the structure of cash flows before reacting to numbers. Implement forced me to go ahead and close the gap between the planning and the doing by building a working Python model. Validate required me to practice productive self-doubt through explicit manual checks and evolve pushed me to think beyond the base case and explore future value states of the world sensitivity analysis. Reflect turns this experience into transferable knowledge by allowing me to reuse the par parameterized notebook structure in future capital budgeting problems. And in this way, the project is not just a one-time analysis, but a part of a longer process of developing analytical awareness. So now concluding by showing you the executive ready recommendations. Financially, the base case roster project passes all the primarity capital budgeting rules. So the net present value of approximately 2.69 million is positive at an 8.5% whack. The internal return rate of return of approximately 12.84% exceeds the hurdle rate. The profitability index of approximately 1.32 indicates a value creation per dollar invested. Payback and discounted payback both occur within the 10-year project life. Strategically, the flag flagship roaster supports the Starbucks premium brand by positioning its experimental um retail strategy by creating a destination style asset that strengthens the customer engagement and the brand storytelling. So the brand benefits extend both the strictly financial metrics and it is captured in the models that we've created today as well. However, the sensitivity analysis, if I can just pull that up, it shows that the project is extremely vulnerable to revenue shortfall. So a 20% revenue decline turns the NPV sharply negative and this pushes IRR far below the cost of capital. So this indicates that the project's risk is concentrated in execution and demand realization rather than in financing assumptions. So there's also meaningful risk of cannibalization from nearby stores which could reduce the true incremental cash flows. So based on all these factors, my final recommendation is to accept a project of critical conditions. So the project should be approved only if Starbucks can demonstrate high confidence in achieving the basease revenue. I can show you the base case again. um the base case revenue profile and can actively manage the cannibalization risk through careful site selection and marketing strategy. So management could should continue to evolve this model as the operating data becomes more available. And this concludes my full driver-based cost of capital analysis. Thank you for watching.",
  "video_url": "https://www.youtube.com/watch?v=PqbEFZKW2E4"
}