{
  "student_name": "Evan Sleeth",
  "org_defined_id": "038072973",
  "username": "esleeth",
  "email": "",
  "transcript": "Um, my name is Evan and I'm using a new device thing called OBS. Um, so I'm hoping that my face is still showing along with my code. So here here is my collab code right here on the side. I hope this works. We're going to give it a shot. Uh in this project, uh I'm testing how efficient the stock market really was during the 2020 2021 GameStop short squeeze. Uh the goal is to see whether GameStop's price movements followed the efficient market hypothesis or they were mainly just driven uh by behavioral trading. The first claim I verified was that GameStop traded at 4 cents in August 2020, which turned out to be false. Um the actual data shows prices around$1 to $2 per share. Um, and my plan is to use the daily price data for GameStop and the S&P 500 for the Yahoo Finance. Uh, I'll estimate GameStop's beta with the um, market calculate um, expected returns using the CAPM model and finding abnormal returns, meaning the extra gains beyond what the theory predicts. Then I'm going to focus on my event window between Ryan Cohen September 2020 investment and January 2021's short squeeze peak. Uh here the code downloads data, calculates daily returns, estimates data or beta and um builds the abnormal and cumulative abnormal return series or the C. Uh these numbers show how GameStop's price deviated from what an efficient market would expect. Uh next, I used a t test on the event window to see if the average abnormal return is statistically different from zero. And the results show that a significant abnormal return, meaning that the semi- strong form of market efficiency was was likely violated and the prices didn't immediately reflect all of the public information. Uh in this chart, the blue line right here shows the cumulative abnormal return skyrocketing right here around late January um 2021 when the Reddit community coordinated buying the pressure in the price and the volume chart also shows a 10-fold jump in the trading activity. clear evidence is extreme and hurting behavior. But overall, the weak form and the semi- strong form of the EM EMH, they both appear violated and uh since trends in public news created profit opportunities, the strong form still kind of holds because the inside the insiders didn't systematically profit. Uh behavioral biases like this are they heard mentality and FOMO. They explained much of the frenzy, but the trading limits and the short selling restrictions. They also made it hard for uh rational investors to correct the mispricing. But um this this project pretty much demonstrates all eight learning goals. I tested the EMH with real data. Uh distinguished its forms and applied behavioral finance to um some anomalies. um evaluated the market uh evidence, analyzed an actual event using the driver driver framework and I integrated the theory with uh some data and communicating the uh finding clearly for the uh professional audience. Um but this is my um this concludes my market efficiency investigation and the analysis shows that uh GameStop surge was not fully efficient but um and it was heavily heavily influenced by behavioral forces. I also recommend if you haven't seen the um the little show in the little movie on Netflix about GameStop stock, it is really really good. Um but here is my um here's my session 8 assignment. Thank you very much.",
  "video_url": "https://www.youtube.com/watch?v=CEvDqVyyAio"
}