{
  "student_name": "Jacob Youngworth",
  "org_defined_id": "035845246",
  "username": "jyoungwo",
  "video_url": "https://youtu.be/9NZEq2m4-mc",
  "transcript": "Hi everybody, my name is Jacob and today we're going to be walking through my session 12 weekly video assignment which covers business valuation. We're going to go through a comprehensive business valuation for Panera Bread. Our goal is simply to determine an inform bid range for a prospective takeover by the financial buyer KKR. We're going to use the driver framework obviously as our analysis framework and as our structure throughout this assignment. Right here is the overview of the assignment pulled straight from um the textbook. We're going to drive straight through. We're going to dive straight into the actual analysis of the problem. Starting with the first stage which is the most important which is to define and to discover. So our primary primary objective for this assignment for this problem is two things. The first thing is to conduct a comprehensive valuation of Panera Bread and then using that formulate a winning bid strategy for KKR by contrasting the discipline of a financial buyer against the potential premium of a strategic buyer. The target company here is Panera Bread, significant player in the fast casual food industry. They boast about $6 billion a year in revenue, $900 million every single year in earnings before in interest, taxes, depreciation, and advertisation, which is about a 15% margin. And they earn they get over $400 million per year in net income across over 2100 stores across the world. And about right now, they already have a mature 50% digital sales mix, which derisks future growth, which we'll get into in just a second. In terms of valuation criteria, kind of how are we going to analyze this problem? How are we going to come up with a final solution? To ensure this, we're going to use three core valuation methodologies. The discounted cash flow analysis, um, which helps with look for intrinsic value, comparable company analysis, um, which helps look at different companies to figure out which one makes the most sense. Then our precedent transaction analysis, our PPA, M&A market valuation based on recent deals. It's going to be based on those specific inputs and as well the given information that we have right here. We have the discount rate which we're going to use the industry average of 9% as our base case hurdle rate which is always important to look at and then the market multipliers the industry average um ped um over e is 22 times we know comparable transactions command expected value of about 12 to 15 times which help to anchor our overall ranges we can see overall with growth data as well which is really important to look at how is Panera going to be growing into the future a base growth rate of 8% annually plan to open about 500 new stores in the next 5 years which is going to ne necessitate significant capex modeling and then digital penetration increasing the digital sales mix from 50% to about 70% which further enhances operating leverage and everything like that and overall how are we going to focus on this we're going to define two strategic perspectives that we're going to use throughout the analysis of this problem the first is our financial buyer which is KKR it's a disciplined valuation based simply on their standalone cash flow performance and optimization as well to achieve a high rate of return, the bid is actually going to align more with the lower to middle range of our valuation synthesis. And then on the other side, we have a strategic buyer, um, McDonald's or Starbucks, for example. Their valuations more based on the standalone performance plus the significant value that's actually created through integration and scaling, allowing them to justify a higher control premium and everything like that. So, let's jump straight into the representation side of things where we're going to look at a few key inputs. We're going to map out our entire analysis of the problem and we're going to look at some key financial formulas. So our flowchart that I built out right here outlines the six stages of the driver framework. We already started and completed define and discover where we looked at the key metrics and the questions for our analysis. Right now we're in the representation side of things. We're going to look at the financial formulas and kind of break down this overall analysis. Then jump straight into Google Collab with our implementation stage. We're going to build out our model and do our basic calculations. Validate. We're going to look at the inputs, look at the outputs, make sure that they match and they make sense. Then we're going to evolve it, look into some sensitivity analysis, compare our results, and then make decisions based on that, and then reflect at the end. We're going to make our all of our recommendations and finish everything off together. Key input for this model is the discounted cash flow, which is the really the gold standard for financial buyers. It requires extensive financial projections. We're going to look at operating projections, the weighted average cost of capital, as well as growth rate, and then trading information as well. Then let's look a little bit more at our financial formulas that we're going to be using. I broke down four that we're going to be talking about. The first one is the free cash flow to firm ratio which represents the cash flow generated by Panera's assets which is actually available to all capital providers both debt and equity. So the free cash flow to firm is equal to the net operating profit after tax plus depreciation and amortization minus the change in net working capital minus your capital expenditures. And that all works together to kind of help figure out how much money is going in and out. How much cash flow is going in and out of the firm helps to determine whether it's a good or a bad investment. And then we move more into discount rate and terminal value. Weighted average cost of capital is the weighted average of our cost of debt as well as our cost of equity which kind of reflects the overall risk of the operations of the firm. We want to get around 9% that's our base target. Um the formula for this is D over V um times um RD which is the cost of debt time 1 - T. 1 - T in this situation is the tax rate plus E over V which is also target equity time R O re which is your cost to equity as well which we're going to use the capital assets pricing model to figure out. The terminal value formula is located right over here which helps to capture the value of Panera the ending of our 5-year forecast. Then the last one down over here is synergy valuation, some strategic buyer valuation. We're going to look at premiums and everything like that and then add everything together to figure out which makes the most sense as an overall investment. So now that we got the first two stages right out of the way, let's jump straight into our Google Collab, jump right into our code, and we're going to jump into the implementation stage. So I wanted my code to be very simple, to be very easy to read. So I broke it down into a few different stages to help with the readability and also the overall simplicity of it. So first I implemented and I it's I built in all of the assumptions that were defined in the first two stages. So what our weighted average cost of capital rates were taxes earnings before in interest taxes depreciation amortization everything like that put it in there and then we built it out using all of the formulas to calculate operating profit revenue growth and all of that. Each of the formulas have their own comments out there to help you just understand it a little bit more. Then we looked at some market-based valuation functions. And then nearing the end of it, we printed everything out in a very easy to read chart to help understand what's going on. So let's talk a little bit about through what we've done. The imple the implementation side and the implementation stage is really our whole um math analysis where we jump right into our Python model. We're going to move a little bit more from theory to some actual assumptions and some math. Our base case confirms our starting point. We use our 9% weighted average cost of capital and project the successful execution of the management growth plan with a 9.5% revenue growth and then a 15% EBITDA margin. The immediate calculations is the most important thing which we're going to look at. That's documenting the 5-year free cash flow streams from Panera Bread. Essentially, we're going to trace the cash flows from revenue down to the final free cash flow to the firm. kind of helping to look at the overall investments and everything right there. Breaks it down in the five years, which we were told to do. Year one revenue starts off at $6.57 billion. You can see actually it grows all the way up to $9.45 billion by year 5. This growth is simply um combined by the base growth rate actually plus the phased ramp up of the 500 new stores that are increasing across the world as well as the increased digital sales penetration. The next one is net operating profit right over here. grows from $493 million or $493 million to over $700 million about $78 million right over here over the same 5-year period. Panera's profitability is increasing, which is overall a great thing for the company. The next one is capital expenditures, which is also important to look at. It's a very important outflow. Um, we're actually modeling maintenance as well as growth. The investment actually starts high at $314 million. um without modeling this investment, the overall free cash flow to the firm is actually going to be a little bit inflated, which misrepresents the actual cost of growth. Then the overall result nearing at the end after funding all growth investments is positive actually throughout all of the five years. It grows from $478 million in year 1 to over $750 million at 754 in year 5. This positive actually increasing cash flow validates our core operating forecast and shows that Panera could be a positive investment for different individuals. Now, we're going to validate. We're going to use a checkpoint. We're going to look at terminal value and everything like that. We calculated and confirmed that the 9% weighted average cost of capital is appropriate. It accounts for Panera's restaurant sector risk. We assumed with a beta of 1.25 and assumes a typical leverage capital structure um D overV about 35%. This represents the total cost of capital that KKR actually has to beat in order to achieve a profitable return. Then the present value of the terminal value is actually $8.41 41 billion represents about 79.8% of the total enterprise value. This 80% contribution is actually very high, but it's actually acceptable as well for a mature business like Panera because they are very stable. They have an aggressive growth model over that 5-year period, but the majority of the value resides in the long-term cash flow that is associated with the company. That 80% figure actually confirms that the model's sound and the weighted average cost of capital and the terminal rate are appropriately sealed and balanced. Now let's jump a little bit more into some cash flows and everything like that for an intrinsic value. Um our model yields an expected value of about 10.54 billion. Um this is derived from Panera's assets as well as Panera's projected cash flows. It's the most conservative valuation and it actually anchors um the maximum bid for the company. Our PPA um range derived from the 12 times to the 15 times multiplies is $10.8 billion to about $13.5 billion which is a pretty big range. reflects the market's willingness to pay a control premium in these past deals. Since this value is slightly below the low end of the range, it actually suggests that KKR has room to raise their bid without actually violating financial discipline. Then the last one is comps um a public median. The median value from comparable public companies is about 14.4 billion. This actual figure is a little bit higher than everything else but it reflects the liquidity and the growth premium placed on the large other companies in this industry like McDonald's, Chipotle, um Starbucks or anything like that. The valuation is actually not achieved very often in a leveraged buyout which actually sets the absolute ceiling based on the public market. Overall, based with all of these different simulations, based on everything overall, the difference actually between KKR's disciplined intrinsic value and overall the strategic ceiling, which is a gap of about $1.25 billion, is important to look at. It's actually a crucial piece within the negotiation. KKR is going to have to bid high enough to win, but also going to have to bid low enough to help maintain that financial discipline and capture that important value that they always seek. Now, we move right into the validation stage. The validation stage is pretty simple. We're just going to make sure that all of our values that we calculated that they make sense and that we can move on into the evolve stage, run some sensitivity analysis with the assumption and the knowledge that our calculations and our values are correct. Starting with technical validation, um we're going to do a terminal value contribution test um to check um the balance of the overall valuation. We find that the present value of the terminal value is $8.41 billion. We calculated that before. The base case enterprise value is $10.54 billion, which means the TV is 79.8% of the overall total valuation. We talked about this just a little bit earlier in the last stage. It's right within that range that we want it to be in. So, it passes the test for this. And then the last one is a financial valuation test. Um, credibility using a little bit of triangulation. Um, it ensures that our intrinsic valuation is credible against external market data that we're going to be pulling in in the next few stages. It's also a critical check um for everything else going on. We're going to start with the DCF base case, our intrinsic value of $10.54 billion. Our PPA transaction floor and ceilings 10.8 and 13.5 billion. And then our comp's median public ceiling at about $14.4 billion. Our discounted cash flow value sits just below the PPA transaction floor of $10.8 billion. Um this is actually a very favorable outcome for the financial buyer. It proves that the internal fundamental valuation is actually very conservative and disciplined. Our intrinsic value is confirmed to be justifiable, which is a great thing. It's a strong and defensible starting point for a bid because you're not overpaying based on the market and transactions within that. Now, with all of that out of the way, with the knowledge that our data and our values are right, let's jump into the evolve stage. We're going to look at some data analysis, run some sensitivity, and run it against different cases throughout the problem. So we're going to pull it all the way down to here. We have success we've successfully done everything before that. So now let's jump straight into the multi- scenario discounted cash flow model. We're going to define the financial versus the strategic range using a base scenario plus a downside and an upside. So this scenario summary which is shown right over here in number one establishes the full spectrum for our financial valuation by modeling three distinct operating futures for Panera. The section here is really the core of our analysis. The first the first row you can see right over here is our downside case. It's our walkaway price. This is our pessimistic view kind of designed to define our financial floor. A models of failed execution where external pressures and internal risks materialize. We stress the model actually as well. Um me and Gemini stress the model by raising the risk and the cost of capital setting the weighted average cost of capital higher at about 10%. We also model margin compression due to labor and commodity inflation. So we drop the EBITDA margin to about 14%. And then we assume the strategic buyer only captures 50% of financial synergies. The resulting financial buyer EV is $ 8.84 billion. This becomes our absolute floor. Any bid below this price is our walkway price. We're not going to take it. The strategic ceiling in this place is $7.99 billion. The base case which we're going to look at as well. Um this is our anchor which we did throughout stage four and stage three. This represents the most likely outcome under management successful execution of everything that they're doing within their goals. The weighted average cost of capital of about 9% and margins maintained at 15% yields that financial buyer EV at $10.73 billion and then the strategic one at 11.98. And then the last one is our upside case. This our maximum potential case. Sorry, the ideal optimistic scenario representing flawless execution and a market that's a little bit more favorable. We have a little bit of competitive advantage built into it by lowering the rated average cost of capital to 8%. We also model superior operational efficiency pushing margins to about 17%. This actually defines the maximum theoretical value um for the financial buyer 17.66 billion and the 19.32 billion in this specific case. Overall, the internal valuation runs from the downside of about 7.5 billion all the way up to almost 15 to 17 billion on the upside. This is really the financial foundation. We use this when we jump a little bit more into sensitivity to help build out our overall analysis. Talking about sensitivity, we executed the weighted average cost of capital versus a terminal growth sensitivity matrix shown in number two right over here. This our deepest risk quantification check which isolates the two most volatile long-term assumptions. Weighted average cost of capital impact is on the left side. It's the vertical one. This analysis confirms that weighted average cost of capital is actually the largest swing factor within the specific situation. Moving the weighted average cost of capital just by 100 points, say from 9 to 10% or from 3 to 5%. Causes the expected value to drop significantly from 10.474 billion to only 9.14 billion. It confirms the dependency on securing favorable financing and de-risking an overall asset. The maximum expected value demonstrated by this matrix is 14.61 billion at 88 8% weighted average cost of capital and a 4% growth. And then lastly, we're going to capture some sensitivity using some synergy. We ran a sensitivity test to help quantify the competitive threat from a strategic buyer. It uses the base case discounted cash flows value and actually models an enterprise value assuming varying levels of synergy capture. At 0% the value is $10.73 billion which is the intrinsic value and the floor of this competitive range. 50% is going to be about 11.36 billion. And then 100% if we're capturing it all that's going to be that ceiling up at 11.98 billion. So overall what did this evolve stage kind of tell us? It helped us to figure out this overall negotiation zone which was driven by the capitalized value of synergies. It's about $1.25 billion from highest to lowest. This is where the deal is either won or lost for KKR. And they have to be strategic within their bid structure to help make sure that they're in this zone to ensure that they get the maximum value out of their bid and their deal, but also are maintaining that strategic value throughout this whole thing. Now, with this all being said, with all the math out of the way, let's jump into our recommendations. Let's jump into the reflect stage. We're going to work through everything and kind of see overall what makes the most sense for Panera and for KKR. Based on our full spectrum of our valuation, we actually recommend an initial bid price that balances competitive necessity with that financial discipline at about 11.2 billion with a walkway price, so that floor of $8.84 billion. This represents a 6.2% premium over our base case financial buyer expected value of about $10.54 billion. but it's intentionally placed within that competitive gap between our intrinsic value and that overall strategic ceiling within the situation. This price is actually very well supported with our analysis with our data. Sits above the transaction floor and sits right below the ceiling for a strategic buyer. Now, we're going to look a little bit between a financial buyer versus a strategic buyer and the perspectives between them. Our bidding strategy is really driven by the reality of a competitive market. We have to pay a control premium to secure the asset against our rivals. We have quantified synergies. We have to quantify the value of our synergies and it can came out to be about $1.25 billion in the base case. That difference is our competitive gap. It's the gap between the expected value and the ceilings. And then also a control premium. We're paying a control premium within this situation um to obtain 100% ownership in the company and the right to implement our full value creation strategy. a right that we really can't monetize by a minority shareholder that we really have to have on our own. Let's look a little bit more into the justification for these reasons as well. Our analysis really identified that weighted average cost of capital and execution risk are the greatest drivers of uncertainty within the situation. Our strategies built to mitigate this overall risk. Our risk driver is our weighted average cost of capital sensitivity. The matrix confirmed that a 100 basic 100 point increase of the weighted average cost of capital causes about a 15% drop in expected value. So financing and execution are very important within the situation. We want to mitigate it. KKR has to secure some favorable debt terms to lock in that 9% assumption or lower which helps to stabilize our overall valuation and the model. And then finally we want to mitigate the risks. The integration of the integration risks associated with the company are actually around middle. While Panera's digital backbone is strong, the store level operations actually requires an overhaul and management is going to need to push a little bit into that. So, we need to immediately deploy our operations partners to help execute the cost savings and the growth to help derisk the asset and be positive into the future. Now, overall really how did we want to do this? We wanted to execute this. We wanted to look at management rollover. We also wanted to look at some integration risk. Overall, what is our conclusion? What does this come out to? The recommended bid that we're going to make is 1.2 billion. It's that optimal balance between financial discipline as well as competitive necessity. It's actually justified financially as well as strategically and it's built upon some stress tested valuation and models and sensitivity that we did. We recommend proceeding with the bid to acquire Panera. It makes sense financially. Panera has had a lot of success in the past and they're projected to have a lot of success going into the future. That's all I have for the session 12 assignment. It was very interesting to look at into business evaluation kind of look at different scenarios and look at if it would be a positive investment. That's all I have. I hope I answered all the questions and yeah, it's been a great semester so far."
}