{
  "student_name": "None None",
  "org_defined_id": "025515744",
  "username": "cruz22",
  "video_url": "",
  "transcript": "0:02\nHi, professor. So, this is my mini\n0:06\nproject\n0:07\nthree.\n0:09\num\n0:11\nfrom your\n0:13\nguidelines on the mini project build,\n0:17\nwhat I wanted to\n0:19\nkind of inspire\n0:21\nand wanted to sort of create was\n0:27\num a financial tool where I can um\n0:32\nuh monitor a set number of stocks\n0:37\nin\n0:39\nin nan and a n and see what all can uh\n0:47\nbe interpreted from the information. So\n0:51\nhere I have my AI builder uh help me\n0:55\nbuild each of these steps to where I'm\n0:59\ngetting stock prices checked every so\n1:02\noften. And in this case, I'm build I'm\n1:05\ngrading the uh intervals every 4 hours.\n1:08\nThe reason I want that is because\n1:10\notherwise I'm going to be getting uh\n1:12\nemails every hour, every minute, and I\n1:15\ndon't want that. I want something that's\n1:16\ngoing to be a little bit more spaced out\n1:17\nwith the market. Something that can give\n1:19\nme an average and then a daily total\n1:23\nuh workflow configuration. So here\n1:27\num I'm getting any sort of stock that's\n1:30\ngoing to be below 300 or right around\n1:32\n300 which\n1:35\num still needs to be debugged because\n1:38\nI'm actually getting uh see here 600\n1:43\nuh 300. So obviously it's not perfect.\n1:48\nSo it still need it does still need some\n1:50\nwork. Uh, I did also see that this was\n1:54\nsuccessful. Professor, if you notice the\n1:56\ntime right now, it's 11:02. Um, I\n1:59\nactually just had my last\n2:02\nHere we go. I just had my last stock\n2:05\nprice update sent to me about 2 minutes\n2:08\nago so that I could double check and\n2:10\nmake sure that it's still here. Now,\n2:13\nhere, uh, it was working before. If\n2:18\nyou'll see in my email.\n2:21\nLet's see here. Yep. See? No.\n2:28\nOkay. So, I'm going to go back\n2:38\nto reflect\n2:42\nstuff\n2:45\nand me.\n3:02\nOkay. So, we're going to let that work.\n3:04\nUm,\n3:06\nworkflow configuration. And that's of\n3:08\ncourse where we have stocks and um a\n3:12\nsort of\n3:14\nuh price threshold, the symbols, the\n3:16\nstock price which we're using Yahoo\n3:19\nFinance, the results. We're going to\n3:21\ncalculate the volatility as well, which\n3:24\nI did like that my first one did uh work\n3:29\noriginally and it was just to kind of\n3:32\naverage the top three stocks in the\n3:34\nmarket as well as their volatility,\n3:36\nwhich can help me in terms of\n3:40\nrecognizing which stock needs to be\n3:42\ninvested or which one I should aim to um\n3:48\nto possibly invest in because obviously\n3:51\nwith volatility becomes higher swings,\n3:53\nhighs and lows. And that is great for\n3:55\nlike a day trader. But obviously, if I\n3:58\nwant something that's going to be\n3:59\nlong-term, I need something that's a\n4:01\nlittle bit more stable or less volatile,\n4:04\nlike 1.75%,\n4:06\n1.3.\n4:08\nUh something like with Amazon where it's\n4:10\n1.3. Those betas are probably going to\n4:13\nbe a little bit less lower.\n4:16\num which is going to be good because\n4:19\nagain I'm looking for something more\n4:22\nlong-term. So\n4:24\nI'm going to go ahead and execute.\n4:28\nWe we're getting our AI investment\n4:31\nadvisor which I did ask for\n4:35\num in the AI\n4:39\nuh\n4:41\nin the AI build.\n4:44\nuh here in my toolbox or my toolbar. I\n4:47\nwanted an AI investment advisor or\n4:49\nsomething wanted that can help me um in\n4:52\nmy email alerts not just send me the\n4:55\nstock prices, but I also wanted it to\n4:58\nsend me uh the best stocks for long-term\n5:01\ngrowth sort of recommendations that will\n5:04\nappear in the email. So, we're going to\n5:05\nsee if that works as well.\n5:07\nThis part does take a little bit longer,\n5:11\nbut I was able to get all my API keys\n5:13\nfrom Open AI. You see, I got my first\n5:16\none uh to start building and then my\n5:18\nsecond one for the AI investor.\n5:26\nWe'll just wait for this to uh finish\n5:29\nloading. And again, professor, with this\n5:33\nworkflow\n5:35\num\n5:37\nfor\n5:38\nmy finance tool, its main purpose again\n5:41\nis just to monitor the uh the stocks.\n5:45\nSo, this could be a tool for somebody\n5:47\nwho wants to be either a day trader,\n5:49\nmaybe they don't want 4hour intervals,\n5:52\nthey want 10-minute intervals, someone\n5:55\nwho can get a quick response to their\n5:57\nemail without sitting in front of the\n5:58\ncomputer all day long. Uh, or maybe five\n6:02\nminute intervals. Uh again, this could\n6:05\nbe for a day trader or this could be\n6:06\nsomebody for like myself who or a\n6:10\nclient, you know, who I would want to\n6:13\nhelp them or they would want to invest\n6:15\nand manage and monitor most of all what\n6:20\nstocks they're going to want\n6:21\nspecifically.\n6:23\nSo, as soon as it is done, this is going\n6:25\nto send me an email alert to my Gmail,\n6:28\nwhich as you can see here, professor,\n6:31\nuh, I've gotten a lot because I've had\n6:34\nto sort of play with it and see, uh,\n6:36\nthat it can it can work, uh, as I'm\n6:39\nbuilding it little by little.\n6:45\nUh, I do also have 20 stocks that I'm\n6:49\nactually monitoring. So if I go down to\n6:53\nthe bottom,\n6:55\nI think this is when I first started.\n7:00\nSo the volatility was not defined.\n7:05\nExcuse me. These are all my stocks that\n7:07\nI have to the left, which so I have like\n7:10\nExon Mobile, Tesla, Meta, which I really\n7:14\ndid like. We got Proctor Gamble. Uh\n7:18\ndefinitely some of the big ones.\n7:19\nProfessor\n7:22\nUm,\n7:24\nsorry. This this uh tool right here does\n7:29\ntake a little bit longer than normal. If\n7:32\nyou could just bear with me please,\n7:33\nwhile it's finishing.\n7:43\nSo, hit save while it's loading.\n7:58\nHere\n8:04\nwe go. So, that worked and I should be\n8:07\ngetting the email alert shortly.\n8:19\nNo.\n8:30\nOkay, looks like it should show me the\n8:34\ncorrect\n8:36\nprice here in a few minutes. So, as you\n8:39\ncan see again for my last one at 11:01\n8:43\njust a couple minutes ago, uh the stock\n8:46\nsymbol was not there. So, it was it was\n8:49\ndeleted.\n9:02\nYes. Okay. Good. All righty. So, that\n9:06\nwas the fun part. The hard part is\n9:09\ngetting the emails. Sometimes it takes\n9:12\nOh, looks like it just went through.\n9:15\nOkay. So, I have, of course, my box up\n9:18\nhere at the top. Three most valuable\n9:20\nstocks. I've got the names, the\n9:22\nvolatility, good, most volatile stocks,\n9:26\nand then of course my AI investment tool\n9:28\nrecommend recommener right here, my\n9:31\nadvisor, so to speak,\n9:33\nuh, tells me that based on the current\n9:35\nstock data here, my recommendations for\n9:37\nlong-term investments, 5 to 10 years,\n9:41\nuh, Google, current price, $320,\n9:45\nhigh volatility, but I did use my\n9:48\nfriendly Gemini\n9:51\nAnd just to remind me, is volatility\n9:53\ngood or bad? Uh it is neither good nor\n9:57\nbad. So it's both higher potential for\n10:00\nlarge sudden losses which can be uh a\n10:05\ndeterrent but it does have the gain or\n10:08\nit does have the potential for higher\n10:10\nlarge rapid gains. So that volatility\n10:14\ndoes have to do with that high risk high\n10:17\nreward. And even though I don't want\n10:19\nthat if I am going for uh maybe 5 to 10\n10:24\nyears I can still look something like\n10:26\nNvidia or Johnson and Johnson\n10:29\nstronghold strong history of stability.\n10:32\nSo uh this again professor is the email\n10:35\nthat I will be receiving based on my\n10:40\nnew AI tool from NAN. So here it is\n10:44professor. Thank you very much."
}