{
  "student_name": "Heidi Chen",
  "org_defined_id": "037430730",
  "username": "chen5063",
  "email": "",
  "transcript": "Hi, I'm Heidi and this is my session nine homework. So to start off or um assign assignment, the define is that the goal is to systematically determine Netflix splendid capital cost which will serve as the hurdle rate for the hypothetical five billion dollars content investment. weighted average cost of capital synthesizes the cost of equity which is determined by the capital um asset pricing model and the after tax cost of depth weighted by their market values. Here's a represent. So first we have to calculate the component cost with the givens such as market risk premium of 5.5% risk-free rate of 4.5% equity beta is 1.3 tax rate is 21% which in this case 0.2 21 pre-tax cost of depth is 5.8%. So in order to calculate for cost of equity we use um risk-free rate plus the equity of beta beta multiplied by um the the market risk premium then we get our cost of equity of 11.65%. The after tax cost of depth is mult is calculated by our pre-tax cost of depth multiplied by the reciprocal of our tax rate which in this case is 1 minus 0.21. So our after tax cost of depth is 4.582%. Second we need to calculate market risk weights which is our current market value weight. So market value of equity is $200 billion and our market value of debt is $13 billion. Our total firm value is the combination of our market value of equity and depth. So our current our total firm value is $213 billion. To in order to calculate for equity weight, we use our U market value of equity divided by our total firm value which in this case is 200 divided by 213 and we get 93.9%. And our depth way is 13 / 213 which is 6.1%. Here is the calculation that asked Google Gemini to provide which um which provides the cost of equity after tax cost of debt or current capital structure weights or current weighted average cost of capital and our new capital structure weights after our $3 billion after issuance. So, and then our weighted average cost of capital after our issuance and here's the value that they provided. So, to validate our um our calculations, we first there's two ways to do that. We can compare it to our peers. So, higher weighted average cost of capital Netflix calculated weighted average cost of capital of 11.22% to 2% is higher than both Disney's which is 8.2% and Amazon Prime Video which is 9.5%. So there's two explanations for that. First is risk profile which is a beta. So Netflix equity beta of 1.3 suggests higher systematic risk compared to a diversified and mature company like Disney. A higher data directly increases the cost of equity which dominates weighted co average cost of capital. Another explan explanation to that is low depth level which is a capital structure. So Netflix has a very low depth weight of 6.1% compared to Disney's 30% depth ratio. Depth is typic typically cheaper than equity primarily due to the tax shield benefit. Disney's higher leverage allows it to utilize the tax shield more effectively resulting in a lower blended weighted average cost of capital. And another way to um validate it is to see the project specific weighted average cost of capital versus firmwide weighted average cost of capital. So a firmwide weighted average cost of capital of 11.22% is appropriate for projects with a similar risk profile to the company's average operations. So or on the other hand size project specific weighted average cost of capital should be used when a project has a different systematic risk which in this case we can divide it into two categories US content and international content. For US content, there might be may there they may have a lower risk profile and potentially a lower project beta because due to established market consistent revenue streams and lower foreign exchange risks. If the risk is lower than the firm average, the discount rate should be adjusted downward. and international for international content. It often involves higher systematic risk due to the foreign exchange volatility, political risk and a less established market. This would likely require an adjusted upward discount rate which leads to higher project beta to reflect the higher risk category. And for evolve uh we have recommendation I I have recommendations on optimal capital structure strategy. So the analysis shows that the increase depth by 3 million from which is from 6.1% to 7% slightly reduces the weighted average cost of capital from 11.22% to 11.16%. This is because depth is cheaper than equity due to the tech shield. And the recommendation to that is Netflix should strategically increase its depth load beyond the $3 billion issuance to move closer to a more optimal capital structure such as Disney's 30% depth target or a level that aligns with the media industry. Rationale is that the current weighted average cost of capital is high. So moving forward the optimal structure will lower weighted average cost of capital which directly increases the net present value MPV of present projects and creates more shareholder value. This balance should be maintained up to the point where the cost of financial distress distress which in this case is the bankruptcy risk outweighs the tax shield benefits. And to reflect, I'm going to talk about hurdle rates and investment and some investment decisions. So for hurdle rates, the current weighted average cost of capital of 11.22% is the minimum return Netflix must earn on a project to satisfy to satisfy its investors simultaneously. And the investment decision is that the hypothetical $5 billion project must yield an expected return which has to be greater than 11.22% or in this case it's a project specific weighted average cost of capital to be acceptable as a projects return sorry as projects returning less than weighted average cost of capital will destroy shareholders value. Thank you.",
  "video_url": "https://youtu.be/EC7i-FWYCIQ"
}