{
  "student_name": "Isabella Corrales",
  "org_defined_id": "037007344",
  "username": "icorrale",
  "email": "",
  "transcript": "Hello, my name is Isabella Corrales and in this video I will be using the driver method to define the capital budget problem that Starbucks is facing with the $12 million roastery project and just will evaluate its discounted cash flows, the net present value, which is the NPV. and the internal rate of return, which is the IRR, and the payback periods, the profitability index. And then after that, do sensitivity testing and then give a recommendation. So to, you know, define all of our, like discover, define the information, we are using all of these project parameters. So the revenue starts at 8 million, oh my goodness, revenue starts at 8 million in year one, then increases to the 11 million in years two to five, and then $9 million from years six to 10. And then the cost of goods sold is the 40% of revenue labor the 2.5 million rent and utilities 800,000 and then marketing is 300,000 in year one and 100,000 in the like afterwards. Sorry about that. And then We have the tax rate being 25% and then terminal value of $3 million at year 10, as well as our working capital is $500,000 at launch, which is year zero, and it would be recovered in year 10. Also, the depreciation for that is just a straight line over these 10 years. So you take the 12 million over or divide by the 10 years and that'll give you $1.2 million for that each year. And so to kind of like represent that, I did the cash flow model. We have our years, you know, listed out here. That's our 500,000 working capital, which is negative. It just shows as parentheses in Excel. So yeah, it's listed 8 million first year, you know, the 11 million from 2 to 5 and 9 million from 6 to 10 and then the 40% These numbers are 40% of these as we list in the information depreciation I told you how I got that with the 12 million divided by 10 and So yes, it, you know, just goes on from there. We have the operating cash flow, the EBIT, we have our taxes, our terminal value that we had there added that year 10 that we discussed and then how we got the 500 back and yeah, so total cash flow here and So that's kind of like representing related information that we just talked about. So to implement some of these numbers, along with taking the fact that it has an 8.5% WACC, we go over to the collab and we can calculate our net present value or NPV and then the IRR, the internal rate of return. So for that, I got $3,022,514. So a positive NPV means, you know, the project creates value because the present value of those future cash flows exceeds the upfront payment. So that is good. And then the IRR being at 13, I don't know why I didn't multiply it by 100, but 13.25%. And you know, this is higher than the 8.5% WACC we just looked at. So the project does clear the required return. But just also to preface, I, for some reason the collab was being like weird. So I don't really know why it's not listed out as it usually is, but it took me like forever to get that. The simple payback period here is 5.28 years, which, you know, like the 0.28 is kind of, you know, if you want to round it to six, if you don't, whatever. But Yeah, this just means that the cumulative cash flows become positive during, like, when it hits 5.28 years, so... like I said, if you want to round it or whatever. And then the discounted payback calculation is 8.21 years. And this reflects how discounting slows down recovery clearly, because that's the 8.21 compared to 5.28, which is nearing three. And to kind of just, I guess, validate these, I actually had to go through the driver loop multiple times because it wasn't reading pieces of information correctly. And also, well, the very first time I forgot to put the 8.5, so it was totally skewed. So it just kind of messed it up after that. So I had to go through that multiple times to get this answer, which also I double checked with other AIs, so. Oh, yeah. And then the I forgot about the profitability index being 1.24. So this just pretty much means that every dollar invested returns about $1.24 in the present value. So. You know, these results do point towards a value creating investment, I would say. But to kind of like involve them because down here as it lists, we need to run sensitivity analysis for the revenue being reduced by 20% and then the WACC being reduced and increased by 2% and summarize that impact. So for that, come back over to the collab. And this, okay, so this is the 20% reduced. So whenever you do that, under that scenario, you can tell that the NPV is in the negatives. Negative, you know, $3,157,292. And the IRR also drops to 3%. Like I said, this should be multiplied by 100 and all these percentages, but that's 3%. So, you know, that kind of shows the projects definitely becomes unprofitable if the revenue slips that significantly, we're in the negatives here. And then to show how it will act if you-- first, we're going to do decrease because I did that. So reduced to 6.5% instead of the 8.5. we see that the NPV goes all the way to $4,636,096. So that is a huge increase and then it stays the same 13%. So to look how it is when you increase it, you can tell that it's, you know, it's still positive, but it is lower, $1,627,268. So, and then, you know, just as the same IRR of the 13%. But this, you know, tells me that this project is much more sensitive to these, just to sales and demand compared to the discount rate shifts, which is the WAC. So to just kind of reflect and recommend, I'd say these numbers, you know, do tell me that there could be some strong financial performance there. There could be some, like it would be a value investment with a, you know, solid buffer above the discount rates. And the sensitivity results highlight that demand risk is the biggest factor as what we just saw and talked about, you know, to watch since the revenue reductions have the greatest effect on value. But yeah, I would say, you know, usually when I go, there is quite a lot of demand. So that kind of might fit with their branding strategy, what, you know, they think could strengthen the customer experience and support like its long term positioning. So yeah, but to go, you know, back up here considering our NPV and the positive NPV and, you know, 13% IRR and just the strategic fit, I would recommend accepting this project because it does look like, I mean, obviously it could create some value. It'd be a value investment. So yes, thank you.",
  "video_url": "https://youtu.be/4B4szecfvrU"
}