{
  "student_name": "Kayla Lee",
  "org_defined_id": "037191790",
  "username": "lee4991",
  "video_url": "https://youtu.be/dHO4c0N3wxk",
  "transcript": "00:06\nThanks\n\n00:10\nHere  we have the total budget. So I made this  model that kind of gives you a variance explainer to someone who wouldn't  already know about it through finance.  And I also  wanted to create an app that a lot of other people could use,  especially people that aren't involved in finance. uh And I kind of created this uh app because  I noticed that there was maybe a lot of issues with people that\n\n00:39\ndid have much experience with finance or in using the background behind it.  And  this was an easy app and model to have a better understanding.  And I was able to take a lot of trial and error. I first used to N-A-N,  but I felt like it just wasn't  cooperating this well.  So I used to replet instead.  And my approach to it was just kind of giving an idea of  here are the numbers, what does this mean,  and  how is this beneficial.\n\n01:09\nWe already blatantly see this is total budget. This is what the actual income was. So unfortunately, the overall variance is  negative 3000 and  that is a 75 % issue. um And then here it gives more of a model behind it and then it can explain. Wait, let me,  oh, okay.\n\n01:29\nSo here it shows that it's like unfavorable. if I did like another thing instead of revenue here, I have other options. Maybe cause of goods sold. What does this mean? want to do Q4 sales. I'll do 60,000. The actual amount will 100,000. A million. What does this mean?\n\n01:48\nThis is my analysis.  this I did different breakdowns. So this is the budget  total actual this overall variance and the unfavorables.  So I keep adding these items.  Maybe it's salaries and wages  marketing operations, technology, rent, travel  and entertainment and professional services.  And all of these show a difference. And so here we could see this is how  it was affecting the revenue. Now we see how it the budget. I the cost of goods sold. These are accumulated together  with the total.  So\n\n02:18\nThis app is extremely useful  in just finding the different variances, seeing what makes sense with  your finances and  how that money uh works  together.  For example, travel.  Again, let's do Q4.\n\n02:40\nseeds negative.\n\n02:42\nYou don't want any of these to really be happening.  But we see how that all accumulates together. So we have three  unfavorable things,  which we don't want. So now  we see it visually,  and now I can explain it. And it's very easy to someone who has no idea  how these finances work. This is great for an owner, a business owner that just like really isn't involved in the finance. More is just passionate about the passion and intention behind like a business.  But they can still make sure that their number of logistics are making sense.  So that was my app."
}