{
  "student_name": "Ray Sumpter",
  "org_defined_id": "032277341",
  "username": "asumpter",
  "email": "",
  "transcript": "Okay, let's see. Now that I can get this Now that I can get this to work, let's go over here and I want to run this from the top. Yep. All right. I want to show you guys a little bit about what we're working with here. Hi there. My name is Alexander Sher and I want to start off with running you guys through a little bit of our test here so you see that the codes work. This is the first time in a little while that I've been able to show my screen and myself. So I'll show here that I showed it to create a task for creating a bond portfolio for mega corpse pension funds analyzing its characteristics and to perform a duration matching stress test for its interest rate shocks and credit spread widening and generating a detailed pension outline. with this. It created code for me that ran through. Obviously, it worked all the way through. I'm not going to sit here and go bit by bit. I will show you where there was a problem down here. It is. So this is where there was a bit of a hiccup and it showed me the error. We detected it. I had an explained error. Came over here. We fixed it at this step right here. We re-evaluated formed a new code. So it either needed a different parenthesis or a new format. And that's where we rephrased it. And then we continued on and then we're going to move forward here. All right. So, moving back on. In bot investing, there's a fundamental trade-off. Obviously you can see my little script here between yield and safety. So generally bonds offer a higher yield u a higher risk while safer bonds offer a lower risk. The dynamic is pretty crucial for funds like Mega Corp which prioritize preserving of capital and consistent incomes with streams meaning longerterm liabilities. The pros to higher yield is there's higher returns with potential to help funds grow and meet assets quicker providing more larger income streams. But the risk is that the credit uh increase and lower rated corporation bonds which offer higher credit spreads to compensate investor investments for this elevated risk for the higher safety. provides a lower credit risk and oh sorry is often considered risk-free in the case of you know treasurers and tends to be more stable. But the con is it offers a lower yield and is more accepting for smaller return for Mega Corp. The This is typically a mix of both. The pension funds portfolio reflects a balance of both approach is a better way to word it. That's what it provides to me. So they offer a treasure the treasur offers aaa related rated foundation safety for liquidity liquidity. Their yields are lower. They are stabilized the they stabilize the portfolio and offer a reliable base for duration matching. They introduce yield enhancement compensation components. Apologies. By including a mix of ratings by mixing a ratings of funds that can capture high yields from the BPP B tripleB rating rated bonds while also maintaining overall investment grade of credit quality. So let's go down here a little bit. Moving forward. So for the portfolio compensation we have eight hypothetical bonds, two treasures which is AAA rated, six investment grade corporate bonds and for that these bonds are very face these bonds vary face value. Coupon rates which are 0.025 to 0.0 06 and maturities of 5 to 30 years. And then I will let you pause for a second so you can see all the numbers for the overall portfolio matrix. I'm not going to sit here and go through every single bit. Along with that, we will also pause for a moment so you can go and look here a little bit deeper at the parallel interest rates. I would go into it a little bit, but as you can tell, I'm a little bit under the weather. It is a positive 100 bps shock, negative 100 bps shock, and a positive 200 bps shock. These results demonstrate the portfolio sensitivity to interest rates movements as expected due to duration. 100 bps increase in rates leads to significant loss while 100 bps increase decrease leads to a comparable gain. These figures calculated the modified duration which estimates a price change approximately 8.45% with the 100 bps rate change credit spread widening corporate bonds only. And I'll let you go ahead and take a look at the numbers there. Apologies. Like I said, I'm a little bit under the weather. Trying to hold back a coffee. Sorry. My script that I'm going off of also has all of my data pulled into it that is pulled from the um brought it all together here to give you guys a summary. Didn't want you guys to have to read a book. I'm just used to my screen not working. Let's skip a little ahead here and show you guys the overall. All right. So, the interest rate risk management for the portfolio duration of Mccully's duration of 8.5 9 year. Yeah. 8.59 years is closely aligned with the hypothetical target liability of 9 years. The stronger ration match is crucial for the p pension fund as it helps immunalize the funds against adverse interest rates movements ensuring the fund's ability to meet long-term obligations. Credit quality when portfolio maintains an investment grade credit portfol profile combining risk free treasures with double A and triple B rated corporation bonds. This balance balances the need for yield enhancement with a conservative approach to credit risk appropriate for a management managing retired assessment. In conclusion, the portfolio effectively addresses the primary concerns of a pension fund, managing interest risk, rate risk through duration matching, maintaining high credit quality and generating a stable income while investing risk remains in consideration for any long-term bond portfolio. The current construction provides a robust robust and suitable foundation for Mega Corp's pension fund to meet its future obligations. And once again, I'll go back up here, give you guys a little look at the same outcomes that we went through just so you guys can see where these numbers were coming from. There they all are. All right. Thank you guys so much for your time. I really appreciate it.",
  "video_url": "https://youtu.be/h6Iv_1ci43s"
}