{
  "student_name": "Tanish Kukreja",
  "org_defined_id": "036513412",
  "username": "tkukrej",
  "email": "",
  "transcript": "Hi. Uh this is my session 8 assignment for management 310. So first we'll go through the assignment and what we need to analyze. We'll be using the driver framework for this assignment. So the assignment is investigate market efficiency using the gametop short squeeze event of 2020 to 2021 as a case study. verify the accuracy of stated facts. Analyze price behavior relative to efficient market hypothesis predictions and evaluate whether market anomalies constitute evidence against market efficiency or can be explained within existing frameworks. So the first step for this assignment will be to verify the statement games traded at 0.04 in August 2020 against actual historical data. If incorrect document the accurate figures and determine appropriate communication approach for the correcting the professor the timeline for the event was in August 2020 GME was near bankruptcy levels September the founder acquired 13% stake in 2021 the due to Reddit there was a price surge to $483 in February 2021 congressal hearings on market manipulation and Present post price stabilization key points we need to take in mind is short interest peaked at 140% of float retail trading volume increased 10fold during squeeze trading resistance restrictions implemented at peak hedge fund uh Melbourne Capital sustained 53% loss acquiring bailout analyst fundamental value estimate was $10 to $40 per share the things we need to analyze is a basically answer after our analysis will be verify all stated historical price data and document corrections. Test which form of market efficiency was violated. Evaluate whether rational investors could have profited estimate systematically. Compare efficient market hypothesis predictions to observed behaviors and assess behavioral finance explanations for observed anomalies. So for this analysis as I just told I'll be using the driver framework over here. First we'll start the define phase. So for this phase we'll be testing the efficient market hypothesis. What the efficient market hypothesis basically is that how public information can affect a stock price or it cannot affect the stock price. So can we analyze the stock price through all the public information that we have? So using the 2020 to 2021 game stock will be defined in this phase. Was the market efficient in reflecting information or did behavioral biases and social media cause inaccuracies? So this is the key question for our analysis and we'll be able to answer this in other future parts. So to answer the this question over here verify historical price data and document corrections. I'll be going to my code and explaining that. So for this what we did was we used Yahoo Finance to verify if the stock was being traded at only 4 cents and the actual data comes out to be $2 to4 per share. We can see this through this code and if I also go to Yahoo Finance and this is the historical data of GameStop. If you go over here and see in 2020, it was basically being closed at like 4 and it started around $1. So it was being basically traded between $2 to $4. So hence that was like incorrect information. Now if you go to a represent stage if the market is a semi- strong efficient GME's price should quickly adjust to all public information like Ryan Cohen's stake announcement. So after the Ryan Coen stake announcement if this was semi- strong efficient market it would have affected the stock price but if you see it did not. So this basically what tells us is that there were other factors involved like social media like people's emotions that we'll cover in our uh reflecting stage but this is basically our represent stage and that is what I checked we used Yahoo finance for finding the historical data we used in Python libraries we all used these Python libraries we were we computed the abnormal returns which is basically the actual minus the expected. So if we go to our code over to the represent stage, we also took the event date to be uh 27th January of 2021. And why we took this uh why we took this event date and analyze the abnormal returns was if we represent stage and if you go to the chart we can see how the abnormal return like peaked at this state and you can see how it reflects with the cumulative abnormal returns. So this is where it peaked the abnormal returns. Now we can go to the implement stage. Okay. So, okay. So, in the implement stage, we took 300 trading days before the event to calculate the abnormal returns as you can see here. And this the date is 21st January 2021. Event date was taken from the represent stage. It added a constant uh based on the market return and it also took a estimation window uh that is the 300 days. It calculated the expected abnormal returns and it also calculated the CR for us which is the cumulative abnormal returns. So if we go here in our stage after the graph we can we it also depected it in the graph as we were able to see the cumulative AR peaked at between 2.5 and 3 and the abnormal returns peaked at 1.25 on the event date. Now if we go to the evolve stage was behavior finance explanation. So behavior finance explanation is when the the when there is people taking a bet on the stock market based on their emotions based on what other people are doing in the market and not just based on the public information. So as we can see retail investors follow trends rather than fundamentals. So they did not use the public stock information. They did not depend on what the company is actually valued at but they used what information was given at Reddit. So this is example of a behavioral finance overconfidence trader believe they could beat institutions. So people were investing on it which lead to a huge crash later because they thought everybody is buying it. So the stock price is going to go up. So this is one of another example of behavioral finance loss aversion. Short sellers refuse to exit losing positions early. So short selling is basically buying a stock selling a stock at a low price and then buying it at a higher price. So that is how short selling work but they did not work in this patient. So this is also another example of behavioral finance social influence. So coordination through Reddit amplify buying pressures. So the main part in this or explaining behavioral finance over here is people did not use public information they saw other people what people were doing they played on their emotions and then invested in GameStop rather than using the fundamentals and using the public stock information that were available to them. Okay. Finally the represent stage. This will basically answer all of the questions that were asked uh for our analysis. Which EM EM match uh firm was violated? So it was semi-strong firm in which people rather than actually seeing the value of the company, they invest on the basis of other factors like uh emotions, what other people are doing, peer pressure. So that is why the semi-strong firm was violated over here. So that is why the abnormal returns were huge in in this case. Could rational investors profit symmetrically systematically? No prices moved irrationally and unpredictably as the prices of the stock didn't move according to public stock information and there were other factors included. So I think the investors wouldn't have made profit in this case. EMH prediction versus reality. the EM project price reflect all public info instantly. In reality, GME's price was dominated by emotion coordination. So, this is the point of behavioral finance that comes over here that the price of GameStop didn't affect based on the public information but there were other factors included. So, that is why the prediction versus the reality there was a huge difference and that is why we saw the abnormal return was really high. behavior explanation hype fear of missing out her mentality led to short-term inefficiency. This is again the point from behavioral finance people were feeling firmer uh it was the hype of the game stock uh GameStop stock and the her mentality that if everybody's buying it I'll also buy the stock. So this is uh the behavioral explanation. Final insert the GE short squeeze doesn't fully reject EM. So it doesn't fully say that the market study. So basically what the final insight comes from uh this analysis is that it always doesn't depend on the market efficiencies or the public stock information. There are other factors just as important as that that might impact the price. So that is why a huge learning that I learned from this whole analysis was always to focus on the fundamentals when investing uh not bringing in your emotions uh while investing in stocks because there are other factors that can temporarily create inefficiencies in real market and affect the stock price. So this was basically my assignment using the driver framework explaining this case and answering all of these questions. Thank you.",
  "video_url": "https://youtu.be/lnoHX0rSRRU"
}