{
  "student_name": "Levi Schrandt",
  "org_defined_id": "036246049",
  "username": "lschrand",
  "email": "",
  "transcript": "Okay. Hello everyone. My name is Levi Shrant and this is assignment session 10 uh for management 310. And for this um assignment, we are analyzing the cost of capital for a hypothetical situation where Starbucks is proposing a flagship roaster that requires a 12 $12 million uh investment and is expected to operate for about 10 years and the firm's weighted average cost of capital is 8.5%. uh and so the requirement is to earn more than that um for this project to be successful. Um so that is the gist of the project and so with to make a decision upon this project we need um four different measurements which I'll get into uh when I start the slideshow. But what this Python script is really doing is it is allowing us to accurately calculate these numbers. So we can get accurate uh products from our equations and can uh make a decision on whether or not this project will be profitable with clarity based off of the um measurements and metrics. So that's really what this whole Python script is doing which uh Gemini assisted in uh helping me uh write. And this is our output. But I'll explain this output more in uh our slideshow. All right. So, should Starbucks invest in their flagship roaster? So, the challenge given to us, as I've already stated, is it puts us in the whole $12 million, and we have an 8.5% WAC WACC hurdle rate to determine value creation potential over the 10-year store horizon, which was projected by Starbucks. So here are some key parameters for the project. Uh so 12 mill $12 million 500,000 in working capital uh 10-year growth horizon with a terminal value of around 3 million and then an 8.5% WACC with a 25% tax rate. So we're going to work through uh this problem and making a decision with the driver framework methodology and that is define and discover as we've already defined some of the variables and what we're wanting to know uh represent uh we'll get into that that's the next step and then we'll implement the code to make the calculations necessary to gain valuable insight into our decision and then validate uh those answers. So, some operational assumptions that were given to us. the revenue trajectory starts at $8 million uh peaks at $11 million and that's when the new factor is still there and then it will stabilize uh around $9 million uh as as its life as the store's lifetime comes to an end. Uh the cost of goods sold is fixed at 40% of the revenue. So the cost of the products we sell will eat up about 40% of our revenue. And we have fixed expenses of 2.5 million and our rent utilities are uh 800,000 and those will remain constant. So for marketing uh those will be higher in year one with the launch as stated. So about 300,000 reducing to about 100,000 afterwards. And then we have uh straight line depreciation of $1.2 million annually for the flagship store. So this is just a recap showing us that in year one store will earn 8 million. Years 2 through 5, 11, and 6 through 10 it'll go back down to nine. All right. Some free cash flow buildup for selected years. So in year 1 we see a revenue of 8 million. Year two, 11 million. Year 10, 9 million. And we based off of the uh percentages of that revenue. I'm sorry, based off of that revenue, we know that cost of goods sold takes uh 40% of that. So, as you can see, that'll deduct 6.8 million and so on and so forth for each of the following years. And then we can add the depreciation in and you can see what the free cash flow is for uh three example years there and kind of track the well-being of the store. And as you can see in year one, you're not making a lot of money, but but as you um continue to earn and um get your feet under yourself after the marketing costs go down, you can see that that that free cash flow number will start to appreciate. So some of those key metrics explained so no one is lost. the WACC at 8 and a half% which is known as the hurdle rate in this problem. You can think of that as the interest rate of the money we are borrowing or also using from our shareholders. So if the project returns less than 8 12% then that is not a worthy use of our shareholders money that they are investing. The IRR is at 17.65%. Uh this is the project's actual return since and since that is much higher than 8 1.5% the project should be a go. Uh the NPV is just the net present value. So what is tomorrow's dollars worth in today? Like today's money. Um so yeah and we can see that from our calculation this project adds nearly 5.5 million to the company's value immediately upon approval. So the net present value as calculated in the Python script was proven to be 5.47 million value created uh just for saying yes to this project. uh the IRR is much greater than the WCC, which is a good thing. And then we see that we won't get out of the $12 million hole that we put ourselves in until our sixth year, which is puts us at a moderate risk since it is since the store is only expected to be around for uh 10ish years. So, and then the um what the PI metric means at 1.44 is it just means every $1 we invest into this we are expected to get $144 out. So really anything above $1 is expect is good efficiency but 1.44 44 is really solid and that would definitely contribute to us saying yes to this project. So here's it broken down a little further. So at the base case, if we just say yes, then that gives us an 5.47 million net present value uh impact. So we'd obviously accept that. But then we look at the negative 20% revenue, the revenue downside of, you know, factoring all our cost of goods sold in and um all of that and that would lead us to reject. But as you can see, uh the project is highly sensitive to volume or revenue, uh but robust against interest rate and fluctuations. So as you can see it with the WACC with those increases and decreases the net present value impact still remains relatively high which would outcome which would outcome in an accept. So some strategic qualitative factors uh some strategic benefits are the brand halo flagship locations you know elevate the interest in the company uh testing grounds for new brewing methods etc. Um but really the main point of this slide is just the key risks. So like the cannibalization could result in you know taking business away from local Starbucks and then the operational complexity just roasting on-site requires you know specialized products and labor and also logistics. But ultimately with this project we're going to want to accept since the financial returns and net present value of 5.5 million combined with the strategic brand value outweigh the revenue sensitivity risks. That was the ultimate um outcome of our decision. And those are just the sites for those images. And that is all. Thank you for listening.",
  "video_url": "https://youtu.be/NrmVrBrm-Sc"
}