{
  "student_name": "Elisah Korinne Liban",
  "org_defined_id": "038014499",
  "username": "eliban",
  "email": "",
  "transcript": "Hi everyone and welcome to another assignment. Um this time we're working on session 8 market efficiency and behavioral finance. So first let me go through the assignment overview. So here we are investigating the market efficiency using um GME or GameStop um short squeeze event of 2020 to 2021 as a case study. So um this analysis will apply the driver framework as always to empirically test the efficiency market hypothesis or the EMH and assess the role of behavioral finance in this historic market an anomaly. Now for stage one we began by defining the core problem and we look over the um assignment overview in order to do this. So, did the GME event violate the efficient market hypothesis? And our research question became, can the GME price movement be explained by rational models or does it require behavioral finance explanations? The critical first step was verifying the stated historical facts. And we discovered a major discrepancy. The claim that GME traded at 0.04 dollars in August 2020 is incorrect. Historical data shows that GME traded in the range of $1.04 to $1.67 with a split adjusted um during that month. This correction was vital for accurate analysis and you were able to identify the need for GME and S&P 500 price data from 2020 to 2021 to conduct a formal event study methodology. Now for our represent stage, we were able to create a visual um for this entire stage two and here we formalized our analytical plan. We chose the event study meth methodology as our primary tool. Um and we plan to test the EMH by calculating um the EMH by calculating abnormal returns or AR. And first what we did is we defined an estimation window. So that is from September 2020 to March 2021. And then we use the cap and market model to estimate GM's normal relationship with the market. And that's alpha and beta. So um that would be 250 training days ending 60 days before event. So that would be about um about that. and also July 2020 to March 2021 as the event window. And for um number three, our step three is we plan to calculate the cumulative and normal returns or car during key periods such as the September 2020 Ryan Cohen news um and the January 2021 squeeze peak to test the EMH forms. But we also have in this stage um all the equations that we're going to use as seen here um in our visual and we also have that violation test uh structured over here before you move into the implement stage. So now um let's go to our Python code. So for our Python code, uh we executed this through the Y Finance or the Yahoo Finance library to download data and run an OS regression over the estimation window that we determined to determine our market model parameters. So if you run this, it'll run in the back end and we run this um Python code as well. Uh it shows that the simulated parameters are as follows, right? And with this our alpha is02608 and our beta is 1.0252. So using these parameters we calculated the daily um AR and car throughout the event and we also created a graph for that. We plotted one and loading this. This is what the graph looks like after all the calculations that we did for the first 10 days of the event window. Um, and this is the result. As you can see here, the empirical evidence is stark. Um, the car for the peak month of January 2021 over here. um this was approximately 1750% and this massive return cannot be explained by GME's systematic risk alone leading directly to our validation phase and for stage four the validate um what we are doing here is we are confirming our findings from the implement stage through statistical scrutiny so the uh 1750% cent car is highly statistically significant leading to the definitive rejection of the null hypothesis um which is that GME's returns were normal. So this validates the violation of two EMH forms um which is first the weak form EMH violation. The extreme price movement was preceded and accompanied by a 10-fold increase in retail trading volume. And this also suggests that momentum traders who tracked volume and short interest um like past trading data could have systematically profited contradicting the weak form. And then for the semi- strong form EMH violation, the market's explosive and highly exaggerated reaction to public information um was delayed and non-fundamental. So that rejects the semi strong form. And with that um our evolve stage includes um applying our findings to broader theory. So we conclude um that the anomaly is best explained by um by behavioral finance. So number one behavioral biases right we saw clear hurting behavior and overconfidence from retail traders which is fueled by social media coordination. Number two there's limits to arbitrage. Um this mispricing persisted because rational investors like for hedge funds were preventing um were prevented from correcting it due to noise trader risk and the extraordinarily high cost of borrowing for shortselling. So this is the mechanism that allows the anomaly to exist and the policy implement implementation is that the event highlighted market microstructure failures especially the dangerous level of short interest exceeding 100% and the need for clearer regulations regarding trading restrictions implemented by brokers during volatility. So with all of this we synthesize our conclusion. Again, GME was a powerful if high-risk reputation of the strict forms of the EMH in the short term and the profits achieved were expost and highly speculative, not systematic or reere risk-free. While the market was irrational, profiting was a gamble basically. And this confirms that while the EMH is flawed in the face of behavioral anomalies, it still provides a robust framework for long-term risk adjusted investment. So to conclude, GME is basically serving as a critical case study um demonstrating the real reality of limits to arbitrage in preventing the instantaneous correction of gross mispricing driven by behavioral f hurting. So that's it for session eight. Um hopefully this was helpful in terms of investigating our case study. Um and that's also what I learned throughout u market efficiency and behavioral finance as we studied this topic. Thank you very much.",
  "video_url": "https://youtu.be/ryS9goLYvQs"
}