{
  "student_name": "None None",
  "org_defined_id": "037237297",
  "username": "ebrumme",
  "video_url": "",
  "transcript": "Hello. Um, and today I'm going to be\nfilming my mini project\num, three. So, essentially, um, what I\nmade for this mini project was this debt\nflow advisor. So, let's go ahead and\ntoday I'm going to be analyzing um, my\nAI\ncreated\num, app by using the driver framework.\nSo essentially my project goal was to um\nessentially use this tool is to analyze\na user's existing loan. So or like a set\nof loans because realistically we're\ngoing to have more than one at one point\nin our life. Um and so this is an easier\nway to keep track of everything on hand.\nSo I'm going to use an AI device um and\nto advise the optimal repayment\nstrategy. So, this is for like an\navalanche, a snowball, or an accelerated\npayment plan. Um, and explain the\nlong-term impact of that choice. So,\nfirst it was to analyze or advise advise\nthe optimal repayment strategy, snowball\nversus avalanche. Explain why. Explain\nwhy the recommended strategy saves the\nuser the most money or gets them out of\ndebt their fastest. Um, just whatever\nessentially their goal is.\nand then the personalized insight. So\nbasically I'm going to be incorporating\num the user's financial responsibility\ninto the recommendation. So what they\nexactly want to do so the first stage\nwas the define and discover stage. The\nproblem is that users have multiple loan\ncredit card student and car loans and\ndon't know the most effective way to pay\nthem down faster and the minimum\nrequired schedule. oftentimes students\nor um will miss a loan payment and then\nthat makes the next one higher or makes\ntheir interest rate go up and we don't\nwant that. So the AI role in this was to\ndecompose a problem into two competing\ngoals the lowest total cost versus the\nfastest psychological wins and then to\nuse a calculated data to recommend a\nspecific strategy. So to represent so\nthis tool represents or provides I guess\na hypothetical repayment uh scenario for\neducational purposes only um and so it's\nbasically saying that this might so the\nAI advice might be a little off but for\nthe most part it is completely correct.\nSo the avalanche method yields the\nlowest total interest paid among the\nthree options. And then the snowball\nmethod yields the fastest payoff time\namong the accelerated methods.\nSo next is the implement stage. So we're\ngoing to go ahead and go on over to our\num Google\nAI studio. Um so essentially this is\nwhat I made. It's called debt flow. We\nhave um all this information here. And\nthen I'm going to go ahead and I'm going\nto add another student loan or something\nin um we already have a credit card, we\nhave a car, and we have a student loan.\nSo I'm going to add one more in here.\nAnd I'm going to say student uh two or\nanother really fun feature was I put\nlike Purdue um\n2020, let's say four. So it be like last\nyear's. And let's say I paid $8,000 last\nyear. my interest rate\num was maybe 3% and my minimum payment\neach month is $25. So I can add it to my\nportfolio.\nAs you can see, it kind of changes some\nthings around. So now we have them all\nright here where we can see Purdue 2024,\ncar loan, student loan, and our credit\ncard. So essentially what it's saying is\nif we want to use the snowball method\nhere, this is when it's going to be able\nto be paid off or the freedom date as\nwe're calling it. Um, and this is for\nthe snowball effect. So basically we're\ngoing to pay the smallest balance first,\nwhich in this scenario is going to be\nour credit card, but the APR is also the\nhighest. So that was good for a good\nquick win. But um the avalanche methods,\nwe're going to do the highest interest\nfirst. So essentially, we're going to be\nusing the um definitely the credit card\nin this scenario because it's 99 19.99%.\nSo we definitely want to get that one\npaid off the uh first. So essentially\nall you have to do here is hit generate\nplan. And what will happen is it's going\nto break down some of our um\num numbers and everything of what we\nshould do and payoff dates. Um and also\nin um the evolve stage which I um\nhad already mentioned um which I will I\nmean mention in a second. um I evolved\nit by adding our credit score in and\nthen that will help um also be able to\nsee how it's going to impact our credit\nscore. So um which is I think really fun\nand I think that's definitely super\nimportant to do. So um because as we\nknow credit scores literally can make or\nbreak whether we can get another car if\nour car stops working or an apartment\nbuilding or just big purchases like\nthat.\nSo essentially our advisor AI\num it's a little hard to see here. I\ndon't know exactly why it changed colorsbut that's okay. So this says, \"As your\nfinancial adviser, let's break down your\ndebt repayment options to get your debtfree efficiently and effectively.\" So\nthe verdict is essentially you're going\nto use both of the snowball and the\navalanche uh methods. That's going to be\na 64 months,\nbut the avalanche method saves you the\nmost money. So it depends on what the\nuser exactly wants. So um basically the\navalanche method saves you the most\nmoney in total interest. So, it would be\n$4,925.14,\nwhich is $153.32\nless than the snowball method. So, it\ndepends on what the um client is really\nlooking for. Um, and again, essentially,\nas you can see, it just gives us a\nreally great breakdown. Um, and it's\nsaying like right now the Purdue loan is\ngoing to be the one that we're going to\nhold off because it does have the um\nlowest.\nUm, so yeah, so we're going to finally\npay the 20 24 loan until all our debts\nare clear. So basically, we're going to\ndo the most expensive debt first so then\nit doesn't continue to accumulate and\nkeep racking up more debt. And we're\ngoing to stop at the highest interest\nrates charges from compounding which\nwill save us most money overall.\nSo that was the whole assignment which\nwas really fun to do. And then let's go\nahead and let's go back.\nSo that was that and then validate. So\nall my information is validated at the\nbottom um of the run simulation. So as I\njust showed you and then to evolve as I\nwas just talking about I evolved this\nproject by adding a credit score\nindicator. I thought this was super\nhelpful so users know that like as they\npay back their loan the effect on their\ncredit score because as we know um\nusually if we have more debt the credit\nscores are going to drop versus when um\nwe don't have that situation if we pay\nit back our um and have less debt our\ncredit scores higher. So to reflect on\nthe assignment or the R stage of the\ndriver framework, the final one, um I\njust like to say overall I really\nenjoyed doing this many projects. I'm\nalways surprised by how easy it is to\ncreate such a useful financial tool. I\nuse this loan calculator because I\nthought that it'd be useful for myself\nand my other classmates. And honestly,\nin the future, I plan to continue to use\nit because I think it's just so helpful.\nAnd um I just love how simple it was to\ncreate. So I just wanted to say thank\nyou for listening and I hope you have agreat rest of your day."
}