{
  "student_name": "None None",
  "org_defined_id": "037454602",
  "username": "thorpe11",
  "video_url": "",
  "transcript": "This is Michael Thorp and this is my mini project three submission. And so my project was a retirement planner. Um, and I used uh Google AI Studio uh to make this. Um, after a long um pretty much discussion with Jim and I, I was able to define and um pretty much break down everything that I would need to input into Google AI. So that would uh produce something such as this for me. I had to input multiple prompts and customize it um so that I could get graphs and be able to input numbers and get this AI output. So, what this does is it asks for your current age, uh the age that you want to retire at, how much is currently in your savings, and your estimated yearly income. And then it asks for your retirement goal or how much money you want to have um at that age of retirement. And then it will give you three um possible options for um saving and it will tell you which one is the best and it will give you advice. So when I asked my brother um coming out of college, he would be 22. Um he wants to retire at 50, wants to retire early. He said he has around $7,000 in savings and um he said he wants to make $150,000 and he said his retirement goal is an ambitious $5 million. So if I click the analyze my plan,\nit will generate this bar graph which shows three options. Uh the blue one is the base, the green one is the optimistic and the gray one is uh conservative. And it gives you a strategy analysis which is AI generated. It says, \"Your retirement goal of $5 million by age 50 is quite ambitious. Based on your current details, achieving this goal will require a significant commitment to saving, ranging from a substantial portion of your income to an extremely challenging amount depending on market performance. And so here are those uh three options that it shows up here as well. And so the conservative route would be if you um invest $8,000 around $8,000, which would be about 65% of your income uh per month. And so to reach the $5 million goal by age 50, it tells us right down here with a conservative 4% annual return, which I think that is pretty low if you compare it to the um S&P 500. If you were to invest in that, uh I think this is more of just like if you had a savings account at a bank, uh you would be needing to put in $8,000 a month. And it says it explains it. It says this level of savings is not likely affordable for most people as it leaves very little for living expenses. And that assumes a return rate of 4%. And then we have a um second one, the base, which is about 45 46% of the monthly income. And it says under a base 6% annual return scenario, we would need to save $5.7,000 per month, which is 46% of the income. And while it's more feasible than the conservative path, it still requires significant financial discipline and strict budgeting to achieve, which is an assumed return of 6%. And finally, it gives you um a more optimistic one, which requires $4,000 of monthly savings for 32% of the income per month. Uh and this is if the market performs optimistically at 8% annually. Um, and this is a more manageable percentage and aligns with typical savings recommendations, but it relies heavily on consistent strong market performance performance which carries higher risk. Um, and then it gives you a recommendation on the path forward. It says given the high savings rates required, especially in the more conservative scenarios, you should seriously consider adjusting either your retirement goal, age, or actively seeking ways to significantly increase your income. Relying solely on optimistic market returns carry substantial risk to our plan. A balanced approach would involve a combination of increasing income and potentially re-evaluating your target to make the new plan more realistic and less stressful. Um so this is basically telling my brother that he should find uh another source of income or um maybe ask for a raise in his job. Um, and it's also telling him that he should probably uh expect to work a little longer than past age 50. And his retirement goal, $5 million, maybe a little too high. So, he can lower that by probably a couple $10,000, maybe a couple hundred,000. And he would be looking at um a more realistic uh goal to hit. So, yeah, that is my project."
}