{
  "student_name": "Jarrett Evans",
  "org_defined_id": "037163659",
  "username": "evans596",
  "email": "",
  "transcript": "Alright, hello and welcome in this video. You We're gonna walk through a real world case of, in corporate finance, of weighted average cost of capital for Netflix. So, this analysis is in connection with, like, a major hypothetical. $5 billion content investment decision. So, goal isn't just to calculate a number. It's to kind of understand the story, the data is telling us about Netflix, uh, their, their writ, their risk. And it's financing strategy, and it's competitive position as well. So, we're looking at fr- first, you know, what is Netflix's true current hurdle rate for investments? So, another question. We'll one. How would a $3 billion debt issuance to fund this investment impact that rate? and And then third, how does Netflix's cost of capital compare to a key industry peer? here. Disney. Uh, so let's get the data, and then kind of build our model from there. So, this is, uh, kind of where we go into our blueprint, and our analysis will be built on, two kind of core scenarios, a current state, and a pro forma state after the new debt. Yeah. This requires a specific sequence of calculations. C.I.P.M. for the cost of equity, um, after tax. Thanks for watching. So, for the second scenario, we must- kind of mathematically, uh, un-lever and re-lever beta, uh, to accurately model the new financial risk. So, with that point- in, we kind of look at our implementation stage of, uh, looking at the scripts and it's kind of a straight three. forward functional script designed for kind of this clear and repeatable analysis. Um, so you'll cut. . . You to see our calculation engine, like the function of calculate cost of equity, calculate after tax cost. So. And so on and so forth. So. After those three, we're gonna look at the most critical function. ? These are the engines that kind of allow us to. Do dynamically model how changes in the capital structure will affect equity risk. Let's go to the And then finally, the main part of the script executes, um, our two scenarios. It ingests our I hope you enjoyed the video, uh, parameters, um, and systematically kind of runs the calculations for scenario one. So the current, uh, W-A-C-C and scenario two. Post-debt, W-A-C-C. It's designed to output a clean, simple summary of all key metrics, which is kind of what we'll use for our interpretation. So, Let's kind of run the script and get into our output. So. We'll look at. Good. The output. And first we see the current WACC is .1122 or 11.22%. This is our baseline. So Yeah, it's the, this is the rate a new average risk Netflix project must beat. We'll see how we We'll a look to create value. That's our baseline. Next we look at the post debt scenario. The new W-A-C-C. These .1, 1, 2, 0, or 11.20%. So a super beneficial analysis. office. Or, or superficial, excuse me, analysis would stop here and, and say the 3 million and. and dead was almost no fact, but this kind of misses the, the real story. This kind of brings us to, like, the conf- reflecting signal part, and let's kind of look at our signals, or our components rather. So the equity beta. Cheetah. Actually increased from 1.3 to 1.315. 3-1-5. When you, you kind of round it to the 1.315 here. And this is logical by adding more depth. We made the stock riskier for equity holders. So, their required return or cost of equity rose from 11.65. Thanks for having me. To 11.73%. So, if our equity got more expensive, why did- the total WACC go down? The answer is that the tax- is the tax shield and the capital mix. We'll be back. We'll have so we replaced a small slice of expensive 11.73% and, equity financing with a much larger slice of cheap 4.5, uhm, 4.58. a 8% after tax debt. And the benefit of this cheap debt, even in small amounts. . . outweigh the new hire cost of the equity. This is the classic WACC trade-off, um, kind of in work in action. But, overall, the most powerful validation comes from the peer comparison. So. Our calculated WACCO 11.22% is significantly higher than the industry range of 8 to 10%. and Disney's is 8.2%. This isn't a calculation error. It's the central insight. side. 7 Which kind of tells us one of two things. The business risk and financing strategy. So first the business risk. So, Netflix is a high growth, high beta 1.3 specifically. Pure play streaming company. I'm putting company. And Disney is a diversified, lower beta media conglomerate. Investors demand a higher term. From Netflix for a tire systematic risk. And for the financing strategy. Netflix is only 6.1% debt. but it's been the I was disney is 30% debt. Disney is aggressively using low cost debt to lower its WAC. And Netflix is almost entirely financed by expense of equity. Our analysis at this point- is validated. The high WACC is a direct and logical result of Netflix's high-risk business model, and it's conservative equity conservative equity. That kind of brings us to our final verdict, where we look at our 11- 11. 1.2% WACC is the firm wide average here. And, but. But, Is this, but is all kind of content, umm, average risk. No. Using the simple- Simple, right? For all five billion dollars of content would be a major mistake. A new season of a hit US show is, a low risk predictable project. It should probably be discounted at a lower rate. Hahaha. Excuse me. A new high-cost expansion into, like, a politically on the- stable if you, if you would, uhm, international market has a much larger risk. So our model kind of- Okay. Kind of must evolve to use some project specific hurdle rates. It's. Using the 11.2% WACC for the high risk, international project would make it look. We'll be right Artificially profitable leading to a value destroying investment. So, Finally, on the financing, the $3 billion debt issuance is a clear, ,value-creating move. The analysis is unambiguous. Netflix is underlevered compared to its peers. years. It has a significant opportunity to optimize its capital structure. here. By adding more low cost debt, which would further lower its WACC and increase overall in turn. turn. firm value. On investment, management must abandon a single hurdle rate. With we're gonna Yes, thank Thank you. Bye. policy. The 11.2% WACC should only be a benchmark for average risk. Rejections. So, a divisional or. 7 project specific WACC is required for intelligent capital building. And lastly, the verdict. The final financing strategy is sound, but the investment policy must evolve to account for project specific risk. Yes, yes, so, to kind of recap the kind of overall numbers. members. show that we had a new, a nuanced view of Netflix's financial strategy and kind of identified a. day. high hurdle rate, but more importantly, diagnosed Y, kind of a function of being both high business rate. Umm, and a conservative capital structure. We uncovered kind of a clear optimization, uh, uh, opportunity, which. It's been a good time add more debt, and identified a critical policy gap, which is a divisional WACC. This is a kind of a perfect example of how, like, a systematic approach helps you look past the headlines and leads to more are intelligent. Like, data-driven and defensible corporate finance decisions. So, after everything, we have- seen how Netflix's numbers, and also comparing to Disney's, uhm, has affected them as a company. Ready? And where they should go moving forward. So, thank you for joining us, and we'll see you next time.",
  "video_url": "https://youtu.be/O-Z6I2YaL8E"
}