{
  "student_name": "Colleen McCarthy",
  "org_defined_id": "034532957",
  "username": "mccar169",
  "email": "",
  "transcript": "My name is Colleen McCarthy and this is my session 9 assignment the cost capital analysis. So starting off with the find and discover. Let's talk about what we're given the contract. Netflix is considering a major strategic move. It's a $5 billion investment in current content fund this. They are considering issuing three $3 billion in new debt. Our role is to act as a financial analysis to determine the hurdle rate the WACCC to see if this investment is viable and how the new debt changes the company's risk profile. So what do we do then? We separate the signal from the noise. So here are the inputs that we'll be using for those formulas. So for market data we'll be using these three bullet points. Netflix equity data will be these three numbers. The Netflix debt data we'll be using these three here that we are given. influence strategic benchmark we have Disney at 8.2, Amazon at 9.5 and an industry ranges from 8 to 10. So there are five financial objectives. Number one, establish the baseline to calculate the current cost of equity using the CAPM and the current WACC using the existing capital structure. Number two, analyze the change. Calculate the new WACC with 33 billion and new data is added. Number four, visual sensitivity. We will create a visual visualization like a graph showing how WACCC moves as leverage increases. That's number three. Number four, comparative analysis. So compare the calculated Netflix WACC against Disney's 8.2 and Amazon's 9.5 and explain why they differ. And lastly, first recommendation will be answering the question. Should they use firmwide WACCC for all content or for specific rights for US versus international content? Okay, let's do a quick concept check just to ensure that financial concepts are accurate. So we'll def be we must define the tools that we are using. So for the CAPM we're calculating the return shareholders demand for the risk of holding Netflix stock using this formula here after tax cost of debt. We must account for the tax yields. The government effectively subsidized debt because interest is tax deductible. So this is our after tax formula here. Finally, WACC formula, the weighted average of the two components above can find right here where V= D. Moving on to the represent stage. The goal of this stage is to solve for the three essential inputs needed for the WACC formula just mentioned the cost of equity after tax cost of debt and the capital structure weights. Number one, we calculate the return required by Netflix shareholders using this formula and these input values in the calculation. And the result we got was 11.65%. So this is the minimum return that Netflix must earn on its equity funded projects to satisfy investors. Number two, we number two after tax cost of debt will be they calculate the effective cost of debt after accounting for the tax field effect. These formula and these input values and running it be after tax of 4.5 4.582%. So this means that the debt is significantly cheaper than equity due to the tax deductible of interest. Lastly, for the current capital structure rates, we determine the weights based on the market value of debt and equity using the total value equation which ends up giving us 2.13 billion and then put finding the equity weight at 93.9% and then the debt weight at 6.10%. So Netflix has a highly conservative which is low leverage capital structure. Moving to our implement stage. So in this phase we'll be using outputs from the R stage to to calculate Netflix weighted average cost of capital. This CC serves as a crucial hurdle rate. The minimum return the company must earn on its average risk projects as high has all its investors both equity holders. help are objective calculate the currently ACC established the baseline hurdle rate using the existing capital structure and then calculate the new WACC leverage determined the WACC after the proposed billing debt insurance and this allows us to assess the financial impact of the content investedment gosh financial impact of the content investment finance sheet financing decision. So this is a core formula we will implementing and using Python as our co-pilot to ensure accurate and datadriven results. Here's our code given to us by Gemini. Thank you so much for the help run that. And now let's interpret these results. So this yields the following. Number one, the baseline current ACC. So rounding up from 11.22, we have 11.23. So Netflix current cost cuff capital is higher than both the media industry WACCC range which is from 8 to 10 and the key competitor of Disney was at 8.2. This is primarily due to the high equity dependent capital structure which is a 93.9% equity as equity is significantly more expensive than tax shielding debt. So what does this mean for the hurdle rate? With $5 billion content investment to be value creative, it must generate an expected return of greater than 11.23 to satisfy the company's investor investors. So another thing to notice is WACC after their billion debt insurance the new WACCC's 11.08. So change in leverage the debt increase and um to anal an analyze this issuing the $3 billion in new debt reduces the WACC down and this confirms that Netflix's financing decision leverages the tax shield benefit of debt to lower its overall cost of capital is a more appropriate hurdle rate for the $5 million investment assuming that investment is financed with this debt. So these results clearly demonstrate the trade-off in corporate timing. So by meaning a low debt structure, Netflix has low financial risk but a high cost capital at 11.23%. Also the adding adding debt increases financial risk significantly but it lowers the overall WACC making more potential projects like the $5 billion content spend appear profitable. The numerical foundation sets the stage for the final strategic comparisons and recommendations required in the next stage of the analysis. So it's a validate stage. This confirms the accuracy of our calculations and translates the numerical outputs into concrete financial insights which will help use which will help to be used in the final evaluation rule. All calculations from the RNI stages run smoothly in the code and the math and they are ma it is mathematically sound. The cost of equity is correctly calculated represents the high cost source of capital. If your cost after tax cost is also strictly calculated along with the current WACCC we detect this WCC must fall between the what we first cost of equity and the after tax and since Netflix is 93.9% equity the WACC must be way closer to cost of equity which is verified second look at the double the new WACC so adding the three in debt Check this. I suggest to check this. Adding cheaper debt must lower that ACC which is correct and the change in debt weight also correctly drove the small reduction. Strategic financial validation. So the results validate several core financial concepts have the final recommendations. So WACC is a hurdle rate. $5 million investment must yield a return greater than 11.08 08 and must to be profitable for the firm assuming it is funded by the new debt. Looking at the tax shield effect the 15% reduction WACC confirms the value of the tax shield demonstrates that adding debt immediately lowers the overall cost of capital. And lastly, capital structure comparison. So Netflix's current high WACC is validated when compared to competitors like Disney's and also the difference is validated by the leverage gap. So Netflix only uses 6.10% debt while Disney uses 30. So this confirms that Netflix's current cost of capital is high due to its conservative lowrisisk low revenue structure. Number three conclusion for the next stage. So calculations are sound and time. Oh we move on three ways that we're three main topics to discuss here. Number one, so there's been flexified versus firmwide dis discount rates. Going to try to kind of skim through this calculating WCC should serve as an initial firmwide discount rate for the average Netflix project, including the proposed $5 billion content investment. However, for true capital budgeting accuracy, Netflix should implement project specific hurdle risk. For instance, in instance, international content often carries higher political, regulatory, and currency risk. US content and a higher discount rate if applied to international products to avoid the subsidition problem where high-risisk products appear acceptable because they're discounted at a lower firmwide average rate ultimately taking away all the value. The compar comparison appears in the WHC explanation. So Netflix WACCC is significantly higher than median than Disney. This is because which was explained earlier it lies in the capital structure because Disney's leverage it leverages the cheap tax shield benefit of debt by financing 30% while um Netflix still remain highly equity reliant and since equities are more expensive than tax yields overall the receiving remains elevated which was we just touched on that in the other stage recommendation optimal capital structure strategy that Netflix adopt a target capital structure strategy that incorporates more lowc cost debt to move its WAC closer to the industry range or the current debt issues insurance. I don't even know. The recommendation to is to proceed with the $13 million debt insurance to lower the hurdle rate for the $5 million content investment while simultaneously setting a long-term goal to increase that leverage strategically to optimize the WCC. Okay, to wrap it all up in the reflect stage, the completion of the standard was guided by driver framework of course as the big projects are. This is just allows us to move from raw financial data to robust strategic financing decision and method method I actually can't tell right now just executing through the stages. So starting with D starting with defining and discover then refining and representing what we're going to do and then using the implement stage to introduce our plan of attack for the code and then to go through and figure out what interpret the results. The process demonstrated that finance is fundamental is fundamentally about risking price. So 11.3% baseline WACCC confirmed that Netflix's low leverage strategy comes with a high cost of capital making value creation harder for harder than from competitors like Disney. So the core lesson learned here is the practical impact of the tax should affect the necessity of using WACC as a project hurdle rate. Our final findings, the $3 billion debt assurance reduces the hurdle rates from 11.3 to 11.08 was validated to debt in the cheapest source of capital for Netflix. Overall, the analysis reveals that Netflix's conservative capital structure places it above the industry WACC range. The recommendation to proceed with a debt and consider product specified discounts rates for high risk ventures ensures that the future investing decisions will be not will be made not just with accuracy but with optimal long term value creation in mind. Thank you. And for the AI as mentioned earlier I used it to help me make the code implement the numbers and uh infirm my formulas and make sure I was this all over on the right track. Thank you.",
  "video_url": "https://youtu.be/mM5ij65OIho"
}