{
  "student_name": "None None",
  "org_defined_id": "034214748",
  "username": "mbaratia",
  "video_url": "",
  "transcript": "Hello, my name is Matthew Ber and this is my uh mini project 3. In this I'm creating a personalized investment strategy co-pilot in which it will in which it takes uh inputs such as age, country, the invest the original investment amount, my time horizon, years of how long I want this investment plan to be as well as my goal which in this case it would be saving for a down payment on a house as well as a risk comfort text which basically just explains to the model uh what am I comfortable with. In my case, I said I'm comfortable having a few ups and downs uh in the investment returns, but all in all, I would just like it to at least outperform a savings account and I put my experience because I'm 21. I don't a lot of experience in investing. Um I'm going to be at the beginner level. And obviously, you see in the output, you just have this put out in a table here to make it a little easier to look at. So it would take this run it through the basic LM chain in which uh we have the message here to basically inform the model of what we need to actually do and what is required of the model with the information that we provided the previous node. And on the right here it's the same thing but just put out in a text form. Now it goes to the HTTP request with market assumptions where it would take certain assumptions from from you know external sources and apply it to our model. Um so when it's all said and done it runs through the building of scenarios node where it creates three different scenarios being a conservative balance and an aggressive approach. Um and that all determines based on the stock and bond allocation and the breakup of it. So you can see it's.3 for stock allocation 7 for bond allocation for conservative 0.5 and then point uh 6 and then 04 and finally for aggressive 0.9 for stock allocation 0.1 for bond allocation. So after that we can run it through the explain scenario explainer LMM uh node in which it would explain the different reasonings for each different uh scenario. Um and also will give us the highest potential turns over time the pros the cons and uh why we should do each and also how much you potentially look at returning um based on that. And so we run all that through we get our validation format output in which everything I just had mentioned previously uh gets put through here and summarized in a neat clean way that we can look at this uh in a in a effective way. So here this is our summary for our human which is me which would basically just be everything I mentioned previously that I put into the model and gave it its you know context and scenario to then go ahead and run its calculations. Like I said earlier, we have different things for conservative uh balance and an aggressive approach based on our stock and bond allocation. And also here we have our pros and cons listed. So such as lower risk of losing money. However, with the con of a conservative approach is that it may not keep up with potential and as well with our our balance. It would be good because a good mix of growth stability. However, there's not returns actually guaranteed on that. Um and move on to aggressive. You can see a pro of that would be we do have a high potential for returns over time. The highest out of all three options. However, there's a high volatility as risk uh losing money is pretty high due to the fact that it can swing a lot with market fluctuations. Um and down here we can look at the expected base return percentage of 4.1, 5.1, and 7.1 based on the different uh levels of aggressiveness that we're willing to take on. Now, at the end of it, it'll output a recommended scenario for us. So in this case it's recommending balance and it gives us a reason why being that we are young with eight years of experience to or eight years to invest and having a balanced risk profile it's option is a good mix of growth and volatility or stability and it suits my goal of saving for a house down payment by balancing the chance to grow your money without taking on too much risk and potentially losing that money in the long term. uh but also provides a little bit of warnings and limitations is that it's not technically fin like sound financial advice and returns are not guaranteed and also you should consider taking on a human adviser for these larger decisions. So and all in all on the right here we have a format text which is basically everything I just said but put in more of a text form. Uh to summarize this project um I think I would honestly use this thing to help me with uh determining my financial decisions. However, like you know the model said, I probably would take a second opinion being someone in human form uh who's has more experience with this and is not uh going based just off of uh numbers alone. Um ethical considerations of this um I really don't think there are too many because it's just dealing with numbers and hypothetical scenarios and you're not pulling any personal data of anybody. So in that case I think it'd be fine. Um, I did experience some challenges with figuring how to get the AT HTTP request uh market assumptions to work. Um, it took me a little bit of time to figure that out. Um, as I'm just not really familiar with using NA, uh, N8N uh, model uh, builder, but after a little bit of a steep learning, a little bit of learning curve, I ended up figuring it out and ended up being pretty sound project."
}