{
  "student_name": "Abbey Carroll",
  "org_defined_id": "035875419",
  "username": "carro146",
  "video_url": "https://youtu.be/vBTaRa15kn0",
  "transcript": "So for this project, I built an AI powered financial results explainer using NADN and an open AI language model. So the problem I'm solving is that financial results are often hard to interpret for non- finance audiences. People can see revenue and expense numbers, but they don't always understand what changed, why it matters, or what questions they should ask next. This tool turns basic financial inputs into a clear, plain English explanation that someone could actually use. So, here's the full workflow. It's intentionally simple, so it's reliable. Um, it starts with a manual trigger, so I can run it live, and then an edit fields node where the user inputs financial data, and then an HTTP request node that sends those inputs into an open AI model. The AI analyzes the numbers and returns an explanation in real time. So this edit fields node acts as a user input. So here I enter the company name, current and prior revenue and current prior expenses. And then during a real case, these could come from a form or a financial system. But for this demo, I can change them directly. So this is what makes the tool interactive. So changing the inputs changes the outputs immediately.\n\nSo next, this node is where the AI integration happens. So I'm calling open AIS chat completions API and sending a structured prompt. So the prompt tells me that the model tells the model to act like a financial analyst and explains exactly what I want it to do. So I identify what changed, explain why it mattered, flag risks, ask a smart follow-up question, and calculate percentage changes. So the key thing here is that nothing is hardcoded. The AI reasoning is driven entirely by financial outputs. So this is what all of it shows this output.\n\nUm,\n\nso now I'll run the workflow and let's see. I think yeah. Um, so the AI processes the inputs and returns a plain English financial explanation. So you can see how the how it explains revenue and expense changes, includes percentage changes, highlights concerns, and suggests a follow-up question a manager should ask.\n\nSo to show that this is interactive, I'll change one input. For example, lowering revenue\n\nand then I can run that again.\nSo the explanation updates immediately and this makes it useful for quick analysis or management discussions without writing a full report. So who is this for and why would they use it? So this tool would be useful for students, interns, founders or non- finance managers who need to understand financial performance quickly without deep accounting knowledge. So what I learned from building this is that making AI useful isn't about complexity. It's about clean inputs, clear prompts, and making sure the system actually works. The hardest part was definitely structuring the API request correctly. But once that was solved, the value of the tool became very clear. So, if I were to expand this, I'd connect it to a live financial data or export the explanation into a a board ready summary or dashboard. Um, and yeah, that is my presentation of my workflow. Thank you for watching."
}