{
  "student_name": "Isaac Buche",
  "org_defined_id": "036112318",
  "username": "buchei",
  "video_url": "https://youtu.be/L2UeIoORUUw",
  "transcript": "Hello, this is Isaac Buche and this is my session 12 assignment for management 310. So jumping into the assignment overview here. Um we're going to deliver a full valuation of Panera Bread for perspective KKR takeover using the driver method. So we're going to combine DCF trading comps and precedent transaction to produce an informed bid range while contrasting financial buyer discipline with strategic buyer synergies. So jumping into like a little bit of defined strategy here. Um the scale it's going to be $6 billion revenue growing at 8% a 900 million EITa at a 15% margin with a $400 million net income across 2100 stores and our digital sales are already at around 50%. Some market references we have here is um industry PE of 22 times. The president of the EBITDA multiply multiples of 12 to 15X. Chipotle trades at 35x and McDonald's at 25x. Capital assumptions the industry uh WCC is around 9%. Um management wants to 10% rollover. Strategic biders such as Starbucks and McDonald's basically um are circling. Growth lovers we have 500 new stores in in five years. Um digital mix is 70%. dinner/catering expansion possibly um early stage international rollout things like that. So create we're going to create an executive ready recommendation that states your our valuation range our winning bid strategy and rationale for choosing financial and strategic positioning. So moving into our represents phase um we're going to build a Python to Python code to um to create our logic that we're going to build here. So, we're going to calculate the unlevered free cash flow for 5 years. So, jumping into what Jim and I put here together for me. This is going to be our represent portion of this. So, we're going to define um our calculator unlevered free cash flow like I said our UFC for 5 years. So, we're going to do that using this formula that it shows and our assumption will be approxy to that times 1 minus t using net income adjusted for the interest. Um, so this is going to give us our sensitivity toggles, creates uh scenarios, changing revenue and growth models, a comparables engine, apply industry multiples to current financials, and then triangularization, which is a plot of all ranges on a single graph. So moving into our implement, which is when now it created our code here. So our native cube implement phase, we've developed a Python script to autonom automate the valuation. So this is going to help this this Python code is going to um automate our evaluation compared from their company. So if we jump to our code here, as you can see is what Jim and I are base scenarios. These are our projections. It shows us year one through five of each of these scenarios that that it came through. So it jumps out with our um with this with our evaluations here and then it also gives us a graph here. So our trading high growth about 10 billion to 14 billion. Trading PE average at 8.8 billion to 10 billion. Our precedent at 10.8 to 13.5. The downside being at 5.2 upside being at 12.7 and our base being at about 9 billion. So that graph just gives a visual of being able to understand the overall um flow of what's going on during this. So a little bit of validate our sanity check here. Um our observation the DCF base case likely around um 11 billion to 12 billion and uh depending on um well our code is going to be around 9 billion here and should fall within the trading comps value. So it falls between here it falls between 8.8 billion and 10 billion. So right here these two align together they should be our base should fall between his trading average which is correct. That's just a little bit of a check there. Um and then our um DCF implies an um precedent of 20 times but exceeds our 15x. Our growth might be too aggressive. Um but then jumping into our evolve stage here um if recession hits growth drops about 4% the valuation likely collapses to that um the 9 billion bridge which is going to be or like that 5.2 which is going to be like our floor price there. Um, but looking into our overall reflect and our strategy, um, our base case being at 9 billion there is pretty safe. It's pretty in the middle of everything we're looking at here on this graph. Um, with our trading comps being between 8.8 and 14. Um, and then our precedent being at 10.8 to that 13.5.\n\nso looking into our bid strategy. So we're going to the opening bid um at 11.5. Uh this anchors a price without precedent bounds but offers a premiere over the industry floor. Um so it gives us just a little bit higher of of a gives us like just to show that it just gives us a little bit higher than what the industry maybe on average would be giving us a little bit better of a chance to win. So our winning cap but our winning cap we want to stay below hopefully 13 billion. um it just is it just is a little too high for us comparably to something like that. So the edge do not complete on we're not going to want our edge though we don't want to compete on just price alone. Um we want to make sure we have a full understanding of our management our execution and all that thing. Um something that is strategic will integrate you um and we'll keep you in charge. So making sure we're smart with our money and making sure we're smart with everything that we're doing will help us um greatly. So our final recommend my final recommendation overall for this um assignment would be to submit a bid around 11 or 12 billion. Um and we should walk away if anything exceeds about 13.5 billion. I think that's just that'll just be too high. um we're interesting we're at that point we're going to be interesting entering a strategic buyer territory where um value value creation just relies on synergies um alone and we don't that we don't really have. So that is overall my session uh 12 assignment. Thank you for listening and goodbye."
}