{
  "student_name": "Jay Saini",
  "org_defined_id": "037907174",
  "username": "saini52",
  "video_url": "https://www.youtube.com/watch?v=iDCuhNnXPdI",
  "transcript": "\"All right, so this is a session 12 assignment, uh where we basically have to kind of establish the scope, core parameters and critical constraints uh for Panera Bread and kind of being able to input different values to see what would be the best reason. So I tried a different approach um here instead of breaking and compartmentalizing them, since it was harder to change the values and push it down. I kind of had Gemini try to make it all in the same and then produce kind of a nice like um kind of a chart and you can see there's a graph here which we'll get to at the bottom and the recommendation for Panera Bread. So um up at the top I'll explain the code first, show you guys what the code produces and then talk about driver. Um\n\nSo our parameters are revenue, our E B I T D A and our net income is already set to 6 billion, .9 billion, and .4 billion, which is the financial scale that we were given. Our growth and operational drivers, our projection years is five, rev growth rate is about 8%. Uh E B I T D A is 15%, tax rate is 25. D N A P C T revenue is about 4.5%, which is estimated from the depreciation. Uh the K P E X P C T revenue is 4%, and the N W C change P C T revenue is about .5%, which is the valuation drivers. The precedent low for E B I T D A is 12 and then for high is 15. The industrial is 12, the Chipotle is 25.3. The industrial P E is 22, and the Chipotle P E is 35.\n\nThen we have the synergy P C T revenue, which is .03. So this is strategic buyer assuming 3% of the revenue in COGS and G & A savings. Then here's our financial functions, which is basically calculating the D C F. So that's W A C C G and D F projections. So to calculate the F C F underscore T D F projections.l o c F C F um, the formula would be, excuse me, right there. And then T V is F C F underscore T times in parentheses one plus G divided by W A C C minus G. To calculate the P V and the F C F's, we have a for statement, so a for loop, so T in in range one, config projection years plus one, the F C F equals the D F projections.l o c F C F F year.\n\nUm, then our next stage is to actually implement the model. This is kind of where we will have a lot of our print statements and show us kind of a chart. So we have the projections which builds the five year operating F C F projection model. So years, it's a list ranging from one to the configuration projection years plus one. Um, so we will look into revenue, E B I T D A, D N A, E B I T, tax, N O P A T, K P E X, delta N W C, F C F. So, our starting value is the configuration of revenue L T M. So we have another for statement here, which is in T N years, rev T would be um one plus config E B I T D E B I T D A would be rev underscore T times config. D N A would be rev underscore times the D N C P N P C T revenue. Um and so on and so forth all these would be right here.\n\nAnd then we'd also have to format this, so it would be D F or like just kind of rounding all the values. This is all the formations of that. Um, and then here is kind of where we have our market valuations, uh of like the precedent low, the precedent high, the stuff that we talked about a little bit above our code. And then we have our synergy modeling, so our strategic premium, which would calculate the perpetual growing synergies, estimating the year six revenue. The column names for one, two, three, all that that will pop up up on our table in just a moment.\n\nUm, and then we have the sensitivity analysis. So this is going to be for G and G range, the row, and then for W A C C and W A C C range, it would be if W A C C is greater than or if it's less than or equal to G the row would be .1%, otherwise it would be uh to calculate the D C F.\n\nAnd then the last is the football field plot, which is the graph. You can kind of see where we're at with everything um, just to produce that. That's going to be the code right here, and to plot the ranges and set the Y which will actually get a visual representation and um, so these are all our print statements. So it prints out our stage. So our five-year operating and F C F projections in billions. Our revenue is 6.48. In year two, it's 6.9, in year three, it's 7.5, in year four, it's 8.1, and in year five, it's 8.8. So it is growing uh pretty well throughout that. Our E B I T D A is .9, then it goes to 1.05, 1.1, 1.2, 1.3. So it's also growing a little bit. Our D N A is .2, .3, .34. So it does increase a little bit from there. .367, and then .397. Also growing slightly less, but growing. And then E B I T, .6, .7, .79, .85, .92. So it's very close again. Our taxes are also increasing much much uh slowly than everything else. N O P A T is also very slowly increasing. K P E X, again, the same thing. Delta N W C, .032, .035, .038. Yep. So, just very, very subtly, you can't really see. But our valuation checkpoints, our base W A C C is 9%, G is 2.5, P V N F C F S in year 1 through 5 would be 2.3 approximately billion. The terminal value is year 5, which is 10.94 billion. The base case D C F enterprise value of 9.41 and the implied D C F multiplier, which is 10.5.\n\nUm, in our driver stage, we have a D C F sensitivity analysis in billions. So we can see the G equals 2, 2.5, 3, and 3.5, how that affects these rates right here. And this is kind of the football field that I was talking about, where we actually have the valuation synthesis. I have the football field. So we have the 13.5 billion, the comparable companies of the 10.8 to 13.5. The precedent transactions from 10.8 to 13.5. And the D C F, which got a little messed up here, but it would go right there. So it's a little bit less than 10.8 to about 13.2. And we also have a strategic synergy adjusted, which is 13.5 to 16.2.\n\nUm, so the executive recommendation, Panera Bread acquisition, the metric, the value range, implied E B I T D A, that's about the recommended, sorry, bid range would be 12 billion to about 13.5 billion. Um the winning bid strategy would be hybrid aggressive financial buyer. So the bid would be anchored by the high-end precedent multiplier 15 times to compete with strategic buyers, justified by Panera's high growth levers. There's 500 stores, 70% digital, and the management rollover. The walk-away price set at around 14 billion. The upper bound where the financial I R R becomes unsustainable.\nUm, I will leave it like right there. In terms of driver, kind of getting a little bit more of where we were. Um, we, again like I mentioned earlier, we wanted to establish the scope and the core uh, to represent, we had a map kind of analytically plan the structure required financial stuff. So a lot of the values you see kind of play back and forth, and then we were able to get graphs like this. The implementation was actually run. So we did a lot, or Gemini did a lot of the coding and added it to the point where it would make these really nice tables so we could implement and make it very easy to see the data points, and for it to automatically project to us what would be the best values to use, along with the football field right here you can see. Um, to validate, we ran a sensitivity analysis, executing the Python code to test the impact of varying the W A C C, so 8 to 10%, and the terminal growth from 2 to 3, just to help us validate everything. Evolving, um, we synthesize and validate the results into strategic conclusion. So it actually gives us a bid range to look into like this is 12 to 13.5. And to overall reflect, um, the final bidding statement would recommend like I mentioned 12 to 13.5, and the winning prize, the rationale, defending the choice of a hybrid financial strategic position, next steps, so on and so forth. So it's being able to deliver the um, executive recommendations, summarizing those findings is really important. And I think Gemini did a really good job of kind of highlighting all those important stuff um over here. But yeah, I hope\""
}