{
  "student_name": "Gillian Johnson",
  "org_defined_id": "038893789",
  "username": "john3952",
  "email": "",
  "transcript": "My name is Jillian Hston and in this video I will be conducting a full weighted average cost of capital analysis for Netflix using the driver framework. I'll calculate Netflix current WACCC plus the impact of a $3 billion debt issuance. Evaluate project specific discount rates benchmark Netflix against Disney and Amazon and recommend an optimal capital structure strategy. Moving on to define the decision context is a hypothetical hypothetical $5 billion Netflix content investment. And really what we're trying to do here is answer the question that is what is Netflix's true cost of capital today? How would additional borrowing change it? So that debt financing that I mentioned previously and what is the rate what rate should be applied to domestic versus international content investments. So this considers a variety of different factors including debt financing and how different um locations I guess and um currency exchange rates and whatnot and getting your the value for your financing all impact a corporate decision. So moving on to R to rep this represent this problem formula I'm using the WP equation which is um E over E over V * R E plus D over V * RD * 1 - TC. So it's supposed to calculate a company's weighted average cost of capital by multiplying the proportion of equity which is the EV. So E stands for the total market value of the company's equity. B is the total market of the company's capital. So E plus D. And that means D is the total market value of the company's debt. So it multiplies that by the cost of equity which is RE and it adds it to this portion of debt ED and multiplied by the cost of debt RD. So that RD stands for the pre-tax cost of debt. And this is all taking into account the tax shield on debt. So the corporate the company's corporate tax rate is DC which is very important factors into um obviously the impact of the debt financing decision. All right. So this also so the after tax cost of debt estimated by using Netflix's uh triple B plus yield of 5.8%. Um and capital structure weights use weight uses market values not book values. So our tax rate for uh Netflix right now is 21%. So this stage also is used to identify any constraints that we're working with. So Netflix has an equity heavy structure. Um but financing new content through debt affects leverage. It affects of course the credit rating and the cost of capital. Moving on to um implement. So the first part of uh implementing WACCC first we're going to calculate the um the cost of equity. So our risk-free rate is 4.5%. Our market risk premium is 5.5%. Our beta value is 1.3. And then for our cost of debt, sorry, our cost of debt, um, our current capital structure weights include the market value of equity being at $200 billion, the market value of our debt being at $13 billion. So that makes sure that our cost of debt is at 4.58%. And our WE is 6.1%. Now, plugging that all into WHC, Netflix's current weighted average cost of capital is 11.2%. And this is higher than the media industry's range of 8 to 10%. Um, and this can be a bit difficult to, I don't know, not necessarily wrap your head around, but it calls into question the validity of this decision using that to uh finance a uh content investment decisions and the expansion of using leveraged capital over equity which they typically do. So to validate this and to represent this further I have my code here that is going to be able to calculate a WACC as I just mentioned and this is part of my validation as well as I mentioned to you the doing the calculations on the side. So, I was able to compute the WAC on the side, but I also want to put this through code and have the code do it for me. So, let's run this. Here we go. And that's correct. So, the current WACC is 11.22 and then our WACC after 11.14% or I'm sorry, after our $3 billion leverage financing decision is 11.14%. And that means our international WATC is 12.25%. So this is our sensitivity to leverage. This is really important when considering leveraging leverage financing as a decision for your company and the impact that is going to have long term on the company's credit rating on their um accessibility to funds their ability to make profitable profitability decisions profitable decisions. So their debt as a total amount of capital obviously is increasing there to 40%. As their weighted average cost of capital goes down. So having this information before making the leverage debt decision for Netflix would is extremely helpful and will hopefully redirect them in a different way to not necessarily rely on um debt as a primary method or at least 15% of their total capital as a method to invest into new content and endeavors. So moving on to um um or I guess continuing with implementing. So for the US content um risk resembles Netflix's corporate risk uh profile but for international markets especially in emerging economies we have several different other factors that we need to take into consideration. So there's simply higher regulatory risks that come along with um not only other markets besides the US market but different standards across all different countries and what the expectation is going in. So whatever kind of control and freedom Netflix and their corporate investment team wants to have over this um process they need to take into consideration the kind of situation and environment that's already there in those countries. Additionally for some emerging economies you have um a lot of currency volatility. This typically happens in um developing economies where um the more volatile the currency is, the less stable financially that uh institutions are and the more corruption tends to be rampant. Um which is another issue that Netflix needs to take into consideration if they are considering the success of this leverage finance decision. And then the local content uncertainty. So whether or not the actual competence they choose to expand into is worth the kind of risk that they're taking on doing so in different cultural environments or political environments that they may not fully understand. So all this taking into account I'm going to increase the beta by 2% making our beta sit at five 1.5%. This lists the international WACC to 12.2% 2% and so therefore the US content discount rate 11.2% but the international content discount rate 12.2% 2% we see this validated by um our graph for code as well and then as we're comparing to as I mentioned the project risk so as we're comparing to the um here WACC um we'd like to compare Netflix Disney and Amazon and for Disney and Amazon your WCC rates are at 8.2% 2% and 9.5% respectively. And Disney has their lower WCC because they have more diversified business lines. So they have their entertainment, their parks, their studios, um, as well as a bunch of different lines of business within that. They have a larger asset base as well. That obviously goes hand inhand with having more diversified business lines. they have more assets uh resources to pull from and therefore they can they don't necessarily have to le rely on debt or leverage financing to achieve certain investment goals. So that means that they have a lower beta of about uh one point. Netflix has a higher WC mainly because its beta is elevated and it's equity concentration is extreme. So um evolving my analysis thus far we're going to focus on sensitivity analysis. So my sensitivity analysis shows that increasing debt from 6% to 15% of financing reduces WACC modestly but beyond 20% the financial risk increases in the cost of debt. As we saw here in this graph, the more sensitive um obviously Netflix becomes to debt and leverage finance, the more um percent of total capital debt belongs to the WD began rising after excessive leverage. that indicates that Netflix should uh or can use that as um a means to reach their investment goals but only slightly. So my recommendation is to issue the $3 billion in debt because while it slightly reduces WCC it supports a long-term content investment given all other factors etc. And I would also target a debt share of 10 to 15% total capital up from the current 6% and avoiding the Disney file 30% debt unless cash flow stability improved significantly. Again, I would apply the 11.2% WC for US projects and 12.2% 2% for international content and potentially increase the beta for our international content um just to project uh further sensitivity when needed in order to account for different issues that might come up. So this capital strategy hopefully balances tax um field benefits with next Netflix's volatility profile. Thank you for watching this driver based WCP analysis for Netflix. This framework ensured that define and represent tra represent status guided all implementation validation and strategic prepation. Thank you.",
  "video_url": "https://youtu.be/U77RECcJJwk"
}