{
  "student_name": "Caden Mainville",
  "org_defined_id": "037229244",
  "username": "cmainvil",
  "email": "",
  "transcript": "Hello, this is management 310, assignment 10. So the objective for this assignment, we are going to have to evaluate Starbucks project that requires a 12 million upfront outlay and expected to operate for 10 years. We're going to use the firm's cost of capital as the hurdle rate to determine whether the project creates value. And then we're going to um provide a recommendation whether we should accept or reject the decision supported by our driver documentation and our analysis. So here's the data we're working with. Um we have the initial investment of 12 million uh which is depreciated under a straight line for 10 years. That includes building equipment and training cost. Um working capital which is 500,000 which is going to be deployed at launch. and then recovered in year 10. For revenues, we have 8 million in year 1, 11 million in the middle years, and then 9 million to finish us off to year 10. We have our operating cost seen here. And then we're working with a tax rate of 25% um with a terminal value of 3 million at the end of year 10. Now, to actually interpret that data, we're going to go ahead and focus our analysis on producing a transparent cash flow model. We're then going to calculate some capital budgeting metrics and then we're going to perform some sensitivity tests and also provide an executive ready recommendation. We'll go in a bit more into that with our represent framework. So for our represent, this is our analytical approach. So this is how we're actually going to evaluate the Starbucks project and determine whether it creates value within the company. So firstly using Gemini we're going to build a 0 to 10year cash flow schedule. We're going to show visually a table and then also show the cash flow over the years visually uh just to kind of help us out. This cash flow schedule will include revenue, operating cost, depreciation tax shields, taxes, working capital changes and also terminal value. That's going to give us a uh detailed schedule. Secondly, we're going to calculate the core capital budgeting metrics. So, we're going to find the net present value, the internal rate of return, uh the different payback periods being discounted and simple, but we'll get into those a little bit later. And then also the profitability index using the firm's cost of capital. After that, we're going to perform some sensitivity test. We're going to compare our base case to other scenarios such as a decrease in revenue and then also a plus and minus of 2% in our cost of capital. We're going to see how that can affect our investment decision. We're also going to show the net present value heat map which we'll go into detail a bit later on. To wrap this all up, we're going to make an investment recommendation. Um we're going to weigh the financial aspects, the strategy being used, branding, and the key risk involved. So let's go ahead and dive into our implement stage. We're going to walk through our model. So here's our year zero incremental cash flow schedule. Let's go. Let's go ahead and go through the code. So this is all the data that was given through um AI sorted sorted it out all nice and neatly. So what the code is actually doing. So, first we're starting with a uh a little mockup of what it's actually doing. So, it's creating the table and then it's going to populate the columns. After it does all the uh populating, it's going ahead and calculate the COGS for us for all of the years along with total operating cost and all of the other factors that we need to go through. It does a very good job of laying it out in a nice neat fashion. So, we're able to see where it's getting each number from. But once it finishes up and gets through the tax shield working capital terminal values, it spit out this table which came out very organized and was very easy to see all the visualizations for where the money is going. Initially, we can see that if we do go about this that this project is a very front-heavy um investment. So all of the money for the project is being put up up up front. But after that from years 1 to 10 we can see it's a cash generating asset. So that is an attractive uh thing to look at. We can also see how the depreciation tax shield is working through the years. So depreciation is non-cash but it does reduce taxable income which therefore will boost our free cash flow. So it's cool how we can see all of this and be able to interpret it as so. But to move on to a visualization, we can see that we're very front-loaded in the initial investment. But we can see that from all the years forward that the cash flow is always positive, which is very attractive for investors. But I kind of skipped through the code real quick. But all it is was a quick little bar plot taking the data that was already up here and organizing it as so. But to kind of summarize everything we talked about in this section, we can see that the zero year or the year zero outflow um say the significant initial investment of 12.5 million covers the capex and initial working capital representing the project's primary upfront risk like we did talk about for the operating cash flows. We can see that the positive cash flow begins in years 1, peaks in years 2 through 5, and then moderates down in years 6 through 9 as revenue shifts. That is very attractive. As we talked about earlier, we can see we have a year 10 boost as well. The final year does see substantial cash flow uh due to the work to due to the recovery of working capital and the $3 million terminal value. But all in all, what we can see from this is the risk and return that the project has an initial high-risisk capital outlay, but it is followed by strong operational returns in the midterm and a significant final year recovery suggesting a favorable return despite the initial investment. So, moving on to part two of our analysis, we have to calculate some core capital budgeting metrics. So, we're going to go ahead and start with defining the firm's cost of capital as done here in the code. And then we're going to calculate the net present value. For the net present value, it is under the assumption that we are expecting the initial investment to start at t is equal to zero as the first element in the cash flow series. And then from there, it's going to calculate the internal rate of return uh which is basically just the annual rate of return. Then we when it comes down to calculating the simple payback period and the discounted payback period basically the only difference between these two is that the simple payback period um ignores the time value of money while the discounted payback period takes it into account. So the simple payback period is a easier and faster way to go about it but the discounted one is more accurate and technically the finance correct way of doing it. But we can see here uh they do have somewhat similar uh similar calculations. After we do that we have to calculate the profitability profitability uh index which is just just the present value of future cash flows the just the present value of future future cash flows divided by the initial investment. So once it does that it gives us a simple uh chart as shown here of the net present value of 3 million an IRRa of about 13%. The simple payback period which is less than the discounted payback period. Um as we said earlier that is due to the time value of money and then the profitability index. Uh my application just quit on me so sorry if there was an error in the recording. Not sure exactly where it left off, but we're going to go ahead and talk about the profitability index. Uh, basically all that states is for every dollar that you invest, you're pretty much going to get a $1.35 out, which is pretty good. But it's always important to double check um some of these factors. We're going to go ahead and double check the net present value through a verification process. So what the net present value is is really just the present value of all the future cash flows all added up. So we can see uh here we laid out all the years the future cash flows assigned with it and then the discount factor which is this equation plugged in with the time and the cost of capital. Once you do that you get these values shown here on the right. And once the summation of all of those comes out to 3,22,51485, which is exactly what we got here in our code. So we're looking good. So given this information, what can we interpret about it? From this summary, we can see that with the net present value of 3 million and the profitability index greater than one, this strongly suggests that this project should be accepted. With these payback periods, we can see um the project recovers its initial investment relatively quickly, which is great to see. And then the internal rate of return versus the co cost of capital um is the IRRa is significantly higher than the assumed cost of capital. So this would indicate a healthy return on investment well above the company's cost of capital, which would also further support the project acceptance. Now, uh let's go ahead and look into a little bit of a visualization. So using the data as seen before um it basically created a graph for the net present value sensit sensitivity compared to the cost of capital. What and what we see from this graph is we see an inverse relationship. Um as the cost of capital increases the net present value of future cash flows decreases. We can see the project acceptability threshold which is this red line. Basically, if it's above it, we would say accept. Below it, we would reject. But all in all, we can see the cost of capital and the green line here and the uh net present value line as seen here. And when that intersects with the inverse relationship, we come out with the net present value, which would be around 3 million as we saw earlier. But to wrap it all up, this is a good assessment of risk. So the slope of this curve indicates the project's sensitivity. So a steeper slope would imply greater sensitivity of net present value to changes in the cost of capital, meaning that the small fluctuations in the discount rate would have a larger impact on the project's perceived value. So this project shows moderate sensitivity, which would reinforce the decision to accept it in the current cost of capital. So everything that we've done up to this point is pointing towards accepting the investment. All right. So as said earlier, we have to perform some sensitivity tests which as shown here, we're going we're going to go through scenario A and then scenario B. So for scenario A, we have a revenue decrease of 20%. So what we're going to do here is scale the future in incremental cash flows uh by 80%. Um and then from there we're going to be able to see the change. And then as far for the c cost of capital, we're basically just going to do the different calculations with the different cost of capital numbers. uh minus two and plus two. And once that calculation is done, we can see the base case we already calculated up here. With the revenue decrease, we can see the net present value would go negative with a lower internal rate of return. We can see that with a lower cost of capital, the net present value would be higher with the same amount of internal rate of return. And on the flip side, the a positive increase in c cost of capital would lead to a decrease in net present value and in turn also a um the same internal rate of return. So uh internal rate of return does not change uh with the cost of capital because it's not in the same equation. So that's why these two turned out to be the same. But we can see if the project really does not do well or continue to do well, the net present value would go down and from there we would not want to accept the project because it would decrease the company's value in the long run. But as far as the cost of capital changes, we would accept both of them. Um we would prefer a decrease in cost of capital um instead of an increase. uh this is this would lead to a higher net present value which would increase more value in the company. But from this we can see that the project is more sensitive to revenue performance than plausible shifts in the cost of capital. It looks pretty good in the base case but a 20% revenue miss is enough to erase all the value that it would create. So we're going to get a better visualization for what we just talked about. So we're going to take We're going to take the data we found and create a heat map which is going to compare the net present value. My recording crashed again. Sorry about that. So, we're going to compare the net present value to revenue scale versus the cost of capital. And what we can see on here is the different revenue scale. we can see how a 40% miss in revenue would affect the net present value compared with the uh cost of capital over here. So we can see that with a uh high revenue and a low cost of capital that would lead to our highest net present value and on the opposite side of the spectrum a decrease in revenue and very high cost of capital would lead to the worst net netresent value in this case. So this gives us a layout of what could happen and kind of shows us the threshold of if we should accept or reject this investment decision. Now that we went through three critical parts of our analysis, I think we're ready to provide a recommendation. So let's go ahead and dive into that. A quick brief overview of everything we're going to be talk about for this investment decision. For the financial results, we saw that they were strong. We have a positive uh net present value internal rate of return above the cost of capital and a pretty solid profitability index and uh returns are revenue sensitive instead of cost of capital uh sensitive. Next, is this a strategic fit? Is this project actually going to work? Opening a new uh roaster for Starbucks really fits what they do. So, this supports their expansion and their operating strengths and could bring more consumers uh to their company. Obviously, there's a ton of other factors that go into it like location and uh demand demand at the time and overall economy, but in this simple in this simple model, we're just going to assume that it's a uh perfect world and um them adding another roaster would increase their value. But as far as brand impact goes, that kind of goes on to what we were just talking about. This can positively um enhance innovation and convenience if their quality is preserved and can um put them on better terms with their consumers uh showing that they're putting them first. And then as far as the uh risk profile goes, we put that as moderate. The main threat for this project is demand shortfall, but other risks are mostly manageable uh with careful roll out. To get a little more specific before we make a recommendation, let's look at the major risk that we're going to be facing. So if there is a demand shortfall where the revenue goes minus 20, the this scenario could wipe out the entire economic value and pretty much just make this whole project not worth doing. So we have to keep that in mind. Another thing we have to be aware of is if the cost overruns or if construction delays reduce the realized returns that could negatively impact the net present value. Uh there's going to be a competitive results competitive response to the local market and the other um coffee shops in the area. And then there's some operational risk as well. But these risks can be partly uh mitigated through careful site selection and piloting the concept before roll out um to kind of monitor performance. But what would really kill this project is just a revenue shortfall which would drive the NPV to about zero and push the internal rate of return to below the cost of capital which would push us to reject this um investment initially. But but with everything that we've seen, we're going to go ahead and proceed with this investment. So financially, this project clears uh Starbucks hurdle in the base case and remains positive under a reasonable cost of capital changes and the value is slightly sensitive to revenue performance and execution, but it is manageable as we have said. To be a little bit more specific, it should be approved subject to a strong upfront market and site analysis, a discipline pilot phase, and um a clear performance threshold and explicit brand and service standards to avoid erosion at the core Starbucks experience. So, this is how I went about the investment decision to deciding if Starbucks should go about this project or not. But in general, I learned a ton from this project. Uh firstly I learned what a heat map was and it was pretty cool to get to be able to use that and see what it does visually and actually understand it this time. Uh I got some more experience with calculating the net present value, internal rate of return and those type of formulas. So that's always great practice. And then in general I got better with using AI and building um tools with it. But unfortunately my uh Gemini log did get like deleted previously. Uh I refreshed this page after something happened and the logs just got deleted. I tried uh pressing everything over here and going into my history but I couldn't find it. So but that is all I have. So thank you",
  "video_url": "https://www.youtube.com/watch?v=ZfMUEAsFODY"
}