{
  "student_name": "Kendra Zylstra",
  "org_defined_id": "034289869",
  "username": "kzylstr",
  "email": "",
  "transcript": "for hedge funds or short sellers. So that proved that being a fundamentally right isn't enough to be profitable. Melvin Capital was a really good example of this. This was a really pivotal part of the situation. Mel Melvin Capital was right technically that Jamie was overvalued but they were bankrupted by a risk that they couldn't model. So the concepts limit arbitrage is no longer theoretical but it's primary risk to be managed. Secondly, we want to evolve by evolving the financial theory. We want to look at EMH versus behavioral. So pure EMH like using pure EMH is kind of a failure. So we want to evolve to use not just AMH but also behavioral finance because the GM event is a catastrophic failure for the strong and semi- strong forms of the AMH proving that it's not consistently like valid or usable every time. So this brings us to the triumph of behavioral finance. It proves that these biases such as hurting, overconfidence and the disposition effect are not just small anomalies but can become the primary driver of price which overwhelms rational arbitrageers. So the evolve synthesis is that the J event doesn't mean we throw out the EMH but that we have to evolve it. We have to kind of look at how we can use in other situations or in similar situations how we can do a better job by not just using EMH as it is but to evolve it. So the modern and synthesized view is that markets are mostly efficient but are subject to brief violent and self-reinforcing behavior bubbles when limits to arbitrage are high. The GM event proved that behavioral finance is not a soft alternative to EMH but a necessary component of EMH to explain the real world. Finally, I want to reflect a little bit on what I learned. One thing that I learned a lot is to always validate. And we learned this a lot in the beginning. Um, it was a interesting thing to kind of try to validate from the beginning because I feel like that's something I hadn't been doing very well in previous assignments. But making sure to validate all of our numbers before we start the analysis is really important. Even if numbers are given to us or even if we think they're correct, is to double check and like as we validated in the beginning and found out that a claim is incorrect, we were able to use the correct numbers for the rest of our analysis. And then secondly, um, one thing I learned a lot is that EMH is not wrong. It is just incomplete. The market is not a perfect rational pricing machine, but a complex system that is mostly efficient. So that kind of goes back here to our evolve, our second part of evolve. I learned um, a lot about how um, and I feel like this can kind of translate well into other situations when it might not be that a process or system is completely wrong, but just you have to evolve it and change it. Just like in our example here that EMH is not wrong. It was just incomplete and needed a little bit of evolving. So I learned a lot through this project. Um I knew kind of about the situation with GameStop, but I didn't know a whole lot. So it's interesting to dive deeper into that. Just kind of to wrap up here again are the five things that we um did in our analysis with our goal being to test the efficient market hypothesis which we did by analyzing the GameStop short squeeze as a case study which we did for market anomalies and behavioral finance which we also studied those. So thanks for listening. Thank you.",
  "video_url": "https://youtu.be/bTwsTmtdCKc"
}