{
  "student_name": "Cruz Tirado Rojas",
  "org_defined_id": "037412563",
  "username": "ctirador",
  "video_url": "https://youtu.be/B_Pv_TMVggM",
  "transcript": "For this session assignment, we are to\nevaluate Apple's hypothetical $90\nbillion share repurchase using Driver.\nSo the capital allocation snapshot uh\nliquidity $165 billion in cash and\ninvestments, $100 billion in annual free\ncash flow. Uh market context, $185 share\nprice, and the price to earnings ratio\nis 30. Dividend yield is 0.5%.\nThere are 15.5 billion shares\noutstanding. Uh the balance sheet 110\nbillion in debt. Birkshshire owns 6%.\nCEO holds 3 million shares. Retail\ninvestors average 100 shares and\nemployees have $170 strike options. Uh\nproposal $90 billion buyback executed\nover one year. and then alternatives $6\nuh special dividend strategic AI/VR\nacquisition debt reduction and\nincremental research in development.\nSo the objective determine whether the\n$90 billion share repurchase is the best\noption. Compare this uh option to others\nsuch as dividends acquisition debt\nreduction and other alternatives.\nSo we can infer that the uh risk-free\nrate for keeping the cash is 5%. This is\na an achievable risk-free rate for uh\nthe a company this size. So the earnings\nyield for stock is 1 divided by 30 uh so\nit'll equal 3.3%.\nAnd we can use the US corporate tax rate\nuh 21%.\nWe can assume that the risk investment\nof the AI/VR acquisition is 15% based on\nthe standard hurdle rate for risky tech\nacquisitions. And then the net income is\nthe market cap divided by the PE ratio\nwhich is 15.5 billion shares times 185\nuh which is the market cap of $2867.5\nbillion and then divided by 30 which\nwill get you a 95.58\nbillion in net income and then uh the\nagency theory management would prefer\nbuybacks over dividends and then some\nnotes uh if we decide to buy buyback I\nIf we decide to buy back, the EPS will\ndecrease immediately. We must look at\nthe long-term and look at the tax\nefficiency. If we chose the $6 special\ndividend, then there will be a tax\nliability.\nSo for the represent stage we're using\nthe return on equity with leverage uh\nformula as well as the degree of\nfinancial leverage formula uh which um\nwill both use EBIT which we calculate\nusing the net income of 95.58\n/ 1 minus the uh tax rate uh which will\nget us 121 billion. And then the equity\nis 2867.5\nbillion which is uh the market cap. So\nboth the buyback and the dividend would\ndecrease equity immediately since the\ncash leaves. This would result in both\nthe roe to increase whereas the equity\nfor the strategic acquisition would stay\nthe same since they would be simply\nchanging where the assets are.\nSo for the implement stage, I went ahead\nand gave a uh Gemini this information\nand Gemini was able to give me uh uh\nthis uh code. Uh so here we can we\nthey're the given the share price shares\noutstanding the PE ratio and then\nuh if we go\nhere run the four options the status quo\nbuyback dividend and then the\nacquisition\nand then also it was uh you uh to\nvisualize the data it used a chart\nand then if we look here there are four\ndifferent options. The status quo, which\nis uh leaving the money in the bank for\nthe risk-free rate of 5%. The buyback,\nthe dividend, and the AI acquisition. We\ncan see all roses. Uh here uh the status\nquo has a ROE of 3.4 3.43.\nAnd the buyback and dividend both have\nthe same ROE of 3.42. And then the AI\nacquisition has a ROE of 3.68.\nuh DFL uh let's look back here. So yeah\nto validate the ROA for the buyback\nactually went lower than it was if you\nkept the money in a risk-free\ninvestment. This is because the interest\nincome would be destroyed which made the\nnet income at uh drop at the same time\nand so the DFL goes from 0.97 to 1.005.\nThis means that the DF DFL is now\nleveraged.\nThe AI/VR acquisition seems to be the\nbest option since the ROE is the\nhighest.\nSo for evolve uh we going to add uh\npaying debt as is it better option. Uh\nso Apple's cost of debt uh I looked up\nuh here\non valueinvesting.io\nIO um and here you can see the walk the\ncost of equity and then here is the cost\nof debt uh which it says is 5%. So even\nthough uh\npaying debt does not destroy value since\nthe um leaving the money in the bank\nwould give us an interest uh rate of 5%.\nIt wouldn't be recommended because it is\nconsuming liquidity that could be used\nelsewhere. um like we could be using\nthis money for the AI acquisition if we\ndetermine that's the best in investment.\nUh also uh Apple's already uh pretty\nsafe. So I don't think this would really\nhelp them. Well, so would incremental\nresearch and development be a better\noption? If we were to focus on ROE, then\nit wouldn't be the best option since the\ncash would be expensed and would lower\nthe EPS immediately.\nUh so stakeholder outcomes. So for\nmanagement uh they are the primary\nbeneficiaries for the buyback option due\nto bonuses being linked to EPS. For\ninstitutions the institutions like\nBirkshshire Birkshshire would rather uh\nApple choose the buyback option since\nthis gives them a higher stake in the\ncompany. This means they get a larger\nclaim in the company's future cash\nflows. And then for retail C uh\nshareholders uh they would choose option\ntwo in which they receive dividends\nbecause they're just receiving straight\nup cash. And then bond holders bond\nholders would rather the company pay off\ntheir debts to make the company safer.\nIf the company chooses an option where\nthey make money, the bond holders do not\nreap the benefits. So there would be no\nreason for the bond holders to uh\nsupport uh the uh Apple choosing a risky\ninvestment.\nUh so employees uh due to the $170\nstrike option, the employees would also\nrather that the company choose the\nbuyback option.\nSo for the final decision, the model\nproves that the that by choosing the\nbuyback option, we're losing our our\nROE. But this is not the only thing that\nis on the CEO's mind. Uh the CEO may\nstill propose this option since it\nlowers the share count and might help\nreach EPS targets. The only option that\ncreates value is the AI/VR acquisition,\nbut it must be earning 15%. This means\nthat if the acquisition actually doesn't\nearn 15% then the actual the best option\nis the first which is um leaving the\nmoney in the bank. Uh but it's also\nimportant to note that the AI/VR\nacquisition um is very risky. So it\nreally depends on if they uh feel like\nthey would uh be earning the 15% uh in\norder to choose the AI/V acquisition.\nSo um to reflect uh by using ROE and DFL\nto measure the efficiency and risk of\nthe options we were able to compare the\nfour options when looking at the\ninformation it is important to note that\nnot every stakeholder wants the same\noption. For example bond holders would\nrather make the company safer by paying\noff debt whereas the management would\nrather buy back stocks due to there\nbeing uh bonuses based off the EPS.\nLooking strictly at the data, the best\ntwo options are to keep the money in the\nbank and and earn a risk free rates of\n5%. Or the AI/VR acquisition that\nreaches earnings of 15%.That is all. Thank you."
}