{
  "student_name": "Jasvika Patil",
  "org_defined_id": "036591563",
  "username": "patil173",
  "video_url": "https://youtu.be/X02gfkYLrcc",
  "transcript": "So this is my assignment, session 11 assignment. And today I'll analyze Apple's proposed 90 billion share repurchase using the driver framework. So first I'll quantify outcomes for each stakeholder group. compare alternate use of capital, test scenarios in the provided Python model that is on the screen right now, and conclude with the recommendation that balances value creation versus value transfer and agency considerations. So let's begin. The first step of the driver framework is define. So Apple has 165 billion cash.and then $100 billion annual free cash flow, 15.5 billion shares outstanding, share price $185, price to earnings ratio 30, and $110 billion debt. So the proposal is a $90 billion buyback. over one year, which is about 10% of the market cap. And the alternatives are $6 special dividend, AI acquisition, paying down debt, or incremental R&D. So my objective is to determine whether the buyback creates economical value, which is higher firm value or sustainable returns.or transfer value among stakeholders, for example, like from employees or bondholders or shareholders. So I will evaluate EPS, ownership changes, leverage debt or net debt, ROIC implications. So this is qualitatively for acquisition and R&D. And lastly, agency consideration or signaling considerations. So Moving on to moving on. So the numbers that we have for now are the share price is $185. You can also see you can like see it on the screen. um in the code the share price is 185 dollars the price to earnings ratio is 30 and which makes the implied ratio 185 dollars divided by 30 which comes up to 6.1666667 dollars And the shares outstanding is 15.5 billion. So here the implied net income becomes EPS into shares, which is the $6, 6.1667 into 15.5 billion. So that rounded becomes gives the results 95.583 billion dollars. Moving on, the cash is $165 billion. The debt is $110 billion, which makes the net cash $165 billion minus $110 billion, which is equal to $55 billion in net cash. The buyback is $90 billion, and the interest on cash is $10. so we're assuming four percent the cost of debt would be five percent the tax rate would be 21 and these um assumptions are kind of explicitly parameterized in the model shown on screen. So I will show evidence of discover before I implement these assumptions and derived figures appear like on screen nothing that imply noting that implied net income is is $95.583 billion, just to say it again, which is consistent with a $185 share price and the price earning ratio of 30%. Moving on to our next step, which is represent. So here the parameter inputs would be buyback size, share price, share outstanding, cash, debt, interest rate, and tax rate. And the outputs would be shares repurchased, new share count, EPS before and after, EPS percentage change, Berkshire ownership percentage, net debt before and after, stakeholder cash received for dividend and scenario ROIC discussion. And the chart that I have is an EPS bar chart, which as we go further into the code, I will show you. And there's also a small table, a small table summarizing stakeholder outcomes. So my model will take the $90 billion buyback and compute the mechanical financial impact, which is how many shares are repurchased, how EPS changes and how net debt moves. I'll also produce simple stakeholder calculations, which is like what a retail holder with 100 shares receives under dividend, how institutional ownership changes under buyback and how debt pay down alters interest expense. So this takes us to our next step, which is the implement step. So as you can see, the code is already in there. I've already put the code and run it. So as I said earlier, you get this table and you also get a visual table which has earning per share table. So I will, of course, talk about it as we go through it. so here are the model outputs. I'll read the most important numbers and interpret them and then I'll present the exact arithmetic so you can also follow. So the key calculated results first As you can see in the table, so for a base case, which is you do nothing, the EPS was $6.1667. Then the shares were $15.5 billion and the net cash, which is like the net cash position is $55 billion. Moving on to buyback, which was like buyback $90 billion. So here the shares are, repurchased would be 90 billion dollars divided by 185 which is which um goes to about like 400 and 0.4865 billion so and the net shares outstanding is somewhere about 15.0135 billion dollars Not billion dollars, just billion. Lost interest income after tax and deployed cash would be $90 billion into 4% into in bracket 1 minus 21%. Bracket close. So this would be $2.844 billion dollars. The net income after lost interest is $95.583 billion minus the $2.844 billion, which we get the result as $92.739 billion.  Moving on to our new EPS. So here, of course, I'm going to divide the $92.739 billion divided by $15.0135 billion, which gives us $6.1771. Here, the EPS, which is earning per share, increases by 0.17%. And then the Berkshire ownership also rises from 6% to 6.194% because they likely don't sell proportionally. Moving on, the net position would be, so cash after, in terms of net position, the cash after buyback is equal to $165 billion minus $90 billion. This brings us to $75 billion. And so we can calculate the net debt, which is $110 billion minus $75 billion, which is equal to $35 billion in net debt. So this moves from net cash of $55 billion to net debt of $35 billion. Moving on, if we talk about special dividend, which is $6 per share. So here the total payout would be, we would calculate $6 into $15.5 billion. Sorry, $6 into 15.5 billion shares, which is equal to $93 billion, which reaches to approximately $90 billion objective. So it is around that, which is a good thing. Then moving on is the lost interest after tax we would do is $93 billion into 0.04 into 0.79, which gives us a result of $2.9388 billion. The net income would be then you subtract $95.583 billion minus $2.9388 billion, which and this gives us the result of 92.6445 billion dollars the earning per share here is almost 5.9771 um dollars here the eps falls because shares and shares are unchanged but the net income slightly lower and the price also drops by six dollars ex-dividendNow, if you look at debt pay down, which is of $90 billion, interest savings after tax is $90 billion into 5%, which gives us $3.555 billion. Let's see what else. Net income effect would be $3.555 billion minus the lost cash yield of $2.844 billion.  which is which is an increase of or like which gives sorry, which gives us 0.711 billion dollars net. And so the new net income is ninety six point two nine four three billion dollars. Moving on to the EPS, which. would be 96.2943 billion dollars divided by 15.5 billion which gives us 6.2125 dollars and here the eps increases more than buyback in this mechanical model so So this is the data frame and this is what it defines. And as you can see in the table here, the base case is given as $6.16. The buyback is given as $6.16. $6.18, the special dividend is $5.98 and the debt pay down would be $6.2. So the debt pay down produces the largest EPS bump here. because interest savings exceed lost cash yield after tax. And the buyback produces a small EPS accretion, which roughly goes from $6.1667, and it goes from there to $6.1771. So the special dividend reduces EPS and produces a cash transfer to shareholders. Now moving on to our next step, which is which is the value date so if you if buyback size shrinks to 60 billion dollars shares repurchased repurchased fall false eps accretion is smaller if buyback expands to 120 billion dollars the cast cash position drops further causing higher leverage and larger eps effect but rising financial risk too. So we must validate that EPS accretion is not an economic return. It can be a mechanical outcome of fewer shares. True value creation must show higher ROIC or sustainable future free cash flows. So let's check the net debt move. Apple ships from $55 billion of net cash to $35 billion of net debt. This is a meaningful structural change. The company crosses from net cash to net debt. That matters for ratings and covenant risk. So this was my validate part. Moving on to Evolve. So here... If we just quantify the stakeholder outcomes, the retail shareholders are 100 shares. So if you look at under buyback, they own marginally fewer shares in the float, but their percentage ownership rises slightly if others don't sell. And mechanical EPS rise is tiny. There's no immediate cash and potential benefit from share price lift. if market rewards the buyback. And under $6 dividend would be immediate cash would be $100 into $6, which is $600. And share price likely drops roughly $6 ex-dividend. However, some shareholders prefer cash now. So you have to keep that in mind. I'm Moving on to the institutional holders, this would be, which is example, Berkshire, 6%. So here, buyback. In buyback, Berkshire's ownership concentration rises from 6% to 6.194% if Berkshire doesn't sell. So that increases their voting power and share of future earnings, which is good for long-term holders. And under dividend, ownership is unchanged. Under debt pay down, the percentage is unchanged, but firm risk profile improves at the same time. If you look at management, CEO, buyback benefits management if their compensation is stock-based, which means EPS increases, potentially raises performance metrics. If options vested at $170 strike, Buyback reduces outstanding shares, slightly improves per share metric, and may increase option value. This creates a potential agency issue, and the management may favor buybacks to inflate short-term EPS and share price linked pay. So the employees... with $170 strike options for them they have option value which means intrinsic would be $15 per option now and the buyback may increase share price modestly which means the dividend doesn't change option intrinsic but reduces company cash The R&D or acquisition could increase long-term stock more than a buyback. So talking about bondholders, moving from net cash to net debt increases leverage and may worsen credit metrics. Debt paydown improves safety to bondholders and buyback transfers balance sheet liquidity to equity holders while also increasing net leverage. so which is basically a transfer of risk my last um step is reflect so if we talk about value creation versus transfer so here technically the 90 billion dollar buyback produces slight EPS accretion or EPS increase, which was an increase of 0.17% and increases institutional ownership concentration. But it converts Apple from a net cash position into net debt of $35 billion. The buyback is partially value transferring. It returns capital to shareholders while increasing balance sheet risk for bondholders and reducing available cash for long-term investments. Debt paydown mechanically produces a higher return. produces higher EPS improvements in our simple model because interest savings exceed lost cash yield after tax. The $6 dividend is a transfer of cash to shareholders but reduces EPS and liquidity. An acquisition or R&D could create true economic value, but only if ROIC is greater than the cost of capital, and that requires deeper diligence on potential AI deals, which we do not have in this assignment.  My recommendation is I recommend a hybrid allocation. We use a $40 to $50 billion for targeted buyback to signal confidence and return excess capital. And then $30 to $40 billion to reduce debt and keep $15 to $20 billion reserved for strategic R&D. or any other investment contingent clearly on defined return threshold. So here the minimum expected ROIC should be greater than the WACC. But my reasoning here is this preserves balance sheet strength, reduces agency risk, provides shareholder returns, and retains optionality for value-creating investments. If management cannot credibly demonstrate RIC with greater than WACC for acquisition or R&D, then debt reduction plus modest buyback dominates a large unfunded paycheck. And large aggressive buybacks can signal management's belief that a stock is undervalued. However, they can also be a way to boost EPS for compensation reasons to mitigate agency risk, link buyback authorization to strict conditions, which, as example, maintain minimum net cash of greater than $50 billion, net leverage ratio not to be exceeded, etc. not to exceed X and require independent board review and publication of expected IRR thresholds for any acquisition. So this was my session 11 assignment. Thank you."
}