{
  "student_name": "Graham Hubertz",
  "org_defined_id": "036212822",
  "username": "ghubertz",
  "email": "",
  "transcript": "Hi, my name is Graham Hubertz doing the session 10 assignment for Management 310. So assignment overview, evaluate Starbucks' proposed flagship roastery that requires a $20 million upfront outlay and is expected to operate for 10 years. Use the firm's 8.5% weighted average capital cost as the hurdle rate to determine whether the project creates value and to recommend and accept slash reject decisions supported by driver documentation. Our initial investment is $12 million, which is our building, equipment, and training, depreciated straight line over 10 years, working capital, which is $500,000, deployed at launch and recovered in year 10, revenues of $8 million in year 1, $11 million in years 2 through 5, and $9 million in years 6 through 10. Our operating costs, our cost of goods sold is 40% of the revenue. Labor is $2.5 million. Rent and utilities is $800,000. Marketing is $300,000 in year one, then $100 ,000 thereafter. Our taxes is 25 % corporate rate. Terminal value is $3 million at the end of year 10. So we're going to use the driver framework. So I put this into Google Gemini, and this is what it gave me. So the primary goal is to determine if the project's net present value is positive when discounted at 8.5% WAC, and thus whether it creates value. So our driver documentation and cash flow model. So first we do discover. Our project is Starbucks flagship roastery. Our initial outlay, $12 million. Our hurdle rate, WAC, is 8.5%. Our project life is 10 years, and our tax rate is 25%. Our key cost, cost of goods sold, is 40% of the revenue. Fixed operating costs $3.3 million per year and slightly higher in year one. So R, represent a cash flow, modeling, the core. This section develops the annual free cash flows for the project. So one is depreciation schedule. The $12 million initial investment has depreciated straight line over 10 years. So our annual depreciation equals initial investment over project life, which is $12 million over 10 years, which is $1 ,200,000. Our annual free cash flow calculation, our FCF, equals revenue minus operation cost minus depreciation times 1 minus the tax rate plus depreciation minus the NWC. So, are all figures in millions of dollars, year zero outlay is minus 12.0, investment minus 0.5, times NWC equals minus 12 .5 million dollars. Are year 10 adjustments, terminal cash flow. Are after tax salvage value, terminal value is $3 million, as our terminal value is usually assumed to be after tax unless specified otherwise. But for simplicity, we'll treat it as a final cash inflow. So, our recovery of net working capital, NWC is plus $0.5 million. Our total year 10 FCF is NOPAT plus depreciation plus terminal value plus NWC recovery, which is $600,000 plus $1.2 million plus $3 million plus $500,000. So, which gives us $5.3 million. So, I implement capital budgeting metrics. We use the 8.5% WAC to calculate the discounted cash flows in core metrics. So we do our net present value, and our net present value is $3.67 million. So our internal rate of return, the internal rate of return is the discount rate that makes MPV equal to zero. Our internal rate of return is 13.1%. Our payback period, the time it takes for the cumulative FCF to equal the initial investment, $12.5 million. dollars. So the payback occurs in year five. Our payback period equals four years plus 2.3 million dollars over 2.7 million dollars which equals 4.85 years. So V we go to validate which is sensitivity analysis. To validate the decision we test how sensitive the NPV is to changes in the two most variable and impactful inputs revenue and whack. So the project remains value creating MPV more than zero, even with a 10% decrease in all revenues. This indicates a good margin of safety. The project's IRR of 13.1% is significantly higher than the 8.5% WAC. So E, Evolve, Executive Recommendation. Given that the project core's metrics are favorable, the decision is clear. Our recommendation is accepted. Our rationale is value creation. The project generates a positive MPV of $3 .67 million, meaning it is expected to create value for Starbucks shareholders. A return? The internal rate of return IRR is 13.1%, which is significantly higher than the firm's 8.5% hurdle rate, WAC. So our risk profile. The sensitivity analysis shows the project is robust. Even if revenue is decreased by 10 % across all years, the MPV remains positive at $0.86 million. So, our reflect, our lessons learned, our next steps. So, the greatest vulnerability is the assumed revenue stream. The model assumes a significant jump in your revenue from year one, $8 million, to year two, $11 million. Our next steps should include refining the market research to ensure that year two to five revenue forecast is achievable, as it is critical to quickly recovering the initial investment and working capital. So now we go, I put this into Python code on Collab, and this is what we have. Our variables. And it goes through each step, as well as calculating the net present value, the internal rate of return, our payback period calculation, and more. And our recommendations accepted. And that's it. Thank you for listening to my session 10 assignment.",
  "video_url": "https://youtu.be/KLr2MXC4TYo"
}