{
  "student_name": "None None",
  "org_defined_id": "037005845",
  "username": "ali243",
  "video_url": "",
  "transcript": "0:01 Hey, how are you doing, my name is Rahman Ali. And today we were told to make an API workflow. It was really hard and uh, I'm pretty sure I could generate.\n0:10 Okay, so let's start because I only have five minutes because this is, uhh, use any other similar work for a platform.\n0:19 So I need to make a pot to build my own finance tool. So that's all I had to do. A little bit of a harder how to do a lot of stuff.\n0:27 I had to watch all the YouTube videos and do it. But, it was, you know, it was actually really helpful and I didn't learn a lot.\n0:32 Alright. There's not really much, there's no graph, there's no chat duty, there's no AI, there's none of that stuff that I have to show you this time.\n0:38 It's just very simple. I'll show you my work when I did it. It did take me around an hour and a half, it did take long.\n0:43 Umm, I can tell you exactly what we needed to do is just, all I needed to do was build a very basic AI powered finance.\n0:48 Personal finance tool. Keep the support making useful. That's exactly right there. Umm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm.\n0:57 . I'm, uhh, creator free. I already did all this. I created a loop and I created three loops actually. Requirements is core A functional.\n1:04 I did all this. So, let me show you guys what I did. So, I built right here. So, this is what I built, you know.\n1:12 So I'll see you right here. If you look at it, I built an AI, an AI, he receives messages. When he receives messages, he uses ch- right between all the brain and then he, this is the memory, this is the total memory.\n1:25 He uses this to do it and then they get sent to this right here. Alright? So, I made it simple.\n1:30 ball. I made it really, really simple. I made it, I was like, I made it really, really simple. Umm, just.\n1:39 We'll talk to kind of figuring out how to track all my money. Basically, if I'm, I'm a business man, so if I make $20 today, I'm gonna, uh, how much, it cost me, then how's my profit?\n1:52 And then if I have any expenses today, alright? So, let's, let's go start. Let's ahead and good start. So, let me explain to you.\n2:01 Sorry that a bunch of tabs opened. That's why it's a little hard. I'm sorry. Okay, so I'm going to do the chat.\n2:07 I'm going to do the chat. But I can tell him. Hey, I mean. Okay. $20 today. And, eh, costin'. Me, uh-huh.\n2:23 It costin' me $5. I also- Oh. Spent $5 for gas. Thank guys.\n2:38 Alright. It's gonna, it's gonna process, use the brain, and then it's gonna confirm with me. So confirm. And then it's gonna, it's gonna send it to her Google Sheets.\n2:53 She's sending it to her Google Sheets. Now that it's sent to her Google Sheets, I'm going to check on it and make sure I wait, let it finish.\n3:01 Work for the user. But when you come here, it'll show luck. I will say, $20, how much you made in, how much did I spend, how much it cost in me.\n3:10 It was $5 for gas, which is cost, and then, and then I also assumed I spent another $5. dollars. for what I said to $10 total.\n3:21 $5, gas is $5, which is why it's out. And then, umm, the other- by the other is $5 for the cost, how much it cost them.\n3:29 So, $5 for gas and $5 for the cost of the product. And total cost me $10. And the product was $10.\n3:36 Basically, I had, I bought, for example, say I bought AirPods, I bought AirPods for $5. dollars. And it took me $5.00 to go to the person to sell it to.\n3:46 And I sold it to him for $20.00, which is my end. And then, my cost is $10.00, $5.00 for gas and $5.00.\n3:52 And for the actual product and the profit was $10.00. And basically, I always said, let's say anything. Hey, I made $5.00.00.\n4:02 The item costed me $155.00. You $15.00. Let's try to make a little more calm, please. He's gonna run the b- As the agent, I'm gonna say, calm, calm, firm.\n4:25 Nah. You that I confirmed it. It's gonna process it, it's gonna send it to the Google Sheets and then bam.\n4:32 When you come here. You're, You're, It's gonna say in $500 cost $255 and the profit was $34,000 for cents. That right there explains exactly- what we needed to do.\n4:43 Create a bop, create a AI agent bop, and have it do a simple finance tool for us. What I had was how much I spent- I'm a business man, and I don't know how much money comes in, and I don't know how much money comes in.\n4:54 And this thing will actually be useful on my day-to-day base. Thank you guys very much, and I hope- I'll see you guys next time.4:59 Bye. Bye."
}