{
  "student_name": "None None",
  "org_defined_id": "035836182",
  "username": "alenig",
  "video_url": "",
  "transcript": "Hi. So, today uh this is my project for\nproject three. Um and I built uh\nbasically a stock analysis um AI. So,\nit'll go through go through you can\nenter whatever stock you like. Uh it'll\ngo through look up the uh the price, the\npast information, history,\num some of the other some other like\nuseful information, company news, things\nlike that. Uh and based on all that,\nit'll give you a decision on whether you\nshould buy the stock, not buy it, or\nhold on it. Um and then give you some\nreasons why. So how this this chain\nworks, um there's a company input form.\nSo you put in what company you'd like to\nlook at, uh configures that work the\nworkflow, and then we get into the AI\nbot. Um it'll let\nDon't know why it won't let me zoom in.\nUh anyway, basically what it does um has\nthese different nodes. Uh it has a chat\nchatbot. Um I was using Claude for this\none. So uh this one uses Claude. Uh\nstock price data tool. So it gets the\nstock prices uh that it needs. Um and\nthen company news tool. Uh I guess I\nshould note this now. Um my first\niteration did not include company news.\nIt just had um the chatbot and the price\ndata. Uh, so I don't have a version\nspecifically for the first iteration,\nbut uh once I did that, I figured might\nbe good to add in some company news to\nsee, you know, what they're saying about\ntheir company and uh how their company\nsome changes that might be happening\nthat might end up affecting stock price.\nSo, so that's the difference between my\nfirst iteration and second iteration. I\njust don't have the different forms for\nthem. Um, so yeah, so it has a node for\ncompany news. um adjust the analysis\noutput. Uh so it runs through this and\ngets all the information it needs. Then\nuh it moves over to formatting data. Um\neverything goes to a Google sheet. So it\nmake sure it formats the data uh to all\nwork well and then sends it to the\nsheet. So we'll go through a little\nexample here. Um click execute workflow\nand then I've done Apple and Tesla. So\nwe'll do Microsoft\ngo. So then you just click submit off\nand it'll run through.\nDoesn't take too long luckily. So\nobviously it's got to run through\neverything, but um doesn't take forever.\nThere we go. Okay. So, runs through\nthat. Everything tells you it\nsuccessfully went through the workflow.\nThen we clicked onto this sheet here and\ngives data. There was originally going\nto be a chart. Um, I wanted to make a\ngraph like showing past stock prices,\nbut I was working on it for a couple\nhours and it would not I could not get\nit actually set up. Um, so I tried the I\ndon't know why it wouldn't work, but uh\nmaybe at some point that's something I'd\nlike to add to this. I think it'd be\npretty helpful for an analyzing uh the\nstock. But so it gives you the date uh\nand time of when when you put in the\nrequest. Uh gives you the company. So,\nMicrosoft tick uh and then gives you the\ncurrent price. Um and then some price\nchanges. So, this one tells you about\nMicrosoft's price changes. What within\nthe past year?\nYeah. Uh then it gives you its\nrecommendation. So, for Microsoft here,\nit's saying buy. Um you can see I looked\nat some other ones when I was testing uh\nTesla and Apple and it said both of\nthose to hold. So, it'll give you\ndifferent recommendations.\nUm, and then a long list of\nrecommendation reasons. So, you can see\nhere we go. Um, it gives a good list of\ndifferent things, AI leadership, cloud\ncomputing dominance. Uh, basically a ton\nof different things on that specific\nstock. Um, that might make it seem like\nit's a good thing to invest in. Uh, and\nyou can definitely look through and read\nthose, but yeah, gives a pretty detailed\nuh, recommendation.\nAnd then it gets into some technical\nanalysis. Um\nso tells you about uh how they've kind\nof moved in the past.\nUm and then some risks. So uh obviously\nwith any stock it's going to be a risk\ninvesting in it. So it tells you some of\nthe general risks that are going to\nhappen or could happen. So like in this\ncase market risk um is always going to\nbe there. company specific risks, uh,\nsome of the ones that happen with that.\nUh, volatility, stuff like that. Gives\nyou the beta, which is nice. Um,\nand then some key news. Again, that's\nwhat I added in my second iteration. Um,\nand tells you about some of the new\nnewer things that they're kind of going\nthrough with. Uh, so like their new AI\ncapabilities,\ncloud computing, all that good stuff. So\nagain, just gives you a pretty detailed\nbreakdown of the stock and how it might\nlook in the future, how its past results\nhave been, and then finally gives you\nopinion uh on whether it recommends\nwhether to buy, sell, or hold. Uh\nbasically what to do with that stock. So\nyeah, that was my project. Thank you for\nlistening."
}