{
  "student_name": "Kayla Lee",
  "org_defined_id": "037191790",
  "username": "lee4991",
  "email": "",
  "transcript": "I am gonna start my session eight. assignment about the market efficiency investigation. So first we're trying to investigate the GameStop case study that happened in 2020, uh looking between the efficient market hypothesis and also the behaviorals behind the market efficiency. So I'll go more in depth between those two because those were the main uh points between. And so first of all, this statement saying the GameStop traded at four cents and in August 2020, that is inaccurate. I use the data from the Yahoo Finance, that was my source that I used for all the graphs and all the equations and those will be the data points I will use throughout my analysis. And so this is the data I use, it was actually a dollar and five cents, which is still low, but it's very different from the four cents given here. I'm also gonna explain, I'm first gonna show the... the... analysis through using the Google Pro Gemini and how I was able to incorporate that into the Python code which will show graphs and an analysis using equations and modeling that will be a good visual to see and then how that relates to why the game game stop is affected throughout the markets using the EMF and then also the behavioral analysis. So first of all this equation. one of the models, this uses the capital asset pricing model. So we find the rates and the assets using this equation. This is one of the main equations that I use for this graph that I'll show you in a minute. And then also the anomaly, which I'll explain later on. m So the first main issue with this whole situation, this case study was the different forms of the market efficiency were violated. So first, the weak form here was violated because we can't go past the trading data that we already have. The semi strong form was annihilated because this was also a core violation since all the publicly available information was already reflected in the stock price. Therefore, in efficient market, it wasn't incorporated. And so we just kind of neglected that information for the semi strong form of the market behavior. And then the strong form just also wasn't relevant at all, since it dealt with private information. So it wasn't public for us to really use. So this event didn't correlate to the private data, we are looking specifically into the public data. oh And then also following with the driver technique, what are we trying to solve? What are we trying to explain? I'm trying to explain why this case study is so important, just because you would initially think, oh, in the market, you can't predict what's going on, but there's certain safety nets that you can hold yourself accountable with your company to try to make the most amount of profit or most amount of, you know, with the asset ratios, what would be the best investment? But also you have to look behind the behaviors of it. as well. Obviously, the efficient market hypothesis, you kind of have a baseline of what's going on, but specifically, there's different behaviors that I will go into. So for example, hurting, overconfidence, loss aversion, anchoring, those are the main components that kind of built the catastrophe with within GameStop. Because, know, investor with the hurting, all the investors were going in, which affected the smaller investors and also just a smaller analysis, so much was going into specifically GameStop and the hurting, which affected the market price. So many people were going into it. There wasn't a good end result from it. Overconfidence. Some investors just also overestimated their skills and also just kind of how much GameStop was worth. This was also, I would like to note, was also extremely temporary. Sorry, it was temporary with the public information. We just didn't see the live up-to-date information about it. So some things were inaccurate price or the percentages investments the marketing behind it. So that also affects the behavioral factors because everyone was trying to join into the crowd and cause you know the issues with hurting and then the last two loss aversion anchoring. So it's also just the psychological behind the investors. It was so much going into it which caused such a huge issue and then also just anchoring so like I said before the data was wasn't up to date therefore it was kind of arbitrary data people were kind of guessing predicting it was pretty random so that wasn't the best result I also would like to mention this data I mean this graph that I created just to kind of show a better understanding between the different forms so the weak and the semi-strong and the strong form about all that information and how that affected it So obviously the weak form was there or was violated. The semi-strong wasn't even acknowledged and there wasn't a need for the strong form information. The main issue with this case study also was the fact that there was a glitch in the market, which means there was an abnormal return. So you can see this equation pretty simple. It's the actual return minus the expected return. We see that with the abnormal return if it was really large you see there's a lot of something that's unexpected and that makes sense with the different behaviors because with all these different behaviors happening obviously the the stock will decrease and it won't be as much of a return in the investment as people were hoping for. I also would like to mention as a result with this event we also noticed the issues with the arbitrage arbitrage um with solvency and just like the market risk as well because the arbitrage is supposed to be the safety net from all these issues, but we actually can see deep down of how they all actually affected each other and how this certain behavior affected the the effects of the arbitrage and then how that also vice versa affected each other. So since I kind of represented all the data points, how am I going to implement this? I implemented this by using Python. To use for the Google Co lab to know the market also failed because of the lack of the critical information Hence the weak form of the data. So there's also short interest that peaked at 140 % of the public flow So that was neglected and that wasn't it should have been priced in but wasn't so therefore the stock trading and the premiums were kind of reflected that and it was a short squeeze So that's why the game stop case study can also be a lot of people mentioned short squeeze behind it. So it was 483 per share but it wasn't driven directly from the company's fundamental assets and values, which was only 10 to 40 dollars. But everyone kind of realized how the structure was working and so hence the different behaviors. Everyone was just hurting to the crowd. Everyone was like, oh this is such a large amount of money, let's go in, let's get into all that. And so this affected all the different financial modes. behind it and also just the normal behaviors. That's why this is also a really special case because it's not triggered by the traditional market participants. It was kind of affected by like social media and just the behaviors. So people were thinking more with their head. but not, or people were thinking more about what was kind of going on, what they're kind of had wanted, but not initially taking a step back what was going on. I use the Google Pro Gemini, how I implemented this, want, like I said before, I use the code. So I first kind of put in the data, asked it to create a code using the data from like August 2020, which is like what it started. It's like the low amount of like force sense, that was like the inaccurate data. I asked it to create a code and here shows, I did a couple different reiterations, but the final product that I want to show has this craft. So as you can see, let me make this a little bit bigger. As you see, there is timestamps between the 2020, 2021, that little short squeeze here. We see how much the actual GameStop close price was, and then also the trade value, mean, trade volume. So you see. lots of millions of the trade was implemented and then this is how it kind of went up. So looking at that data, it reflected on these different key points. Let me go back to here. I want this to be... easily visible to understand, let's say in a day process within the stock market and how the market efficiency worked. So this shows each day in 2021, it shows the close high low open volume. So, you know, the open right when the market opened, how much it was the lowest it was the highest it was and then when we close the market for a day. this shows the number of logistics behind it and also the volume you see there. so many people, you can see the increase, so many people were falling into the crowd with all that behavior, know, main emphasis on hurting, I feel like that was the most prominent one between the people and you can see that because the amount of people that just joined into this stock just increased significantly. Then it kind of died down once people realized what was going on within the market. The value wasn't as valuable as they thought it was initially. I also wanted to create more data sets that had a better explanation of what was going on and also just kind of visualizing in a different aspect as well. So this model here. This model right here has a better representation with more analysis. So you can see the average price of the game. So you got to compare it also from 2019 game. So why would every why would people just kind of go up to GameStop? You see the difference between 2019 2020. That's why this case study is also highly regarded because you see such a big difference between what happens with everyone's behaviors. Everyone wants the money. Everyone wants to be where the money is. So you can see the squeeze peak of when everyone, you know, when everyone bought the stocks and joined in within the market and then the close price. So you can see here that the Ryan Cohen stake is here early on in 2020, right when it was happening and then kind of how it shot up and then also kind of how it was dying down with that. to know Ryan Cohen, who is the CEO of GameStop. So he had a large percentage of the shares, obviously. And so that also affect, that had, that was a big point in the analysis as well. So that is the code. Let me reiterate this one one more time. Oh wait, that was just the graph. Okay. Like the graphs I showed you before, some of those numbers, how did we get them? Like I said before, we use these equations that show that took analysis behind the expected return for GameStop, the risk free rate, the T-bill, and the market return between these as well. And also just the riskiness of the whole process. Like I said before, you can't predict how the market's going to be, but there is a sense of regard and kind of a framework that you should follow. And that's why I was causing such an issue because everyone had a behavioral issue with it, but also a bias, which is what I'll get into. So arbitrage, that is what limits all these risks or at least helps the market in that aspect. We can see with this specific case study, the rational investors, people that should have known what was going on, they are supposed to be aware of their stocks are overvalued or issues like that within the GameStop, but this whole process or this whole story or not story case study Proof that this can be destroyed as well. So these two major risks So the retail herd acted irrationally and also in unison which made the price even jump higher than it should have been and then the solvency risk that is the main a thing that was kind of affected using the arbitrage. So we see, you know, different like hedge funds that had that like try to correct that the game was overvalued, but they had to liquidate because of the different issues. So in like January 21, other factors in the market that kind of just affected these different companies as well. Also to validate this discovery and kind of the data analysis behind it, I added a iteration into the code here. So we kind of see visually why these numbers equated to that. Why was there such a big jump in that time range or in that time frame within GameStop? And then now market everyone's pretty irrational about it so it kind of remains solvent in that case and here these are the different cases of just kind of how we approach it so It was recommended to just kind of have a passive investment strategy behind it. So the EMF, while it's important, it's also imperfect. It provides a baseline for passive investing. We can see if like, if markets are efficient enough, but also statistically we can see behind it, why it might consistently outperform or underperform uh the market behind it. And so this kind of shows as a warning and this is a big lesson for lots of hedge funds and just firms and such being aware of what's going on with the management behind it. And here, like I said before, it could be obliterated by just behavioral risk. You can't predict behavior. Unfortunately, I mean, there's psychology behind it, but unfortunately, these behaviors, it's gonna... Snowball and that's kind of what we saw like GameStop with those effects and then this is the case for the active management While obviously those behavioral there are some activeness to it people saw them on where was the money going? That's where I want to be a lot of people were going to where the market was With that money and all of that momentum and value as well. I would also like to mention aside from behaviors and the EMS you can also just acknowledge the risks behind it as well. So in a related sphere of market friction, leverage corporate structures can incentivize asset substitution or risk shifting. So you should be aware of these issues because it also just kind of serves as another example of how rationally people can also just exploit how the system and the framework of the market works together, which can also just lead to inefficiency and also just destroying the simple models as well. Like I said before, did do a couple reiterations of this just to make it more accurate. Obviously, I couldn't keep the first iterations because I was adding on to the final one. But in the beginning, I didn't have a graph. I wanted to kind of implement it be visually available to also validate it. And so that's why I kind of created this graph as well. And does make sense overall, it does make sense. And the fact that I remember hearing about what was happening within the market and how GameStop affected and how of a catastrophe it was, and it makes sense because at the end of the day, while we do know the technicals behind it, the professionalism is extremely important. The behaviors behind it, especially with the market. It's kind of how people feel about things. And I feel like that was just something that was emphasized and you could see that it was brought to light uh about it. And then, there a better way of doing it? I think having it visualized is good, because you see that first, they thought it was so much more in value, but... It wasn't, what was it? They lacked public information, was a keeping error, but you thought that the share was $483 each. But it was only estimated to be what, $1040? And then at the end of the day, $1.05. That kind of shows the inaccuracies and kind of the risk that you have to be careful with in the market. Also, I forgot to mention that since it was obviously overvalued, we know that. It also just lacked the infinite capital that needs to have such a high stake in the market with a company with that type of value to also just remain solvent against a different price surge. Also, we see issues, obviously, a lot of people were upset there was issues within the market and the brokers also just had to stop buying, which affected everything else in the market as well. companies kind of had a domino effect that affected each other specifically within the market. And then this cycle also caused more collateral risk in the market, aside from what we already were expecting just from the GameStop value. So this kind of all ties together because you realize how for a success in the company, even a success in trading, and per share in the market, all these little factors come together. I noticed specifically that it really comes down to, at the end of the day, we're all people. We all have different behaviors. When it comes to money, people will have different opinions and ideas and options. These four main behaviors is what really made the GameStop issue and kind challenged the efficiency model hypothesis and went against what the EMF was EMH was supposed to do because we all have a certain bias that affects that affects our judgment as well. And then these also three effects were all come to play at one point, the momentum effect, the value effect and the size effect. So kind of see how maybe the smaller socks, you know, how they're tended with the the value stocks and just kind of how they might uh outperform the growth stocks and then just the momentum between, oh this stocks kind of winning, this stock is losing, we should go to the winners, eventually affecting the behavior of hurting. And so those were the main key points of that. ah from this process really focusing on kind of more the professional or behavioral side of the market. kind of learned on the past couple weeks touching base on what we did, what's going right technically with certain equations that thanks to the Google Pro Gemini, some of what it was asking for specifically within the equations, I was able to use that to create the pie down code for the colab to have a better visual visualization of it and then overall overall we see you know consequences of your own actions and I depth I deep dive more into which approach would have been the most responsible and I made the conclusion of using the passive allocation. Having more of a passive approach while there are pros and cons for each one, it utilizes the baseline market efficiency the best. You still want to use that model because that gives a big framework and base work of how it should be but also kind of protects the investors. Obviously so many people coming in that's that was the main issue with GameStop but being able to kind of protect them kind of understand what's going on has a better approach and it's more on more aware and less catching someone off guard with how the market goes back and forth and it also just limits the effects of the arbitrage. That was my analysis and just explanation about kind of how everything worked for the GameStop short squeeze event in 2020. That short squeeze were kind of, you know, spurred up and all of that. We see, we also just see how you know, Ryan Cohen, how he got that stake, how that affected it, all the price search to $483, which was accurate that this was given this right here. It's not accurate. according to the Yahoo Finance. And just see how it peaked, you know, 140%, how we see the squeeze affecting the market efficiency, the losses behind it, what actually was the share amount, which is only estimated to be $10 to $40, depending on the time of the market, and how all of the different forms that we need to be aware of when making these decisions were violated, looking at the private information, looking at the public information. and how that EMF EMF EMH sorry EMH model almost contradicted the behavior or at least it wasn't prepared for the behavior behind it and then the anomalies for that and then also these rational investors systematically while they thought they were profiting off of it, they weren't fully considering how it would affect the market. people in the very beginning, not to say probably got something out of it, but eventually the ones later in the crowd didn't. Thank you.",
  "video_url": "https://youtu.be/YGvbnwhf9PA"
}