{
  "student_name": "Leon Francis",
  "org_defined_id": "037379655",
  "username": "franc103",
  "email": "",
  "transcript": "This is my session 10 uh assignments response. So let us start off with the define and discover stage. So the goal for this assignment is to evaluate whether Starbucks's proposed flagship roaster creates enough value for the firm and decide whether to accept or reject the proposal. So let us look at some of the key information provided to us. So if you go to the assignment, we can see a brief insight into what we're supposed to do. We we we also receive a whole bunch of information about this uh proposed um project. So we have the investments involved in it. the working capital which refers to a set amount which you put in to at the start and you receive the same amount at the end of the um the invest or the project. We have revenues for each of the different years and how they vary between the years. We have operating costs and this is quite important because there's multiple different aspects that go into this operating cost um factors. So you have cost of goods sold um being 40% of the revenue. You have the manual labor costs. You have the rent to the facilities and utilities. You also have the marketing costs and so on. And you also of course have the tax rates of 25%. And a terminal value also known as the salvage value of the model being 3 million at the end of year two or year 10. So here are the required analysis and I'll be going through each of them in the different stages that we follow in the driver framework. So let us move on to represent frame or represent stage. And what I want to do here is just take a step back and synthesize or uh summarize all the information that was provided to us to just have a stable platform to begin our work on or analysis. So if we run the code here's a perfect summary of the information that's been provided to us. So we see that the proposed project duration is of 10 years. The discount rate is the same is actually the weighted average cost of capital. So the minimum return required for the company to keep the investors um happy in the sense or investors engaged to invest more in the company. So that is 8.5%. We have the corporate tax rate that's applied to Starbucks is 75%. We and then here's the information on the investment. So we have the capital investment at the year zero of actually you know setting the project up or buying it is $12 million. Then you have again as I said the working capital of 500,000. And this is interesting as we also have a depreciation method uh which is straight line over 10 years. And I'll be going through over this um in a bit, but what it is essentially saying is that the project or equipment that we have is going to be depreciated over 10 years by a set amount each year um to a terminal value of $3 billion at year 10. Then operating data, we have again 40% of revenue, fixed operating costs, marketing cost, and here's the clear revenue schedule. So for the first year we have $8 million um of revenue coming in. For the next four years we have $1 million and for the final 5 years we have 9 $9 million. So this kind of reflects the um different stages. So um how do I say different stages in terms of setting you know the slow growth when the equipment building or the whole setup is um initiated then we have the stable growth at $1 million and then the final decline growth around $9 million. But this is just a hypo hypo uh a expected or assumption that we're making that this presents the growth trend of how the revenue will change. Now let us move to the implement stage. Now here we have a lot of different equations to go through. Um so let's just get straight into it. So we have all the information from the represent stage already here and there are different values that we want to uh calculate. We have operation operating costs. We have depreciation, the earnings before income taxes applied. We have the actual taxes, the net operating profit after tax. We have uh many more um cash flows, a terminal cash flow and capital investments, but we'll look into it later. So the free cash flow is the capex at year 0 plus the net worth change at year 0 as well. Now the annual depreciation as I said is the same appreciate uh amount being depreciated each year. So you see the project year is 10 years and then capex initial value is from right here. So additionally some of the other costs that we will be using or uh factors you'll be using is the uh earnings before income tax. So this is given by revenue minus operating cost minus depreciation. Okay. We also have the taxes and we know the taxes amount equals to the uh earnings before income tax times the tax rate. We also have the net operating net operating profit after tax. So that is just the uh earnings before income tax minus the taxes and then operating cash flows of this value plus the depreciation. These are all different uh values that are considered when making a financial decision and each of them provides a great role in um helping us understand more of the um what kind of values and what kind of situations are happening behind the problem so that we are better informed before taking the decision to go ahead or um step back from setting up such a project. We also have the net uh present value calculations that we have to do and that is quite important because that's the main factor or concept used to determine if it's worth it or not to take the project and I can also combine the validate stage here because if you look at the equation um I can just show it soon. Yep. Net present value is the cash flow divided by 1 + D. R here would be the weighted average cost of capital. And if we go back to the code, it's using that same, you know, minus t minus the cash flow times / 1 + the rate raised to the um oh it's here raised to the um time the respective time. We can see right here sum of cash flow. So we know the code is using the exact same equation. So that's in a step of validating that the code is using the correct values and then we just know that the net present value is just going to discount all the cash flows from the different years as we know over the years the um value is going to be weaker. So we discount all of them to present worth just to have that stable value that we can use to evaluate whether the inflows are greater than outflows and so on. So if you look at oh yeah um the actual outflows or output here is a clear um cash flow timeline and we can see the total flow of cash flows. So year zero it was uh $12.5 million and it's here in thousands but the $500,000 from the working capital and then the 12 million from the investment. Then we have 8 million in revenue but we also have operating costs which we know uh vary over the years as well as claimed right here 40% of revenue labor utility rent marketing. So, yep, it's just a clear way of putting everything together and we have a clear uh statement of how much the cash flows are for each of the years. Now, here is the net net present value. So, all of these cash flows um just converted back to the I want to say the interest rate, but it's actually the weighted average cost of capital. So using that rate, we discount every single one of these cash flows to year zero. So we have that stable baseline to compare the values. So the net present value is actually 3,22,000 almost. We also have the internal rate of return and this is a way of calculating the this is a metric used to present how um metric used to present the cash flows and it's compared against the weighted average cost of capital to say whether to invest or not and we'll get into it a bit later. We also have the simple payback period which refers to how much time it takes for the cash outflows to equal the cash flow inflows. So it just looks at uh at what time does the sum of the cash flows in the future equal the $12.5 million investment. So it tells us 5.28. We have the discounted payback period. So that is how much time it takes for. So the simple payback period is just looking at the actual values whereas a discounted payback is referring to the um the discounted values which are adjusted according to the weighted average cost of capital or the rate. So this is more accurate than the simple payback period but it's just a different way to look at at what time the inflows equals outflows. or the inflow inflows add up to outflows. And then we have the profitability profitability index of 1.24. I actually didn't show the equation for this, but it's right here. Net present value plus the investment divided by the initial investment. So it's just another metric to uh see if the project will be profitable. So here's the recommendation. Our final decision is to accept as the project creates value. It covers 8.5% of the cost of capital and adds 3.2 million in wealth to shareholders and with the IRRa exceeding the hurdle rate of 8.5%. Now as I said before the IRR is the internal rate of return given by the actual cash flows here. So that being greater than the uh weighted average cost of capital is a good sign telling us to invest or accept this project proposal. We have the strategic brand and fid so flagship strategy. A roast acts as a halo project evaluating the entire Starbucks brand equity even if direct profits are marginal and it this project can also be an innovation hub as it provides a venue for testing premium products. However, there are some key risks as there's high fixed costs. there's large upfront payment and also high fixed labor rent which can create high operating leverage and there's also terminal value sensitivity and I'll go into this more in the evolve stage but the final conclusion is that we should proceed with the investment as the project is financially viable and is strategically vital for maintaining the premium brand positioning of Starbucks. So overall the main factors I want to say is that the irr being greater than the hurdle rate is perfect to accept this proposal for the evolve stage. I want to look at how the um this is just a lot of code and I've kind of already got into this. um it's the same values but ju just to focus on the output we have the different scenarios just to see the sensitivity analysis of the different factors involved in this calculation. So under the base case which we had the weighted average cost of capital was 8.5%. Full revenue received and the net present value was calculated as shown before and the interated return was this much. However if the revenue decrease or reduced by 20%. With the same weighted average cost of capital um meaning revenue is 80% our net present value goes down by a lot in the case that it's a negative. So our IRRa or internal rate of return is 3.88%. And this is a warning sign as this value is lower than the weighted average cost of capital. So telling us if this was the case, we shouldn't be in investing in such a uh project. Now if the weighted average cost of capital increase by 2%. Our net present value also decreases because it's a higher rate. So the values are much weaker in the future. So if we can make that connection, but our irr is the same. So it's 13.25%. We have the if the rate average cost of capital decreases by 2%. The whack value is 6.5%. And that would actually increase our net present value but still giving us the same IRRa. So what is the summary of sensitivity analysis? There's a critical risk in scenario 2 as a drop in 20% in revenue returns a negative net present value and this project has a high operating leverage and fixed cost consume profitability if volume drops. So that's just connecting back to the point on having high fixed costs which could eat into profitability if the revenue baseline is not uh consistent over time. And then we have discount rate sensitivity. So you know it just tells us how the vari cost of capital impacts the net present value. And we saw that right here. Um but the project remains value accurative even if the cost of capital rises to 10.5%. saying that even though there is quite a bit of change, the net present value is still pro uh positive, meaning that your inflows or revenue is actually greater than your investments or costs, which is a good thing. But companies will always look to maximize the net present value to ensure that their inflows or revenue is greater much greater than their costs. So overall I felt that this was quite a comprehensive and view on how to use financials and financial knowledge to make investment investment decisions as using factors or concepts such as time value of money. We have a better understanding of how we can use we can use the current time as a baseline and use uh discounted rates or discounted cash flows just to have that stable baseline to compare different years and different costs. And this allows us to make a more informed decision whether to take the investment or take the proposal or not. And I see why companies are using this uh at such a deep level because it kind of forms the baseline for um financial uh analysis or accounting as well. So I see how the time value of money is quite the important um you know concept when it comes to workspace involved in financials. But yeah, I was going to show you the inter rate of return calculation, but I realized it's a um it's it's yeah it's uh a predetermined function in the code so I can't show it but yeah uh overall I felt it was a great experience to work on such a project or such a assignment because it helps us understand how you know different concepts in uh financial management and financial uh the whole of finance can be used to make informed decisions in uh the industries. Thank you.",
  "video_url": "https://youtu.be/GwXfaJaW7LU"
}