{
  "student_name": "Christine Shong",
  "org_defined_id": "036250202",
  "username": "shongc",
  "video_url": "https://youtu.be/UjUqkdjFkwQ",
  "transcript": "Hello, my name is\nChristine Chong, and this is my\nsession 11 assignment. So our assignment\noverview to start, what is the problem,\nand what do we know? So to look at it, it\nsays, evaluate Apple's hypothetical $90\nbillion share repurchase using Driver. Act as\nan independent analyst who must determine\nwhether the buyback creates value-relative\nalternatives, uses of cash while balancing\nstakeholder incentives. And here we\nhave a capital allocation snapshot. Liquidity of $165 billion\ncash in investments, $100 billion of\nannual free cash flow, a market context\nof $185 share price. a price per equity\nof 30, dividend yield of 0.5%, 15.5 billion\nshares outstanding, balance sheet of\n$110 billion of debt, a back share owned 6\n% of it, and the CEO holds 3 million shares.\nRetail investors average 100 shares,\nwhile employees have $170 strike\noptions. And the proposal is that $90\nbillion buyback executed over one year,\nwhich is estimated about 10% of market\ncap. The alternatives are $6 special\ndividend, strategic AI, or VR acquisition, debt reduction,\nincremental R&D. So that's what\nwe know so far. To sum it down, we\nhave the current share price of\n$185, a shares of outstanding\nof $15.5 billion, and a price per\nequity ratio of 30 and a proposed\nbuyback of $90 billion and the\nalternative dividend of $6 per share\nspecial dividend. So the financial\nlogic, we need to calculate the earnings\nper share or EPS to shorten it in\nabbreviated terms. The earnings per\nshare is calculated by the net income\ndivided by the shares outstanding and I'm just\ngonna look over to the code step by step so\nour share price and everything we have\nare here we need to calculate the net income\nfirst and in a back buyback cash goes\ndown to pay for shares while shares outstanding\ngoes down companies retire the shares\nthey buy three net income stays the same\nusually unless we lose interest income\non that cash and the result of it is if\nnet income stays the same but shares go\ndown earnings per share goes up now to represent\nhow to map this thing out we need to\ncompare four scenarios to satisfy the\nalternatives requirement and to define our\ninput or define the scenarios we have\nscenario one is the status quo which is to do\nnothing which is our baseline and then\nmoving on is our scenario two the buyback\nof 90 billion dollars to spend to buy shares\nat 185 um dollars the new shares\nequals the old shares minus in parentheses\num the 90 billion dollars divided by the\n185 dollars subtract it subtract that\nnumber from old shares and in our third\nscenario we have a special\ndividend which is a pay a one-time\ncash dividend What this does is\nEPS doesn't change much, but shareholders\nget cash instantly. And our last scenario\nis debt reduction, which pays off $90 billion\nof debt. This saves interest expense, so\nnet income increases. Phase three is\nto implement. That we have is\nto build a... So we use this code\nright here to make a comparison table\nfor the scenarios. um scenarios\nand then when we click run um this\nis what we see um so to get\nback to that um now looking at the\noutput does the output make sense um when\nwe run the code um looking at the earnings\nper share on the earnings per share row\nin the table we see the buyback rate number\none the buyback scenario which we should\nsee the earnings per share increase\nsignificantly like around 6.37 cent uh 6.37\ndollars of buyback um this happens because\nthe denominator of the shares got smaller.\nTwo, we have the dividend scenario which\nis the earnings per share should remain\nflat at $6.17 because the number of shares\ndidn't change at all. And third, we have\nthe debt scenario of earnings per share in\norange right here but not as much as the\nbuyback. This is because the interest savings,\nthe numerator increase usually isn't as\npowerful as the share account reduction in\nthe dominator decrease at current interest\nrates on validation logic the buyback is\nthe most accredited that's the most to\nearnings per share this validates why management\nmight prefer it and to um and to keep evolving\nthis and to reflect on this matter um\nthis code gives us the numbers but this\num but we also need to make a recommendation\nfor this uh financial outcome so our\nrecommendation based on the analysis is to proceed\nwith the 90 a 90 billion dollar buyback\nand why we recommend that is one for the\nshareholders um they uh for the result\nthey see an immediate earnings per share boost\nfrom $6.70 to $6.37. The agency theory\nof this is that this returns excess cash\nto owners preventing management from wasting\nit on bad acquisitions, which is like the\nempire building. Second, for the CEOs of 3 million shares\nthat we discussed, the result of it, since\nthe CEO holds shares, the buyback increases\nthe value of their holding directly. it\naligns um it aligns their interests with\num shareholders third we have like um\nemployees the option holders this results\nthe prompt mentions they have options with\n170 strike and the impact of this is to is\nthat a buyback usually pushes the stock\nprice up since the um current price is 185\ndollars pushing it higher makes their options\nmuch more valuable they will prefer\nthe buyback over the dividend because dividends\nusually lower the stock price by the\namount of the dividend. And last but not\nleast, the bondholders. The risk is spending\n$90 billion. Cash reduces the cushion available to\npay back debt. However, since the\ncompany still has 165 billion dollars of\ncash the risk is quite minimal um so last but\nnot least valuation versus transfer buyback\ntransfers cash from the company balance\nsheet to shareholders who want to sell it creates\nvalue by artificially inflating earnings\nper share the dividend which is like a pure\nvalue transfer the cash moves from\ncompany to shareholders and last but not least\nthe r&d strategic. This is the only option\nthat creates organic long-term value, but\nit is risky. A buyback is safe financialengineering. Thank you."
}