{
  "student_name": "Van Uk",
  "org_defined_id": "035723111",
  "username": "vcuk",
  "email": "",
  "transcript": "Hello. I will be doing the session 10 assignment today and so let's just get straight to it. The assignment overview is evaluate Starbucks proposed flagship roster that requires a $12 million upfront outlay and is expected to operate for 10 years. Use the firm's 8.5% WACC as the hurdle rate to determine whether the project creates value and to recommend an accept/reject decision supported by driver documentation. So the parameters for the project is there's an initial investment of $12 million which accounts for the building equipment training and depreciated straight line over 10 years. The working capital is $500,000 and it's deployed at launch and recovered in 10th year. The revenues is $8 million in year 1, $1 million in years 2 through five, and $9 million in years 6 through 10. And the operating cost is 40% of revenue. Labor is $2.5 million. The rent and utilities make up 0.8 million. The marketing is 0.3 million in year 1, then 0.1 million thereafter. The tax is 25 is a 25% corporate rate and a determined value of $3 million at the end of the 10th year. Okay. So put into Gemini and and this says following parameters are extract from the assignment briefing will be inputs for the model. So the hurdle rate is 8.5% and this is used as the discount rate for all metrics. The initial investment is $12 million. Year z year year zero outlay for building equipment and training. The project life is 10 years and period over which cash flows are projected. The depreciation depreciation method is a straight line and it's over 10 years with the annual depreciation that equals 12,000 divided by 10 which is a million dollars and 200 a million 200. Yeah. And then the networking capital is 500,000 and deployed in year zero and fully recovered in year 10. The corporate tax rate is 25% used to calculate taxes and depreciation tax shields. Ter terminal value is 3 million expected sale value liquidation value at end of year 10 and so we can take a look at the revenue and operating cost projections. So in year one the revenue is 8 million cos is 3,200 the labor is 2 2,500 utility is 800,000 the market is 300,000 years 2 through 5 would be a revenue of 11 million cog of 4,400,000 labor would be two 2,500,000 um utilities would be 800,000 and marketing would be 100,000 years 10 6 through 10 would be 9 million three 3 million 600,000 2,500,000 800,000 and 100,000 project should be accepted if its net present value is greater than zero the WACC of 8.5% is the minimum acceptable rate of return and so this is the incremental cash flow schedule logic um you can see the formula right here the annual operating cash flow formula the OCF formula which excuse me that's oper for operating cash flow. Uh and this is the total cash flow in a year calculation and we can see that year 10 and additional terminal value component is added that NWC is a recovery cash flow. Uh the core capital budgeting metrics formula this is the net present value formula that we was used internal rate of return that was used. The profitability index payback per year sensitive analysis plan the revenue shock which would be revenue times 1 minus 20% the W stress would be WCC plus or minus 2%. And this is uh one of the Python code parameter assumptions. The WCC right here, the tax rate, the project life, the investment and depreciation. You can see the working capital, the revenue schedule, cost schedule. Uh the Python implementation will iterate from year 1 to 10 to calculate the operating cash flow OCF then combine it with investment and then terminal value components to get the total cash flow array for years 0 through 10. So this is the the year counts year zero year 1 year 5 year 10 and this the 8 million 11 million 9 million revenue the 2.8 million 7.4 1.8 zero to 2.4 4 to 0.4 tax rate um and no PAT depreciation total cost total uh cash flow um in year zero was negative 12.5 million then the year one is 1.2 2 million. Year five is 3 million and year 10 is 5 million. The sample calculation for year five is revenue of 11 million cogs are times 0.4,400 44,400 and the other cost 3,400,000 the total PEX is 0 7,800,000 depreciation is 1,200,000 the bit 2 million tax is 500,000 uh the notepad is 1,500 OCF is 2,700,000 total total cash flow which would be this right here and that's basically it and this is the other code that was um in collab. So here is the Starbucks roster capital budgeting uh the methods this the initial investment working capital the life years WHDC tax rate to revenue revenues CG's labor r utilities market year one and other years timeline the year depreciation metrics profitability index is right here um the baseline model, the output, and then you get to the summary. And yeah.",
  "video_url": "https://www.youtube.com/watch?v=WwHjwTYFVxo"
}