{
  "student_name": "Alex Lenig",
  "org_defined_id": "035836182",
  "username": "alenig",
  "email": "",
  "transcript": "Yeah. Hi. So, today we're looking at Netflix and a hypothetical $5 billion uh content investment decision. So, we want to look at whether it's better to invest in stuff that uh based on our whack or weighted average cost capital. Um stuff that would be uh using that to invest firmwide uh on that rate or uh possibly projectwide. um and see how those kind of investments would compare with uh other companies in the media industry. So to get started um we'll basically get into our driver framework. Uh so we'll look at what is whack um and then what are its components. So uh first off it's important to note we have all this data market capitalization um total debt um a book value and market value. I'll talk about the difference. Our beta, if you remember, that's kind of how risky our uh company is based on returns. So, it's bigger than one, a little bit more risky um than most companies might be or than the market might be. Um we got our bond rating, our corporate t corporate tax structure, and then current stock price. Um and we've also got these different market conditions. So, our risk-f free rate of 4.5%. Um then our market risk premiums 5.5% and then basically what the media industry what our industry with Netflix here would be uh or whack range would be in so 8 to 10%. So uh to get started look at what is whack um what is the weight average cost of capital I guess I should say um weighted average cost of capital is basically what percentage we need to get back on investment um for to be able to pay back our investors. Um, so we're looking at looking at a certain amount um in a percentage of again I guess what we need to pay back our investors. So this is a formula right here. Um it's a long long string here. Um so we have a bunch of different parts here. Uh our E is our market value of equity and then our D here is our market value of debt. So I guess this would be a good time to talk about market value. Um go back to here. Um so when we're looking at a company, we can either use our book value or market value. Um book value is basically uh based on our accounting our accounting values. Uh so what we do to make our uh debits and credits line up. Um and then our market value is what our actual numbers are. So like if someone was investing in us, uh what the market conditions would be. So normally when you're making kind of making financial decision decisions uh you almost always want to look at market value because that's going to more uh effectively represent uh the current economic reality. Um it's going to show you what an investor uh the cost investor would actually occur uh in the environment we're in today. Um compared to where book value is just again basically doesn't reflect what the risks the investor would be taking on it. just reflects our historical values uh that make our balance sheets line up. Uh so when making decisions, you're pretty much normally going to want to use market value. Um and that's what we're going to be doing today. So that's why here uh we have it as market value of equity and debt. Um then just to say equity is uh basically what we have to pay back to our investors and then debt or I guess that those are costs but equity is investments and debt is debt what we have to pay back. Um V uh this is our total cost of capital. Uh so this is our E plus our D um makes our makes up our capital our equity and debt. Um and then RE and RD are our cost of equity and cost of debt. Uh and then these I guess like I said earlier uh this is basically what we have to pay back to our investors uh from their investment. Um and then cost of debt what we have to pay back for our debt. So things like stocks or bonds um or getting getting a loan from the bank the interest we'd have to pay back on that loan. Uh so just those kind of things. Um and then our corporate tax rate. Uh just just our tax rate. Uh so yeah so this is our formula for that. Um was there another part here? Whatever exponents. Okay, so this can get us into our represent stage uh which is our actual calculations for our whack. So what we're looking at um first off we want to do our actual calculations uh based on this data. But then we're also told uh we want to Netflix is considering a three billion addition uh uh debt debt issuance uh for content investment. So we want to look at if that goes through how would that affect our whack. So uh we'll do the base one first. Um so we look at it we have our uh E plus D. Uh again these are given to us here. Uh so it's 200 billion plus 13 billion. That gets us our total of 213 billion billion uh for our capital. Um and then we take our weights uh which is basically just weighting our equity and our uh our debt. So for our equity, we have a pretty high pretty high rate of 93.9%. Uh so that's a lot lot of our uh capital based in equity. Uh and then a lot lower percent in debt, which is important to note. Um our RV that was our cost of equity. Um so this is just our um looking sorry I can't remember what RF was. Um anyway uh well RF uh point 0045 or 4.5% uh this was in here. Uh this is just our treasury rate. So basically our market rate um and then we have our beta. Um again this kind of shows our riskiness of the company. So we have 1.3 above one a little riskier. Then our MRP um was given here 5.5% our market risk premium. Uh so that's given here. So we just can use that to calculate our our equity. Okay. Um so that gets us to 11.65% for our uh our cost of equity and our cost of debt. Uh this is basically just our bond yield. Uh 5.8% uh and that's what we're given. We're given our 5.8%. And then here our corporate tax rate uh it's just 21% again we're given that uh here. So okay sorry about that. Um so uh we get all those numbers uh all those intermediate calculations we need. So then we can just plug it into this formula we were given here for whack and then that gets us 11.2 22%. So again what does that mean? That means basically for investment we need 11.22% 22 2% back, excuse me, uh to be able to pay pay um pay on our capital. So that's for paying back our investors, paying back um the banks, really any loans and things like that. Uh that's the target we need. Um so that's for our base, but we also want to look at what would happen if we had a 3 billion uh debt issuance. Uh so we're increasing our debt. Uh we can see here this increases our capital uh instead of 13 billion like it was here. Uh 16 billion so just an extra three on our debt. Um so that ends up with our weights decreasing our uh weight our equity a little bit and then our uh increases our debt and you can see uh doesn't affect our uh cost of equity. Um, and it still doesn't uh change our cost of uh debt or or uh this corporate tax rate. So, the only difference really is in our weights here. Um, but you can see that ends up actually making our uh whack go down uh to 11.32 or 11.113, sorry. Um, so we get a little lower whack, which means uh we need a little less money basically to get back to be able to pay to our investors. Uh, which would be pretty good. So looking at these rates both are 11%. Which when we look here, we can see the industry range uh for the media industry at least is about 8 to 10%. So we're a little bit higher than that. So it might be good to start looking on ways to get down get that whack lower, which I'll talk about in a minute. So um this gets us to our I uh we'll look at code I guess for calculating it and then our firmwide versus project wide rate. Uh so we'll look at the code first. Uh it's pretty simple. It's basically the calculations we just did. It has all these variables. Um just which is what we were given. Um it does basically the same kind of calculations I just did or I just showed you. Um and then so yeah when we run it uh it tells us total valuation uh then gets all these rates and then basically the important part it gets us to our current our whack of 11.22% which should be right yeah 11.22%. Uh then if we have that 3 billion debt issuance 11.13%. We can see we get the same thing here 11.13. Uh so that code works gets you the right values you're looking for. Um there's a 9% difference uh 9% difference in percentage points if we issue that debt. Um I guess it's important to talk about talk about the tax shield benefit. Uh this is basically for debt. When um when we use debt, it's typically uh considered taxree. So we don't actually have to pay tax on that debt. Um and this is what becomes a really important part of uh kind of trying to figure out that weight for your uh between equity and debt for your assets or for your um for your capital. Um so the tax shield benefit again uh that's basically looking at debt and saying since I don't have to pay tax on it uh it is actually might be more valuable for me to take on more debt to increase that capital. So, that's a big thing. When we're looking here at um at Netflix, we can see uh it has a very high uh the base one has a very high uh equity balance. So, we're putting 93.9% of our capital in equity uh and only 6% in debt. So, a good way to be able to get our whack down um so we have maybe a less less of a baseline to hurdle uh to pay back our investors would be actually increase that debt. So if we increase that, say we're at 200, say we had at 13, say we had 100 billion, um, basically that's going to high, I mean, that would be a drastic increase, but that would really increase our debt, uh, which would start to help increase uh, or decrease our whack. Um, so again, that would give us a less less of a baseline hurdle. So um the other point we were going to talk about with this the implement oh yeah uh firmwide versus projectwide rate. So basically what this means is um when we're looking at a project uh we're wanting to invest in. So in this case uh we're looking to invest 5,000 in uh content. So um is it here? Yeah. So project specific versus firm firmwide discount. Um it's basically saying based on our wack uh do I want to apply that to every single uh project in our company or just uh go on a base uh project by project basis. Um and a good way to look at this is with the analysis we're told to do here. Uh US content versus international content. So when we're looking at US content that's going to be something that's probably a lot safer to invest in. Uh we know it has an audience um or has a market I guess it should say. Um it so stable viewership um there's established uh regulations for it. Um and yeah it basically is a lot more stable. Uh so if that's the case our discount rate should be much lower than it might be for say an international content. Uh international content uh is different foreign markets. um maybe not quite as an established uh viewership um you know there's cultural barriers uh and v varying rates. So basically looking at something that's a little safer and then something a little riskier. So if we have two things that one's that one that's risky one that's not uh why would we want to you know use one rate to based across the whole company to just uh value evaluate those on. So that's why when we look at uh assessing projects on a firmwide basis or just on a projectwide basis, uh most likely we're going to want to evaluate things on a projectwide basis. Um otherwise if we just use the firm firmwide whack of 11 uh22% I guess was first one we calculated uh we'd be accepting risky projects uh like certain international projects that might be risky uh that actually destroy our value but then say safer uh projects that are uh US content we just wouldn't accept because we don't see them as meeting that whack requirement um even though they're safer and they add value to our company. So that's an important thing to look at um when you you when you calculate a whack whether you actually want to use it uh companywide or just kind of use it as a baseline to start looking at project on project project basis. So uh here we want to compare our our company and our uh what we got to other companies. So, the ones we're given here, uh, we're given Disney's capital structure of a 70% equity and 30% debt. This gets them a whack of 8.2%. Um, we can see here again, that's pretty that's a lot lower than we have and it's also within the media industry range. Um so on the lower side at least of the media uh range and as we kind of looked at earlier and discussed a little bit uh this seems to be a lot highly well one reason I guess is highly due to they have that 30% debt as where we only had what 6% yeah 6%. So, as they increase their debt, uh they're able to balance out their uh capital a little more and make it so that their hurdle rate for their investments is a lot less. So, uh when it in our case, if we wanted to decrease our whack, it might be a good idea to looking into uh invest or adding adding more debt uh or issuing more debt, I guess I should say. Um and yeah, uh they just have a higher or less of a debt to capital debt to equity ratio. Um so another reason for this also uh is in our beta here. Um which gets us our cost to equity. So again, we have a pretty high beta um 1 point 1.3%. It's on the higher end, so higher than the market return. Um, and Disney in most cases would likely have a much lower beta. Uh, and we kind of talked about this in a different lesson, but this would be due to um this would be due to uh just that they're more um what's the way to say it? Uh diversified uh they have more diversified assets. um they're in more than just the media market as where Netflix they don't have, you know, a bunch of different branding. They don't have they don't sell they really don't sell anything other than their streaming service. Uh Disney has a ton of different things, a ton of different investments. So, their beta is going to be a lot lower. Um which helps bring that whack down. Uh and it's kind of the same thing with Amazon Prime. Um they use Amazon's corporate whack. um they have the AWS system. Um so they're pretty diversified. Uh they're again in more than just that streaming service. So they're gonna have a lower beta and that helps to bring down their whack even if they had the exact same equity to debt ratio as we did. Excuse me. So um what is the optim optimal capital structure? Um so what we're looking at would be basically zoom uh basically as we could see if we're thinking about adding three billion debt in uh a three billion debt issuance. I don't know why I put insurance that just not right. Uh but issuance um what was I saying? Oh yeah. Uh so we can see that three billion debt issuance uh decreases our whack uh which is getting on the right path. So we might want to look into slowly issuing more debt. Um obviously we don't want to issue a ton at once. Like I was saying earlier if we issued a 100red billion in debt that might really start to cause some problems. Um but slowly issuing more and more debt um that'll really increase um help to in or decrease their whack. it might be a good idea to look to getting it kind of around to that 30% Disney was at so that we have a 3070 split um because we can see that's working pretty well for them. But yeah, slowly increasing or slowly implementing more debt into our system um would probably be the best bet. And also just um you know making sure we do that three billion. Um, but when we're looking at our uh when we're looking at our $5 billion content investment, uh, we wouldn't want to look at just our companywide whack here. Uh, as we talked about earlier with the project versus firmwide rates. um it's really not going to be like fair to view content say from I guess the US uh versus international on the same level. So we want to look at things on more on a project by project basis than just everything should be has to meet this criteria uh even though that wouldn't be fair to that would cause problems financially and wouldn't be fair anyway. Um so basically increase debt um and make sure we're doing thing project on project basis. Finally uh usefulness. So again that's just that's just talking about how useful is the cost of capital analy uh analysis or analysis cost of capital. Um it is useful in helping to get kind of a barrier or barrier a benchmark for what we want to pay or what we need to pay back to our um investors. But as we looked at with this scenario, it's not something you want to base every single project you're doing on. You want to make sure you're kind of looking at each project and saying and and analyzing it so that you know, okay, is this is it fair to ba base it on our companywide whack? Is everything kind of similar? Uh everything we'd be selling similar everything we I swear fire truck goes by every time I record one of these. Um but anyway, what was I saying? Um, oh yeah. Would it be fair to analyze everything we're investing in on uh this one whack we have for companywide thing or investing in separate things? Uh maybe they're higher risk but have a higher reward or maybe they're lower risk but have a pretty safe reward. Uh so yeah, kind of just analyzing things on a project by project basis and then figuring out uh based on our whack also what's a good way to kind of approach our future of uh getting our uh getting our ratio of debts to uh debts to equity like in a decent spot. Maybe we need to raise debts. Maybe we need to lower it if say we're in a 50-50 split and that was causing problems. So yeah, that's all I got for today. Thank you for listening.",
  "video_url": "https://youtu.be/9Hk59C3OxtY?si=jBeeUfAqK_Y6iwY_"
}