{
  "student_name": "Tanmayi Sharat",
  "org_defined_id": "035964608",
  "username": "tsharat",
  "email": "",
  "transcript": "My project uses the GameStop short squeeze as a case study to test how well the Efficient Market Hypothesis actually holds up during extreme market events. Before I jumped into the code, I structured everything using the full DRIVER framework. That means I started by defining and discovering the core questions and verifying basic facts. Then I represented the methodology by laying out the event-study structure. After that, I implemented the models, validated their significance and robustness, evolved the analysis to look at deeper implications, and finally reflected on how EMH, behavioral finance, and market microstructure all fit together. Once the framework was set, I organized the data work into two loops. Loop 1 builds the full event-study foundation. Loop 2 strengthens the analysis with Fama-French factors, sentiment proxies, and borrow-fee dynamics. The research questions I focused on were three things. First, did GME's price behavior match weak, semi-strong, or strong-form efficiency. Second, could a rational investor have systematically profited in real time. And third, were the extreme movements better explained by behavioral finance and market microstructure rather than EMH. Before running any analysis, I had to do some fact checking. There was a claim that GameStop traded at four cents in August 2020, so I pulled the daily pricing data to confirm. My output showed a minimum price of 1.04 dollars, a maximum of 1.67 dollars, and an average of 1.20 dollars for the month. So GME was a one-dollar stock, not a penny stock. Getting this right matters because all EMH testing depends on accurate baseline prices. In Loop 1, I built the entire event-study framework around three major public events. The Ryan Cohen stake in September 2020, which serves as a semi-strong efficiency test. The short squeeze peak in January 2021, which tests both weak and semi-strong efficiency. And the congressional hearings in February 2021, which are another semi-strong test. To implement this, I defined an estimation window from April through August 2020. I used CAPM to estimate expected returns, computed daily abnormal returns, calculated cumulative abnormal returns, ran t-tests on the abnormal returns, and visualized CAR patterns across all three events. The CAPM model gave me a daily alpha of 0.0087 and a beta of 0.3784. What that means is that GameStop earned about 0.87 percent excess return per day in the estimation window, which is extremely high, and the stock only moved about 38 percent as much as the market. So it behaved like a low-beta stock with unusually high excess returns, which already suggests CAPM does not fully explain it. Then I ran t-tests on abnormal returns for each event window. The Cohen event produced a t-value of 1.14 and a p-value of 0.2673. The short squeeze window gave a t-value of 0.52 with a p-value of 0.6089. And the congressional hearing window gave a t-value of 0.01 with a p-value of 0.9917. Because all these p-values are above five percent, we statistically cannot reject the idea that average abnormal return is zero. Volatility is massive during the squeeze, so statistical power is weak even though the economic movements are huge. When you look at the cumulative abnormal return plots, the Cohen event is basically flat, which fits semi-strong efficiency. The short squeeze, the red line, jumps above plus 2.5, which means more than a 250 percent abnormal return inside the twenty-day event window. And the congressional window shows only a small temporary bump. Visually, the squeeze is a clear economic violation of EMH, even though the daily AR variance makes the t-tests noisy. Volume data supports the same story. Volume was normal through 2020, then exploded in January 2021. Price movement lines up perfectly with the volume surge, which is a pattern typically explained by retail herding rather than new fundamentals. Then in Loop 2, I strengthened and validated the findings by adding a multi-factor model, adding sentiment data, and adding short-borrow fee behavior. This loop gives a deeper interpretation beyond just CAPM. The Fama-French regression produced a daily alpha of 1.8012 percent, which annualizes to about 454 percent per year. The R-squared was only 0.103, meaning the model explains barely 10 percent of the variation. The market beta was negative at –1.6518 and significant. SMB was extremely large and positive at 5.7454, and HML wasn't significant. A 454 percent alpha is obviously not a real premium — it's the model trying to absorb the anomaly. Ninety percent of GME's returns are idiosyncratic noise. The negative market beta and massive SMB loading show that the stock behaves like an extreme, sentiment-driven microcap, not a rational factor-priced asset. The Jarque-Bera statistic was over 13,000, confirming extremely non-normal residuals with skew and fat tails. So the multi-factor model actually strengthens the case that fundamentals cannot explain the GME movement. Next I used Google Trends as a retail-attention proxy. The spikes in search interest line up perfectly with the price spikes. This is textbook behavioral finance — attention-induced trading, herding, overconfidence, and narrative cascades. These movements aren't reactions to cash-flow news; they're reactions to social-media attention. I also plotted the borrow-fee rate to capture limits to arbitrage. During the squeeze, borrow fees spiked from around three percent to roughly fifteen percent, and brokers restricted buying. For arbitrageurs, this means high shorting costs, risk of forced buy-ins, shrinking liquidity, and asymmetric restrictions. Even if you knew the stock was overpriced, the structure of the market prevented you from correcting it. This is exactly what limits to arbitrage looks like in practice. Putting everything together, outside the squeeze window GME behaves somewhat like a normal small-cap stock. During the squeeze, weak and semi-strong efficiency break down completely. Multi-factor models cannot explain the returns. Retail attention and herding overwhelm any fundamental story. And arbitrage is crippled by frictions like borrow fees and trading restrictions. The result is a short-lived but extreme market inefficiency. So my final conclusion is that markets are mostly efficient most of the time, but efficiency collapses when behavioral forces and market frictions overlap. The GameStop squeeze doesn't show that markets are always broken; it shows that during rare episodes, attention substitutes for information, social behavior overwhelms fundamentals, and the mechanisms that normally enforce efficiency stop working. That mix produces explosive inefficiencies that traditional EMH cannot fully explain.",
  "video_url": "https://www.youtube.com/watch?v=tkfGt_g6a_Y"
}