{
  "student_name": "Gage Pittman",
  "org_defined_id": "037005578",
  "username": "gcpittma",
  "email": "",
  "transcript": "Hello, my name is Gabe Pitman and today I will be discussing capital budgeting and investment decisions specifically for Starbucks proposed flagship roastery which requires a $12 million upfront outlay and is expected to operate for 10 years. Using the firm's 8.5% weighted average cost of capital as the hurdle rate, I'll determine whether the project creates value for the company and recommend my opinion as what to do for the project. So to define our parameters, we have a $12 million initial investment which includes building equipment and training depreciated straight line over 10 years. Our working capital is $500,000 deployed at launch and recovered in year 10. Our revenues are 8 million in year 1, 11 million in years 2 to 5, 9 million years 6 to 10. Now operating costs are 40% of our revenue. Labor is 2.5 million. Rand utilities is $800,000. Marketing is 300,000 in year 1 and 100,000 thereafter. Our taxes are 25% of the corporate rate and our terminal value is $3 million at the end of year 10. After defining those parameters and running the calculations, we determined that our base case NPV is 2.6 million. Our base case internal rate of return is 12.8.4%. Which is good. Our profitability index is 1.22 also good. And our simple payback and discounted payback are both within our 10-year life cycle, meaning that we will make our money back. And now to represent this, we will go to our 10-year cash flow chart, which has our revenue, operating cost, taxes, depreciation, tax shield, our cash flows, terminal value. As you can see, we've defined parameters and built our 10-year cash flow and calculated what we needed to. We will implement this sensitivity test. uh by reducing revenue by 20% and uh increasing and decreasing our weighted average cost of capital by 2% and how it affects it. So revenue has a positive relationship with both the net present value and the internal rate of return. So if it decreases the NPV and the internal rate of return also decrease. The weighted average cost of capital has an inverse relationship on the net present value. When the weighted average cost of capital increases, the future cash flows decrease and vice versa. It just if the ICC is above the WACCC, then it's acceptable. But once the weighted average cost of capital, which is our hurdle rate, is above our internal rate of return, we no longer want to accept a project. And we can verify that with a lower hurdle rate, more money. Higher hurdle rate, less money. And same with our decrease uh by 20% in revenue shows how sensitive projects are to how well it performs. So with a decrease in 20% revenue, we end up with a negative $3 million, which we want to reject the project. And now to execute and reflect on our decision. The base case net present value is positive. Therefore, it exceeds the required rate of return and will create value for Starbucks. The base case internal rate of return is significantly above the weighted average cost of capital, which shows it's an acceptable project. The simple and discounted payback periods, like I said, are both within the 10ear project life. So, that's good. and the 20% revenue decrease resulted in a negative net present value which shows how sensitive it is to revenue. The project is profitable and allows for market expansion into a growing segment. Executing this project and creating the roaster would offer a competitive advantage for Starbucks if successful. It shows positive enhancement, but there is a reputational risk. If the project fails to meet expectations, but if it is successful, it solidifies our position in the market. And some key project risks include whether or not the target market will accept the new product or service, especially with the high sensitivity to revenue. Another key risk includes operational execution as this will be the first flagship roaster for Starbucks. There's a risk with that. In a competitive response, competitors may try to start up similar projects which could affect our performance. Overall, I think that it is a good investment and it will create value for the company. We just have to watch out for the revenue. We definitely want to proceed with caution. Uh we see how sensitive it is to our revenue, so we need it to perform well and we may want to consider increasing our marketing. But uh that is what it is.",
  "video_url": "https://youtu.be/6Fq5OWtr_oU"
}