{
  "student_name": "None None",
  "org_defined_id": "036214646",
  "username": "jacob269",
  "video_url": "",
  "transcript": "Hello, my name is Andrew Jacobs, and this is my savings goal planning mini-project for Project 3. Uh, for this assignment, I built a simple AI-powered tool that evaluates whether a personal savings goal is realistic or not.\n0:13\nUh, in this assignment, it's designed to help uh, people understand the tradeoffs behind their financial goals, uh, straight up. So, uh, what does my tool do?\n0:25\nMy tool takes five inputs, age, current savings, monthly contributions, and the target amount and how many years a person has to reach that goal.\n0:35\nIt sends that information to an open AI model along with a very strict set of rules. The AI is told to not give out financial advice, but instead explain whether the goal is realistic.\n0:46\nIt also shows, uh, it also shows three risk scenarios and suggests small tweaks that the user can make. Uh, the main part of the tool is a single Python function.\n0:57\nIt builds a data package with the user's inputs and sends it to the model using the open AI API. The model uses my structured prompt to format the output into five required sections, a TLDR, a realism explanation, three portfolio scenarios, recommendations on what to tweak, and an educational disclaimer\n1:18\n. Everything is done in one code cell to keep the project very simple and easy to run. So, for my example, I used a realistic goal.\n1:27\nA 21-year-old who has $3,000 save adds $200 a month and wants to reach $25,000 in five years. The tool calculated they would need around a 10.8% annual return to hit that target.\n1:45\nThat's not impossible, but it's definitely on the aggressive side. Uh, conservative scenarios showed they likely wouldn't reach the goal without saving more.\n1:52\nThe balanced scenario had a chance of success but with some risk and the aggressive scenario could hit the goal but with large market swings.\n2:00\nSo, the tool also recommended three tweaks. Uh, increasing monthly savings, extending the timeline a little bit, and doing yearly check-ins on risk tolerance.\n2:11\nSo, why does this matter? The point of this tool isn't to offer financial advice, but it's to help users understand the math behind their goals and the trade-offs between safety, growth, and timeline.\n2:22\nEven if someone has zero financial background, they can read the output and immediately understand the situation. So for the project for my AI disclosure I used AI to help with the structure, formatting, and decoding.\n2:37\n\nI wrote the logic for the tool and examples. So, overall, in conclusion, this project gave me a clearer understanding of how to combine data inputs, logic, and AI to create something simple, but actually useful.\n2:53Thank you for listening."
}