{
  "student_name": "Carson Parmer",
  "org_defined_id": "036732462",
  "username": "cjparmer",
  "video_url": "https://youtu.be/eK7A0zLKD6w",
  "transcript": "Uh D for the DRIVER method here on, uh, session, uh, 12 assignment. Uh, we're going over what the Panera Bread and KKR takeover form. So we'll start with the Define and Discover. So the goal is to determine an informed bid range for Panera Bread for a KKR takeover, triangulating DCF, trade multiples, and precedent transactions while contracting [Contracting] contrasting financial buyer discipline with strategic buyer synergies. Target is Panera Bread, prospective buyer KKR, and key input and matrix: Revenue, growth rate, EBITDA, uh net income, EBITDA, um, one with in- uh industry and one with main- management target uh used for DCF base and target growth levers. 500 new stores, um, like I said, uh, here's the key inputs. So you got 6 billion, 8%, as you can see on down through there. Uh, key valuation multiples: Industry P/E, 22 times, Chipotle, 35 times, McDonald's, 25 times, precedent EBITDA multiples, 12 to 15 times. Key questions to answer: What is Panera's uh DCF? Uh, what is implied variation range based on relative valuation? How much uh could synergies add to the valuation for a strategic buyer? What is the resulting Football Field valuation range and optimal bid strategy for KKR? Critical Gate Evidence: This section serves as the required evidence for the Define and Discover stage.\n\nUm, and Represent. So we're on to the R part of the DRIVER method. Plan: Construct a Python-based model to perform three required valuation analysis and synthesize the results into a bid range. Uh, Discounted Cash Flow DCF model, time frame five years plus terminal value. Base case 8% revenue growth, declining to 6%, margin stable at 15.5%. Um, upside case: Growth sustained at 10%, margin expand to 17% due to digital scale, 9% and 3 and a half percent. Downside case: Growth drops to 5%, margin contracts to 14, 10% and 2 and a half percent. Formula: Calculate uh free cash flow, terminal value using the Gordon Growth model.\n\nUh, relative valuation, trading comps. Uh, use tax and multiples and EBITDA multiples. Pier set multiples use the uh stated industry P/E same, and uh derived for the percentage range 12 to 15% times midpoint 13.5 times. Pressing transactions use the started tax EBITDA range to 12-15 times. Triangulation sensitivity synthesis, create a Football Field chart showing the EV ranges for the three methods. Sensitivity prime much [Prime much] parameterize the WACC 8 and a half to 11% and terminal 2 to 4% on the base case DCF.\n\nImplement valuation execution. This section represents the model execution assumptions and interme- intermediate calculations that would be visible in the presentation. So here is the chart that I have came up with. As you can see year 0, 1 and 5, Revenue, EBITDA, or DA, FCF, PV and FCV. Uh dollars all in millions. So as you can see from year 0 to year 5, 6% or um uh 14% uh because in year two it goes up 8 and then it goes up another 6 to year five. You can add in the uh discount rate and the terminal growth also. Um this down here is showing you the calculations, how we got to that. Uh relative valuation method. Um Pressing [Precedent], trading comps, trading comps P/E. Uh so here is the multiples used, 12 like I said 12 to 15, uh 13 and a half, 22, 25 on the high end. Input values, EV range, implied equity value range, all in billions. Synergies, a strategic buyer could raise 15 [50] million to 100 million in annual pre-tax synergies through procurement, uh G&A savings, and cross-selling. Post-tax synergy assumed 75 million pre-tax, approximately 60 million post-tax. Capitalized with the 60 million, terminal 3% and WACC 9 and a half percent. Um this will add approximately uh 932 million. Um up.\nValidate. Cross check the inters- DCF values uh 14.9 billion and substantially higher than the comps precedents 10% or 10 billion to 13 and a half billion. The public comps industry average may not fully capture Panera's digital uh leadership 50% sales and fast casual growth potential. This mar- market may not fully value the 8% growth rate and the 15% margin compared to slower growth rate peers. The DCF is likely more accurate as it explicitly models these growth levers. Financial buyers KKR discipline, KKR must rely on uh DCF but cannot pay through the high strategic values. Their bid should be constrained by the base case DCF and include a slight control premium over the precedent maximum to secure the deal. Strategic buyers, um, the EV boost from the synergies, uh, 1 billion validates the strategic buyers can justify a significantly higher bid. The model needs to determine uh Evolve. So we're on to the Evolve part of the DRIVER method. Uh refine, the model needs to demonstrate how 10% management rollover affects the KKR bid. KKR can offer a lower cash price per share and significant portion of the management equity enrolled into the new private company, effectively anglining [aligning] their interest post acquisition. Sensitivity check and Reflect. So here is a chart on the reflection. Trading comps, precedent transaction, DCF uh base and DCF upside. So as you can see, um, here is the ranges that it goes into and then a rational that I came up with on the um end of it. KKR winning bid strategy, KKR, a financial buyer must maintain strict return discipline IRR targets and should not pay the strategic value only available on a strategic competitor. Recommended bid range 13.8 billion to 14.5 billion. Walkaway price is 14.9 billion. Paying more means the IRR target is likely be missed without aggressive aggressive risk growth assumptions. Negotiating talking points: Risk mitigation, highlight the sensitivity of the DCF to 1% shift in the terminal to justify your bid closer to 13.8 billion. Management alignment, stress the value of 10% management rollover it keeps management incentive and reduces the immediate cash required per share, offering a higher normal price while maintaining financial discipline. Um and my conclusion is KKR should position its bid at 14.5 billion, a slight premium over their peers, and rely on management rollover to satisfy Panera's board. Uh if a strategic buyer bids above 15 billion, KKR should walk away as the price reflects synergistic uh value that cannot they cannot realize"
}