{
  "student_name": "Joe Dragoni",
  "org_defined_id": "036050644",
  "username": "jdragoni",
  "email": "",
  "transcript": "All right. Hello there. I'm Joe Dragoni and this is my um se session 10 um management 310 assignment. Um doing the cost of capital analysis. Um so our assignment overview looking at the overview here. We're evaluating Starbucks's proposed flagship roaster that requires a $12 million upfront outlay and is and is expected to operate for 10 years. where you can use the 8.5% weighted average cost of capital um that Starbucks has as the hurdle rate to determine whether the project creates value and to recommended an accept or reject decision supported by driver documentation. So some of the parameters that are given to us here um we have an initial investment of $12 million which in uh involved building of the building equipment and training uh for the people working in this roaster um and it depreciates um over 10 years straight line. So, it's got a 10 year useful life. We got a working capital, $500,000 deployed at launch, and it'll be recovered in year 10. $8 million of revenue in year 1, $11 million of revenue um from years 2 to 5, and then $9 million from years 6 to10. Um so, yeah. Then, operating costs, we got the cost of goods sold being 40% of revenue. Labor being 2.5 million a year fixed. Rent and utilities $800,000 a year, which is fixed. marketing starts at um 300,000 uh or yeah 300,000 in year one and then only 100,000 a year um thereafter. So that one will also be fixed but it starts at.3 and then fixed at 0.1 thereafter till year 10. Then we get 25% corporate uh tax rate and a terminal value of $3 million at the end of year 10. So we'll focus our analysis on producing a transparent cash flow model, the core capital budgeting metrics, sensitivity tests which do the implementation stage and an executive ready recommendation. So looking in our into our driver framework that we'll use for this uh first stage being define and discover. Our goal is that we want to see if this project will earn a return greater than the cost of the funds used to finance it. Um so we must determine if the roster generates a net present value greater than zero. Um, so it must be positive and we must focus on the whack hurdle rate. Um, which is the 8.5% weighted average cost of capital that Starbucks has. Um, and then just some other basic information to go over. Um, if the net present value is greater than zero, this means the project covers all costs, pays back the investors their required 8.5% return and generates extra value on top. So the goal um there we would accept the goal or accept the recommendation. And then if the net present value is negative that means the project destroys shareholder value even if it generates positive accounting profit. So we would reject the project in this case. So to to build the net present value model we must isolate the free cash flows. Um and those components include um the cost incurred um at time zero or the day of the start of the project. So that being the 12 million $12 million for the building equipment and training which is our capital expenditure. the 500,000 required for the inventory and cash on hand which is our working capital and um we would we would observe these as negative values since this money is going out and so the negative cash flows at the start of the project. Um revenues we already talked about having $8 million in year 1, $11 million from years 2 to 5 and $9 million from years 6 to 10. Um and then operating expenses we got the cost of goods sold which is variable because it's 40% of the year's revenue. Um then the fixed costs of labor and rent and utilities. Um the marketing of three million or 300,000 in year one. And then 100,000 for years 2 to 10 which is which will be fixed after year 1. And then also we must consider depreciation expense um which is the initial investment minus the salvage book value um over the 10ear useful life. So it will be calculated as $1.2 million a year. Um but this is a non-cash expense but will still lower taxable income. So it must be noted. And then looking at our tax shield, we must apply the 25% tax rate to the earnings before interest taxes or EBIT. Um, and that'll be an outflow. And then looking at terminal value adjustments, we're selling for $3 million um at the end of the investment, but there's also tax. Um, so 3 million times 25% tax is 75 million. So our net cash inflow uh at the end of the 10 years will be 2.25 million. Um, and then we want to calculate the net present value at year 10. and determine if that will overcome our hurdle rate of 8.5%. And see if there's value generated from this project. So now moving down to the represent stage where we actually calculate the cash flows for each year. Um we want to visualize the flow of money for this 10-year investment. Um and determine if this project creates value. Um yeah, we'll create a cash flow timeline for the 10 years of the investment. So we talk we talked about depreciation a little bit already. It's the cost basis minus the salvage value over the useful life. So, like we talked about already, $12 million, um, which is the initial check written minus the salvage value of zero over the 10 year useful life is $1.2 million. Um, our salvage value here is zero for tax purposes because when companies assume the asset loses all its value in 10 years, they get a larger tax deduction. So, that would actually be better for us. Um, and this is better for net present value because of time value of money. Um, like we've learned already, um, saving cash today is better than saving cash in 10 years due to factors like inflation and other things like that. So, looking at our 10-year investment cash flow schedule, um, in year zero or the day the project starts, we talked about already um, having negative 12.5 million in outflows due to the, um, paying for the building, equipment, and training, which is 12 million, and the 500,000 working capital for inventory, etc. Um, so 12.5 million out of our pockets. In year one for the investment, but in year two in or year zero, we lose the 12.5 million. In year 1 is when we actually start to generate some cash inflows. So we have the revenue of 8 million in year 1. Um, but we have to subtract our operating expenses. So cost of goods sold up3.2, labor and utilities, labor, rent, and utilities -2.5, million800,000. and then the year 1 marketing of300,000. So 6.8 million in operating expenses and then calculating our taxes, it would be zero at this point. Um, and then we got the 8 million in revenue minus the operating expenses minus the 1.2 million depreciation. So that shows that we have zero earnings before taxes and interest. So there's nothing to be taxed. So this shows our cash flows. The 8 million minus the 6.8 million operating expenses is 1.2 2 million in year 1. And then from years 2 to 5, uh, revenue is 11 million at this point. Cost of goods sold of the the 40% of 11 million is 4.4 million. So we lose that. Um, the labor and rent stay the same. Marketing is 100,000, which is it goes down. Um, so we have $7.8 million in operating expenses, which increases. Um, but our revenue also increases. So calculating the earnings before taxes and interest gives us $2 million which is just the 11 million revenue minus the operating expenses of 7.8 million minus the depreciation. Um so that's income that can be taxed. So applying the tax rate to that um we pay $500,000 in taxes. So, our cash flows is the earnings before income or interest in taxes minus the 500,000 in taxes is 1.5 million uh for our free cash flows from years 2 to 5 as well as adding back the depreciation that we took off since it's a non-cash expenditure. So, it would be 2.7 million of cash flows there. And then looking at year 6 to9, the revenue goes down to 9 million. um calculating the cost of goods sold, labor, rent, and marketing again to give us 7 million in operating expenses. Then taking then we get the earnings before interest in taxes of 800,000. Tax that by 20 or multiply that by 25% to get the taxed income that we have to pay and then we get the free cash flows of um 1.8 million. And then looking at this last year, year 10, um our exit year where we generate the bulk of our earnings, our um incomes, we have the free cash flows 4.8 million from the year before. The recovery of the working capital, which is $500,000. Our investment is fully depreciated as we talked about with the salvage value being zero. And then looking at the terminal value here, it's the sale price of $3 million which we sold it for minus the tax which would be 25% of that 3 million which is 750,000 gives us 2.25 million of for the terminal value. So our cash flow is the operating free cash flow is 1.8 million plus the recovery of the working capital which is 500,000 plus our terminal value which is 4.55 million. So that's where the bulk of our cash inflows come from is this um last year our exit year. So we can see that this project is quite backloaded. So now to calculate the present value of this it's the 4.55 million over the 1.085 which is our whack our discount rate whack calculation um raised to the 10year period is 2.1 2.01 million. So obviously less than what we think of it or what we calculated as here. Um and then just look at the net present value sum of the present value from each year which we'll show in the implement stage more in detail is 2.69 million. So that will be our represent stage. So now we move down to the implement stage where we actually can apply all this information or have Gemini help us to create this these calculations automatically as well as calculations for the um what else did we make calculations for? um the discount payback period, civil payback period, profitability index, and then the sensitivity analysis for the reduced revenue and the whack um as well as helping to create our recommendation. So looking down at this we have all the code made here and then we can run it real quick and then we'll see from here going up to the first part the comprehensive financial model our base case whack is 8.5% as we saw already and looking at all of the cash flows um that we calculated already um like we see in year zero we have the negative 12.5 million and then we get those same cash flow amounts that we calculated in the represent stage and then it shows us the present value of those investments um as a percentage of what the actual cash flow is. So in year one the present value is 92% of that um the present value 84 85% 78 72 it goes the present value decreases as time goes on which aligns with our time value of money knowledge that we already have and then or that's the PV factor rather and then the present value we can see it um reflect that same information that we've already learned here. So our total NPV which is the sum of all these present values is 2.69 million. So then looking at some of the core investment metrics that we talked about um the internal rate of return is 12.84% which is greater than our target which would mean we would accept the project here in this case got a profitability index of 1.22 simple payback period of 5.3 and discounted payback of 8.2. Um so like we said we will go more in detail in this in the next stage. Um but now looking down at the sensitivity analysis for our discount rate um as we test out the different whack amounts um our base case here of 8.5%. Shows that we would accept the project and as the whack decreases um a lower hurdle rate to jump over it increases the net present value. So a hurdle rate of 6% gives us a whack of 4.66 or a net present value of 4.66 which is very good for us. It's very high number. So we would accept it there. And then conversely as the whack goes up closer to double digit percentages 10% 11 12 13 14 we start to get into dangerously low territory. um at 13% is when we get into the negatives which is when we would start to reject because if net present value is not positive then we would not want to we would not want to accept the project. So then also looking at the revenue scenarios in a different sensitivity analysis um looking at the impact of a drop in revenue also in an increase of revenue um like we said we don't have in this scenario we get all of our revenue our net present value is 2.69 69. So we'd accept the project there. We'll drop in 5% would decrease our net present value, but it's still greater than zero. So we could accept it. But as we get into the -10s, negative 20s, losing revenue, um this would cause our net present value to be negative. So we would end up rejecting the project. And then same as if we go if we go up to 10% here, gaining even more revenue. Obviously, we would want to accept. So I also created um some tables, some graphs that show this the correlation between net present value and the whack as well as the change in revenue. As we can see there's negative correlation between whack and net present value as it decreases um as the yeah as the net present or as the whack rather increases the net present value decrease and then as the revenue change increases. So as we get more revenue our net present value will increase which actually makes a lot of sense when we think about it. So then moving down to the validation stage here. Um like we talked about simple single payback period is roughly 5 years and 3 months to recover the initial cash outlife. So this is relatively long for a retail investment like Starbucks but is still acceptable for us. Our discounted payback period is 8.2 years which means that the project does not break even in value until in value terms until late in the cycle. So we see the value is uh backloaded like we talked about already because we get lots of our value from the exit in year 10. Um if the lease is terminated early, the project will likely destroy value. So that is a risk to keep in mind with this project. If we decide to bail early on it, we will not capture our full value and we'll likely even lose some money. Then our profitability index is 1.22 times. So for every dollar Starbucks invests in the roaster, it generates $122 in present value. So that is acceptable uh as we're generating more money um the more we invest at least at this stage. Then our sensitivity robustness check like we talked about we done we did that already. um the negative correlation between NPV and whack. Um the reduction in revenue would also see reduction in NPV um and it gets into the negative point. So there's a positive correlation between these two and um looking at a terminal value check we calculate the terminal value in the implement stage and as well as the represent stage at year 10. So that $4.55 million in year 10 that we got out of it accounts for nearly 45% of our total net present value. So we are highly sensitive to that exit assumption. Um and this is because specialized equipment like huge coffee roasters or roasteries that we that Starbucks would implement here often has very low resale value and retail fitouts usually have zero value after 10 years. Um if the terminal value becomes zero, we lose 2.25 $.25 million uh of act after after tax inflow in year 10 and the present value of that loss is roughly a million dollar. So losing a million is very unappealing. Um so we do not want that terminal value to drop to zero. And then this would also cause the net present value to drop from 2.69 million to 1.69 million losing our million dollars as we talked about already. Um and it's still safe. The net present value is still greater than zero but it's less attractive to the shareholders. So they would likely not recommend the project knowing what we could have had. And then the operating leverage check, we assume that cost of goods sold is a perfect 40% of revenue. But in reality, they don't fall as fast as revenue does. Um so if revenues drop to $6 million in a bad year, the labor and rent, they will remain fixed. Um so the margin is significantly reduced as we're still paying these fixed costs. Um but we're not making as much revenue to cover those costs. Um and then looking at the what the break even sales volume is. That's if the break even is point is too close to our forecasted sales. The project is operationally fragile. Um so luckily we're not too close to that point but that's just another leverage check. If like if we lost our revenue then it would get us closer to the forecasted sales which would make the project be less appealing since there's a lot more risk involved there. Now moving down to the evolve stage. um looking at some applications of NPV and other concepts. So this has been overarching concept the present value time value of money um in all the sections that we've done in management 310 so far. So like cost of capital in section 9 real estate and mortgages in section five time value of money was specifically centered on present value net present value calculation um and many more if not all. Um and then just some like actual real life scenarios where this could be used. Um merchants and acquisitions um using capital budgeting on a massive scale um instead of buying a coffee roastery this would mean Starbucks would buyer would buy a entire company or like a coffee bean farm or something like that. So the decision rule that we would have to think about in this case would be calculating the net present value of the existing cash flows or the present value of our existing cash flows or our target plus the present value of our synergies which is the cost savings or revenue boost that wouldn't exist independently and then we subtract our cost which would be the price paid for that company or that farm. Um this can also be applied to customer lifetime value or CLV where we treat marketing spend expenditures as an investment and not just as an expense. So our cash inflows would be our margin per customer times the retention rate and our hurdle would be the discount rate um reflecting the risk of the customer churning. So that would apply whack concepts in that as well. So if our customer lifetime value is greater than our customer acquisition cost or CAC um which is very similar to the whack for capital budgeting then we would determine the market campaign has a positive net present value and then also looking at leasing versus buying which goes along with the session five real estate and mortgages that we talked about a few weeks ago. A company like Starbucks decides whether to own a building or to lease it. So in the case of the roaster looking at owning or leasing this building um which creates more value for us um we have a couple options. Option A to buy pay $12 million up front and benefit from depreciation tax shields and residual value at the end or to lease the building pay $0 upfront and pay the annual rent which is taxdeductible. Um, so the net present value of leasing versus buying would be avoiding the rent payments minus the purchase price plus the depreciation tax shield and see which one provides more value for us. So those would be some of the applications we could use um of the capital budgeting and net present value stages. And then going down to the reflection stage, the last stage of the driver framework. Um, as we talked about already, net present value is the overarching concept not only in this class but also in all of the business finance world. Um, and it's a concept many businesses face every day. So, just reinforcing that idea and getting me to think even more about that is another thing I reflected on during this journey. Some other key insights taken away from net present value calculation and capital budgeting. Um, we learned that net income does not equal cash flow. As year one, our model showed zero net income. Um, then the earnings before interest in taxes. Um, the business generated $1.2 million in cash. Um, because we added back the depreciation costs, we took away even though they're non-cash expenditures, we still accounted for them in our financial statements. Um, accounting profits include non-cash fantasies like depreciation. Um, and valuation must be based on money you can actually spend or return to share shareholders. Um another takeaway that we took or that we another insight that we took away rather um we had the 8.5 8.5% whack which represents the opportunity cost of money being spent on investment that can't be returned to shareholders. So kind of weighing the options there. If a project can't beat the whack, we are effectively stealing value from investors even if the project makes a profit. So that's just something else we need to consider how much money we're really spending and if it's worth it um based on our rate of return compared to our whack terminal value. Um we discover that nearly 45% of the project's value came from year 10 which was the exit or selling our company or the roster rather. Um and long-term projects depend on this exit. Um a slight error in this calculation can flip a decision from accept to reject. So we always really need to scrutinize the final year and make sure that our calculations are actually accurate. As for the sensitivity analysis, um we saw the negative correlation between net present value and whack as well as the positive correlation between the revenue and the net present value. Um and then we saw this framework of spending money now and get risky money later applies to everything which is aka being universally applicable. Um, and the net present value framework is the universal language of business business viability. Um, whether that be in mergers and acquisitions or leasing versus buying a building, all of these business decisions, uh, in one way or another rely on the net present value framework. And then lastly, uh, looking at our executive recommendation, um, we would accept this project because we saw the net present value being greater than the hurdle rate. um or in other words the internal rate of return exceeding the whack of 8.5%. So the project is financially profitable or positive and profitable as the net present value of 2.69 million over 10 years. Um the net present value is 2.69 over 10 years but it's operationally fragile as it relies on high revenue volume. Um it's got positive operating cash flows which begin in year one with that $1.2 million and continue Yeah, the $1.2 million inflow and they continue through year 10. Some key risk factors we had to look at as well is that because we had the $3.4 million in fixed costs um through the sensitivity analysis, we saw the 20% drop in revenue eliminates nearly all of that shareholder value um since the net present value is less than zero there. Um and the 45% of net present value derived from the year 10 exit um shows that um if the location can't be sold or subleasased favorably in a decade, the returns diminish. So we really again have to put emphasis on that last year and make sure that we will be actually be able to take away this value. So the roaster shouldn't be treated as just a coffee shop but as a capitalized marketing expense. And there are all these different costs that we need to consider while we're looking at this decision. So that is my session 10 driver framework um assignment looking at the cost of capital. Thanks for watching.",
  "video_url": "https://youtu.be/KtCb5M9EZGY"
}