{
  "student_name": "Deep Patel",
  "org_defined_id": "037663656",
  "username": "pate2233",
  "email": "",
  "transcript": "Hey guys, today I will be doing session nine cost of capital analysis assignment. Okay, so for define and discover, we know several things. So the purpose of the analysis is to determine what Netflix's weighted average cost of capital, which is WACC, for evaluating a 5 billion content investment would be. So we're going to assess the potential of a 3 billion new debt issuance. And we're also going to compare Netflix's WACC to competitors such as Disney and Amazon. And we're also going to evaluate whether project specific WACC is required in US versus international content in Netflix's streaming services. Okay. So there are several key questions that we need to answer. So the first question is what is Netflix's current cost of equity and cost of debt? What are Netflix's current capital structure ways? How does WACCC change when there's more leverage? What discount rate should be used for different types of content investment? And is Netflix's cost of capital competitive with its peers such as Disney and Amazon? So, we're given several um data values. Um so, the first one is the market cap of 200 billion. The debt of which is a market value of 13 billion. Beta is 1.3. The risk-free rate is 4.5%. The risk-free premium. The market risk premium is 5.5%. The bond yield is 5.8%. The new tax rate is 21%. The new debt under consideration is 3 billion. Disney's WACC is 8.2% and Amazon is 9.5. Okay. So, we're going to calculate what um Netflix's WACC comes out to be. Okay. Um so for represent we're going to represent some of the formulas that we have. So um the WACC formula is um this as it's shown and then we're also we also know the cost of equity um and then the um CAPM formula which is this RE= RF plus beta multiplied by MRP and then the cost of debt formula and then the capital structure ways. So now we're going to implement all of this information that we already know into um it using Gemini and Python. Okay. Um so in Gemini I did I gave it the prompt saying I I am completing a corporate finance an assignment on Netflix's weighted cost of capital. I need you to generate a Python code that performs all the calculations and creates a visualization based on the exact financial information below. So all this financial information is the information that we were already given. And the Python coast code must calculate um the cost of equity using the CAPM formula which is this. Calculate the after cost after tax cost of debt which is this. Calculate NEetflix's current WACC using the market value weights based on this. And then the formula is this. Um, calculate Netflix's WACC after issuing an additional $3 billion of debt. And then um create a leverage sensitivity analysis, produce a Mattplot lib library um line chart and then the output should print all of this. Okay. So the code that I'm I was given is that okay now I'm going to analyze this. Okay. So this is the inputs that we were given and we gave it to Gemini. And then these are just formulas that it uses to calculate all the um values. And then um if we go to here this is the um values for the line chart which it will make for us. And then this is the values of like the cost of equity and stuff like that. Okay. So the cost of equity comes out to 11.65%. The after tax cost of debt is 4.58%. The current WACC is 11.22% and the WACC after the new debt issuance is 11.13%. So this chart shows us that um when like the debt ratio is 15%, the WACC becomes 10.6%. And then whenever like five like right now the after tax cost of debt is 4.58% which is around 5% is slightly under 5%. And it it shows that this it is 11.2%. And um over here if I go down like as the um debt ratio increases the WACC would increase as well. Okay. Um and this is what I used. So um I can validate all of this information. So like I plug I used the formulas that I know from here um into here and then I plugged in the values that I know and I got 11.65 65 for the cost of equity and that is the same cost of equity that Gemini gave us. Same thing with the after tax cost of depth 4.58%. Same as here. Um the current WACCC is 11.17%. It is slightly lower but is very um similar between the two. And then the um after the 3 billion debt issuance it comes out to 11.2% 2% to 11.3% which is slightly similar to this. Okay. Um so I can validate this by um recalculating the WACC using Python to eliminate the manual error. I can confirm the use of market values not book values and then I can double check the CAPM inputs and they all seemed correct. So I can test how WCC changes when the beta um changes from 1.1 to 1.5% when the debt ratio increases from 5% to 20% when the bond yield changes plus or minus 1%. And then the benchmark validation was um so Disney's WCC is 8.2% which is which means it's a lower leverage also lower risk. um Amazon's WCC is 9.5% which is higher corporate risk and um Netflix's WACC which is what we calculate right now it aligns with the higher systematic risk that we are given over um here the the risk that we were given and then the reasonless check is Netflix's high beta which leads to a higher equity cost which leads to a higher WC CC and lower debt usage leads to a smaller tax shield. Okay. Now I can evolve on this um by improving accuracy. So I can recalculate levered um beta using the Hammad formula to reflect um debt impact. I can add country risk premiums per region for international content since like international prices and content is also different. I can add a scenario with investment funded with a 50% debt and 50% equity. And then I can also add dynamic visualization with WCC and the debt to um ratio curve. And then strategic evaluation recommendations would be I can gradually increase leverage to 15% debt weighing. I can maintain the um BBB plus credit rating and keep um borrowing cost low for um investors. I can use project specific hurdle rates for green light content. Align capital structure closer to Disney to reduce WACCC. I can continuously revisit capital structure as cash flow improves. And then I can reflect on this. Um so like the key takeaways is that Netflix's current WACCC which is around 11.17% is above um others which reflects a higher risk for Netflix. Um I also know that the increasing debt slightly reflects reduces the tax benefit because the leverage is still low. A uniform WCC is inappropriate for global pro projects and risk varies by different types of markets. The capital structure is a strategic tool which means more debt is higher tax shield but it also means a higher equity cost. And then the reflect on the decision is that WACC provides a rigorous hurdle rate for evaluating the 5 billion content investment. Um optimal financing is likely a disciplined increase in debt not equity and strategic content investment should exceed project specific WACC not firm YWACC. And this analysis directly connects corporate finance theory to real world real real world competitive strategy. Thank you.",
  "video_url": "https://youtu.be/Z1VPW6VzvoQ"
}