{
  "student_name": "Chris Huisman",
  "org_defined_id": "033313257",
  "username": "chuisman",
  "email": "",
  "transcript": "Hello everyone. This is Chris Heisman and today we're looking at the session eight assignment on market efficiency. So to begin we're going to start with our defined stage um and define the problem. So the primary objective is to analyze the uh GameStop short squeeze. Um we will test uh this event against three forms of the market efficient a efficient market hypothesis and evaluate whether the behavioral finance or classical uh efficient market hypothesis provides better explanation for the observed price action. But before we do this uh we're tasked with verifying this statement. GameStop was traded at 04 uh cents in August 2020. And based on historical data queries uh this statement is false. And uh this historical data right here uh is going to show that the uh stock was traded from 1.04 to $1.67. Uh so this following code installs the uh data set for our analysis and also verifies uh GameStop stock. And as you can see um it never was 04. Okay. So now that we have the data from uh y uh from Yahoo Finance, let's move on to the represent stage. So our analysis will be implemented um using uh spy data and GME data uh loaded previously. So, we're going to visualize uh we're going to create a primary chart showing the GME adjusted closing price and GME is GameStop. And we'll take a look at some um uh some uh investments including Ryan Cohen's investment uh the peak price and Robin Hood trading. Um we're going to take a look at the week form uh EMH test. We're going to overlay a 50-day to 200 day simple moving average. Um so if it's weak um it shouldn't predict uh future returns. Then we're going to take a look at the semi- strong form test where we're going to analyze price reaction around uh key public news events. And then we're going to do a behavioral and risk analysis in the evolve stage. So we'll move beyond uh the EMH to quantify behavioral aspects. So here uh we're just going to confirm that our data is downloaded. So we have GameStop, we have the SPY data, S&P 500. Okay. So now let's implement the problem. So in this stage, we're going to execute the first part of our plan. We're going to calculate the 50 day and 200 day simple moving average of the weak form test and create a primary visualization. um of the GE adjusted close price and the SMAs um yes okay this chart will be the foundation of our analysis. So this code right here creates the primary visualizations lots of stuff and here we go. So now we can see uh we can see here Ryan coin buys 13%. And then the surge so the red surge begins and then over here towards there we're going to have the Robin Hood restrictions. So yeah now we that's where we can see um the SMA fluctuations. Okay. So let's validate this. the charts from uh this is going to help us validate the hypothesis. So this plot confirms the uh narrative the price is low and stable and then exponential price surge occurred um and it closed at 86.88. Um and obviously this shows a massive spike clearly supporting the 10-fold increase in retail trading. Uh so the weak form test was violated. The price chart shows a classic momentum anomaly. The price crossed above its 50 and 200 day SMA in late 200 I'm sorry 2020 and then exponentially diverged from them. So we have generated enormous abnor abnormal returns which uh states that past price data trends cannot be used to earn such returns. So violated. Uh three, the semi- strong form EMH test was also violated. Uh it was not rational. The public reaction to it was not rational. Uh so some public information, Brian Cohen stake and the uh known high short interest reaction instead of price moving immediately uh it first lagged and then was wildly overshot uh any possible fundamental values. So this overreaction driven by social media is a clear failure of semi- strong efficiency. And fourth the strong form tests was also violated. This is the easiest to prove. If this form held the price would always reflect all information. So the fact that this price was about $5 in 2020 and 400 plus in 2021 and then 40 in 2021 of February, the price was not reflecting information accurately. So the existence of a bubble or squeeze existed. So it was a violation of a strong form image and yeah so this is just us validating it. This is just what this code is doing. Um daily returns calculated GQ doing a peak squeeze 1,00%. Whereas the spy during the same period was nowhere near there. So abnormal return versus the market. Conclusion, strong evidence against market efficiency. Now let's uh move on to the evolve stage and take this analysis up a notch. So our validation confirms that image was violated and we want to ask why. So um the answer lies in behavioral biases. Uh this was a textbook example of hurting and overconfidence and confirmation bias. Um limits to arbitrage. EMH assumed that if prices wrong, rational investors would step in, short the stock. Well, this didn't happen. It was already overshorted and there was a squeeze that happened. So this forced buying from shorts added to the buying pressure from retail, creating a short squeeze and pushing the price even higher. And R investor profitability. Uh that asked the question, could a rational investor have profited systematically? Um in hindsight, yes, but beforehand, no way, Jose. So the risk was enormous. The conclusion is that this was not a systematic profit opportunity. So uh this code is going to uh show us uh the analysis including risk. So we'll go over here. We have a very similar chart. This is the GameStock price. So this is its price and this is its risk. Kind of nuts. Kind of nuts. So every this is a this volatility plot quantifies the extreme irrational risk during the peak. So yeah, look at that. Crazy crazy squeeze. All right. So this is analysis uh is going to conclude in the represent stage. Um we're just going to overlook everything. So the assign the uh the original uh 04 price was false. Um all the EMH forms were violated. So weak form, semi-strong and strong completely violated. Um this was totally due to behavioral bias and uh arbitrage and uh basically I mean in theory uh this event does not mean markets are never efficient. It just demonstrates that they could be profoundly inefficient in the short term. Um this event also supports and refutes uh both active versus passive. passes investors were unharmed but most active managers were destroyed. So in conclusion uh this is a event uh that was a powerful argument for the behavioral finance framework and highlights rational models are incomplete without accounting for human behavior and real world market versions. And yeah that was my analysis on the game stop short. Thank you.",
  "video_url": "https://www.youtube.com/watch?v=ZpRGq5m3L4Y"
}