{
  "student_name": "Lahari Bikkavilli",
  "org_defined_id": "035990933",
  "username": "lbikkavi",
  "video_url": "https://youtu.be/D4NV4k0gMno",
  "transcript": "Hi, how are you? My\nname is Lahari Bikavilli and this is my\nsession 12 assignment. For this one, I think\nI'm going to go ahead and skip through the\ncode and not actually go through it in\ndetail just because it is very long. But as\nalways, I reprompted Gemini a few times to\ngive me comments. That way, if I ever go back\nthrough the code, I have it. I use generic\nvalues that are like our assumptions or\nparameters to make the rest of this information,\nkind of do the mathematics that we\nneeded to do for this. Along with that, I\ncreate some sort of a diagram. So for this,\nI went with a bar graph, I believe,\nthat you'll see lower. So there's going to\nalso be things about like a legend and\nthe x-axis, y-axis. And then, of course, a\nbunch of print statements that we get our\nresults. But because the code is very long\nand has a lot of print statements like this,\nI'm going to go ahead and skip through and\nget to the actual what the task was and what\nthe the sorry what the code says. So Panera\nBread Evaluation, this is the ever neat note\nsheet for me to read aloud. the goal was\nessentially to value Panera's for a potential\nKKR financial buyer acquisition and recommend\ntheir winning like a winning bid range that\nthey would have so for this these are the\nrequirements that I listed at the top just\nto make sure I hit everything and then so\nover to define and discover um I defined the problem\nas what is Panera worth to KKR versus\na strategic buyer and then I identified the\nknown so this is the six billion in revenue\n900 million in EBITDA strong digital mix\nthings that Panera had that would make them um\nthat like they did to have in general next i\nidentified the unknown so i didn't know their\nwhack their terminal value their capex\nintensity their possible synergies any of those\nthings and then next i set up parameterized\nassumptions so i could test these scenarios\nthat's what we saw a little bit earlier\nin the code as well um for represent i used\na clean structure so i use in it my inputs\ncreated dcf did multiples synergies and then\nfootball field bid in that sense i identified\nkey value drivers so revenue growth even to\nmargins capex for new stores and then terminal\ngrowth and whack and then implement so\ni built a five-year dcf with revenue ebit\nebit and et cetera et cetera the information\nthat you see here i modeled base upside and\ndownside scenarios so i did three technically\nthree different scenarios all of which we'll\ngo over later and um sorry i lost my footing\nhere yes so i did those three i used um this\nuh perpetuity terminal value i built a whack\nfrom their cap end and enforced the 10\nkkr hurdle and then added on ev and equity\nbridge and management rollover for validate\ni cross-checked the dcf values against what\nthe trading comps would be for um companies would\nbe for ev and ebitda and then the president\ntransaction multiples i checked the terminal\nvalue percentage of ev make sure it was\nwithin a reasonable range for this scenario\ni applied ev such ebitda versus market\nbenchmarks and then i ran whack versus terminal\ngrowth sensitivity analysis evolve layered\nin strategic synergies so i modeled these\ndifferent synergies that you'll see a little\nbit later in the thing as well and i compared\nfinancial discipline versus strategic ceiling\nfinally reflect i valued what um what the\nmarket is most sensitive to which is um which\nis the values most sensitive to terminal\nassumptions margin expansion capex intensity\nstrategic buyers can pay more but kkr should\nnot final recommendation prioritize return\ndiscipline over headline price so my key results\nwhat the model so so starting with the\ndcf so going through my results here on\nthe right side i have implement so panerabed\ncomprehensive business valuation whack\njustification this is the immediate checkpoint we\nhave our component input and value these are\nall of our numbers here with a little bit of\num the math and kind of what the different\nthings are so whack narrative i'm using\nscenario such target whack of 10 for evaluation\ndiscipline and then cap m cross check implies\naround 8.3 percent and that after tackle\ntax around 4.9 percent then moving on financial\nanalysis requirements the dcf model this\nis my base case here five-year operating\nprojections and the fcf bridge so as you can\nsee it starts from 2026 so next year and goes\nfive years from there and it shows the difference\nin their revenues ebitda ebit and so on\nand so forth i think the revenue you can\nsee here is this is intentional right we're\ntrying to see if the revenue can grow and as\nthe years go the revenue does grow here which\nis very important same with the ebitda as\nwell terminal values support and ev composition\nso i have a few numbers for that here\nas well and then kind of come back down here so\nbase case dcf is the anchor valuation upside\nreflects faster growth and margin expansion\ndownside reflects slower growth than\nmargin margin pressure terminal value is built\nusing the fcf and not shortcuts so multiples\nanalysis so trading comps 18 to 22 times the\nev evita so represent a realistic m a pricing\nwhich was the entire point of the scenario\nright well how can we make this a realistic\nversion of what panero might be going through\ndepending on these three different markets\nand then um precedence to find the floor comps\nto find the ceiling for financial buyers\nmoving on strategic synergies so strategic\nbuyers would be like starbucks mcdonald's\nthings that are kind of in the competitor realm\nfor um panera that they could potentially\nlike merge with and can realize the supply\nchain efficiencies digital platform scale\nstore overlap benefits for example mcdonald's\nand panera sell all of the breakfast food\nitems and things in that sense sorry i lost my\nthing here again um okay awesome right\nand then synergies are phased in probably\nprobability weighed and discounted at a higher\nrate so this creates a higher strategic valuation\nceiling so let me keep moving down here\nas you can see this is the comparable excuse\nme the comparable company and precedent\ntransaction value uh transaction analysis and\nas we can see the trading comps numbers here\nand then we can also see the precedents here\nmoving down we have the strategic buyer\nsynergies and positioning so synergy pv strategic\nev which is low and then you can see the\ndifference in the numbers so obviously strategic\nev high is going to have a higher number\nhere at the end versus strategic ev low then\ntriangulation football field synthesis this\nis the last thing here and so um sensitivity\nanalysis of WAC versus their terminal\ngrowth this is the evolve and validate part of\ndriver I like to at least kind of put\nsomething on there just so I can make sure where\nI'm at in the driver scenarios as you can see\nas we're changing this percentage here and\nincreasing it from 1 .5 to 3.5 we see the\ndifferent WACs changing at different WAC percentages\nfor example right and for the most part\nI think we see them increasing as they go\ndown the list obviously as we're increasing\nthis percentage it's more about how much\nthey're increasing by finally reflect and\nfinal recommendation this is where i'm going to\nspend the most of my time recommended bid\nstrategy for kkr financial discipline enterprise\nvalue bid range is going to be the ten\npoint two ten thousand two hundred and sixty\nmillion to seven thousand seven hundred eighty\ntwo million um i think those numbers might\nbe written a little bit weirdly just because\nof the um uh excuse me the phrasing of it\ngive me one second here okay sorry about that\nyeah i think the number oh this is open to a\ndifferent class i do think that the number\nwas a little bit um confusing and messed\nup there for a second but the numbers are\nsupposed to say as i have done here 7.8 billion to\n10.3 billion enterprise value the implied\nev evita is going to be 11.4 times to 8\n.6 times and then the walkaway price should\nbe 12.34 billion so the rationale for financial\nor strategic positioning this is where we have\nour final graph here that you can see sorry\nnot a bar graph I think I misspoke when\nI said it but the financial buyer which is\nKKR anchored a standalone value in market M&A\nreality so 12 to 15 times precedence bid\nrange center is going to be the 10 times and\nthen in respects the 10 percent hurdle rate and\nrelies on 10 management rollover strategic\nbuyer can justify our higher ceiling via\nquantified synergies and control premium so\nmoving on here we have the enterprise value\ntriangulation the football field right and so\nfor this i did have a specific way that i\ncould go through and um explain what the graph\nis here so this football field shows the valuation\nranges from each method so the left\nside is going to be the downside dcf and\nprecedent floor middle is going to be the basic\ndcf and trading comps and then right side is\ngoing to be strategic buyer range with\nsynergies and a control premium the red vertical\nline so these that you see right here is\ngoing to be kkr's work recommended bid range\nthe black dash line which is right here is going\nto be the strategic buyer walkaway price.\nThe key takeaway from all of this and what\nall those numbers really mean is that KKR\nshould not chase the strategic ceiling. That\nvalue depends on synergies KKR cannot fully\ncapture. So for them, they should not chase\nthat strategic ceiling. Sensitivity analysis,\nso why this matters, shows how valuation\nchanges with WAC versus terminal growth\nand then confirms that valuation\nis sensitive but reasonable. Base\ncase assumptions are defensible. Helps\njustify the walkaway price that we have\nthat we talked about. Final recommendation,\nso this is the money slide of things and\nkind of what my final thoughts are uh\nrecommended kkr bid enterprise value range\nbase dcf plus plus or minus the modest premium\nimplied ev ebitda so consistent with\nprecedent transactions includes 10 percent\nmanagement rollover conservative terminal\nassumptions disciplined whack and the walkaway\nrule do not exceed strategic buyer\nceiling any price over that destroys financially\nso i think the big thing here is\nthis do not exceed the strategic buyer ceiling\nand that's kind of what we're saying here\nright they shouldn't be chasing that\nceiling because they just cannot fully capture\nit and it will cause them to be financially\nbankrupt and so financial versus\nstrategic buyer contracts so I'll say this part\nclearly which is important KKR the financial\nbuyer values Panera on standalone cash flows\nrequires returns above 10% whack relies on\nexecution not speculative synergies so a strategic\nbuyer can justify paying more due to\nsynergies lower cost of capital willing to\npay a control premium overall the conclusions\nthat kkr should win only if price stays within\ndisciplined financial balance so based on the\ndcf market multiples and strategic synergies\ni recommend kkr to pursue panera with\nthe base dcf anchored bid range and walk away\nif pricing approaches the strategic buyer\nceiling just for their best benefit and to\nmake sure that they're putting their best foot\nforward in the money realm and yeah overall\nthat is my code i can kind of go like run\nthrough it here once in case it wasn't shown\nmore clearly because i was reading off my list\nand then this is the output that I have and\nthen as I go forward this is my code but\noverall yeah that's it that's my video Iappreciate your time thank you so much"
}