{
  "student_name": "None None",
  "org_defined_id": "036108316",
  "username": "rbadam",
  "video_url": "",
  "transcript": "Hi, my name is Ronaksai and today I'm\ngoing over my mini project 3. So\nutilizing AI, I created this cap budget\nAI um on HTML. So this is a capital\nbudgeting analysis and it uses a uh N8N\nto create an AI analyst reasoning. So\nthis our financial analyst analysis. So\nfirst I kind of just threw in some\nnumbers. So we have 50,000 a discount\nrate of 10% and a project here and then\nI threw some cash flow numbers in and\nthen to see what would happen. Um so\nthis is our AI analyst reasoning. So\nbased on the quantitive analysis this\nproject creates shareholder value with\npositive NPV of 122,213\nand then the return is 64.4% and it\nexceeds our hurdle rate of 10% in\nindicating efficient capital use. So\nlike if I was to refresh the page and we\nhave no numbers and then I run an\nanalysis. Since we have no cash flows,\nthis would be a bad one. So our\nquantitative analysis suggest the\nproject destroys value. The NPV is\n50,000 and the negative 50% return fails\nto meet your 10% cost of capital gain.\nOkay. So now let's go through how I\nbuilt this. So, first I used uh I\nutilized um AI and Gemini to analyze\nwhat needed to get done and then um I\nwanted to build a tool that handled both\ntime value money and then does the math\nin uh instantly compared to um us create\nuh completing the math for it. So, uh,\nutilizing a lot of the information from\nsession 10 and the context about using\nthe spreadsheet to calculate NPV, but\nhow that spreadsheet can't tell you if\nthe project aligns with your strategy or\nwarn you about hidden risks. So, first I\nwent through the driver framework to to\nbuild this. So we had so the initial\nlike with the discover was to move\nbeyond the accept reject binary outputs\nthen to the reason where I reason with\nthat an AI agent acting as senior\nanalyst could bridge the gap. So this is\nwhen we implement our 8 nan and then\nlastly utilizing Gemini I was able to\nbuild the front end in HTML for\nimmediate feedback and then connect it\nback to the uh nan backend for the AI\nreasoning. So now let me go through some\npre pre uh pre-populated uh uh case\nstudies that I've created. So let me\nhere load our charge port charge point\ncase study and then run our analysis. So\nfor our charge point case study we have\nan initial investment of 5.3\nuh 53 million sorry. Yeah. um\nyeah 53 million and a discount rate of\n11% and a project term of 10 years. And\nthis is our cash flows which we can also\nsee here with year one being a cash flow\nof 8 million and then changing to 15\nmillion at year three and then changing\nto 12 million at year 8 and then back to\n20 million at year 10.\nSo this is kind of just like a a\nballpark just um the charge point\nanalysis and then so\num so now we can map our uh cash flow\nthat I just showed you. This is our cash\nflow and then this is our cumulative\ncash positioning and then um\nso with our analysis we were given the\nNPV calculation which is 22 million and\ninternal rate of return and then our\npayback year and then we see our IRR\nversus\nour R IRR which is 9.1 19.4 that I said\nearlier and our hurl rate of 11%. And\nthen lastly,\nwe can also see that um\nuh we have the 4.5% pay uh 4.5 years of\npayback period which I also stated\nearlier. Now we can move on to our AI\nanalyst reasoning. So based on the\nquantitative analysis, this project\ncreates shareholder value. We know this\nbecause it has a positive NPV of 22\nmillion and a return of 19.4%. Which\nexceeds our hurdle rate of 11% which\nindicates that it's efficient capital\nuse.\nSo now um\nI'm going to move on to our second uh\nexample. So we have our Starbucks\nexample here. Let me load it in. And we\nhave the initial investment of 12\nmillion here. And then let me run my\nanalysis. So similar situation where we\nhave a hurdle rate of 8.5 that's our\nWACC and our project term of 10 years.\nAnd then we can map out our cash flow\nand cumulative uh cash positioning. and\nthen where our annual cash flow is. So\nit's about two two million a year one.\nAnd then we have our m um the mature the\nmore mature years of year two to year\nsix uh year\nyear 9 which is 3.5 million and then\nlastly a very good year of year 10 which\nis 6.5 million. So based on the\nfinancial analysis we we know that this\nprovides shareholder value because it\nhas an MPV of 10 million and then the\nreturn is 24.1% which exceeds our hill\nrate of 8.5%.\nWhich indicates efficient capital use.\nSo this is the capital budgeting\nanalysis tool that I created using uh\nGemini and other AI tools. Thank you."
}