{
  "student_name": "Chris Huisman",
  "org_defined_id": "033313257",
  "username": "chuisman",
  "email": "",
  "transcript": "Hello everyone. I'm Chris Heisman and today I'm presenting my cost of capital analysis for Netflix using the driver framework. So the goal for this project is to determine if Netflix should issue a $3 billion uh debt investment to fund new content. To make this decision, I need to calculate the weighted average cost of capital or WACC which will serve as the hurdle rate for this investment. So let's dive into the analysis. So starting with the define and discover stage, um I've mapped out the financial parameters provided in the case. Uh, so we're looking at, let's see what we have here. We're looking at risk-free rate of 4.5% and market was premium of 5.5%. Crucially, Netflix is a beta of 1.3. So that indicates it is more volatile than the market. We also have the current capital structure at 200 billion in equity and only 13 billion in debt. Um so I've stored the variables in this code um to ensure consistency throughout the notebook. All right, moving on to the represent stage. Um so before we perform our calculations, I modeled the logic uh using Python. Uh let's see here. So like the cap uh capam function after tax cost of debt and the weights. So this is where I have uh defined those functions. Um yeah. So by moduleizing this I can easily rerun the analysis. Um right so functions defined logic proposition complete representation. Okay moving on to implement. Uh this is where we're going to actually start the analysis. So I'm running two scenarios here. uh scenario A which is Netflix's current uh WACCC and scenario B which is going to be the proforma um WACCC after adding the $3 billion in debt. So uh using those predefined functions and data from earlier uh we're able to calculate uh the uh following. So as you can see the cost of equity is 11.65% 65%. Um, and yeah, the cost of debt is actually significantly lower at 4.54% due to the tax deduction on interest. And currently, uh, Netflix is equity heavy with 93% of its capital coming from expensive stock. And yeah, and you can see here, this is going to come important later, but our new WACCC is 11.13%. Okay, so moving on to validate, I'm performing some sanity checks to ensure the model aligns with our theory. Um, so we're going to have uh these three checks. Let's run the code real quick. Okay. So, check one. Um, is our debt cheaper than equity? Yes. Um, this is going to confir confirm confirm our uh seniority and tax shield concept. Our second check, did the WACC go down? Uh, yes it did. Uh, by swapping expensive equity for cheaper jet, the WACC dropped slightly. And for check three, I'm comparing it to the industry um at roughly uh 11 point uh 22%. Netflix is above the industry average of 8 to 10%. So this makes sense because Netflix is a high growth uh streamer whereas appears like Netflix are diversified uh conglomerates with lower risk. So as you can see this reflects the higher systematic risk uh and beta 1.3. Now moving on to the evolve section. Um we understand that financial models aren't static. So I used Python's map uh plot lib to visualize how sensitive the WACC is to leverage. So, uh, I also implemented some US content versus international content. So, I'll show you right here. This is our our graph. So, this red line shows the Netflix's WACCC curve. You can see it trending downward as we add debt. Um, this green line is our proposal. And, uh, yeah, this visual confirms that Netflix is currently underleveraged compared to a peer like Disney, which is down here at like 8.2. 2%. And yeah, this this checks out because um as the debt increases, we should expect this WCC to decrease due to uh tax shielding. I also calculated um project specific WACCC. So since international content carries currency and regulatory risks, I added a 3% premium. Um so domestic product hurdles 11.22 international content 14.22 this increases because we know uh that international content is going to be riskier so we're going to demand a higher return. Okay. Now going on to our reflect section. Um based on my data uh my recommendation is to proceed with the three billion debt uh issuance. Uh the reasons why is because we have a lower hurdle rate. It's going to lower our WCC, so making content projects more profitable. Um it efficiently uses the corporate tax shield and uh even with this new debt, Netflix remains com Netflix remains conservative compared to Disney's higher 30% debt ratio. And yeah, this is just a table comparing it to the pure Disney and the other cost of debt, cost of equity values. And yeah, thank you for watching and I hope you liked the video.",
  "video_url": "https://youtu.be/pDq9o5Q16Pw"
}