{
  "student_name": "Ryan Date",
  "org_defined_id": "037312318",
  "username": "rdate",
  "video_url": "https://youtu.be/JAKURHy2gWk",
  "transcript": "0:00 Welcome to my session 12 assignment. Um, I'm going to dive right into things with the driver methods, starting with D, Define and Discover.\n0:09 Um, so the objective for this video is to provide a defensible valuation range for Panera Bread and recommend a winning bid strategy for KKR while weighing financial buyer discipline against strategic buyer synergies.\n0:22 Um, so the key facts from the deal snapshot that we have is revenue is at $6 billion and growing 8% annually.\n0:30 EBITDA is at $900 million with a 15% margin. Net income is $400 million. Um, there are 2,100 stores with 500 new stores, playing in five years.\n0:42 Digital sales are at 50%, currently targeting 70%. And for industry references, the P-slash-E is 22 times. Uh, the precedent EBITDA is 12 to 15 times, Chipotle is 35 times, and McDonald's is 25x.\n0:59 So, and the WACC is 9%, and management wants 10% rollover. Um, and strategic bidders, such as Starbucks and McDonald's, are present.\n1:08 Uh, so some key questions that we're also going to look at is, what is Panera's intrinsic value using multi-, multi-scenario DCF, and how do comparable public companies and precedent transactions compare?\n1:20 Support this valuation. How do financial versus strategic buyer perspectives affect bid strategy and price? So, for the represent portion of Driver, um, we're going to model Panera's financial projections, free cash flows, and valuation ranges.\n1:35 So, multi-sear-, scenario- DCF, uh, five-year projections. Well, the assumption that we're going to make here is that revenue grows, growth is that base 10% upsize, or base 8% upside 10%, and the downside's going to be 5%.\n1:50 For the E-B-I-T-D-A margin, the- uh, base is going to be 15% upside 17% and the downside's going to be 13%.\n1:56 Um, the cap X, uh, is 4% of revenue, tax rate is 25% and the WACC is 9%. And you can see here- the calculations that my, um, AI large language model he used.\n2:14 Um, the capital FCF is going to equal EBI TD, uh, EBI TDA times- one minus T plus depreciation minus cap X, minus the change in working capital.\n2:30 And, uh, perpetuity growth is 3% and the terminal value, um, is going to be calculated using this formula right here.\n2:40 As you- You can see, um, the valuation ranges, uh, the base case, DCF, is 7.8 billion, the upside case is 9.5 billion, and the downside case is 6.5 billion.\n2:50 So that's what we got, uhm, throughout the calculation made. And, the- multiples applied were the EVE-EB-I-T-E-A at 12 to 18X, and the P slash E at 22 to 35X.\n3:09 So the valuation range, the EV based on- Ops is 8 billion to 10 billion, and the implied equity value is about 7.5 to 9.5 billion.\n3:20 And the present transactions, umm. The relevant transactions would be fast casual acquisitions in the last five years, and the E-B-I-T-D-A multiple- levels of 12 to 15X, and the transaction EV is me 7 to 9 billion.\n3:34 So, for the implement portion, umm, I generated Python code with the help of a-of the same large language model, which you can see in my- Google collab book right here.\n3:46 Umm, at first, it takes the inputs and it base financials and calculates growth assumptions, other assumptions. Now, the Python calculates comparable and present multiples and millions.\n4:03 And then it has this function here for the free cash flow projection. And then it has this function of the DCF valuation and it will calculate the DCF for scenarios as well.\n4:13 and comps and present ranges. And then it creates this lovely chart here. And it produces scenario values at the end.\n4:22 So that's my Python notebook. And the target value is going to be 7.5 to 8.5 billion. Umm, the financial buyer kickin- Our perspective is going to focus on discipline returns leverage and FCAF.\n4:36 Um, it's less willing to pay a strategic premium and a strategic buyer perspective such as Starbucks or McDonald's. Um, the potential synergies are potential store overlap, which is 50 to 100.\n4:48 The million dollars in annual savings, the digital scale, uhm, faster expansion of delivery and loyalty programs, operating leverage, so shared supply chain, and SGA efficiencies.\n4:58 So they'd be willing to pay a premium, ten, ten, ten, by fifteen, twenty-five percent above base valuation, um, and the integration risks are cultural fit, retention of key management, um, and IT systems.\n5:14 So the management rollover is ten percent rollover incentives, retention, and alliance interests. For the verify portion, um, the step was to triangulate valuation using DCF comps and pressing transactions.\n5:29 So through DCF, the low end is six point five billion, and the high end is nine point five billion. For comps, the low end is seven point five billion, and the high end is nine point five billion.\n5:43 And pressing transactions, it's seven billion at the low end and nine billion at the high end. So everything seems to be within six point five to nine point five billion.\n5:52 Somewhere in that range. Umm, yeah, and the observation, the consensus value is somewhere between seven point five and nine billion.\n5:59 Umm, moving into the final steps here, for Evolve, umm, we would adjust assumptions for sensitivity mark. So, the upside scenario assumes 10% revenue growth, margin expansion, and rapid digital adoption.\n6:15 The downside scenario reflects slower store growth, digital adoption plateau, and margin compression. Umm, and consider potential changes in WACC. the interest rates, or competitive bids.\n6:26 Umm, for my final stage, I've created an executive recommendation. So, the valuation range will be somewhere between 7.5 billion to 9 billion, and that's the consensus across- DCF, comps, and precedent transactions.\n6:43 The winning bid strategy for KKR is the walk-away price, the support by ability. The initial offers me 7.8 to 8 billion to leave negotiation room.\n6:52 And the rationale here is to stay disciplined as a financial buyer, while- highlighting operational upside and efficiency improvements. And negotiating talking points that you could look at is synergy potential versus strategic bidders, management retention, and financing flexibility and leverage capacity\n7:09 . So ultimately the conclusion here is the financial- buyer position is recommended because it's disciplined, it's ROI focused, and it avoids paying strategic premiums.\n7:18 And a strategic buyer may offer a higher price, but KKR can capitalize on operational improvements and digital expansion to achieve superior returns without overpaying.7:28 Thank you. Thank 3 3 5 6 4 7 8 5"
}