{
  "student_name": "Ramon Randolph",
  "org_defined_id": "036002798",
  "username": "randol15",
  "email": "",
  "transcript": "All right. So, our task today was to act as a venture capital firm and to analyze the pro asset pricing model for these the following three three companies um and to give an analysis of what this means for them. So the first thing that we needed to do, we need to understand the data that we're given. And so that means we need to understand how the capital asset pricing model works. And so basically it's a formula to get the required return of our stocks. So basically what investors will demand from the stocks for the risk that they take. Um and that includes the risk fee rate. So basically the rate of the lowest risk option or the no- risk option which is usually treasury bonds. The beta which is um the measure of how volatile a stock is compared to the market. So high beta um highly susceptible to changes in the market, low beta not much susceptibility and then the market risk premium. Um, and that's the difference between the expected return of the market and our risk-free rate. So, our expected return, just so we have a clear idea of what this is, was 10.5%. Um, and that's just the S&P 500. And so after this what we needed to do was calculate the uh required return for each of our companies. And for Cloudtech that's 13.5%. For regional bank corp that's 9.3%. For green energy utilities that's 11.1%. And then as a comparison I used Palance here which is a very well-known company and their uh expected or required return is 20.4%. Um and so all this means is th this is the amount inspector investors would expect to to uh have put m to get back after putting money into these stocks. Um after this we're looking at our security market line. And this is basically the relationship between the required return and the beta. So uh risk versus return essentially how volatile it is for the market and that's how risky this stock is. like if the market crashes, you're losing all your money. And then how much uh you can expect for that return, like the acceptable amount that you would need for this stock to be valued at what it is. Um, and so what we want is for our required returns to be lower than the uh market um yeah or no expected return is higher than required return. Yeah, we want our required returns to be lower than our market expectations and that makes it a good stock to invest in because it could be undervalued. Um, but if it's higher than if our required return is higher than the market, it may be overvalued. And so for most of these stocks, you're pretty overvalued. Um, the green energy is the closest to being fairly valued. Um, the best one to invest in probably be Regional Bank Corp as that could be uh that could that's under the market and so it could have like that undervalued thing and it could make us a lot of money but Palanteer and uh Cloudtech are overvalued. Um, and the reason that is is because like like I said, their betas are so high. They're very uh susceptible to market changes. And the reason for that is especially for uh these two companies, they're providing services that are in uh I don't want to say bubble, but I think bubble is the right word. Um they're providing services that are based on demand very much. Like if say we're in a recession, they're not going to, not even say we're in a recession, they're not going to do very well. Like the regional bank and the green energy, they're things that you would need outside of in regular day life. Like basically everybody needs energy. Basically, everybody needs a a bank. And so they're going to do well regardless of what the market is. And that's why their betas are so low. Um, but these two have high betas because they're I guess frivolous ones. Um, like they're not super important to everyday life. You're not going to you're not going to see people uh you're not going to see somebody who's worried about their next paycheck talking about talent here and how much uh how much investing in it could get them. But you are going to see somebody who who's worried about their next paycheck, worried about energy and what their bank is doing with their money. Um, and that's like the easiest way to tell why betas are so differentiated through different um different industries. Um, and so after this, what I did was have AI take our betas and look at the cost of equity and the uh cost of capital. So the cost of equity is essentially the same as our uh required returns. Um, and that's how much it would cost these companies to have investors uh invest in them for the quarter uh or for whatever period. like that's how much the investors would expect to get back. Um but the cost of capital depends on our debt, right? So what that means is here our cost of capital is yeah no weighted average cost of capital uh it's the equity weight of the company times the cost of equity plus the net weight of the company times the after tax cost of debt. And so for a lot of these company for cloud tech this doesn't matter cuz we have no debt. It's completely 100% financed and that's why its cost of capital is so high. It is as high as its cost of equity. Um in a lot of these you don't see that and that's because they are debt financed. Um especially for Palanteer I believe it's debt to equity ratio is like 0.04%. Which is really good. Um and that means that it doesn't have to its cost of capital is a lot lower or not a lot lower but it definitely is lower than its cost of uh equity. Um, and for these two, the cost of capital is much lower than the cost of equity. And that's simply because, like I said before, they're such um the industries are so necessary that they aren't as volatile to run or costly to run. Um and then for the last thing we had we wanted to or no not the last thing uh a good strategy for this we could get some debt financing in here um for cloudtech to lower this cost of capital and it might be able to do that. We could get more debt financing. We can get less uh equity. We could have some we could try to apply for grants and all that. But uh that also comes with risk like now the company's in debt and if you don't manage that well you're essentially uh going under. Um for the effects of a recession I had a look at a normal rate. This our standard I had a look at a very bullish market or or yeah a booming market. Um and then I had a look at a uh very bearish market. And so you see that here like the interest rates uh for the risk-free rates in the booming and the or no bearish market it's very low. Um and for the booming market it's much it's a little higher. Um and for the market risk premium like people don't want to invest in this time so they're going to so it's the risk premium is very high and that risk premium means that uh means that people are expecting much more in terms of their uh required returns. Um, so for if we go into a recession, all of these people want much higher returns for from uh stuff like Palunteer and Cloud Corp. But for regional bank corp, they're okay with a little bit less. Um, they understand like the regional bank is what makes them money, not what makes what holds the money. And so it their required return isn't as volatile towards this. Um, and that's partially because of their beta. their beta isn't volatile at all like it's much lower than market. So they don't need to worry about this required return as much. Um and then right here we just have a very clear graph of the costs uh for here it is. So like standard um around 13 bearish uh much higher 15 and then bullish a little bit lower like say that's 11. And for Palanteer, like since their beta is so high, like 2.65, you're going to see those values be drastically different in these uh and these bearish and bullish uh scenarios. Um and the same with the weighted average cost of capital, you see like for regional bank corp, it essentially the same all the way through. Same with general utilities. And that is because their betas are so low cuz their industries are not as volatile as these two. Um but one thing that we don't get in this is a comparable company analysis. So for CPAM or CAPM, it's a great way to look at um how the company does compare to the market, but it doesn't show us how it does compare to other companies like it. And that's something that if we are an investment firm or a venture capital firm, we'd need to know. Um, and so one thing that we could do is comparable company analysis. Um, and that just means that we look at the market relative to these companies like uh like cloud tech. So since Cloud Tech is an AI startup, it'd be looking at companies like Open AAI or if Regional Bank is a is a banking corp, it'd be looking at companies like um like Wells Wells Fargo or Fifth Third. And for green energy utilities, it'd be looking at places like IPL, like Indiana Power and Light for those uh energy companies and seeing what they're doing compared to the market and if it's a good investment for that specific segment of industry. Um yeah, and that's one shortcoming of CAPM. It doesn't tell us that. Um yeah, thank you",
  "video_url": "https://youtu.be/WMjvdiaDYjQ?si=8ZdI32xAS3AU4emO"
}