{
  "student_name": "Alex Lenig",
  "org_defined_id": "035836182",
  "username": "alenig",
  "video_url": "https://youtu.be/Gn5UEyafz1s?si=fcLr-tTLKv11l1md",
  "transcript": "Hi. So today my project for the capstone\nis a personalized investment plan um\nmaker. So basically you have a form here\nwhere uh you put in your information um\nyour financial information uh kind of\nconfigures it and stores that checks if\nyou have all the required fields um\ngives you an error if you don't. If you\ndo have everything goes ahead and\ncalculates the financial metrics uh and\nthen uses AI to generate the actual\ninvestment plan. and then finally spits\nit back out into Google Sheets. So, one\nof the cool things I like about this is\nuh that allows you to put in some goals\nyou might have. So, things like buying a\nhouse or um you know, getting a masters\nor things like that, things that are\ntypically big purchases uh and tells you\nsome of the best ways to invest in that.\nSo, we'll get started with a demo here.\nUm when you click execute workflow, it\nopens up this investment form and gives\nyou a bunch of different fields. Uh then\nyou go through and put them in. So,\nwe'll say I'm 35. We'll just go with the\nexamples here. Uh 75,000.\nUh I'm assuary,\nso we'll put in that. Uh your risk\ntolerance, um we'll say moderate for\nthis. Investment experience level, we'll\ngo beginner. Uh current savings, again,\nwe'll go example 50k. Uh monthly\ninvestable income, uh we'll say again,\n1500. uh existing investments. So 401ks,\nstocks, Roths, we'll say I have 401k say\nI have 40\n40k\nuh in my 401k. Uh debts and liabilities.\nSo loans, cars, student loans, cars,\nthings like that. We'll say student\nloans.\nUm we'll say 25. Okay.\nUh emergency fund status, we'll say I\nhave none for this one. Uh target\nrequirement age, 65 is kind of base in\nthe US. Uh major life goals, uh things\nlike what I was talking about earlier,\nwe'll say home purchase\nin five five years and we'll say 300k\nhouse. Uh investment pre preferences and\nrestrictions. Uh we'll go none here.\nText situation say I'm married at 25\ngoing married\nfiling\njointly\nfiling. There we go. Uh and then\nliquidity. Uh we'll say medium. So then\nyou click submit. Gives you form\nsubmitted. then basically goes through\ndoes all those things I was talking\nabout earlier and then it takes a minute\nto go through the actual AI of\ngenerating the investment. Uh so while\nthat's happening I'll talk about uh some\nof these uh specific parts. So uh who\nwould want this? Uh this is basically\nthis is pretty good for people who um\neither are in uh wealth management or\npeople who are individually wanting to\njust you know try to work on investing\nand figure out how are they going to\nactually be able to reach their goals.\nSo, it's good for professionals and also\nbeginners uh because like things you saw\nin the prompt, you can actually select\nuh what level you're at in uh you know,\nhow much you know about investing. Um\nthings like that. Um\nand then some things I learned while\nworking about this. Uh I'll talk a\nlittle bit more about some of them once\nI get done with this, but uh I learned I\nlearned a bit about the different plans\nthat you can actually invest in and uh\nspecifically how AI will actually um\ngive you some responses for it because\nit's kind of a little different than if\nyou just research it on your own. Uh so\nbasically uh finished up this so it\ntakes it and then spits it out into\nGoogle Sheets. Uh you can see the\nformatting itself. Uh this is one of the\nthings my\nThat was one I tested earlier. Uh or\nhere we go. Um\nso you can see it kind of looks Let me\nwhoop this wrap this. Um it looks like\nit should probably be uh inputed in\nsomething like Docs, which realistically\nit should. I was trying to do that\nearlier. Um this is one of the things I\nlearned about it uh earlier. Um I was\nhaving issues with it uh specifically my\nclient ID. um off of Google Cloud. Uh I\ndon't know why it wasn't working. So,\nit's something I'd like to fix, but um\nit still works definitely in Sheets. Uh\njust kind of have to format it a little\nlittle differently. But, uh yeah, it you\ncan see it looks like something that\nwould be in like a docs or sheets or or\ndocs or word or something like that. Uh\nso, getting into what it actually does.\nUm gives you all this information. Uh\nso, it starts comprehensive investment\nplan. Uh prepared for the inputs you\nhad. So 35-year-old actuary. Um and then\ngives you the date or I guess not the\ndate but the month and year of when you\ndid it. So right now it's December 25.\nUm then you get to the executive\nsummary. So gives you the top three\npriority actions you need to uh go\nthrough. So the immediate one it tells\nus is to establish an emergency fund.\nLike if you remember we clicked no\nemergency fund. So it's an important\nthing to make sure you have before you\nactually get into investing. So it\nrecommends a 26 26,250\nemergency fund uh 6 months expenses uh\nbefore aggressive investing. Um then\ntells us that our uh to allow K 1,500 a\nmonth for 18 months for uh to complete\nthe critical foundation.\nUm month six. So uh once we hit that uh\ntells us to maximize our tax advantage\nretirement accounts. So try to basically\nincrease our 401k uh as much as we can\nto match our uh employer. Uh then open\nfund a Roth IRA um and tells us\nrecommended 70k a year or 7K a year. 7K\nwould be nice uh for tax\ndiversification. Uh and then year two uh\ntells us we want to launch a launch home\npurchase fund. So actually starting to\nget into that process of uh we want to\nbuy a house. So um trying to get a fund\nto reach that goal. Uh so after we\ncomplete that emergency fund um redirect\n1,500 a month. So that 1,500 we had\npreviously into dedicated home purchase\naccount using uh conservative allocation\nto preserve capital for five years. Man,\nI cannot read right now. Um but yeah, so\nit gives us those three priority actions\njust to kind of get us on a route to\nknow where we need to go. Um then it\ngives us some key recommendation\noverviews. uh tells us our um just a lot\nof the information we put in um risk\nprofile we put moderate to uh moderate\nso it kind of tends uh based on kind of\nwhat you are so like like here I put in\nan actuary\num it told says moderate to conservative\nso it kind of takes that uh your role\nyour job into account and how much you\nmake to tell you kind of where you're at\num tells you primary is a two-t tired\napproach with conservative short-term\nfor the home purchase and then a\nmoderate long-term for retirement.\nUm projected retirement nest egg is 2.24\nmillion at age 65. Uh this is an\nmoderate scenario. Uh and then monthly\nretirement income is 77 74 grand a month\nor 74 grand I wish uh 7,400 a month uh\nand then tells you in just adjusts for\ninflation. Home purchase goals uh is\nactually achievable. So, if I put\nsomething in say buy a home in two years\nfor 20 million, uh it's going to tell\nyou that's probably not realistic.\nUm but here it tells you it's\nachievable. Um and it recommends putting\na n uh $90,000 down payment uh when you\nturn 40 uh which is when our plan was to\nbuy the house in 5 years. Um\nand then gives you some projections for\nthe outcomes. Uh so based on the 1500 we\nsaid we were contributing contributing\num says year five hopefully we'll have\n170 excuse me 178,000 in our portfolio\nuh enough for a sufficient down payment\non our house and ongoing retirement\nsavings. Year 10 hopefully it's up to\n360\numk. Then hopefully year 30 we're about\ntwo about 2.2 2 million um which exceeds\nthe 1.5 million target by 469%.\nUh so it looks like we're in a good\nscenario. Uh it does a lot of these\ncalculations uh based on a uh the\ninformation you actually put. So like\nwhat you're making per year, uh what you\ncan invest, but it also takes into\naccount um things like your job. So like\nan actuary has uh good uh typically they\ngrow um their salary increases yearly.\num by quite a good amount and then um\nit's definitely a growing field. So\ntakes all those kind of things into\nconsideration to uh give you these\noutcomes. Um then gives you a success\npro probability. So high 85% which is\ngood given your stable profession above\naverage income and manage manageable\ndebt load. Um and then it gives you a\nrisk profile analysis. So uh risk score\nof 65 or 65%. Um classification of\nbalanced growth with uh preservation\nfocus\nuh and then it tells you all these\nfactors that's considered um so some\nstrengths age 35 which gives us 30 years\num to in case there's a market downturn.\nuh stable profession like I was saying\nactuary um recession resistant career\nwith anal set uh strong income uh that\nuh married filing jointly tells you the\nadvantages of that low debt to income\nratio uh which is great only 25k in\nstudent loans um again this is just\nsomething that's current so can't take\ninto account projections of say say um I\ndon't know if I went back to school and\nuh had to take out a bunch just student\nloans that might cause some issues. Um\nand then the employer sponsored 401k. Um\nhaving that 40k in there is already\nhuge. Um that's a good one. Um but then\nthings that might be an issue with the\nportfolio. Uh having a zero emergency\nfund, which like it says probably should\nhave some immediate attention. Uh\nbeginner investment experience, which\nmeans um might be a lot harder to\nactually invest.\nuh near-term near-term major goal uh has\nsome means we'll probably have to do\nsome capital preservation\nuh self-stated moderate risk tolerance.\nUh so just where you're at in your\ncomfort zone and then how you need to be\nliquid uh with your liquidity.\nUm profile implications.\nUm\nso it gives you some of those uh\nrecommended approaches. Um\nthen here I think this is the more\ninteresting part. Uh yeah the asset\nallocation strategy. Uh so like I said\nabove we get a have a two portfolio\nstrategy that it gave us. Um so we have\nour goal of buying a house and then\nretiring at 65. So uh first portfolio a\nis for just building that emergency fund\nthat we have none of right now and then\npurchasing the home within 5 years. Uh\nso it tells us our target amount is 116K\nuh with how that's split up uh time\nhorizon of 5 years. Um and our objective\nso\nuh tells us what our recommended\nallocations should be. So 60% in high\nyield saving and market money or money\nmarket uh with a 4.5 to 5% APR or APY\num 30% in short-term bond funds. Um it\ntells us again it tells us how all these\nare broken down to actually get into our\ntarget amount. Um what it expects uh and\nthen conser 10% conservative bond bond\nfund.\nUm then goes through some dollar amounts\nfor at full funding to well just copies\nthose down basically to get to that\ntotal that we had up here. Uh then gives\nyou a little rationale just to make sure\nuh you know uh where you're at. Um\nso that's for the goal of a just\nbuilding a emergency fund and then\nbuying a house. Uh portfolio B is for\nthe long-term retirement which is uh\nabout 30 years in the future. So what we\nhave currently 500 or 50k in our 401k\noh yeah uh time horizon 30 and objective\nis to grow up to 2.2 million. Um so it\ngives us a little breakdown. Why is it\nSorry. I don't know why this isn't\nI don't know why this isn't coming down.\nThis one working. Yeah,\nthere we go. Okay. Um\nwhere were we at? There we go. Okay. Uh\nso portfolio B, sorry about that. Um\ntells us what we want to uh gives us\ndifferent breakdowns of where we want to\nallocate between years. So gives us the\n10 years uh basically a 10-year gap\nright now. So we're 35 and then where we\nwant to what we want to have to 45. So\n70% equities. Uh\nand then the different breakup of that\n70%. So things like domestic stocks,\nlarge cap lends, uh basically where we\nwant to be at. Uh then international\nstocks, uh fixed income, real estate,\nall those little things. Uh gives us a\nbreakdown of what we want to be invested\ninto. Uh then again gives another\nrationale to kind of support what it's\nsaying.\nUm\nand then then after that gives us uh\nsome other splits. So age 45 to 55 um\ngives all these different kind of\nfocuses we should have or paths we\nshould be uh thinking about. Um those\nare more projected because obviously\nthey're farther away. So we don't know\nwhat our financial situation might look\nlike in the next after that 10-year\nperiod. Um so gives us some some good\nthings to at least look at for the\nfuture. Uh then it tells us our specific\ninvestment recommendations. So tells us\nour priorities should be to build a\nemergency fund uh and our targets.\nUm and then it gives us some recommended\ninstitutions to actually put our money\ninto and uh invest in. Um,\nand then priority two, our four is our\n401k. Um, basically telling us to\ncontribute enough uh to to where our\nemployer can match it. Um, yeah.\nHello\nOkay. Yeah, I don't know why it's not It\nhas more information below this, but I\nguess it won't show me right now. Uh,\nbut yeah, so basically it gives a pretty\nin-depth view of uh your scenario. I\nguess that's what all that should be\nsaying. Um, gives you a good good basis\nto go off of and uh what to invest in.\nSo yeah, that was my plan or my project\nfor the capstone. Thank you for\nlistening."
}