{
  "student_name": "Gavin Hannon",
  "org_defined_id": "035642219",
  "username": "ghannon",
  "email": "",
  "transcript": "Hello. Hello. I'm Gavin Hannannah and today I am doing the session 8 assignment and this assignment is we are investigating a mark efficiency using the GameStop short squeeze event that happened in 2020 2021. So we were giving uh fact some facts and our event timeline which our timeline was in August 2020 GameStop nearly went bankrupt. September in September Ryan Cohen acquires 30% state in January of 2021 Reddit drove prices up to $483. In February, congressional hearings on there was congressional hearings on market manipulation for GameStop. And with some key data points, short interest peaked at 140% of float. Retail trading volume increased 10folds during squeeze. Trading restrictions implemented at peak. Hedge fund Melbourne Capital sustained 53% loss requir requiring a bailout. And lastly, analysis fundamental value estimates were between $10 to $40 per share. So for define and discover, our objective is to analyze the game stop event against the pred predictions of the efficient market hypothesis. And we need to evaluate whether this market anomaly constitutes evidence against market efficiency or if it be it can be explained within existing financial frameworks such as behavioral finance. So, first we need to verify the um facts that we're giving. So, the first one was GameStop traded at 4 cents in August 2020. And to determine if this is factually correct or not, I used Yahoo Finance and I came up with that the lowest that GameStop traded at was around a dollar. The highest was $1.79 and on average was around $1.17. So based on what I found, this the GameStop did not trade at 4 cents in August 2020. So that statement was incorrect. And so I would need to communicate this to professor and I would probably send out an email explaining the incorrect statement and showing him the real data that I gathered. So, next we have the other facts of Janu January 2021. Reddit uh drove prices up to $483. Uh short interest peaked at 140% of float and trading restrictions implemented at peak and I was able to verify the rest of these facts. So, these were all correct. So now that we have all all the correct facts in the event, we go to the represent stage. And this is where we're going to determine which of the efficient market hypothesis form was violated. So there's three of them. Weak form, which is prices reflect all past trading data. This form was violated due to the sudden massive nonf fundamental price change that happened and it suggested a market driven by past buying selling pressure rather than rational the rational pricing. The next form was semi- strong form and this prices these prices reflect all publicly available information. So like financial statements, news and analyst reports and I found that this form was actually the most violated. The peak price was several times higher than any reasonable fundamental estimate suggesting a massive disconnect from publicly available uh value information. Like how this means that like I said that $483 it was priced at at one time. Realistically analysts found that it was actually valued at $10 to $40 instead of $483. And then last is the strong form. This is when prices reflect all information public and private. This was likely not tested due to it being hard to prove because due to um information being private. So next we are going to implement and to we're going to determine um market analyst constitute evidence against market efficiency. And so with my code I did into different uh stages of discover. And in step one, I had it check the fact that um the claim of it was um GameStop was priced at 4 cents was incorrect as it found that the lowest in August was around 1.04 and the highest was around 1.67. So it used an if statement that claimed if it if these amounts were greater than if the lowest amount was greater than point4 uh.5 or point4 then this the statement would be incorrect and as shown here it the code uh correctly verified that the claim is incorrect and is significantly higher than 4 cents. Next was the represent stage. And in this stage is where I had it claim which um H uh HM H or EMH was form was violated and it used all the information that I gave it that was I was given and it correctly came up with that the event primarily challenged the semi- strong form of EMH and it stated the reasons for this and it was that semi strong states that prices reflect all public information and like I said that the stock surged to $483 when it actually costed around $10 to $40. And so now we are going to the implement stage and this is where we um actually see if mark an anomalies was the reason behind um this the this event and so with stage step three and four is implement validate. So in this stage it's going to first um split data into the estimation and event windows and then it's going to which is going to calculate the adjust returns for the risk-free rate using this formula and then next it's going to calculate the abnormal return calculations using the CAPM framework uh estimation. It's going to estimate alpha and beta to come up with its um uh de data. And then with the uh stage four, which was the validate stage, this is when it's going to use the t test to use the null hypothesis that the abnormal rate is equal to zero. and or if it doesn't equal zero. So it's going to use the t test and then calculate the p value and the mean abnormal daily normal return. And here we can see that the implement did just that the stage did just that that around 2020 to 2021 um it calculated a alpha around.12 and a beta of.0505 0505 and it calculated and it using uh the website that I had the Yahoo Finance it came and found out that there were some abnormal returns a very high abnormal returns around January 25th and February 1st it had a high a noral return of 1.75 and a high of 1.5 on February 1st. And which makes sense cuz that was when Reddit around January, Reddit uh called the prices to go up and this was around February was around uh when there was congressional hearings. So it makes sense that they were high around that the that time period. And to validate we're going to use the uh collab used a statistical significance testing and it calculated test statistic of 1.77 p value of 0.085 085 and a mean daily abnormal rate of 0.11 and it calculated a total cumulative abnormal return of 4.51 and using this this data it was able to conclude to do not reject the null hypothesis that the no return was equal to zero. So what this tells us is that the reason so the reason we calculate this abnormal return is to test if GameStop event was a real unique market anomaly. And this tells us that it was we reject that that statement. And so next I have is a visualization showing the cumulative annual returns to showcase that around 2021 in January and February that that is when the p the normal returns mostly increased by mostly increased by. So next we want to evaluate so whether there were even profit opportunities for uh GameStop investors. For the most point no there were not in the EMH sense because a rational investor following a strategy of buy low sell high based on fundamental value would have been on the short side and incurred devastating losses because they bought at such high prices of $483. when the uh price was actually around $10 to $40. Now there are there was opportunity for some in the behavioral behavioral sense. Those profitable investors were those who identified that these were extreme an anomaly and they bet on the behavioral catalyst. So now we want to go to the evolve stage and this is where we're going to uh talk about this where I'm going to talk about how there there were different factors for this uh GameStop event. So first is how quickly and accurate market reflect new information. how Reddit uh started uh putting in that to invest in the company and how that new information affected uh first the accuracy which was the market was highly inaccurate cuz like I said earlier 10 it was actually $10 to $40 and not $483 and next was speed. The market was extremely fast to incorporate technical and social mediadriven information. The news of high short interest and coordinated buying triggered an almost instant massive price spike. So next I'm going to talk about behavioral biases and this is where how what caused people to invest in this um event. So first is hurting and bandwagon effect and this shows that the thousands of retail investors. This is when the investors followed uh the consens consensus based on the platform of like Reddit and this people bought the stock simply because everyone else was. Next is availability horistic and this is when the GameStop dominated the news and social media making it highly available in everyone's mind. Everyone wanted to invest in it which caused the stocks to rise much further. Next is overconfidence. Many individual traders believe they could time the market perfectly. However, buying just before the peak and selling right at top and they did this despite of the extreme risk. And lastly was loss aversion. This bias was particularly strong for the short selling hedge funds. Their loss aversion made them desperately cling to their short positions or try to cover them at any cost which fueled and increased the this squeeze event. So next I want to talk about market an anomalies. So this event itself c was categorized as a dramatic short squeeze anomaly which is a situation where technical factors for short sellers to buy causing the price to increase by a good amount regardless of like fundamental uh values and values people have. So how does this affect certain stuff? So for momentum, the price going up caused more people to buy and this caused the price to go up even more. This created a self-fulfilling prophecy of rising prices until the short interest was resolved. Now, how did this affect the value? Obviously, GameStop was much more overvalued even and its price climbed even more dramatically showing that for a period value fundamentals did not even matter to some people and investors. Next we're going to talk about asset substitution problem. This is a concept usually applied to highly leveraged firms but we can see a simplified version in this event like so for instance the hedge funds that shortened GameStop were highly leveraged which means they borrowed a lot of money to make a big bet. So, and when the shot stock price began to rise dramatically against their bet, these funds were facing massive immediate losses. When a highly leveraged entity is already losing, it might be incentivized to take even bigger risk. And this would to try and make up the deficit knowing that if the risk pays off, they win big and if it fails, they simply lose everything that they invested in. Next I want to talk about limits to arbit arbitrrage and this is arbitrageers are rational actors who try to correct mispricing by buying low and selling high. In this case the stock was clearly overvalued yet there was still inefficiency and this was due to nose trader risk. The nose traders which are the retail buyers acted irrationally and drove the price up to impossible levels. And next would be the implementation cost. This the incredibly high short interest of 140% meant they were physically not enough shares available to even borrow making the short selling strategy impossible to execute efficiently even at the peak. So with all that I want to reflect what I'm going to do. I want to uh compare em EMH versus behavioral finance. So with EMH investors are rational and prices reflect fundamental value whereas behavioral finance investors are human and they're more biased and prices can diverge from value. With the with this event, we can say that for EMH, the price was irrational, but the crash was the market eventually correcting the overvaluation. Whereas behavioral finance would state that the price was a behavioral bubble driven by uh hurting and sentiment triggered by a market micro structure vulnerability. And lastly, the implication for each in EMH. The this event highlighted that the semi-strong EMH only holds under normal conditions and fails catastrophically when market friction is extreme. Whereas in behavioral finance for the implication is that behavioral factors and coordination tools like social media can lead to sustained large scale price deviations like how um Reddit did. Next I want to talk about market efficiency policy implications and how this affected um how we should go about after this event. So want first of all we want the possibility of short interest exceeding 100%. We need to regularly review that like in this event it was up to 140%. From now on, we should probably review stuff like this when it reaches a minimum of a a maximum of 100%. Next is the clearing of settlement. So the clearing process constraint constraints that force brokerages like Robin Hood to halt buying must be more modernized to prevent such a systematic friction. And lastly, social media and market manipulation. regulars. We faced the challenge of distinguishing between collective investment enthusiasm and illegal market manipulation. The event uh underscored the need for regulatory mechanisms to adapt to the speed of modern retail coordination. And so all in all, I think the single most important thing that I learned is that markets are not are not always perfectly rational and people's feelings can sometimes matter more than math. So this event really taught me that successful financial an analysis requires combining the quant quantitative methods with an with also an understanding of human behavior.",
  "video_url": "https://youtu.be/n-7BgDpZkC0"
}