{
  "student_name": "Kulpreet Singh",
  "org_defined_id": "035817975",
  "username": "sing1099",
  "email": "",
  "transcript": "Hello, my name is Kulpreet Singh and uh today I am presenting a capital budgeting analysis for the proposed Starbucks flagship uh roastery. Uh the the goal is to determine if we should invest the 12 million in this project and I've used the driver framework to structure this analysis ensuring we don't just crunch numbers but solve the right problem. So we can see here that the um I'm going to start with the define process. So we define um and like before writing any calculation logic I define the problem parameters especially in the Python uh dictionary. Um so we have a $12 million upfront investment. We have a strict 8.5 WACC hurdle rate. Um we have variable revenues. So at we have 8 million at year 1 peaking at 11 million and then stabilizing at 9 million. So by as isolating these uh variables at the top of my code I can ensure that the model is more flexible and the assumptions are more transparent. So the next step is the represent phase. Um we need to uh um what's it called? Uh sorry we need to translate the accounting rules into the logical flow. So I have here a uh function uh that that does the calculate uh cash flows right here. Um I represented the timeline using numpy arrays for year zero to year 10. Um I modeled the logic um for operating cost um the cooggs, the labor, the rent, all that stuff and deducted the depreciation to get the EBIT. Um, so and then I I represented the taxes at 25% and added back the depreciation to arrive at operating cash flow and then I finally I adjusted for the 500k working capital outflow at year zero and then uh and it's recovery in year 10 alongside the after tax terminal value where we can see here. So the next step is the implement step. Um right here I wrote the calculation metrics function. Uh it computes the NPV and the the IRR. It also calculates the profitability index and the payback periods. And uh this pretty much ensures if like if the inputs change the metric update automatically without any manual errors. Um so then our next step is validate. Um I'm going to run the code and then we can see um two graphs that show up. So as you can see um the the base case NPV is positive. It's approximately 3.5 million. Um the IR is uh 13 uh 13.59 and uh the which is well above our 8.5 uh whack. Um so the profitability index is 1.28. Um that uh that means like every dollar that we invested we created a$128 in value. These numbers validate that the model is working uh mathematically and the pro project is profitable under ideal conditions. So right here we're going to go to our next step uh that is evolve. So like if we uh I'm like evolve we're going to do like a little bit of like a stress test uh the assumptions. So like we can say that like if the revenue uh the revenue drop like I simulated a 20% drop in revenue the code shows that this turns the NPV negative approximately negative 1.4 million. Yeah 1.4 for and this indicates the project is highly sensitive to the topline performance and then also like uh we can do a WACC change which uh I evolved the discount rate by plus or minus 2%. Even at a higher cost of capital at 10.5% the NPV remains uh positive showing financial resilience regarding interest changes. So to um to finally uh uh to reflect on this and recommendations while the financial metrics at uh the NPB at 3.5 the IRRa at 13.6 suggests that it's an accept decision. The evolved stage showed us that uh a 20% revenue misdestroys the value. So with my recommendation, Starbucks should proceed with the investment as it exceeds the hurdle rate and offers a strong brand value. However, we must implement strict cost controls and marketing insuranceances to prevent that 20% revenue drop scenario. The financial margin of safety is decent, but it's not infinite.",
  "video_url": "https://youtu.be/MSrrAx-5o3U"
}