{
  "student_name": "Noah Azevedo",
  "org_defined_id": "036596149",
  "username": "nazevedo",
  "video_url": "https://youtu.be/cBb_0YWpdKM",
  "transcript": "Hi, my name is Noah and for today's assignment we focused on corporate decisions and incentives. So that is uh specifically session 11 assignment and for this uh task we have to evaluate Apple's hypothetical 90 billion share repurchase using um the driver framework. And with these numbers we have to determine whether this buyback creates value or if there are other ways to use that money.\n\nHere we have a capital allocation snapshot where where I will go more in detail using the driver framework and essentially the key takeaway here is that we have to deliver a recommendation that explains uh stakeholder impacts, agency considerations and value creation versus value transfer outcomes. So there's a lot to unpack especially uh regarding what is what and that is why the driver framework is so important. So here in the first step we have to define and discover essentially we are asking ourselves what are we solving and why it matters.\n\nSo I divided the driver framework into defining the core problem uh its key concepts the stakeholders. So who who is actually involved and uh potential alternative decisions. So I'll go do that right now. So the core problem here is that Apple has too much cash and uh they're proposing to spend 90 billion uh dollars to buy back their own stock. And we have to figure out if this is a smart uh business route. So if there's actual value creation or just a financial trick to make numbers look good. So uh a value transfer and with that idea we already go directly to one of the key concepts which is uh the buyback. So the share repurchase and what does that mean and uh why would a company ever do this?\n\nSo, a buyback is like um you having a pizza with eight slices and the chef takes one slice away. The pizza didn't get bigger, but the remaining slices hold now a larger percentage uh than it used to. So, Apple is buying it or proposing to buy its own shares to reduce the number of of of slices or stocks available. uh which usually makes the remaining shares more valuable and also uh for investors this just emphasizes that the company believes it's undervalued. So it's actually a very smart idea to uh generate value within the company without necessarily doing something like um investing in research and development or buying another company for instance.\n\nWith that there's also capital allocation and this is just a term for how the company spends its allowance and as I started talking a little bit uh they can either save it spend it on new factories. So uh what I mentioned on research and development buy other companies so mergers and acquisitions or give back to the shareholders through uh dividends or by performing buybacks.\n\nLastly uh in the key takeaway this was mentioned and what is agency theory. So this describes the potential conflict that the people running the company like CEO and the people who own the company uh shareholders can can face with one another. And uh with this term, this just means that this conflict might result into the CEO doing something to boost shortterm um bonuses but hurting the company in the long run.\n\nWe have the stakeholders which is the CEO who holds three million three million shares. We have a massive investor which is Burkashshire Hataway and who would love to have a buyback because they increase their ownership without having to spend a dime. uh the employees who have hold options as you can see here and uh the retail investors. So average people with 100 shares do they want to cash now through uh dividends or a higher stock price uh later and in the main question we also have to consider pro potential alternative decisions.\n\nSo if we don't buy or if we don't spend the $90 billion, we must compare it to something in order to really give a thorough analysis of the actual problem. So in this case we have four different um options which is a special dividend strategy acquisition. So uh buying an AI or VR company to grow the business debt reduction. So paying off the $110 or $110 billion debt or going through a more alternative route would which would be research and development. So spending more research to to invent the next iPhone for instance, what generates more value out of those options.\n\nThis directly this question actually goes directly to our next uh phase of the driver method which is represent which essentially is our blueprint before we code anything. So now we have to build a Python model that takes Apple's current financial snapshot and runs it through five different scenario a uh engines.\n\nSo in this we would have the inputs and the only thing that we derived was the net income and we got that from uh the prices and equity ratio. So um I actually put a comment here. So, since we know one share costs um $185 and the price tag is 30% earnings, we simply divide those two numbers to find that each share generates about $6.17 in profit. And because there are or 15.5 billion shares, we just multiplied those numbers to create a rough estimate of um Apple's total profits per year.\n\nNow our outputs would be defined as the following. And then the code structure itself with the inputs defined would have each scenario. So scenario A which is the proposal and the mechanism of the code would or the simulation would be that cash goes down, share count goes down and the question that we would ask um or answer in this code would be does the earnings per share um rise enough to justify losing uh that cash cushion.\n\nAnd then this this kind of goes on in scenario B. So talking about special dividend uh the strategic acquisition defraction and so on. Hence the setup itself would be to import pandas for data tables and matt block matt block lib for charts. We define a class function. So create a a function to call run scenario and then accepts uh inputs like uh cash grants and shares retired and then at the end we would have a visualization to create a bar uh bar chart comparing EPS uh impact across all four scenarios.\n\nAnd um with this code and and the whole structure of itself, we would then assume two things that the depth interest rate. So we would assume a 5% if we pay off all if we pay off debt we save this money and the acquisition return of investment where we would assume that the company the new company we buy earns a 10% return on on investment.\n\nSo now we go straight to implement and I can drag the code here to the screen. There we go. And essentially we define the input the baseline um of what we're trying to to figure out. So the outputs, right? And then running each scenario if we were to do something different and then create a comparison table and then display this table to actually create a chart so we can really visualize uh the code.\n\nSo I'm going to run this real quick and let's see if it works. So yes, it does. And here we get the base scenario, how that impacts. And then just how that each scenario would would impact. And then therefore here we get a chart which actually shows the impact of capital allocation on earnings per share. And um looking Ma strictly mathematically it seems that acquisition seems to be the best choice. But is that really the case? Is the code considering all aspects of of uh of acquisition? Is is it a really good idea?\n\nThis is important to go straight ahead to the evolve uh section of this assignment where I actually had my aha moment. So it shows a earnings per share of um uh of $6.75. So a 9.42 increase while the buyback only gets us to $637. So a 3.24 increase. So mathematically as I mentioned buying a new company looks like the winner. But is it? A buyback is safe while buying a company is risky. So this is a tradeoff that we must explain using the driver framework.\n\nSo why why did acquisition win on paper in the first place? So we assumed that there was a 10% return on investment. Since the cost of borrowing or the opportunity cost was lower than 10%, we made money. But there is a very big butt in in this situation where where we have a a risk note that in real life acquisitions often fail due to their higher risk. So the 10% of itself was just a a guess by by us and that that holds a lot of weight towards our final decision.\n\nTo the next question, why is the buyback lower? So because Apple's stock is already expensive, buying back expensive stock is harder to make a return on. It boosts earnings per share but not as aggressively as a high growth acquisition.\n\nAnd finally, why did the demon do nothing to the earnings per share? And I can go back and show that if you missed it, didn't do anything. Why? Why is that? Well, dividends leave the company. So, the money is gone and the share count stays the same. So essentially all the value generated just went to the shareholders pocket and not the the shares share price of itself. So that's why it seemed like there was no impact but for the company it really didn't didn't impact.\n\nSo um here we go directly to the reflect stage of this assignment which is the critical thinking phase. As I mentioned through this video, the math states that an acquisition or debt payout creates the higher immediate EPS growth and paying off debt yields yields a guaranteed 5% return. Whereas buying back stock at these high prices only yields about 3.3%.\n\nHowever, the reality of this is that an acquisition carries massive execution risk and the 10% return on investment that we used um was a complete guess. And while debt payown is safe, Apple is already cash risk. So, it doesn't need more safety. It can pay off its death debts any time. It's it's not going anywhere.\n\nSo with that in mind, although in this case the code might be telling a different story, I would recommend uh with proceeding with the the idea of of buying uh $90 billion worth of of share. So doing that share repurchase, the buyback, but with caution.\n\nAnd and why why that choice? Well, it aligns perfectly with uh employees and management. So, with the idea also of uh the agency theory with options at a $170 strike price, a buyback that pushes the stock to $200 creates massive retention value for talent. There's also stability. So unlike a dividend which creates a tax bill for everyone immediately, buyback uh rewards long-term holders like Burkinshshire Hathway tax efficiency. So also a huge investor of that of the company that was mentioned uh in in the beginning phases of of this assignment and also at the end I I mentioned this also in the beginning of the video buying back stock is a great idea because it signals that that you're telling the market essentially we believe in our own future more than any outside acquisition.\n\nAnd um although there's there's a lot of of of math and and a lot of uh calculations towards um defining value within a company. Confidence also goes a long way. So this sort of signaling can be really beneficial for Apple.\nAs a conclusion, while debt payout is mathematically superior, uh the buyback solves the human equation. So, rewarding employees and signaling confidence without the high risk of a massive acquisition, for instance. So, yeah, this has been my work. Thank you."
}