{
  "student_name": "Graham Hubertz",
  "org_defined_id": "036212822",
  "username": "ghubertz",
  "email": "",
  "transcript": "Hi, my name is Graham Hubertz, doing the Session 8, Assignment for Management 310. So our assignment overview, investigate market efficiency using the GameStop short squeeze event of 2020 to 2021 as a case study. Verify the accuracy of stated facts, analyze price behavior relative to efficient market hypothesis predictions, and evaluate whether market anomalies constitute evidence against market efficiency or can be explained within existing frameworks. So our critical first step, verify the statement. GameStop traded at $0.04 in August 2020 against actual historical data. If incorrect, document the accurate figures and determine appropriate communication approach for correcting the professor. Event Timeline August 2020, GameStop Nears Bankruptcy Levels September 20, Ryan Cohen, Chewy Founder, requires 13% stake. January 2021, Reddit r slash WallStreetBetsDriven Price Surge to $483 February 2021 Congressional Hearings on Market Manipulation Present Post-event Price Stabilization Key Data Points Short Interest Peaked at 140% Afloat Retail Trading Volume Increased Tenfold During Squeeze Trading Restrictions Implemented at Peak Robinhood Hedge Fund Melvin Capital Sustained 53 % Loss Requiring Bill Out Analysts' fundamental value estimates $10 to $40 per share. Required analysis. Verify all stated historical price data and document corrections. Test which form of market efficiency weak, semi to strong, strong was violated. Evaluate whether rational investors could have profited systemically. Compare efficient market hypothesis predictions to observe behavior. Assess behavioral finance explanations for observed anomalies. So driver framework requirement. So driver is my analytical work process, not a documentation format. So I put all this into Google Gemini. I had said I have an assignment over this. Use the KISS method. Keep it simple and stupid to complete it. Export it into Python code on Collab when done. I also have it follow the driver framework as well. so I'll go over to collab and here it is so let's go through it so instructions open a new work notebook and Google collab paste this entire script into a single code cell click the play button to run the cell so here we go the script is gonna go through it all so D for define investigate the GameStop short squeeze as a case study for the efficient market hypothesis so we must verify the statement. GameStop traded at four cents in August 2020. We will use the Y Finance library to pull real historical data to check this. We also need to get the peak price from January 2021. So R represent our KISS plan. Implement. Download all GameStop historical data using the Y Finance library. We verify. We isolate the data from August 2020 and find the actual low price. Compare this to the four cents claim. Find the actual high price in January to February, 2021. Evaluate. Use simple comments to analyze the data against the EMH. Report. Print the findings and show a simple graph of the price surge. So, here we go. We implement our data. We get the historical data for the last five years. Stock prices are auto -adjusted for splits. And we go through verify. We check the facts from the assignment. Our critical first step, verify the four cents claim. our filter data for August 2020. We find the lowest low price during the month. The claim that it was traded at four cents is incorrect. The prices are split adjusted. The 2022 stock split makes past prices appear lower, so we verify the 2021 peak. The actual highest price during January 2021 was 483, so So this figure is confirmed as correct. So we evaluate. We analyze the findings, KISS version. So analysis one, how to communicate 4 cents error to the professor. Our KISS approach would be professor. For the assignment, I used a Python library to pull the official historical stock data. The data shows the split adjusted low for August 2020 was around $1 or $4 pre-shift, not 4 cents. I believe the 4 cents figure in the prompt might have been a typo. I've used the correct data for my analysis. So, we go through all these analysis ones as well, and our conclusion, the GameStop event is a classic example of a semi-strong form violation. We have the same thing for analysis three, could rational investors have profit systemically? No, it wasn't a systemic profit, it was a high-risk event -driven trade. and analysis for behavior finance to emh the event is a poster child for behavioral finance herd behavior millions of retail traders coordinating a reddit to act as a single massive whale overconfidence retail traders believe they could and did beat multi-billion dollar hedge funds hedge funds excuse me prospect theory yolo many investors were trading with stimulus money treating it like a casino loss aversion was low they're willing willing to hold the line even at a 90% loss, which is not rational investor behavior. And we'll go back to analysis two as well. I accidentally skipped over it. Which form of market efficiency was violated? The weak form failed. This says you can't predict future prices by looking at past price movements. Our semi-strong form failed. This says you can't profit from publicly available information such as news company reports and short interest data. Our verdict is it's clearly violated. And our strong form was failed. This says you can't profit even from private insider information. Our verdict, it's not relevant. This event was driven by public data, not insider trading. Conclusion or GameStop event is a classic example of a semi -strong form violation. So now we'll go into E, or excuse me, R. So R, we go into report. Show the final result. We plot the price, focusing on the key period. Use a long scale on the y-axis to make the pre-squeeze prices. And here's our data here. Our log scale is key to seeing the explosion. So now we add an arrow to point out the squeeze. And with all this information here, our analysis is complete. Thank you for listening, and that's the end of my session 8 assignment.",
  "video_url": "https://youtu.be/OrKrKjhiEqI"
}