{
  "student_name": "Dylan Scheel",
  "org_defined_id": "037036066",
  "username": "dscheel",
  "video_url": "https://youtu.be/3iOUWkDcQNI",
  "transcript": "Hi, this is and this is my management 310 uh session 11 assignment. This week we are working on corporate financial decision analysis. So the assignment overview is to evaluate Apple's hypothetical 90 billion share repurchase using driver. I'm supposed to act as an independent analysis. We must determine whether the buyback creates relative value to the alternative uses of cash without missing stable incentives. So um and then the final goal is to use this information to deliver a recommendation that explores state impacts agency considerations and value creation versus value transfer outcomes. So if we go over here to my problem, I said told the AI, I am an independent financial analysis whose goal is to determine whether a hypothetical billion dollar share purchase by Apple would create relative or would create value relative to alternative uses of cash while balancing stockholder incentives. To do this, I want to build a transparent model that prioritizes buyback size, share, and financing assumptions. I want you to act as a fellow analysis with a multitude of knowledge and all things surrounding corporate financial decision analysis as well as an expert knowledge in Python coding to help me reach my final recommendation. For the analysis, I want you to use given hypothetical information to create a model that quantifies stakeholder outcomes. This is the retail shareholders, institutional shareholders, management employees, and bond holders under the buyback. I know that massive buybacks can be advantageous for market perception of the company as it could make the stock seem much more valuable to a stock owner looking to purchase Apple stock. With that being said, I want to compare the buyback to the dividend, acquisition, debt reduction, and R&D alternatives using metrics such as EPS impacts of earnings per share, ownership changes, ROIC, leverage, and strategic fit. And I just took all the information hypothetically and I would provide it. Um, and so I said when making financial models, it was incredibly important to use all the hypothetical information. And for the final code, please be sure to use the KISS method. Keep it simple. And the goal of um the goal of the models are able to be to be able to be easily digested by our escape. So if we go over to our code, you can see here in the cell we have all of our inputs from the information and then it is um just going to calculate your metric. So the earnings per share is your price divided by uh divided by the price of the share or so basically you're just how much you're earning per share per share. Uh and then for leverage ratio it's identified by the cash balance and then the CEO's value because as we saw here the CEO had 3 million shares. So once we buy back that's going to skyrocket. So oh sorry. So um we do the C shares times the share price in the first A we're looking at the buyback um and then taking into account the Birkshshire's new ownership because they don't sell and B is a special dividend. So this is going to be taxed. So we have to take into account there. And then the dividend yield impact is the dividend per share divide by the share price debt reduction and acquisition. And then it just took into account the state. So if we look here, uh on the left is our where we're at right now. And then this on the right is after the buyback. So as you can see, the earning per share goes up 6. two is $22 is huge, especially when we're looking at billions of shares. The share count decreased, which makes sense. We bought back shares. Uh and but the big thing here is Birkshshire ownership went up.2%. Which doesn't seem like a lot, but when they did absolutely nothing and they're not getting taxed for what happened. Whereas if uh we did a dividend, they would be taxed on the ownership go up. They just gained 2% of the company for doing absolutely nothing which was huge. That's what So that's something to keep in mind. Um our net debt decreased. The CEO's wealth went up, which means he's going to be very happy. All of our agents are going to be h very happy. Um if we look at the special yield is 3.3%. Um and uh If we reduce our debt, it is reduced to 20. So um uh so if the dividends were to go through the cash would be heavily taxed and the employee shareholders would not be happy as this is much better uh they're much better to grow their value. So uh when looking at the dividend the people that own the stock, the average choice, they're going to be happy. They're making money um but they're going to be taxed a lot and for your C or your retailers or your retail stockholders, they're okay with that because it's the only way they're making. But for somebody like the CEO, the company employing shareholders, they're upset because they are getting taxed on this dividend that even though it's a big dividend, they're heavily taxed in much functions like shares tax, which would grow the value of the shares that they already own before giving them\n\nUm in the eyes of the agents they want the product to happen because uh the options are leverage to stock price and if the bond holders want to pay down the debt. This is because the biggest thing they care about is whether the company stays afloat. because the owner uh they get their coupons on their bonds has no effect on company's growth companies earnings per share anything. It's just simply the fact that the company exist and so they want to have as low risk as possible.\n\nOverall the company would want to go on board their priority is to grow company value and keep the employees and agents happy. The buyback act does that. It increases the ownership of the company and also create a market perception that the Apple stock as I said above say Apple buys those 500 million shares of their stock in the stock Apple.\nIt must be uh because goods happening and so other people are going to buy this stock and and reaction to this which is going to drive Apple's stock price up and increase the uh increase the price and this creates um this creates value. It doesn't just transfer because the shares that they already own value for the employees for the company and so it creates value. We're not transferring where something with a dividend you can transfer. The debt reduction transfers the value because you have less debt and also reoccurring value. And then the last thing I wanted to do was I gave the prompt. I said now that I know the best options to buy back I want to see a graphical feature to illustrate the ownership concentration back. I know that Birkshshire would increase their ownership and see how it compares to Apple and stakeholders. Please illustrate this in a way this is a 10. So if we look here we have um our two guts and as you can see but it doesn't look like it's a big difference but that.19% is going to make a big difference for BSR because they don't get taxed on this ownership that they grew like that is it's so important that Apple lost its ownership even just because they didn't tax the whole tax on it that's going to be millions of dollars for the that they just basically bought for free for just keeping their stock. And so that's really important. And so overall, as we talked about this this week class, there are a lot of corporate financial decisions in community when you have something with a lot of cash like Apple does. And in this scenario, I said we should go on because we are looking at the point of view of the stakeholders in the company, your agents if you will, your CEO, and all they want to do is grow. They want to grow their personal assets, which are the assets in the company. And a buyback does that because it drive a lot of different causes and effects will drive up the value of the stock. And that's super important because in your first look you may just think oh paid off debt that's great we don't want to have debt but as we entire semester that's a good thing to have and debt the people only real people care about the debt is borrowers and company doesn't really owe anything to them and they own the coupons but that doesn't change no matter what happens with the company unless it stays. So it was very interesting to see how the buyback can impact and improve the value of the company as we said create the value. Thank you."
}