{
  "student_name": "Gurpreet Multani",
  "org_defined_id": "036767359",
  "username": "gmultan",
  "video_url": "https://www.youtube.com/watch?v=otBIeLNLENo",
  "transcript": "my final project over here it's to calculate. So here we use the rubric.\n\nSo it's not a report. We used n to create an AI tool and we're using open AI for the chat over here as well. And the financial problem we're solving is to find out how much a house would be if there was a certain price with a time limit of payment etc. And the amount we put down. It would provide us with the answers of the loan that we need and the monthly payment we would have to pay to get it cashed out and pay it off within a certain amount of years. So, someone who wants it, it'll be people who are looking to buy a house, something easy. And here's my demo that I'm gonna demonstrate of this. So, here, this was a test that I tried to do. 49 $490,000 is the home, 10% down, 7% interest, 30 over 30 years. Since I used that example already, I'll just change it up. I'll put $550,000 and say we want to pay this off within 20 years instead of 30.\n\nSorry, don't mind my kids in the back.\n\nAnd here you see it's coming out now. It comes back with a logical explanation. The home price is 550,000. The down payment is 10% which amounts to 55,000. This leaves a loan amount of 495,000 with an interest rate of 7% and a loan term of 20 years. So here it gives us the monthly rate payment is $3,838 with a total interest paid over the time of the loan which is 20 years will be $426,55. So now let's see we change it again. We can change up the percentage. put 50% down. Only 4% interest in 10 years. Must be rich to do this, I guess. But let's see what that comes out to.\n\nSee, so calculates that as well. This results to a monthly payment of $2,481. The total interest that would be paid after 10 years is $52,661.\n\nSo home price 490K, down payment of 245K. So you have to take that loan out. So really, you're just paying back that loan because you're going to pay that up front. Interest rate is 4% to pay that back. I put Yeah, I put 4% interest rate. So that's what it will come out to paying that loan. Okay. Okay. Now we can do one more. We'll do\n\n500. This is a matter of fact, let's do let's do a million dollar house,000,000,000\n\nmillion home 10% down\n\n10% interest over\n\nYeah. 30 years.\n\nAnd here the output comes out to\n\nsuccess. You're buying a house worth million, 10% down payment, which is $100,000. So you have to take a loan out of $900,000 and then you would pay the interest rate of 10% over the 30 years. Monthly payment would be $7,898. over the course of your loan course of your loan you would pay a total interest of approximately a million 943 and 332,000. So So basically this tells this app uh shows you that like when you're looking to buy a house and you want to put a down payment and then take a loan out as well. You're going to buy the house outright with the loans. You're going to be paying the loan back but the loan has interest. So house cost a million dollars right here. you're going to pay almost another million dollars more after taking that loan out cuz the rate is so high. But this is just a makeup thing. So, you know, if your rate is really lower than that and everything is cheaper than what I just put. I just put expensive things and all that just to see how much it would calculate. So, now we want to do one more. Let's do\n\n$100 million loan 10% down. Let's do 2% interest over 30 years. It's a really good loan lender for 2% interest.\n\nOkay. See down percent down payment loan amount 900,000. interest rate is two over 30 years. Monthly payment is $3,327. So see, so the uh total interest that you would pay over 30 years is $297,567. So the total cost at the end of the 30 years would be1,297,567.\nAnd yeah, this is the project. Just type it into the chat, put the numbers of the house, down payment, two, the interest rates, and the amount of the year, and it gives you the outcomes. Simple as that."
}