{
  "student_name": "Evan Sleeth",
  "org_defined_id": "038072973",
  "username": "esleeth",
  "video_url": "https://youtu.be/aIRDGgPBeoo",
  "transcript": "\"Hi everyone. In this video, I'm going to walk through my financial model evaluating Apple's $90 billion capital allocation decision using the DRIVER framework.\n\nI coded a scenario-based financial model in Python that starts with Apple's base financials. These include the $185 share price, 15.5 billion shares outstanding, estimated net income using the P/E ratio of 30, $110 billion of debt, $165 billion of cash, and an assumed tax rate of 15 percent. I also include assumptions for cost of debt, cost of equity, free cash flow, and operating income.\nThese inputs represent the Define & Discover stage — establishing the financial environment Apple is making decisions in.\"\n\n\"In the Represent stage, I structure five different capital allocation choices as scenarios within the model:\n\nA $90B share repurchase\n\nA $6 special dividend to all shareholders\n\nA $90B strategic AI/VR acquisition\n\nA $90B debt reduction\n\nAnd $90B invested into incremental R&D\nI then create a results table that will store the impact of each scenario on Apple's share count, net income, EPS, leverage, ROIC, and ownership concentration.\"\n\n\"In the Implement stage, my calculate_metrics() function runs the financial impact of each scenario:\n\nBuyback:\nI calculate how many shares Apple can repurchase at $185 each, reduce the share count, and recompute EPS. No income changes occur because it's cash-funded.\n\nDividend:\nThere's no change to shares or earnings — it simply transfers value to shareholders.\n\nAcquisition:\nI assume the acquisition produces a 10% ROIC. After tax, this increases Apple's net income.\n\nDebt Reduction:\nReducing debt lowers interest expense. The tax-adjusted savings raise net income and reduce leverage dramatically.\n\nR&D Investment:\nI treat R&D as long-term strategic capex. There's no short-term income hit in my model, reflecting long-term value creation potential.\nFor every scenario, the model recomputes EPS, leverage, ROIC, and even Berkshire Hathaway's new ownership percentage.\"\n\"Next, in the Validate stage, the code prints Apple's Base Case EPS and ROIC, followed by a formatted comparison table summarizing all scenario results.\n\nKey observations from the output:\n\nBase Case EPS is about $6.17\n\nBase Case ROIC is approximately 69%\n\nThen across the scenarios:\n\nThe share repurchase increases EPS by reducing shares outstanding.\n\nThe acquisition generates the highest increase in total net income.\n\nThe debt reduction significantly lowers financial risk while improving ROIC.\nThe dividend returns cash but does nothing to improve operations or EPS.\"\n\"At this point, the model naturally reveals where true economic value lives:\n\nBuyback: EPS goes up — but mostly through accounting mechanics, not real value creation.\n\nDividend: Pure value transfer.\n\nAcquisition / R&D: These have the highest potential upside if returns exceed cost of capital.\nDebt reduction: Strengthens the balance sheet and reduces risk, which can support long-term shareholder value.\"\n\"To wrap up, here are the key reflections from the model:\n\nHighest EPS Growth: The $90B share repurchase.\n\nHighest ROIC Improvement: The $90B debt reduction scenario.\n\nAgency Risk: The buyback increases insider ownership concentration and could be mis-timed.\n\nRetail Shareholders: Dividends offer immediate certainty; buybacks offer potential upside.\n\nEmployees: EPS accretion and stock price growth from buybacks can improve the value of $170 strike options.\n\nValue Creation vs. Value Transfer:\n\nBuybacks and dividends mainly transfer value.\n\nAcquisitions, debt reduction, and R&D are the only scenarios with potential true economic value creation.\nThis completes the DRIVER analysis of Apple's $90 billion capital allocation decision.\""
}