{
  "student_name": "Daniel Verachtert",
  "org_defined_id": "037038927",
  "username": "dveracht",
  "video_url": "https://youtu.be/KlWbM1jhNIE",
  "transcript": "Hi, my name is Daniel verachtert and this is my capstone project. Um, so I made a AI investment memo generator. It's a classic banker tool. Um, so the problem that it solves is writing investment memos that take forever. So the user will input financials, industry, and a thesis angle. and they'll receive a one-page investment memo, the risks, the upside and downside, and key diligence questions. So, here you like off the start, put in Apple, I put in the ticker symbol, the industry, uh the deal type, investment horizon, risk appetite, and the thesis angle, and then I put in the financials. I feel like this is the biggest downside is that each of these, if you don't know it, you have to like actually find it. You can't just put in Apple and it autofills. If that was a feature, that would be nice, but you couldn't do that. So, you have to research these values yourself. But once you do that, you can enter historical financials. It's optional. So, I didn't do it. Then it gives you the model checks. And then there's scenario analysis. So, the downside, the base, and then the upside, and you can change the values if you need to. I'm just going to leave them where they were. Then here's the valuation summary. You could see the valuation comparison right here in a graph. And then you click generate memo. And it might take a little bit, but um\n\nyeah.\n\nOkay, while we're waiting, I'm just going to move on to the next or like So, I had already generated one. Now, it's just going to take a bit to generate a new one, but it'll give you an executive summary. Oh, here we go. Uh, so it generated again. I think it just changed a few words here, but uh, it gives you an executive summary of Apple, business overview, investment thesis, key drivers, and KPIs. market and competitive landscape, a financial snapshot, valuation and ranges, key risks, diligence questions, and a final recommendation. Here the recommended watch list, and you can download it as a markdown or a PDF.\nAnd yeah."
}