{
  "student_name": "Jose Casiano Trujilo",
  "org_defined_id": "037715236",
  "username": "jcasian",
  "email": "",
  "transcript": "Hi, in this video we will discuss the session nine assignment which is the cost of capital analysis. We'll be walking through the full whack analysis for Netflix using the driver framework as always and in order to start we can move into the first stage which is define and discover. Uh here my main objective was to clearly understand the financing decisions that Netflix is facing which is that they are considering a 5 billion investment and also possibly issuing an 3 billion new in depth and basically before building any model I wanted to find the key variables which are stated right here which are the necessary inputs and also I want to clearly show the like the the whack why it matters and to give a brief summary the reason why whack matters in here is that it is the minimum return that Netflix must earn to satisfy both the tapped and the equity investors. uh in here it also functions at the hurdle rate for project approval. And the key discovery that I made when doing the define and discover was how the capital structure affects the whack through the tax on depth and also how the contract specific risk affects the discount rate for the projects and and yeah I think we can move into the stage two which is represent and for this stage I mapped the entire analytical workflow that I will be implementing later. Here I try to made four key assignments which the first one was computing the current whack using the market value capital structure weight uh which is basically equity value divided by the total capital and the same for depth here and for the cost of equity what I'm what I will try to use is the capital asset pricing model because in my opinion opinion. I think that captures the systematic risk through beta. And for depth, I use it after tax cost of depth because interest is tax deductible. Then second I com I wanted I want to compute whack again but after issuing the 3 billion new in depth and this lets the code isolate leverage effects which is something we need to pay attention on. Then third I wanted to compute the project specific quax which is basically the US content and the international content and to do the US I will use the same as compared wack and to do the international content I I I require the code to add a 1% country risk premium to the cost of equity which aligns with the project specific discount rates. And finally, the fourth point is that I wanted to build a leverage sensitivity plot from 0% to 50%. That weight in order to visualize how whack changes with leverage. And I intended also to overlay Netflix whack, Disney's whack, and Amazon's whack. And also the industry range. And I hope this shows where Netflix sits relative to its competitors and how far it is from the optimal structure. Then for the stage three which is implement this was the code that I did the first time myself. I I defined all the inputs and I also stated why what I wanted um the the Gemini and collab to compute and then some comparisons. However, the first time running this prompt into the code, it gave me like 25% of actual Python code and 75% of of words. I don't know. I don't know why. So what I did was to copy and paste this uh this prompt into another AI and I told it to refined it. So so my issue will be solved and it gave me this prompt which is basically like all the all the inputs and all the specifics are the same except that it clearly says generate Python code only and do not include explanations and all those things. for example, no analyst paragraphs and no repeated text and how itmon run clearly in collab with no extra variables and yeah so after then copy and pasting this new prompt into Gemini it gave me a code that it actually looks like a code and not paragraphs. So here first of all as always it is the define all inputs. This first line defines every required input which is stated by the assignment. And I think we can move into the following section which is the capital structure weights. Uh in here the code basically computes the market value weight which is equity divided by no equity. Yeah, equity divided by total capital and also depth divided by total capital. This directly aligns with the assignments requirement to understand how the weight versus current weight be and also these weights determine how much each financing source influences to the whack. Then we can move into the cost of equity which is here which is the capital asset pricing model. And in here um these lines applies the formula which is the risk-free rate plus beta time the market risk premium. The capital asset pricing model captures systematic risk which determines the return shareholders demand and then we can move into part the following part which is the after tax cost of depth. And here the code is multiplying the bond yield times the one minus tax rate number which incorporates this incorporate the tax shield which is one of the main reasons to why firms uses debt as it lowers the effective cost of borrowing because inter interest reduces taxable income. Then we can move to the following formula which is the current WAC and this is the core of the WAC formula of equity weight times the cost of equity plus the depth weight times the after tax cost of depth and these calculations which is going to be stated uh after it gives the Netflix current WA about 11.22%. Then we move on to the which is basically the same but it adds the three billion in depth. It recomputes the capital structure weights and the new whack which were is going to be also printed afterwards is about 11.13%. which means that the additional leverage slightly lowers the hordal rate which is which is actually consistent with the tax shield theory. Then we can move into the project specific wax which is the US project whack and the inter international wack and here the code um understand that the US content uses the corporate whack so it wrote as equal and for the international it adds the 1% risk premium to the cost of equity which raises whack roughly to 126% and in here basically this reflects how global projects require high returns to compensate for the additional risk. Here the prints which is like what I what I was explaining the numbers that I was explaining before it will print in here and then the code what it did was the leverage sensitivity plot and all this code which is like mostly the lines it generates the sensitivity plot which models whack across the depth weight from 0% to 50% depth weight. And sorry and because the cost of depth is held constant, the curve slopes downward, which shows that replacing expensive equity with cheaper tax advantage debuces whack. Erh. Also the plot includes the benchmarks of the other industry. For example, here in the purple it is Amazon swag and here it is Disney swag. And also you can show obvious you can see obviously the key here. And finally and the other thing that it shows is the industry ranges 8% lower and 10% not higher. And I wanted to to do this sensitivity plot. So it is like so you can see more clear clearly how Netflix like interacts with the the other companies and the industry itself because it allows a direct strategic comparation that is very easy to understand. And finally, as I have mentioned before, it is the summary print out and it prints all the wax clearly. Um, and and yeah, and you can understand it clearly. So I think now we can move into stage four which is the validate. And like to summarize what I wrote after running the model, I validated the outputs to ensure that they made economic sense. For example, firstly, I understood the fact that adding three billion in depth barely lowers the whack which tells how Netflix has significant unused depth capacity and this structure is still very equity heavy. So the tax shield hasn't been fully utilized. Secondly, my second point that the international whack is higher than the US whack which is exactly as is expected when adding country specific risk premiums. And thirdly, the leverage sensitivity curve slopes downward smoothly. As I mentioned like a minute ago, it doesn't have spikes or I don't know like impossible values like outliers that confirms how the model behaves consistently with financial theory. Then we can move into stage five which is the evaluate and what he wrote is that after evaluating Netflix results we can see that the current whack of 11.2% 2% is higher than both Disney's and Amazon's which means that the market assigns more risk to Netflix earnings compared to these other companies and this is likely driven by its higher beta and reliance on equity financing. Also, the 3 billion depth is barely moves the whack, which suggests how Netflix is still under levered and could add more depth actually without significantly raising financial distress risk. And also for the project level decisions, I think the US has a lower like the US actually has a lower hurdle rate compared to the international which jumps by about 1 percentage point. So Netflix should and I think it should only approve international project with expected returns comfortably above 12%. Which yeah and this analysis I think demonstrate how the whack operates at the horal rate for capital budgeting. And for the final section which is the reflection I made the reflection of the full analysis and basically the project helped me to see the whack not just as a mechanical formula but as a lens to how a company finances its strategy. It also forced me to think about leverage, country risk, investor expectations, and how the market prices Netflix relative to its competitors. And maybe if I extended this analysis, I will in further occasions incorporate rising depth cost at higher leverage levels and estimate synthetic rating ratings to find Netflix true optimal capital structure. But overall I think the driver analysis in this project was structured and especially did the define discover and the represent it allowed me to create a code that after refining with AI it's hit all the marks that I wanted to so it will satisfy the assignment questions. So this was my assignment and thanks for watching and I hope you like it.",
  "video_url": "https://youtu.be/7Jw8DMUETV0"
}