{
  "student_name": "Sharanya Srivastava",
  "org_defined_id": "035908028",
  "username": "sriva154",
  "email": "",
  "transcript": "Hi everyone, my name is Sharanya and um in this project I analyzed the market efficiency of the 2020 2021 GameStop short squeeze using the drivers framework. So basically today I'm going to walk through each of the drivers stage in order and show how the data, the code and my graphs support my conclusion. So in the define stage um I set up the core research problem. So in this um our prompt gave several factual cla claims about GameStop. Um but before doing any of the analysis I needed to verify the accuracy of these statements and our most important one because it can change the entire narrative was GameStop traded at 4 cents in August 2020. Um and so my first research question became became is that statement actually true? Then I defined the broader more analytical questions. Um how did GME prices and volume behave around major events like the Ryan Cohen stake announcement, the January 2021 short squeeze peak and the congressional hearing? Two, what do abnormal returns around those events tell us about weak form and semi- strong form market efficiency? Three, did statistically significant abnormal returns exist and could rational investors systematically exploit them? Four, how do behavioral biases like hurting, overconfidence, and FOMO explain the extreme market behavior that we saw? So in the discover stage I collected clean historical data um and using Python and the Y finance library I downloaded the daily price and volume data for GME and for the S&P 500 proxy spy from 2019 to the present. So, this gave me 1,727 observations, adjusted close prices, volume data, and enough pre-event history to build proper estimation windows. Here is my um notebook output right over here. Starts over here, right? Perfect. um with you can see the merged data set with the GME prices and um volume on the left and spy prices on the right. In the represent stage, I designed my analytical plan. Basically, my blueprint for how the study event would work. Um I plan to compute log returns for GME in the market. Use a 110day estimation window before each event to estimate the CA capm alpha and beta. Define a 21 event um window like 10 day trend 10 trading days before and after each event that we have. Four, calculate the abnormal returns and the cumulative abnormal returns. And then five, test how extreme and statistically significant um the cumulative abnormal returns were. So my three main events were August 31st, 2020, Ryan Gohan takes a stake, Jan January 27, 2021, short squeeze peak near $483. And February 18th, 2021, the congressional hearing. So this step made sure my implementation had structure and it wasn't just a random analysis. So implement this is where the coding happened. Um first of all I fact checked the um 4 cents claim. So the code filtered August 2020 prices and found our minimum prices to be $14 and our max price to be $167. So the statement is completely false and um here is the graph that showed the actual August trend August 2020 trend and over here as you can see um this would need to be corrected politely by showing the actual split adjusted figures. Um number two our estimation of the CAPM parameters. So for each event, my code estimated the alpha and the beta. Um for example, Ryan Gohan's event was the alpha was 0.00.6 and the beta was 1.02. Uh as we can as we have written right over here, our short squeeze peak the alpha was 0.0125. and our beta was 1.77. And here are the graphs for both. And these high betas confirm that G um confirmed GME was already extremely volatile heading into the squeeze. So, um, looking back up to our abnormal returns and the Ryan Cohen stake, there is a large positive abnormal return on the event day. Our the C rises sharply to about 045, meaning 45% of abnormal performance in the window. So, that's statistically significant. Our T stat is around 23. So this suggests a semi strong EMH violation. Um next we have the short squeeze peak. So our AR spikes massively right before the peak. Our car reaches around 2.5 or 250% of normal return. um followed by an extremely negative equally extremely negative ARS and this volatility is not explainable by rational pricing. Then um we have our congressional hearing. So our alpha for this is 0.01772 and our beta is 1.85. Um, so it shows that the pre-event car is negative. The event day shows a sharp positive AR and the postevent car turns upward. So this behavior again looks like it's influenced by sentiment, not the fundamentals. And then um here is my last screenshot sorry graph. Um in January 2021 uh where is January 2020? There we go. In January 2021 the average daily volume jumped from about 26 million all the way up to 265 million. So that is around a 9.9 times. It increased nearly 10 times. Sorry. So, this is a classic hurting behavior amplified by social media especially um by Wall Street bets. Last um then we have validate. So now invalidate I evaluated evaluated sorry whether the abnormal returns were statistically meaningful or not. So from the output table we can see that Ryan co Ryan Cohen's car t stat was 23.0. Um um our the squeeze peak car t stat was about 6.6 and um the congressional hearings car stat was about.77. Um so this basically means that the first two events show highly significant abnormal returns far beyond what the semi- strong EMH would follow u sorry would allow. Um the hearings event is mildly positive but not a statistically extreme. So this validates that the market did not efficiently in um incorporate um information especially during the short squeeze in the evolve stage. I connected my empirical findings to investment implications. So when I compared postsque squeeze returns um it showed that GME fell down to -65. It fell to um 65% from February 2021 to um February 2022 and our SPY rose to a positive 24%. So this is a dramatic mean reversion. So while the inefficiencies existed, they were not reliably exploitable by our rational investors because short sellers faced unlimited risk. Broke brokers sorry uh restricted trading and um borrow fees and liquidity constraints were extreme. So this falls under the limit under the limits to arbitrage concept. Finally, in the reflect stage, I looked back at the entire analysis. So, this event shows a clash between EMH, EMH, and behavioral finance. Um, there's a weak form efficiency was violated because the prices showed massive massive predictable momentum. Um, the semi strong form was violated because public news did not incorporate um smoothly. So, um the prices overreacted wildly. strong form was definitely violated since hedge funds themselves were caught off guard. Um behavioral factors like herd behavior, FOMO, narrative trading and social mediadriven coordination explain the explosive car patterns and volume spikes for better trai better sorry um volume spikes far better than traditional EMH and overall a realam GME is a real example of a market behaving irrationally not efficiently. So um thank you for watching my analysis. Um using drivers helped me structure my thinking clearly from defining the problem that we had to validating and reflecting on the results that we get from the code. Um, thank you.",
  "video_url": "https://youtu.be/qUK7YpXuSIQ"
}