{
  "student_name": "Anamika Mitra",
  "org_defined_id": "037556874",
  "username": "mitra69",
  "video_url": "https://youtu.be/t-JbtuJykuw",
  "transcript": "\nAnamika Sankha Mitra started transcription\nAM\n\nAnamika Sankha Mitra\n0 minutes 4 seconds0:04\nAnamika Sankha Mitra 0 minutes 4 seconds\nOK.\nAnamika Sankha Mitra 0 minutes 5 seconds\nSo financial reporting is often a game of hide and seek management. Teams and experts are experts at using sophisticated language to mask poor performance. For analysts, the challenge isn't just reading the numbers, it's decoding the entire spin that.\nAnamika Sankha Mitra 0 minutes 22 seconds\nAnd companies trying to say in their statement a polite phrase in an earns in an earnings call can often hide A disaster in a balance sheet. For my project, I built the red flag scanner. It's an interactive tool that I used.\nAnamika Sankha Mitra 0 minutes 38 seconds\nThat I helped was built using the Google AI studio to that uses AI to automate this decoding process. I programmed it to act not as like a neutral summarizer of what's what, something what, a company statement says, but as a sceptical credit analyst hunting for a downside.\nAnamika Sankha Mitra 0 minutes 58 seconds\nRisk.\nAnamika Sankha Mitra 1 minute\nLet me test this with this agent that I made with a live example. I'm going to feed this prompt. I'm going to feed this AI quarter three financial update from a fictional CFO.\nAnamika Sankha Mitra 1 minute 17 seconds\nI'm going to tell you how reason. I'm just going to read it out for you. We're pleased with the resilience of our brand while top line revenue remained flat year over year, we made a strategic decision to increase inventory levels by 45% compared to quarter two. This build up is purely proactive to ensure we can meet potential future demand scenarios.\nAnamika Sankha Mitra 1 minute 36 seconds\nBecause of this working capital investment, operating cash flow was negative 15,000,000 for the quarter, but we're comfortable with our liquidity position to liquidity position to streamline our reporting. We will no longer be providing specific quarterly revenue guidance moving forward.\nAnamika Sankha Mitra 1 minute 51 seconds\nWe are also excluding digital transformation costs from our adjusted net income.\nAnamika Sankha Mitra 1 minute 57 seconds\nTo an untrained reader, that sounds like a proactive strategy. But the red flag scanner will look past that. That confident tone in this statement and analyses the financial logic behind beneath it.\nAnamika Sankha Mitra 2 minutes 12 seconds\nLet me copy this and put this within our agent. So I'm going to run it right here. Run scanner and let the model deconstruct the statement.\nAnamika Sankha Mitra 2 minutes 26 seconds\nYeah.\nAnamika Sankha Mitra 2 minutes 31 seconds\nOK, here's the verdict. First, look at this gauge right here. It gives it. It gives this a risk score of nine out of 10 and a recommendation to run away.\nAnamika Sankha Mitra 2 minutes 43 seconds\nNow looking at the breakdown of what, which is probably the most powerful part of this tool, it talks about inventory blow, the tool flag, the 45% inventory increase against a flat revenue. Why? Because it correctly identified that this isn't proactive, it is a massive trap. It means that they.\nAnamika Sankha Mitra 3 minutes 2 seconds\nHave a warehouse full of unsold goods that they can't move. Furthermore, it highlighted cash burn. It caught the negative $15 million operating cash flow cash flow, the CFO called it an investment, but the AI correctly labelled it as a cash burn that threatens their liquidity.\nAnamika Sankha Mitra 3 minutes 22 seconds\nIt also talks about guidance ref black it highlighted how the decision to stop providing quarterly guidance. The AI identified this as an attempt to reduce accountability and hide future underperformance to all the shareholders and people and the public in general and metric manipulation.\nAnamika Sankha Mitra 3 minutes 43 seconds\nIt called out the adjusted net income trick by excluding digital transformation costs. They are trying to artificially inflate their profitability. Essentially, this AI broke down all the like hidden signals that are maybe like an untrained reader or person who's.\nAnamika Sankha Mitra 4 minutes\nCompletely new to finance, may not understand from this statement and it demonstrates the real value of AI in finance. It's not just about automating a data entry, it's about second level thinking. This tool provides proves that we can build a system that don't just read what management or companies say, but actually understand what.\nAnamika Sankha Mitra 4 minutes 19 seconds\nThey're trying to hide and tell you whether it's actually, whether it's going to be a risk, ever investing in that company or not. Thank you.\nAnamika Sankha Mitra stopped transcription"
}