{
  "student_name": "None None",
  "org_defined_id": "038893789",
  "username": "john3952",
  "video_url": "",
  "transcript": "Hi, I'm Gillian, and this is my Mini-Project 3: the FutureMe Finance Coach.\nA lot of students and early-career professionals know they should be saving or investing, but they get stuck on questions like:\n 'How much do I need to save each month?' and 'Should this be in a savings account or invested?'\nMy tool uses AI not just to calculate, but to explain those trade-offs in plain English.\n[0:20 – 0:50] – Who It's For & What It Does\"It's built for people roughly like us: 20s, goals like grad school, moving to a new city, or saving for a down payment.\nThe user can type a natural language prompt like:\n'I'm 21, have $3k saved, can add $300 a month, and I want $20k in four years for grad school. I'm moderately risk tolerant.'\nThe tool then:\nUnderstands the context — age, goal, horizon, risk tolerance.\n\n\nBuilds three scenarios — safe, balanced, and aggressive.\n\n\nProjects future balances using external interest rate data.\n\nExplains the \"why\" behind each option, not just the numbers.\"\n\n\nWalk Through the Workflow (DRIVER loop)\"Here's the n8n workflow.\nI start with a Webhook trigger that receives the user's message and ID.\n\n\nThen the first AI node parses the message into structured JSON: age, current savings, monthly contribution, goal amount, horizon, and risk tolerance. That's my 'Discover and 'Represent' step in DRIVER.\n\n\nNext, a Function node does sanity checks: it prevents negative values, clamps the time horizon to a reasonable range, and defaults risk tolerance to 'medium' if it's unclear. That's part of making the tool more robust and trustworthy.\n\n\nFor external data, I use an HTTP node that pulls a current risk-free rate from an API.\n Then another Function node calculates three scenarios with different expected returns and computes the future value using monthly compounding.\nFinally, a second AI node performs multi-step reasoning: it gets the profile and scenario data as JSON and returns a structured JSON response. That includes:\nA short plain-English summary of the goal\n\n\nA markdown comparison table\n\n\nA narrative analysis of trade-offs\n\n\nA recommended mix aligned with the user's risk tolerance\n\nAnd an explicit disclaimer.\"\n\n\n[Show the JSON output and table.]\nTrust, Safety, and Accuracy\"To make this trustworthy, I added several guardrails:\nThe Function node that clamps values and prevents obvious nonsense inputs.\n\n\nThe AI system prompt forces educational language, not hard recommendations, and it must return a disclaimer saying this is not professional financial advice.\n\n\nI also log each run with a Google Sheet node, so I can review scenarios and spot weird behavior later.\n\nI tested the tool with multiple scenarios — for example, very short horizons, unrealistic goals, and zero savings — and refined the prompt so the AI explains why a goal may be unrealistic instead of hallucinating perfect solutions.\"\nV1 → V2 & Reflection\"In Version 1, the tool just used hard-coded return assumptions and a single AI prompt that spit out unstructured text. It didn't pull any external data and it was harder to trust.\nIn Version 2, I:\nAdded the external rate API\n\n\nIntroduced the sanity-check Function node\n\n\nSwitched to structured JSON outputs with a table plus a disclaimer\n\n\nAnd logged user scenarios for future improvement\n\n\nBuilding with AI as a component changed how I thought about the tool. My job wasn't just 'call ChatGPT' — it was deciding what AI should do, what math should do, and where to add guardrails. I wouldn't blindly trust this with real money, but I would use it as a learning coach to understand whether my goals and contributions are in the right ballpark.That's my FutureMe Finance Coach — an AI-powered tool that tries to make finance smarter and more understandable, not just faster.\""
}