{
  "student_name": "Arjun Suresh",
  "org_defined_id": "037585093",
  "username": "sures111",
  "email": "",
  "transcript": "All right. So today we're doing WVA9 which is cost of capital or uh whack weighted average cost of capital in which we are going to calculate um basically hurdle rates for a company or the minimum uh required rate of return or the discount rate that they use to value projects. All right. So the prompt talks about basically Netflix has these parameters, these values and then um it has a couple market conditions and then some info about competitors. Uh I'll talk about each of these specifically when we get there. So let's um talk about what our objective is. So basically we want to determine the correct discount rate or hold rate that Netflix should be using for internal valuation using whack. Um the scope is the company of Netflix and the information that they need um for their analysis and the time scope should be um pretty much now. uh the deal they're looking at which will put them5 million more dollars in debt um is is something that that's immediate. Uh our constraints are the information we're given in the prompt and then possibly maybe I don't think I use this very much but uh standard market data um that's publicly available. So uh next we have the data that we need and we have we pretty much have everything given in the prompt for us to calculate whack. We don't really need anything else. Um our success metric would be a mathematically and financially sound whack calculation where the math behind it backs up but also we connect it to the finance side and explain why it's like that um and why it's meaningful. And then our benchmark industry average whack of entertainment is around from 8 to 10%. And we can see that here where Disney and Amazon Prime Video are both 8.2 and 9.5. Uh next we move to the represent stage. So how are we going to represent whack? Um is very simple because there's already an equation for it. So basically uh we take the proportion of the value that is in equity and then multiply it by the cost of equity and then we add the proportion of debt of our value and multiply by the cost of debt times one minus the tax rate. Now um basically the idea is more money we have in one section equity or debt the more the cost of that equity or debt matters. Um it's a bit like stocks. If we're very much in this category of stock and it goes down that matters much more to our portfolio compared to if we only have 20% in something else versus 80% in the original. Um so then cost of equity was of course uh connecting back to um CAPM so capital asset pricing model which basically lets us think about opportunity cost and what the value of something like that is and then cost of debt is just the interest rate but gets reduced by the tax rate because we save money when we utilize debt because it's a tax write off. So that's the advantage of debt there is that we get a big tax write off. So a lot of the time people are hesitant to get into debt but in this case it's a very strong tool to use. Next is the implementation stage. So I can take us to our code. So we have the input parameters of the prompt. Um and then basically we take the total capital sum them both then we basically find the proportion of each the same way that we would here in this formula where we take equity weight and debt weight. So that's analasous to that and then we um calculate the cost of equity using CAPM. So this is the CAPM model we saw alpha which is the risk free rate plus debt times market risk premium right um and then again the cost of debt is going to be uh basically our interest rate times 1 minus the tax rate as we see in the formula. So those formulas are very simple basically we plug them in and we print them and get our numbers. So I'll go back to the slideshow. I think it's easier to see there. So this gives sort of a breakdown only 6.1% is debt. Um and we can see the cost of debt is much lower than the cost of equity. And so uh especially after tax it becomes less than half of the cost of equity. What that means is probably to fund projects we could be taking on more debt. Um so basically yeah um but on the flip side this means that projects do have to like have a very high return to overcome the hurdle rate we have. Um then uh we find the actual whack with a couple calculations which is 11.22% 22%. Now I want to go back here. That's significantly higher than Disney and Amazon Prime. Keep that in mind. Now let's verify. Let's think about the numbers we have. See if they make sense. So the benchmark is 8 to 10%. We are above that. Um and the question that ends up is why are we above that? Um there are sort of two answers here. one is a doily answer and one is a Watsonian answer. So in the universe of the problem in the context of the problem it's probably some way that uh they structure their capital and the fact that they don't have much debt means that um they require very very high returns from any project they embark on because um they just have such a high cost of equity. Another thing could be these are hypothetical numbers and so they just ended up outside the range. But this is this this means something important that it's outside of the 8 to 10. This means that uh we are sort of demanding we demand our projects be more profitable than Disney or Amazon Prime. Now that could be good. That could mean we have very successful projects. or it could mean, you know, we're not quite using um debt in the right manner. Next, for the evolve step, I looked at what would happen if we change the market risk premium and the equity uh beta. So, the beta of the stock that we own essentially and so in the middle is what we have 11.22, 22 but I changed some of these values and basically uh you can see that the whack changes. So if the market is doing great and the beta's high you know we are really really really sitting there demanding that every project bear 14%. versus when uh the market's not doing so well 4.5 and you know we're not so strongly boosting off the market at 1.1 only demand like 10% in this in this 9.15 uh square. So this sort of lets us visualize how it changes as each of these factors changes which is helpful because uh the market can be volatile and things can change at any time. So in a sense of creating a report for executives, this is helpful because uh not only have I done one calculation, I've done hey maybe next week the market will be doing worse. Here's what I know. Um so so this is flexible in that way. Uh next we can move right on to the reflect stage. I think Netflix is likely underusing debt and the benefits of the tax shield. it could be doing a little more and just reaping huge rewards from tax exemptions. But on the other hand, structure is key and having very low debt will give us good metrics like uh asset to liability ratio and things like that. So there are like other financial things we could consider where hey maybe this is the best decision for Netflix to be taking. Um, and the way they structure their capital is very important, which is interesting to look at because it's the very next topic we move to. Um, there's a limitation here and it's that our answer is a number and that doesn't tell us everything about the situation. Like I said, it could be that they're using debt. It could be that this is the best way for them to handle uh their finances. It could be that there's actually some third thing that uh matters more. So, this doesn't get at a very good why, but it gives us a very good metric um that we can also use to value projects. And the last lesson I think I learned is that a raw hurdle rate doesn't necessarily mean you're making good business decisions. So, let's say a project is worth 12% and my hurdle rate is 13%. Well, it's possible that 12% project, you know, uh that's all it makes. All it makes is 12%. So on the net it kind of loses you money but um it opens up new opportunities later like you break into a new market segment um you have a new operation in a new country um and now you're open internationally u maybe there are even tax benefits there like uh I think it's important not to take these numbers so literally and to uh sort of look qualitatively and situationally at everything that's happening.",
  "video_url": "https://youtu.be/oYn8p9IFVNc"
}