{
  "student_name": "Joe Dragoni",
  "org_defined_id": "036050644",
  "username": "jdragoni",
  "video_url": "https://youtu.be/nRmDWzMg8qA",
  "transcript": "All right. Hello there. I'm Joe Dragoni. This is my management 310 session 12 assignment, the last one for the semester, which is crazy. Um this one is over business valuation and financial modeling. So uh doing a comprehensive business valuation for Panera Bread. So our assignment overview here is we're going to deliver a full valuation of Panera Bread for prospective KKR takeover using the driver method. We'll combine the discounted cash flow method trading comms pre uh in precedent transactions to produce an informed bid range while contrasting financial buyer discipline with strategic buyer synergies. So looking at the information that was given to us, we'll look here at this deal snapshot. So our scale um this first part was a little bit confusing. I don't know if this is supposed to be um part of the analysis, but I assumed it was. So I think it's $6 billion in revenue growing to eight. I didn't include I just included the $6 billion in revenue though. I didn't know what I was confused what growing eight meant when doing my analysis. But so we have that the $900 million earnings before entrance interest taxes depreciation and amortization which is our 50% margin. Our $400 million net income across 2100 stores 2100 Panera bread locations and digital sales are already 50%. Our market references include the industry uh price earnings ratio around 22 times. The president earnings before interest taxes depreciation amortization multiples being 12 to 15 times. Chipotle trades at 35 times price earnings and McDonald's at 25 times price earnings. Our capital assumptions is that the industry rack weighted average cost of capital is 9%. Management wants 10% rollover and there are strategic biders circling this um acquisition including Starbucks and McDonald's. Um so KKR has to be strategic about this. And then the growth levers we have are um 500 new locations for Panera Bread in the next 5 years. a digital mix um from 50% up to 70% dinner and catering expansion and early stage international rollout. So uh creating new locations in other countries and then our assignment is to create an executive ready recommendation that states our validation range winning bid strategy and rational for choosing financial versus strategic positioning and we'll use the driver framework to do this. So moving into the define discover stage driver, our goal here is um to establish a defensible enterprise value or EV um and we'll make a range to inform B to inform a binding bid for Panera Bread in um the perspective of KKR the investment company or investment firm rather. So they're the buyer KKR is they rely on leverage operational improvements and growth of the multiple um the exit multiple being the price earnings to generate returns. we must hit a target um irr typically 20 to 25% for a deal of this size. It's a very big deal acquiring a very large company like Panera Bread and a money on invested capital or MOIC of 2 to 2.5 times over a 5-year hold. So, like we said already, we're looking over the 5-year period. Our competition, um our valuation must lean heavily on growth, the growth levers provided, um rather than just the financial engineering. So strategic buyers can pay higher control premium. Um so we want to determine if we'll take the strategic side or just a financial side um here when we make our offer. So the a robust validation requires four components. The DCF which we talked about already um which are um including the future cash flow or what are the future cash flows worth today. Um capturing the upside of the 500 new stores and the digital mix. Um, and this will give us our intrinsic value or what we value the investment to be worth. We'll also look at the leveraged buyout method or LBO working backward from a 20 to 25% IRR and peas debt load um including or which would be a four to six times leverage amount. Um, what is the maximum price we can write a check for? So, are we able to pay for this? The trading comps include how does the market value how do the market value peers like Chipotle and McDonald's um or how rather how does the market value peers like Chipotle and McDonald's not how they value themselves and this sets the floor and the ceiling based on the current public sentiment and then the present transactions would have others paid for similar assets um which would have like 12 to five times earnings before interest taxes depreciation amortization or just EV evida make it a little easier to Okay. Um and this tells us the clearing price for the um the control premium. Also, our management rollover is needed to ensure operational smoothness and incentives to continue working, which is why we'll need that 10% rollover or why management will want the 10% rollover. And then looking at our multiples here, um the EI eBnings, which is the exit multiple. So then our key drivers um are the topline growth which is revenue um which will we have the plan for the 500 new stores over the five years which represents a around a 24% increase in fleet size of our company. Digital pen penetration being the 50% to 70%. Um the high digital mix increases throughput and average ticket size. So you know more going through more food being able to have less labor there. And then dinner and dinner and catering are currently underutilized as it was described. So we're expanding here or expanding here will effectively increase sales per square foot in the restaurants. Um profitability is our second driver. Um operating leverage as revenue scales. Uh fixed costs like rent should decrease as a percentage of sales. And then digital orders require less front of house labor. Um so that will ex that could expand the current 15% um earnings before interest taxes depreciation amortization margin close to 18 to 20% just because of having less labor. Um then the capital efficiency which are free cash flows. Um the capex requirements for this building 500 stores require significant capital. So we need to distinguish between uh growth and maintenance capex. um maintenance capex being just keeping the stores open and growth capex being having more new stores added to our fleet. And then we also want to look at working capital here. Um with a negative working capital cycle common in restaurants um growth generates cash. So growth will be a good thing to look at. Um even though having um negative networking capital um might look bad on the balance sheet. And then just other critical assumptions we need to consider is the 9% whack, the 12 to 14 times earnings for exit multiple and the 21% corporate tax rate and the 10% management rollover as well. So moving down to the represent stage here um we are connecting the growth levers or the inputs to the enterprise value which is the output. So plug in the growth levers to get our enterprise value or determine what that could be or at least just laying that out. So we look at the 5-year period um to cap capture the value added for KKR we must split revenue into same store sales efficiency which is just SSS um and the unit growth which is our scale. So looking at our first um scheme for our model layout is the top line which is the revenue model. So like we said already the existing fleet is 2100 stores and the first driver of this is the digital mix and then the second is the the expansion in the group the dinner and catering. Um then our result here will give us our SSSG metric or our same store sales growth metric which we'll use to calculate our total revenue. Um and then we'll also have the 500 new stores um which you know if we look at it linearly this will be 100 new stores a year. Um then we can create a ramp curve from this. Sorry, don't know why I did that. We can create the ramp curve for this. As I was saying, um in new stores, new stores typically open at around 80% of mature volume in year one. And then we will also assume average unit volume or AUV assumptions to calculate our total revenue which will be in this formula right here. Um which was I used decisions from Gemini to help me calculate this as well. So our second model here is the profitability model schema which demonstrates how the 50% earnings margin expands. So in this model we'll look at the cost of goods sold which would include things like food and paper and those costs are variable depending on you know the time of day um how many customers might have we might have in a given month. Um the labor will be semivariable as employees will come and go and as the digital mix hits 70% labor hours per transaction decrease. So there'll be less need for physical labor as we increase our digital mix. And then occupancy being rent utilities that will be fixed. Um and as the AUV rises due to dinner and catering the occupancy percentage drops. Um and then our result here would give us that earnings before interest taxes on depreciation and amortization. Um and we're targeting the expansion from 15% to 80% over the whole period. Then our last model we look at is more so like a cash flow statement. Um so we have the positive number from the earnings from the revenue and margin build. Then we less taxes of the change in the networking capital which we already described why this was negative. the maintenance capex and the growth capex which will give us our unlevered uh free cash flows or the UC UFC which is the cash available to all to all capital providers which is our input for the discounted cash flow model. So using that um we project the UFCF for 5 years and calculate a terminal value from that. So then looking at our enterprise value um of the discounted cash flow uh just writing this out in collab was the easiest thing to do but it's the sum or sigma from years 1 to 5 of the UFCF over the 1 plus the whack to the t to the time that we are looking at um plus another fraction being terminal value over 1 plus the working weighted average cost capital whack to the last year five. So it should look like this fra this is a fraction plus this fraction and this will give us our valuation for Panera which we won't calculate this by hand but rather we'll have Gemini help us to draft the code in the implement stage which we'll go to next. So looking at the implement stage we have a very large amount of code here. um just we'll run it real quick. Give us our actual model evaluations, the the year-by-year cash flow projections, some visualizations as well and the sensitivity analysis. So looking at our implement stage results, um looking at the fifth year, say we were in 2024 and year five, our base case for the investment, um this is showing in millions. So this would be around $1.5 billion in year five would be our investment amount or what would our earnings before our earnings would be. And then the valuation that we would provide would be the 13.5 times earnings and the 9% whack would be 16.5 16,550.9 million. So that would be 16 billion or so. And then we look at the strategic case valuation here. it increases by another six billion. So 22.475 billion dollars here for our synergies would that would be the valuation for the strategic case. And then our floor and our ceiling um of what we valuated it what we value it at would be the floor of 12.9 billion and the ceiling of 18.8 billion. So as we see here, it'll be easier to visualize this out rather than just state the numbers. So I'll show that in a second. But then looking at a sensitivity analysis of the whack versus the terminal growth in billions of dollars. Um so as we see here we can we show a little heat map here which helps us to actually see how the sensitivity of two different variables compare. So we can see as the whack increases as we know from past lessons in management 310 that the whack increase is not the most desirable. So as the whack increases we can see that our valuation in billions of dollars decreases. So starting at 8 um we get a 14 point or around $15 billion um valuation at 2% growth per year um and as that increases to 10 it decreases almost $4 billion and then our base case here say well at least for whack our base case of the whack being nine we can see that these would be the numbers here and then so we we know whack is sensitive to um change as it increases the the valuation will go down. But looking at growth as we go across the x-axis here um or the horizontal axis rather as the growth increases a whole percentage point we can see there is about a $2.5 billion increase in the valuation. So we also see that the terminal growth is sensitive to change as well and that terminal growth has a positive correlation with the valuation while whack has a negative growth. We'll get a better look at that in a second. But looking at the final projection projections in a 5-year view, um we can see so we started with $6 billion as I stated earlier and after one year that increases um by 400 million another about four another about 400 500 million from year two and it goes up about the same amount every year for the next for five years. So it's pretty constant but we look at about a 7% 7.6 6 7.3 variable growth which decreases year-over-year and then our earnings before interest taxes debt or depreciation and amortization increases yearbyear as well and then we see the same with the cash flows the unlevered free cash flows here. So that shows us our information about our financial pro projections and then again we can see this in some visualizations here. So a linear increase in the revenue over the 5 years um starts in around the 6 billions uh going up to over 8 billion and then um the same increases from the earnings before interest taxes depreciation and amortization percentage raises from that 15% to that 18% like we wanted it to. And then in this graph here, the earnings before interest, taxes, depreciation, amortization versus free cash flow conversion. Um, we see how both of these numbers are pretty similar for each of the five years, but grow at about a constant rate linearly as well, positive linear relationship. And then again in this heat map on the left side here we can see that um the lowest valuation is a low exit multiple and a low or a high whack and a low exit multiple um which would give us our lowest valuation and then a low whack and the highest exit multiple or PE ratio would give us the best value valuation. So again, whack as the whack goes up, valuation goes down. As the this time looking at the P ratio or the exit multiple as the exit multiple goes up, the valuation goes up as well. And then also looking at a value triangleization between the trading comps, the present transactions, the discounted cash flows, and then the KKR cash flows. This helps us to get a range for what we could potentially be bidding on here or the prices that we'd be willing to bid. And this shows right here at the bottom here our base case or our case that we're looking at specifically the floor that we're willing to bid being $12.9 billion and our ceiling being $18.8 billion would be the investment we would be willing to propose to take on Panera Bread. Whereas the trading comps has a smaller floor being about 11.7 billion ceiling 14.4 billion. The transactions you can't really see it here but it says 10.8 8 billion with a ceiling of 13.5 and then the strategic uh discounted cash flow which is what the competitors like Chipotle and McDonald's will be looking at having a floor of 20.2 billion and a 24.7 billion. So this can help us to reinforce the idea of taking the financial position um when making an offer. So that's our implement stage. We'll move down to the validation stage. Right now um as we already talked about a little bit the results from the implement stage shown in millions of dollars and the DCF enterprise value sensitivity analysis shows that the EV is sensitive to whack and the changes in the multiple as well as well as the thermal growth excuse me so validation verdict our intrinsic value for KKR um is 13.6 six perpetuity and 16.5 exit multiple. So those are both inside of our base case that we saw in the triangulation down here. Um our strategic value for the competitors is 20 plus billion due to the synergies that they have whereas KR doesn't have those synergies or have that much of a benefit with the synergies. And then our winning bid range would be 14.5 to 15.5 billion um which we'll go into bore in a little bit. So just to validate our answers even more and you know compare this or really show the strength of our analysis um we'll look at some different cases here. So um projected revenue growth from 6.5 billion to 8.5 billion and margin expansion from 15 to 18%. We'll compare this to industry realities now. So, um, looking at if we included the 500 total new stores or a linear growth over 5 years of 100 new stores per year, we see a 5% unit growth rate um, and for a mature brand that's been around for a while like Panera that has 2100 units around the country. Um, this might be aggressive growth um, at this stage, but it's definitely feasible. uh the digital mix of 50 to 70%. Um leading peers like Starbucks and Chipotle are already near or above this like with their apps or their kiosk that people can order within their stores and Panera is already at 50% digitally. So it makes sense that they can do this. So it's uh also feasible market expansion from 15 to 18%. Most of this comes from the labor leverage um because digital orers orders need fewer cashiers. So um as the margin increases it makes sense for the digital switch. And then lastly the exit multiple of 35 times the EBITDA. Um this this is a conservative relative to our entry which is the implied 16 times for the EBITDA. So this is also another number that makes sense. Now looking at the financial statement integrity um or the three statement linkage the um balance sheet income statement and the cash statement. So years one to three showed depressed free cash flow on despite the rising earnings um and high growth equals high capex plus working capital drag. So this means the model accurately shows that we cannot pay down debt aggressively in the early early years because the new store opening, but shows that we're targeting high growth and hoping to increase our earnings in the future with those. And we also talked about already assuming negative working capital um which is standard for restaurants because customers pay instantly and we pay vendors in 30 days. Um and also some other reasons. Um so this will have the correct effect on the internal rate of return that we will be seeing. Then our looking at evaluation stretch test or a valuation stress test. So a case that could really hurt the company and how um if it makes sense to buy in this case. So we'll look at a stagflation case here being the high inflation low growth. So our assumptions that the SSSG drops to 1%. um customers don't buy as much and inflation for wages hit 6%. So this would erase our margin expansion and margins stay flat at 50%. And then the exit multiple drops to 11% because there's market fear and people aren't wanting to take riskier investments on. So our 5-year earnings would be $1.1 billion versus the 1.5 billion in the base case that we were looking at earlier. um the exit value will be $12.1 billion and if we pay $15 billion we would lose money because our money on invested capital is less than one times. So that would be bad for us. Um and then does a $15 billion enterprise value or approximately 16.5 times earnings make sense in the public market? So, we already looked at Chipotle trading at 25% um earnings um with a 35% price earnings ratio and then McDonald's trading at 18 times the earnings with the 25 times price earnings ratio. So, we are paying a 35% around a 35% discount to Chipotle and a slight discount to McDonald's. um which is accurate since Chipotle has higher margins and McDonald's has that global scale because you know if you've watched the movie Founder it's talked about as being a real estate business and buying the land for the restaurants um and just attracting customers that way rather than you know a restaurant like Panera which you know people know the logo and stuff but it's not really to the scale that McDonald's is at or even Chipotle is at. So that will be that shows the validations for all the different arguments that we've looked at so far. So that'll be our validation stage. So we'll move down to the evolve stage now. So we'll look at now how the idea of financial modeling can be seen across many instances in the finance world. So there are many instances of this. Um I use some of the ones in the example problem so far in this session 4 uh for the se section 12. Um so we look at some career um instances. So a first one could be investment banking. So in the case of investment banking, they use the high end of um the range of strategic synergies to convince companies like Panera to sell shares of the company um at the low end um to create urgency with buyers like KR. So um investment bankers would you know convince Panera to sell lower so that there would be more investor growth. Um and then the way we can consider this is looking back to the triangulated football field approach and how um you know going back up there investment bankers would urge to sell close to this point the floor here. If we look at the KKR uh discounted cash flow based case um in terms of private equity um thinking about how buyers in this case like KKR um they care about the internal rate of return obviously because they want to know how much money they're making back on their investment. They obsess over the exit multiple and leverage capacity. Um just like we cared about for our investment with Panera um for KKR and the potential growth associated with that. Um and then for corporate development or acquisition analysis, um strategic buyers like Starbucks or McDonald's would strip out the LBO debt and replace it with a synergy model, um which would save costs in the supply chain. So um their valuation for this would be the standalone discounted cash flow plus the present value of those synergies, which would um give them a different value number than the one we've calculated now. So this is how you know strategic buyers would evaluate or um value their investment investments that they're looking at equity research and stock equity research/s stock recommendation rather um these types of careers are focused towards predicted earnings of investments. So in the case of Panera taking on 500 new stores that assumption and breaking down they would take that or the the um stock recommenders would take that assumption and break it down by the quarter to predict next quarter's earnings per share beat or miss. So helping to determine if you know they're on the right track with their investments and would get the earnings per share that they would hope to get. um a couple other um just separate um ideas or instances that could be looked at as well um in the case of business valuation. So private credit and leveraged finance um financial modeling is used to look at managing risk in a deal. So focusing on extreme cases such such as the stagflation case and making sure companies can pay back their loans or else not approving the deal even if it's valuable. So, you know, just making sure that even though they're take there is going to be some risk to take on that it would be worth it even if there were cases like stagflation in the economy. And then real estate private equity also looks at this idea. Um, a real estate fund might buy just the buildings and not the restaurant operations. Um, so like in the case of Panera, they have 2100 stores currently that they operate. Um and a real estate private equity firm would model the cash flows of the property um like with the rent checks that Panera pays and not the actual business. Um but they still have to have some sort of value to look at um to determine if you know the tenant of the building is actually worth keeping in there and if it's actually making the money. So just as a summary there we can see that there are many contexts in which this idea can relate to the Pinera example and business valuation in general and there's definitely a lot more than the ones that I've already listed. So that is the evolve stage and then we'll move on to the very last stage being the reflect stage. So um in this stage we uh just going over the full analysis um we saw that Panera Bread is a highquality digital first restaurant or they're shifting towards that idea um and they plan to grow from $6 billion to $8.5 billion in revenue via 500 new stores um if they decide to you know follow through with that or if KKR decides to follow through with that if they make the investment. So what insights can be taken away from the Premier Bread analysis? Um our valuation was the 13.6 6 to $6.5 billion intrinsic value. Um, so we would take the financial advantage position here rather than the strategic which would the which the competitors would take because they're this just makes more sense to us. We're paying less than the competitors will um because they're paying over $20 billion or they could they would consider playing over $20 billion for that investment. Our decision should be to submit a binding bid at $15 billion. If the price goes above 16 billion, we walk away um just because that's getting close to our ceiling or what we would actually value it at and there's not really much room to um make those earnings back. So, some other just general insights that can be taken away from this. Um the whack and the price earnings ratio are are very important to consider in this case um as we've seen in other um sections of this class so far and other finance concepts. So with this we saw that the whack was pushing the price down um because that includes risk inflation and interest rates and then the multiples and the growth um constants like the price earnings um we're pushing the price up because that includes market hype digital execution and the SSSG factor uh the wax at the floor the minimum return we need and the multiple the price earnings multiple set the ceiling or the maximum price we can hope to sell for. So our successful deal requires key management. Um like we said, management rollover is another key driver because if there's not um proper management running the company, then it will not be successful and we and we need to make sure that all operations are on board and smooth to ensure success within the company. And then we saw that valuation is not is a range and not just one single number. The football field analysis and the implement stage just in general helped us to see that the range is better for insurgency when bidding rather than just one single number because there's some flexibility to move around and negotiate there. Um cash is fact, profit is just an opinion um just looking in terms of the cash flow statements um or the financial statements. So our model showed the earnings the EBITDA rising every year but the free cash flow was low in years 1 to three because of the maintenance and growth capex that we were paying. So you can't pay debt with the EBITDA but rather you pay it with cash flow and you always look at the cash flow statement to see the true cost of growth or the actual cash that we have on hand um coming from growth. Our forecast our forecast showed growth accelerating. So we must ask why will margin jump to 18% um when they've been 15% for a decade. So our answer you know we would say the digital mix shift jumping to 70% digital mix um even though it's still a risk but that is definitely what would get our margins to jump up in this day and age for Panera. And then we also saw the power of leverage with the LBOS's by putting down less of our own money um in equity and borrowing the rest through debt. we were able to amplify return on equity which is a very good thing and shows how powerful the leverage power is with a company like this. And then lastly, you know, the football field chart wasn't just a graph, it was a negotiation tool as we talked about already. And it visually showed why we can't pay $20 billion and want to take the financial advantage position. Um the best analysts don't just dump data. Um they curated it to support a strategic recommendation. So just like we said going back up to here, these visualizations help us to determine, you know, the best course of action to take here and this range through this valuation triangulation with the football field analysis gives us the best enterprise value in billions of dollars to look at when purchasing this company. So those are the main key things to take away just looking at this analysis here. So like I said, this analysis has helped me to move from ambiguity to structure with the five-year model and then be able to make a decision from that structure. So that is how we were able to analyze Panera Bread and get evaluation for this company and determine all the different factors and concepts that go into that. So that is the end of management 310 for me. This is the very last assignment. So I appreciate your help and watching all these videos throughout the semester and I thank you."
}