{
  "student_name": "Frankie Facente",
  "org_defined_id": "036630898",
  "username": "ffacente",
  "email": "",
  "transcript": "Hello, this is my submission for the section six cost of capital analysis assignment. Today I'll walk through the driver framework to evaluate the proposed Starbucks flagship roaster. The objective is to determine if the $12 million investment creates shareholder value using the firm's 8.5% whack. So we begin with the define and discover phase. Here I've translated the case constraints into Python variables to ensure the model is flexible. First we have the project parameters. We have a 10-year horizon discount rate. The whack is set to 8.5% which is our hurdle rate. Investment you can see the initial outlay of $12 million and a working capital of 500 grand. revenues. I have defined the revenue streams $8 million in year one, increasing to $11 million for years two through five and stabilizing at $9 million for the remainder. And then cost. Cost of goods sold are pegged at 40% of revenue alongside the fixed labor and rent costs specified in the case. Moving on to the represent phase. This is the logic engine of the analysis. Rather than hard- coding values, I created a function called analyze project. This is critical because it allows me to pass different arguments, specifically the revenue factor and the wax scenario to run sensitivity analysis later without rewriting code. Inside the function, I'm modeling the standard free cash flow formula. First, I calculate the EBIT down here by subtracting the cost of goods sold, rent, labor, marketing, and depreciation from revenue. I then apply the 25% tax rate to get NOAT, net operating profit after tax. To get operating cash flow, I added back the non-cash depreciation charge. And then finally I subtracted cost capital expenditures and adjust for working capital changes specifically the outflow in year zero and the recovery in year 10. I also calculate the terminal value here applying taxes to gain on sale in discounting the final cash flows back to year zero using the numpy financial library that's shown down here. Next is the implement phase. Here I execute the analyze project function using the default parameters. This generates our base case scenario. The script automatically builds a data frame containing every line from year 0 through 10, ensuring we have full visibility into the incremental cash flows. Now down to stage V, validate. Looking at the console output, we can verify the model's integrity. Go down to the output right here. Cash flow as you can see the negative cash flow in year zero representing the investment positive cash flow beginning in year one. The metrics the MPV is approximately $2.7 million. Because this is greater than zero, the project is expected to cover its cost of capital and actually add value. The IRRa is set to 12.84% which exceeds the 8.5% whack. And the discounted payback period is 8.21 years, meaning we recover our risk adjusted capital well before the project ends, which is 10 years. stage E evolve. However, a base case is rarely enough. In the evolve phase, I perform sensitivity analysis to test the project's robustness. And I ran three additional scenarios here down here. Revenue risk a 20% reduction in topline revenue. Cost of capital risk increasing the whack to 10.5%. and cost of capital opportunity by decreasing the whack to 6.5%. And shown with these charts looking at the visualizations, the top chart shows the healthy positive cash flows in the green against the initial outlay in red and the bottom chart is the critical decision tool. You can see that even if the whack fluctuates by 2% the MPV remains positive. However, looking at the revenue minus 20% bar, the MPV turns negative approximately negative $1.3 million uh or $3 million. This indicates the project is highly sensitive to sales volume. If the flagship store fails to drive traffic, value will be destroyed. And finally, the reflect stage. Based on the quantitative analysis, I recommend accepting this project. Financially, the base case MPV of $2.7 million and the IRRa of 13.5% offer a solid buffer above the cost of capital. Strategically a flagship roaster, this investment likely offers intangible benefits such as brand equity and product innovation that aren't fully captured in the cash flows. However, the acceptance is conditional on the confidence in the revenue projects. Given the sensitivity to the 20% revenue drop, management should prioritize marketing effectiveness in year one to ensure that sales targets are met. And yeah, thank you.",
  "video_url": "https://www.youtube.com/watch?v=dVBE7dyNkMY"
}