{
  "student_name": "Andrew Jacobs",
  "org_defined_id": "036214646",
  "username": "jacob269",
  "email": "",
  "transcript": "Uh, hello, my name is Andrew Jacobs and this is the Session Ten Assignment. For the AI use and the, uh, eh, decrelation, AI helped with outlining, brainstorming and helped with the coding for the project. And this project, uh, this project evaluates Starbucks's proposed flagship grocery. The project requires a twelve million dollar initial. you investment and a five hundred thousand dollar of working capital. So, uh, it runs for about ten years and uses Starbucks's 5, 8.5% W-I-C-C as the discount rate. Uh, revenues operating costs, taxes and a three million dollar terminal value are all provided in the assignment. And my overall goal is to build a transparent cashflow model, calculate the MP. The IRR Payback and the Profitability Index. We also want to text key assumptions and then make a clear, uh, accept or reject recommendation using the driver framework. Alright, here's the first cell, the code. So, before coding, I plan the structure of the model. I design it so- from year zero to year ten, uh, year zero including the initial investment and working capital, and then year one through ten to include revenues, operating costs, depreciation, and taxes. Uh, in year ten, I added the terminal value and working capital recovery. I also made sure that all major assumptions sit at the top of the code so they're easy to change for sensitivity sensitivity test. Last thing. Alright, here is cell two, the code, and the output. So, I ran cell one to load the libraries and input the three main, and input the main assumptions, and then I used cell two to contrast the full cash flow schedule. Uh, this table shows revenue, costs, depreciation, taxes. And, uh, free cash flow from year zero to three or ten. You can see the large cash outflow in year zero, and positive operating cash flows in later years. Next, we look at cell three, code runs, and here's the output. So, in cell three, I calculate the main capital budgeting metrics. The MPV, IR- R, simple payback, discounted payback, and the profitability index. Um, in the base case, the MPV is positive, the IRR is higher than the 8.5% WACC, the project pays back within its life, and the profitability index is above one. These results indicate that the project creates financial value. Umm, so, in the project I performed basic validation checks. The, uh, depreciation equals the $12 million investment divided evenly over the 10 years. Uh, year zero correctly includes both the capital outlay and the working capital. Your 10 correctly includes the terminal value and working capital recovery, and f***ing. The cash flow timing looks logical, which increases confidence in the model. Next, we look at so-for. It runs. Here's the output. So first I reduce all revenues by 20%. And under this scenario, the MPV drops and the IRR is much lower, showing the project is sensitive to revenue risk. Then I adjusted the f***ing. The WACC by plus and minus two. And as expected, we got the higher discount rates, reduce the MPV and the lower discount rates increase the MPV. The final sell, sell five. The first chart shows the free cash flow by year. You can clearly see the initial investment in operating inflows. The second chart- art, uh, shows MPV versus the WACC, which visually demonstrates how sensitive the project value is to changes in the discount rate. So, to reflect on this project, based on the results, the project generates a positive MPV in an IRR greater than 8.5% WACC. Uh, this, which means it creates shareholder value and- and should be accepted financially. Strategically, this rosary support Starbucks' premium brand and customer experience strategy. The main risks are lower than expected customer demand and high fixed opportunity- operating costs, which lead the sensitivity analysis highlighted. So, my recommendation is to accept the project while closely monitoring revenues and controlling costs to- Perfect. Protect profitability. Thank you for listening. Thank you.",
  "video_url": "https://youtu.be/TraLr2ZeiSE"
}