{
  "student_name": "Kayla Lee",
  "org_defined_id": "037191790",
  "username": "lee4991",
  "video_url": "https://youtu.be/xrxfGJg-gno",
  "transcript": "00:00\nHello, my name is Kayla Lee and I'm going to do the session 12 assignment about the comprehensive business valuation. So first to define and discover what we're doing, I will deliver a full valuation of Panera Bread for a prospective KKR takeover using the driver technique, combining the DCF trading comps and precedent transactions to produce an informed bid range while contrasting financial buyer discipline with strategic buyer securities. So let me first give you the hypothetical\n\n00:30\nof what's going on. So this is the scale.  have\n\n00:35\nthe EBITDA have a 50 % margin,  $400 million net income across the 2100 stores we have at Panera,  and digital sales are already at 50%. Market references here are our parameters. We can see how it's comparison to Chipotle and McDonald's as well.  So just to kind of give an idea between how Panera compares to its  competitors.  And then we have the capital assumption. So the industry walk is at 9%. Management wants it to increase to 10%.\n\n01:05\nover for strategic bidders  since we see you know our competitors like Starbucks and McDonald's doing that as well.\n\n01:12\nAnd then we have our growth lovers of 500 new stores in five years with a digital mix to 70 % with dinner catering expansion and early stage  international rollout as well.  So  with this  video, I'm gonna explain and then also create an executive ready recommendation  that states evaluation range, winning bid strategy and rationale for choosing between financial or strategic positioning as well.  So now.\n\n01:36\nI used the Google Pro Gemini to help me create um this model. So first,  you can't see all of it, but  I will scroll. This is the data  in terms of the number of logistics, and then I will explain further from there.  this initial stage  that I just explicitly stated. oh\n\n02:01\nIn  this analysis, we'll specifically establish the problem to be solved and the rationale for undertaking the valuation and conditions under which value creation can be realistically  achieved. So this initial stage articulates investment thesis that forms the foundation of the model, identifying Panera's core competitive advantages, including its highly recognized brand equity  and vertically integrated bakery cafe model and a technologically sophisticated digital ordering system and a loyalty platform  that provides both operational leverage and a path\n\n02:30\nway to incremental revenue growth.  In defining the problem, the analysis clarifies that the objective is to determine an intrinsic  enterprise value that supports a disciplined acquisition bid,  reflecting both downside protection and upside potential,  while quantifying the operational levers through which KKR can create value.  The rationale behind the acquisition centers on exploiting these levers via a structured national expansion plan,  margin improvement initiatives, and the monetization of digital ecosystem to drive  repeat customer engagement\n\n03:00\nhigher particular revenue, which together will form the conditions necessary to deliver superior financial returns.  So this phase,  we also  involved the collecting and scrutinizing of historical financial statements as well. So in this Google ProGemini, I was able to use other information from Panera  with these number logistics to help. So by linking these qualitative insights with quantitative historical trends,  the model ensures that the evaluation framework is both grounded and robust,  meeting the Rubik's  requirement to\n\n03:30\ndefine what is being solved for why and under what conditions while setting  a structured foundation for this as well.  So now  how do I represent this? I represented this by using this model right here  and having these  graphs right here. um And I was able to convert  the\n\n03:51\ninvestment thesis and operational insights into this parameter-driven financial framework. So  revenue growth assumptions are presented in the model through a combination of same store sales growth  and unit expansion with the base case projecting the additional of 100 new stores per year over five years,  yielding a revenue of CAGR of 7.5%. The same store sales growth is captured through incremental percentage lists attributed in the enhancement of Pinera's loyalty  program.\n\n04:19\nand digital ordering user experience and menu optimization as well. So as we see the EBITDA margins are similarly represented as a function of the labor optimization.  Supply chain centralization and technology enabled cost reduction expanding  from the increase in percentage as well with the revenue growth.\n\n04:40\nWe also remain the maintenance of the CAPEX model at 3 % of revenue reflecting ongoing asset upkeep requirements as well, which the annual growth of the CAPEX is set at $180 million, tied directly to the new store development. This result in a total capital allocation framework that is transparent, also fully traceable for other investors as well. The working capital assumptions are parameterized relative to revenue, incorporating day sales, outstanding inventory turnover, and payable terms and insuring.\n\n05:10\nThe incremental cash flow effects are directly linked to operational activity.  This representational rigor allows the model to capture the dynamic interplay between growth,  margins, capital expenditure, and working capital, ensuring that the projected free cash flow to firm  outputs, which increased from $381 million to  $650 million by year five, are grounded in  identifiable  operational levers rather than abstract percentages.  Furthermore, the intermediate calculations\n\n05:40\nlike the revenue bridges to incremental per unit value, the capex schedules and a working  capital adjustments are fully documented satisfying what's going on and traceability  of the providing framework.  Now we implemented the stage by, since I use  the Google Pro Gemini to provide this analysis, I was able to implement it with these models as well  in a way of representing and how I was able to trace it back into what the strategy is. So was able to use these models  to implement what my  thesis would\n\n06:09\nSo these assumptions are optionalized into a full scale financial model. And I was able to use the weighted capital, the weighted average cost of capital, the walk is derived through the rigorous market consistent assumptions with a 4 % risk free rate. And then we have the downside of 5%, the base of 7.5 % and the upside of 9%. And so therefore the equity beta, we have 0.85 and then that's calculated.\n\n06:39\nthrough these logistics right here with the numbers right here and the equity risk premium of 6 % producing a cost of equity of 9.1 % and a post-tax cost of debt of 5.5 % reflecting a 40 % debt ratio at 4.5 as the EBITDA leverage yielding a blended walk of 9 % for the base case. The projected FCFs are discounted using this walk as well and the terminal value is calculated with a conservative 3 % perpetual growth rate resulting in a terminal value of\n\n07:10\n7.27%, approximately 79 % of total intrinsic value, demonstrating both the importance of termination of assumption and the need for sensitivity testing. These scenarios are also implemented down to a case reflecting the macronomic and execution risk with a 5 % revenue growth. And then we also have with the revenue growth and the slight margin compression and a walk of 10 % producing an enterprise value of 5.85 % billion. And the base case aligned with the core thesis yielding 9.9%,\n\n07:39\nand the upside with 9 % revenue growth and the walk of 8 % producing $14.5 billion.  These scenarios are fully parameterized ensuring the model dynamically responds to changes and underlying assumptions.  The implementation stage also integrates LBO modeling establishing a debt structure of $4.5 billion  around five times the EBITDA  and a $5.35 billion in equity with debt motorization projected based on FCFF growth.  Maintaining interest coverage ratios above four times across the base and downside scenarios demonstrating the financial\n\n08:09\nfeasibility of this transaction as well. So again the projected IRRs will be 22.7 % in the base case, 15.35 % in the downside, and 29.5 % in the upside case with MILICs ranging from 1.6 to 2.1, providing this quantitative support about what this revenue stage would be.\n\n08:29\nThis would also ensure reproducibility and transparency within the company as well.  Now to validate this, I was able to ensure this implemented model is internally  consistent and extremely corroborated and responsive to the other alternative assumptions as well.  So the triangulation is performed using both comparable company and precedent  transaction analysis.  The comparable company analysis selects peers such as Chipotle, Starbucks, and Shake Shack  based on revenue size, growth, brand recognition, and digital  adoption.\n\n08:59\nand liquidity with public EV and EBITDA multiples ranging from 15 times to 18 times of what was given. Improvising Panera's enterprise values of $13.5 billion to $16.2 billion. President transactions are examined including regional and national fast casual acquisitions such as Shake Shack's acquisitions which traded to 12 to 15 times the LTM. Implying valuations of $10.8 billion to $13.5 billion and these triangular ranges provided a sanity check against intrinsic DCF value of $9.8\n\n09:29\n$1.79 billion. And it will highlight the potential strategic ceiling for a buyer with a synergy capture potential as well. The sensitivity analysis validates the model responsiveness to critical drivers as a 100 point base increase in the walk reduces enterprise of $1.79 billion and a 50 basis point reduction in terminal growth which lowers it to $0.92 billion. Let me, so this is the sensitivity analysis right here. So we see the difference between 8%, 9%, and 10%.\n\n09:58\nThese are the models right here. oh\n\n10:05\nSo this will confirm the valuation is most sensitive to the cost of capital and long-term growth assumptions. And the validation phase also differentiates between financial buyer, strategic buyer perspectives, modeling potential observational improvements, cost rationalizations, and revenue synergies as well for a strategic ACWR. And the synergies of 1.5 % of year zero, which would be $90 million phase over the three years with a capital curve of 30%, 60%, 100%, which will produce an NPV of $980.7 million.\n\n10:35\ndiscounted at 9.5 % confirming  that the value creation depends on both operational execution and integration effectiveness.  This management equity rollover 10 % ensures alignment of incentives,  reflecting human capital's critical role in achieving the projected outcomes,  visual validation tools, including football field charts and sensitivity heat maps,  which will consolidate scenario outputs, public and transaction multiples,  and strategic buyer ceilings into actionable insights  as well. And now\n\n11:04\nthe whole check.\n\n11:07\nHere are more of the models. So this model right here shows that the UCF sensitivity to the walk-in terminal growth.  This model right here, so the number of the... uh\n\n11:20\nenterprise  value of it  is right here. And then here we'll show the base case free cash flow projection between the years. hopefully by year five, we grow better. And that's what this analysis will predict as well.  And then this also kind of shows  the full on executive recommendations I will  get back to.\n\n11:38\nSo following this validation, how do we evolve with this? And this operational  insights into actionable recommendations and we'll also give decision support outputs as well. So what's recommended?  The KKR financial bid uh is  approximately  this.\n\n11:59\naround 7.5 billion  ranging to 13.5 billion.  And this also is below the strategic ceiling, which reflects a balance between competitive positioning and downside protection.  Evolution also enclose iterative refinement of the  model to incorporate LBO feasibility,  scenario-driven capital restructuring and projected equity returns under  alternative macroeconomic conditions, ensuring that the model evolves with both strategic objectives and risk tolerances. Intermediate outputs\n\n12:29\nsuch as revenue bridges and the EPITDA growth trajectories as well.  With CAPEX allocations and FCFF projections are revisited iteratively,  confirming that all assumptions remain internally consistent,  externally defensible, and strategically aligned with KKR's operational and financial objectives.  This evolutionary process demonstrates the capacity to integrate new data and also  to adjust it to market feedback as well,  which will refine operational and financial assumptions to better support decision-making  in a dynamic environment while maintaining transparency.\n\n12:59\ntransparency, traceability,  and  reproducibility in all calculations.  Now,  finally, to reflect,  this explicitly links the quantitative results to the qualitative investment thesis connecting the modeling  outcomes to strategic insights.  So the uh DCA evaluation of 9.9 billion is relative to the strategic bias ceiling of 10.17 billion.  This illustrates that Panera's premium is justified only through disciplined execution of operational improvements, margin expansion,  and brain monetization.\n\n13:29\nrather than through the passive acquisition of existing earnings.  Reflection also emphasizes that value creation is sensitive to the careful alignment of capital allocation,  store expansion, and operational efficiency in human capital, confirming that modeling rigor and strategic logic are mutually reinforcing.  By documenting the interaction between intrinsic cash flows and market multiples and president transactions and potential synergies, the analysis provides a clear roadmap for decision makers,  demonstrating how rigorous scenario modeling sensitivity tests\n\n13:59\nand triangulation with market evidence collectively enhances both  the defensibility of the bid and the profitability  of achieving projected returns. And this  reflective shade also consolidates that as well into a coherent strategic insight connecting financial modeling and also the  actionable investment recommendations.  So.\n\n14:20\nAs  we see right here, the recommended KKR bid  is therefore not  only defensible and strategically aligned, but also fully transparent,  grounded and parameterized, assumptions validated against market comparables,  stress tested under multiple scenarios and informed by both operational and financial levers  of value creation.  all of these, the analysis also  has these calculations and with these scenarios and sensitivity outputs,  we're able to integrate financial and strategic buyer perspectives to satisfy  what is going on.\n\n14:50\nbetween the leverage buy-up analysis for Panera Bread  and demonstrates comprehensible adherence to incorporating full cycle scenario modeling  and these assumptions as well.  We are able to also use external evidence from the multi-case DCF construction  and the traceable free cash flows in a defensible walk and terminal value calculations  with the LBO feasibility analysis and the projected equity IRR and MRI C case, which will also have a reflective strategic insight resulting in evaluation\n\n15:20\nrecommendation that balances  the usage of upside potential,  downside protection,  and disciplined investment execution as well achieving a holistic and transparent and analytically rigorous assessment suitable for a sophisticated financial sponsor  such as KKR.  So now to kind of reflect on everything I just said because it was a lot of information.\n\n15:42\nThis analysis, as we can see, the downside between the different percentage of the revenue growth will have a different with the walk as well and how much the EV financial amount would be.  The base case projections between the different years, we see that it increases  between the EVITDA,  even the capex, and there's a change in that as well. It subtly changes with an increase as well.  The FCF also increases as well by year five having a large amount of projection. So this is really important because\n\n16:11\nwhen they're going to come and invest, how is this going to affect the company? How are we going to grow? And it grows quite substantially in a five-year span. Each year  does a lot better than the previous year and has a growth expansion as well with that.  This also  relates to the reflection of the market multiple analysis.  So this is the minimum right here,  depending on the different ratios with the calculations we did  in the code right here  and how it would be evolved.  Excuse me.  And  with the sensitivity analysis, what does this mean for the walk?\n\n16:41\nwith 2.5 % growth, 3%, 3.5 % what's going on. We see it's a steadily increase even depending on the different scenarios of the walk. Currently it's at 9 % we won't market. The company wants us to be at 10%. With that growth, how does it look like? Even at, let's say it doesn't grow to 10%, what does our growth still look like? We still have a large increase year by year that exceeds with.\n\n17:06\nover mostly reaching the 10 billion and going over around that range as well. The models right here, we have the valuation. So this is a triangulations between the DCFs and the comp. So the different ratios of the calculations between the equity.  And we see how that reflects with enterprise value. So lots of them exceeding the billion target range  of we want of KKR. This is the billion range. I really like how this model is able to show kind of what that range is. And we can already see that even for the comps is going in, we're hitting the bid range or going past it as well.\n\n17:36\nthis is the projection bridge that will show the increase uh in the FCFF calculated between each year. We can see that increase is going on  and this shows the  sensitivity analysis and terminal growth  to the walk reflected of the DCF and how that enterprise value goes as well. So again,  this is the billion range of the EV. The walk-away price, so the downside EV, this is the amount we will do in the strategic buyer ceiling with the synergies as well.  The winning bidding strategy should initiate bid at the lower end of the range  to capture premium over the present\n\n18:06\ntransaction average of the 13.5 times the EBITDA and the winning bid should be positioned around that which is highly above the ECDF value ratio. So this is the rationale as well. Let me move that around so you're able to read that as well. So that's my model I did. I was able to use the Google Pro GEMMA to help me create a better understanding of the model and I was able to, I really liked how visually appealing\n\n18:36\nvisually appealing  this model was and an explanation of that as well and so with these models. Thank you."
}