{
  "student_name": "Francisco Menendez-Quintanilla",
  "org_defined_id": "037704658",
  "username": "fmenende",
  "email": "",
  "transcript": "Okay, so today we're going to be analyzing Netflix with average cost of capital or WACC to evaluate a 5 billion content investment decision. Our core objective is to determine the appropriate hurdle rate for this project and recommend an optimal capital structure strategy. Okay, so we begin in the input sections, which are over here. Notice that fundamental components are risk-free rate of 4.5% and market risk premium of 5.5%. set by the market conditions. And Netflix specific equity beta is 1.3. These inputs combined with the current market cap, which is 200 billion, and the debt is 13 billion, are the foundations of our analysis. Okay, so now we're going to calculate the two main drivers of WAX. The cost of equity is determined using the CAPM model. Plugging in our figures, Netflix costs for its equity finance is $11.65. And the after-tax cost of debt reveals the value of the tax yield. And the pre-tax debt costs around 5.8%, reducing the 21% corporate tax rate, making the effective cost of debt only $4.58. Now, we're going to calculate the current. WACC over here. We first derived that capital weights and which is this. And then we, because Netflix is heavily equity finance with a 93.9 equity and only 6.1% debt. Applying the WACC formula, we arrive at Netflix's current WACC of 11.21. So, now we model the effect of the proposed 3 billion debt issue. The large slight increase resulting in 92.6 equity and 7.5 debt. With the recalculations, now the WACC drops marginally to 11.12. This slight decrease confirms that the use of additional debt, even a small amount, is financially advantageous due to tax shields. So, now with the results of 11.21 WACC being significantly higher than Disney's 8.2 and the media industry range being about 8% to 10%, the difference is clearly attributable to Netflix's suboptimal low leverage capital structure. Crucially, the 11.12% is only for an average risk project. For the $5 billion content investment, we must use project specifics, which For example, international content, which is higher risk, should be assessed using a rate higher than 11.12. And a stable U.S. content, which is lower risk, should be used at a rate of lower than 11.12. So our execution recommendation is clear, Netflix should strategically increase its debt ratio towards the 15 to 20% range to minimize its WACC, maximizing the tax shield and bringing its cost of capital in line with the industry. In summary, Our code demonstrates the current WACC of being 11.22. When increasing debt lowers this rate, the company needs a more aggressive strategy to reduce its cost of capital. A lower project-specific WACC will ensure that 5 billion content investment yields optimal returns. You can see even with the 7.4 debt, it only lowered it like 0.1 percent so that's why my recommendation as i already stated should be to get into a 50 to 20 range of depth so in aligns with the industry thanks for watching",
  "video_url": "https://youtu.be/YGsWNEdfCUg"
}