{
  "student_name": "Caleb Piekarski",
  "org_defined_id": "037218585",
  "username": "cpiekars",
  "email": "",
  "transcript": "Okay. So, today I'm going to be going over the uh session session 8 market efficiency and behavioral finance. Um so to today we're going to be going over the uh market efficiency in investigation. So going over the assignment overview, uh we're going to investigate market efficiency using the GameStop GME short squeeze event of 2020 through 2021 as a case study. We verify the accuracy of stated facts, analyze price behavior relative to efficient market hypothesis predictions, and evaluate whether market anomalies constitute evidence against market efficiency or can be explained within existing frameworks. So uh first critical step is going to be to verify the statement um GameStop traded at 4 cents in August of 2020 against actual historical data. Um and then if incorrect document the accurate figures and determine appropriate communication approach for correcting the professor. So looking at the event timeline uh starting August 2020 Jimmy near nearly goal uh goes bankrupt. uh September of 2020, Ryan Cohen that Chewy founder acquires 13% stake. And in January 2021, Reddit um uh price surged to $483. And then February 2021, congressional hearings on market manipulation and present postevent price stabilization. Um some key data points, short interest peaked at 140% a float. Uh retail trading volume increased 10fold during squeeze. uh trading restrictions implemented at peak and uh hedge fund capital sustained 53% loss required bailout. Um so starting out with this assignment, we're going to be looking at this short slideshow. Um so just a project overview, we're going to be going over the market efficiency investigation of the GameStop short squeeze uh 2020 through 2021. Uh the goal is to test how GME's price behavior compares to the efficient market hypothes uh hypothesis uh using the driver framework define represent implement validate evolve and reflect. So looking at define and discover um Jimmy did not uh just to verify from earlier Jimmy did not trade at 4 cents in August of 2020 and the actual price was around $14 to $1.79 per share uh via or according to Yahoo Finance. Uh more facts. Um Ryan Cohen, the Joey founder, bought 13% stake of September through December 2020. And then January 2020 2021, uh the price surged to 43. Uh and then the short interest was 140% of float, which was a record high. Um Melbourne Capital lost 53% January of 21. uh retail trading volume rose 10 10 times and the broker restrictions Robin Hood limited buy orders January 28th through 29th. So um just some findings um after going over all this information um some abnormal returns would be um extremely high in January of 21 prices uh moved far be beyond expected levels. Um cumulative abnormal returns strongly positive during event uh which indicates deviation from fundamentals. Um the trading volume increased over 10 times during the squeeze. Uh which in turn retail speculation surge. Um volatility daily price swings of 30 to 50% um emotional and hard driven trading. Um the fundamental value uh analysis estimated 10 to $10 to $40 per share confirming over valuation at the peak. So um looking at our efficient market hypothesis our EMH evaluation the weak form was uh partially violated um as prices didn't follow typical historical patterns the semi- strong form was uh violated prices didn't reflect available public info moved on social hype the strong form still holds as no evidence of insider info uh driving the event um just some behav behavioral finance insights uh hurting uh which would be investors followed Reddit trends rather than uh analysis and then people also had fear of missing out which pushed um the irrational buying of of this and the overconfidence traders believed price would only go up from here and yeah for rational investor profitability um profits possible only with perfect timing which would be high risk low predictability after the spike. Most late uh insurance lost money as price crashed and um just some theoretical imple implications. Some short-term efficiency market prices deviated sharply from fundamental value. Um long-term correction would be prices return closer to uh intrinsic value over time. And the takeaway would be image uh generally holds but um behavioral factors can dominate temporarily. So just to conclude um what we've been going over uh the GameStop short squeeze revealed how social media collective action and psychology can disrupt market efficiency. So while the market was temporarily inefficient, it ultimately corrected um support and EMH in the long run, but showing behavioral finances uh realworld impact.",
  "video_url": "https://www.youtube.com/watch?v=jscRHcgx_dU"
}