{
  "student_name": "None None",
  "org_defined_id": "034532957",
  "username": "mccar169",
  "video_url": "",
  "transcript": "hi, my name is\nColleen McCarthy and I built a financial\nstatement explainer using Google AI\nStudio and Gemini 2.5 Pro and the main\npurpose of this that it helps investors\nspot risks that they might miss in a\nmuch shorter amount of time and it's\ncalled like the the red flag scanner.\nSo, in order for it to work for the\nworkflow, I gave the system\ninstructions. I give the AI a forensics\naccountant persona. So instead of just\nsummarizing, I programmed it to look for\nthe discrepancies between net income and\ncash flow. So you can see that here\nunder my assistant instructions.\nNow for the demo. So I'm going to upload\ndecided to choose Spirit Airlines, a\n2023\n10K.\nAnd I'm just going to say I'm going to\nask it to analyze analyze this 10K and\ngenerate the red flag report.\nAnd basically you can just watch how it\ngoes through and scans this 127\npage, you know, 10K of Spirit Airlines\nin less than a minute. Where am I? here.\nSo, we're going to keep letting that\nload. It's going to output a\nred flag report,\nwhich is basically a table with the\nfollowing categories. It's going to find\nrevenue quality, cash flow, debt, and\nlegal. and it's going to find what looks\nworrying, why it matters, and they're\ngoing to source it, too. So, we can\ncorrectly validate it, and the tone is\nprofessional and objective, but\ncritical. So, here it is. It said it\ntook 26 seconds.\nAnd so, just to validate it together,\nI'll show the full report. There's the\nfour categories.\nAnd um we could just look at one of\nthese numbers maybe.\nOkay. So here it says under the\noperational instability that um in 2024\nthere's expected to average 25 grounded\naircraft. And then over here under the\nsource we can see it's on page six. So\nif we go back to the 10K and find page\nsix\num\nhere in 2024 averaging approximately 25\ngrounded for the full year. So that was\njust to\nvalidate\nand you can see that I identified and\ncited the correct page number. Okay. So\nnow for a little pivot um I can ask it\nto explain concepts more simply. For\nexample, I can give it a prompt that\nsays to explain the revenue quality risk\nlike I'm 12y old. So we can just put\nthat in there.\nAnd what that\nThink\njust reward this for any category that\nyou can see from this report and just,\nyou know, dumb it down to\nmake it um understandable. So, here you\ncan see that it took 13 seconds and it\ncompares the problem to a lemonade\nstand, which is pretty on theme for a\n12-year-old. And\nagain, there's the revenue quality risk\nthat we asked about and all of\nmore info. And this just kind of\ntransforms raw data into actionable\nadvice. So to conclude\nthis um\nthis tool reduces hours of reading into\nyou know it said 13 seconds and then\n26 seconds which is under a minute um\nsecond risk assessment which is again\nvery useful to investors who might spot\nrisks of\na 10k and again this is 127 seven pages.\nSo I would say this tool is very useful.Thank you."
}