{
  "student_name": "Juan Moreno Morales",
  "org_defined_id": "035730816",
  "username": "jmorenom",
  "email": "",
  "transcript": "Hey professor, in this video I'll be working through my capital budgeting analyze for the proposal Starbucks flash chip. I structure my entire workflow using driver framework and all the calculations are automated using python and cycle collab. In the defined stage my goal was to clarify the investment decision Starbucks is facing. Starbucks is evaluating whether to build a new 12 million flash ship roster that will operate for 10 years the key financial question is does this project generate value above starbucks 8.5 cost of capital to answer that i must build a full capital budgeting system including revenues operating cause depreciation or capital needs taxes and terminal value I need to calculate MPV, IR, payback periods, and profit index, and I recommend whether Starbucks should proceed. In the discovery stage, my goal was to gather all the financial assumptions and identify every cash flow component that must be included in the accurate The initial investment was $12 million, working capital was $500,000, up front fully recovered in 10 years, revenue year 1, $8 million, year 2 was $11 million year 6 to 10 was $9 million, the operating cost was 40% of the revenue, labor was $2.5 million Rent and utilities was $0.8 million. Marketing was $0.3 million in year 1. $0.1 million in year 2 to 10. Marketing was $0.3 million in year 1 and $0.1 million in year 2 to 10 years. The tax rate was 25%. Terminal value was $3 million at the end of 3. At this stage, I was confirmed that every cash flow that must be included, operating cash flow, depreciation, tax yield, changes in working capital, and terminal recovery. In the represent stage, I structured a financial model into a clear timeline from year 0 through year 10. I mapped out the model and the order. Year 0 was the end of CAPS, working capital development. year 1 -10, revenue per year, a COG, operating expense, depreciation, EBIT, taxes, operating cash flow, changes in work capital, terminal value, recovery of working capital. The goal in the present is to not calculate anything yet, but to plan the structure so the implementation will be clean, organized, and repeatable. I also, oh, it's an implement. In this stage, I converted the financial structure into a Python code. First, I created a section of patterns so our assumptions can be changed in one place. Second, I built a cash flow table using Python lists, loops. Third, I incorporated all capital budget metrics. Further, I added sensitive analyze for two scenarios. revenue decreases by 20%, WACC adjusted by 2%. Fifth, I graph the annual cash flow as well as a sensitive impact on the NPV. While in the code runs, you'll see the year-by-year intermediate values such as EBT taxes and free cash flow. In the valid stage, I check my model for completed inaccuracy, cash flow compliances. I verify that depreciation, taxes, working capital, and terminal value are included. Discount rate, the model consists of applied Starbucks 8.5%. Metric included NVV, IRR, properly indexed, and payback analyte. Scenario violation, the revenue downslided and WACC sensitive results have as expected. In the evolve stage, I expand and analyze beyond per number, synthesis, margin, and size. This model can be used for future Starbucks stores, initial projects in multi-scenarios, planning changes, and tax policy. So R is reflect. Finally, in the reflection stage, I validated what it's analyzed taught meet and deliver the investment recommendations the most the most important insight that is positive according income does not automatically mean a project creates value mbv focuses us to evaluate economic value after accounting the the cost of capital taxes and time and cash flow my recommendation based on the project mvv and ira the 8 .5 wacc starbucks roster projects creates a shareholder value under the base case assumptions. Even under the 20 % revenue downside scenario, the project remains close to break-even, showing, moderate it. The main risks including demand, unnecessary fixed labor costs, long-term market returns, but overall financial strategy, case supports accepting the project. So that was my driver base project.",
  "video_url": "https://www.youtube.com/watch?v=_LbsCf32VlU"
}