{
  "student_name": "None None",
  "org_defined_id": "036177508",
  "username": "mill3280",
  "video_url": "",
  "transcript": "Hi there. So, I'm Bri and for mini\nproject 3, I built an intelligent\nfinancial tool that goes beyond the\ntraditional calculations. So, my goal\nwas to create something that doesn't\njust compute the numbers, but explain\nand analyze and guide users in making\nbetter financial decisions with AI\ninvolved. And so this is my financial\ncalculator dashboard that we're looking\nat right here. As you can see, it says\nthe present value, the future value, the\ncost of capital, and then an added-on\nfeature is the smart decision, and it's\na budgeting decision powered by AI. So\nthis is on top of these foundations\nbecause my goal is just to show\nprogression which is outlined within the\nassignment of in my earlier projects I\nwas just able to build the calculator in\nwhich present value could be calculated\nfuture value could be calculated but\nthis is just the next step. So this is\nwhere AI can really jump in and take\nover. So, instead of the user needing to\nknow which formula\nto choose, the AI agent can handle the\nnatural language input. Um, as in like,\nI have $5,000 and I want to invest this.\nShould I save or what does that mean?\nUm, it doesn't just calculate a number,\nbut it interprets the situation. It\nexplains the logic in plain English.\nCompare scenarios. Give recommendations.\nAnd here is where I'm talking about. So\nyou can enter in a project name,\ndescription, your initial investment,\nexpected return duration, and run a\nsmart analysis. So you can kind of use\nthese tools to get to the point here.\nAnd then this analysis will actually\ntell you whether or not you should run\nthis project. So step one is understand\nthe user. So it extracts the user's\ninputs, goals, timelines, risks from a\nnatural language. Um, it uses the\nexisting calculators as tools. So, it\nuses the future value, the present\nvalue, the cost of capital that I built\nearlier as functions when needed. And if\nthe user asks about the future goals,\nthe AI calls the future value\ncalculator. If it asks about today's\ndollars versus future dollars, it calls\nin the present value. And if it's\ntalking about comparing or investment,\nit uses the cost of capital.\nSo it generates scenarios that are\nconservative,\naggressive, and it shows the tradeoffs.\nUm,\nso\nyes,\nin version one of my tool, I just simply\ncalculated a recommendation based off of\none formula. It wasn't personalized and\nthe explanation lacked context. So\nthen this tool made it far more\ntrustworthy, transparent, and alive.\nreal financial decision making. Um my\nbiggest reflection\nin engineering this AI tool was to stay\nwithin realistic boundaries and provide\nhelpful context without overstepping. So\nthis project helped me understand how AI\ncan turn traditional finance tools into\nuserfriendly advisors that make concepts\num understandable for normal people.\nSo, it changed the user experience from\nwhat does the number what number do you\nwant me to calculate to tell me your\nlife situation and I will guide you\nthrough it. So,\nI'm going to go back through here. Um,\nmight need a little refresh right here.\nAnd as you can see, we can just mess\nwith the numbers in each of these to get\naccurate\ndata.\nI will show you how this is run very\nquickly for the financial calculator and\nthe smart analysis.\nand yeah here it shows the investment um\nfor this scenario that I had just\nchanged the numbers to the investment is\nrejected\nso\nit recommends that I don't take this\ninvestment and it gives me an\ninterpretation as to why I shouldn't\ntake this investment. So, it shows that\nthe MPV with these numbers would be\n-3,557.26\nand that indicates that the project is\nexpected to lose this amount of money in\npresent value terms, meaning it's not\nfinancially viable under the current\ncash flow. And it goes in depth as to\nwhy I shouldn't take this. So this just\nreally shows me the next steps in how\ncapable AI is and the power of smart\ndecision in a financial calculator. Sothank you"
}