{
  "student_name": "Galiena Colon",
  "org_defined_id": "037271356",
  "username": "colon34",
  "email": "",
  "transcript": "Hi everyone. Today we're going to go over session nine and we're going to be using the driver framework as we go through this situation. So the first step is define and discover. So let's just run through the structure of the problem. So what's our objective today? Our objective is to calculate Netflix's current and future whack to evaluate a hypothetical 5 billion dollar content investment and make strategic recommendations at the end. What's our scope and horizon? We are focused on Netflix and its corporate financing and capital structure. The analysis is static, but the implication is a long-term investment decision. This analysis is for the Netflix CFO making a capital budgeting decision for a hypothetical $5 billion content investment. So, what are our constraints? The analysis is based on a set of hypothetical simplified financial parameters and does not account for potential dynamic market changes. Whack is calculated as a firmwide rate. Also for our data inventory, we were given all the parameters needed to calculate whack. We need to calculate the market value of the firm cost of equity and after tax cost of debt. For the success metric, it will be we'll need accurate calculations of Netflix's whack for both the current and leverage scenario combined with a financially sound recommendation. And then as our benchmark/sanity check. We will compare against the media industry whack range and then also compare to Disney's whack and Amazon Prime Videos whack. So on to the mission details. Again, this is a $5 billion contact content investment decision and we're going to be calculating whack for the current structure and then we're going to be calculating whack when they use more debt financing. So we were given all of this information that we're going to need to calculate the return using CAPM and calculate whack. And then we were also given information on some of Netflix's competitors so we can do an analysis on that. So on to the represent stage, we're going to be mapping out some of our capital structure components. Just walk kind of walking through the calculations to get to the W. So for the equity component, we were given that the market value was 200 billion. And then we're going to need to find the cost of equity using CAPM. And I outlined what we already have, but we are missing that return value. And then for the debt component, we were given that the market value was 13 billion. But then we need to also find the after tax interest rate because that tax shield will come into effect and actually make the interest rate lower than it it is stated. So then we'll need to find the total capital value and that is found by taking the market value from the equity and the market value of the debt and combining them. And then we'll go into that whack calculation where we take the equity weight and the debt weight and implement that into the whack equation. And then once we find the current whack, we're going to then find the whack after they have issued 3 billion of new debt. And so we're going to need lever the equity beta and rele it using the new debt to equity ratio and then we're going to need to calculate the new whack and the new cost of equity. So on to the implement stage. I'll walk us through the current whack calculations with my code and then we'll go to the whack where we issued more debt and then I'll show you some visuals. So let's go see that code. So, first we're looking at the code for the current whack calculation. And it just outlines here the structure for the equation and some of the values that we were already given. And then it outlines the cap m inputs and the cost of debt inputs. And then it goes into the total firm value where it's going to add together that equity and debt value. And then it's going to find the structured weights. It's going to find the cost of of equity using CAPM. And then it's going to calculate the after tax cost of debt with this equation as it outlines here. And then it's going to calculate the whack calculation. So then as we scroll down, we go into the sensitivity analysis that I asked it to implement and each of the scenarios is testing or giving a different value for one of the inputs into the equation. And so for the first scenario, I wanted to see what would happen if the risk-free rate gets higher. And so it's going to increase it by 1%. For the second scenario, I wanted to see what would happen when the market is more volatile. So it's going to increase the market risk premium by 1% as well. And then I also wanted scenario three to be what would happen if the company beta increases. So it's going to take the beta that it was given 1.3 and increase it to 1.5 and see what the whack is. So then it's just kind of everything and then here is our output. So looking at the output here we can see that our equity weight is very high compared to our debt weight just showing that we are getting more capital from pulling equity from the owners instead of getting debt and then it shows that the cost of is of equity is 11.65 and then shows us the after tax cost of debt being 4.58. So you can see that is cheaper than the equity and then the calculated whack was 11.22. And then here's the different scenarios of the sensitivity analysis. Seeing when that risk-free rate increases, the whack definitely increases. Um when the market risk premium increases, the whack also increases the most out of these three scenarios. And then the equity beta when that increases the whack also increases. So we can see that the calculated current whack is definitely sensitive to different inputs in the equation changing but more so with the market risk premium when that increases onto the code where we are calculating the whack when we were issuing $3 billion of new debt. It outlines some of the parameters that we were already given like I said in the last one. And then it's calculating the unleveraged beta right here and then calculating the and relevering it with our new debt to equity ratio because we have no debt from issuing more. And then here it outlines those components that we're going to need for the calculation like the total firm value, the capital structure weights, the cost of equity using CAPM, and then it also It's the after tax cost of debt and then it runs the W calculation. And then we go into the different cases that I wanted to try. So down here again we have the sensitivity analysis for this new whack that we're calculating. So again I wanted to see what would happen when the risk free rate increases, what would happen when the market risk premium increases and what would happen when that beta increases. So then here just printing everything out and giving us an analysis. Here is the output. So you can see that we have our base case that current w that we calculated before and then we have our new whack when we issued more debt and it gives us some analysis and we can see the sensitivity analysis for this newly calculated whack is right here. So taking a look at some of the numbers from the newly calculated whack, we can see that our equity weight is lower compared to our debt lower than last time and our debt weight is higher than last time because we have issued more debt. And then our cost of equity is higher just because those investors are expecting more because it's getting riskier because we are using more debt. And then the after tax cost of debt is 4.58 and the calculated whack is 11.20. You can see it is a little lower from the base case and then the uh equity beta used is a little bit higher because again more debt issued. And then looking at our s sensitivity analysis for this whack we can see that when everything increased so did the whack increase compared to that 11.20 but it increased the most when the market risk premium went up by 1%. So let's jump into some of the key insights that I found. basically saying that whack did decrease when we added more debt and this indicates that the new capital structure is expected to be cheaper for the firm overall. And then it's saying because we added more debt on that the since debt even pre-tax is cheaper than equity the shift generally pushes back down due to the tax shield on interest payments. And then this section is basically saying that because we added more debt on that investors are now expecting a higher return and that's why the cost of equity went up a little bit. And then it says this increased cost of equity partially offsets the benefit of cheaper debt. So overall the benefit of adding more cheap tax shielded debt outweighed the higher cost of equity resulting from increased financial risk. I did also run a sensitivity analysis on whack compared to different debt to equity ratios. And this graph basically shows us that adding more debt on is beneficial up until a point when it turns and it's not beneficial anymore and the whack starts to increase a lot. So this graph shows that the minimum whack that was capable was 118% and then from this kind of data up here we can see that the optimal debt to equity ratio is 10%. And then this graph kind of shows the same thing just saying that as we add on more debt our whack decreases. And again, the main reason that the whack decreases is because of that tax shield and the interest rate for the debt goes down. So just to kind of recap, we looked at the current whack. We looked at the whack with more debt and then we looked at my visuals. And then what would whack be at different debt to equity ratios. We kind of looked that at that with those graphs. So the optimal capital structure would be the mix of debt to equity that minimizes whack. So there's an initial benefit to debt. debt is cheaper than equity and causes whack to decline. But then there's a trade-off point. As the proportion of debt increases, the company's financial risk rises and lenders demand higher interest rates and share and holders demand a high return. So the optimal structure would be that point where the marginal cost of financial distress begins to outweigh the marginal benefit of the tax shield and at this point whack will be at its minimum and we saw that with those graphs. So the whack we calculated was the overall firm whack. But do we need project specific whacks for the scenario like for projects for US content and for projects for international content? So basically this is saying yes that we do need different project specific wax and you should only really use the firm whack rate if the risk of the project is about the same as the company's risk. But you're going to need different project whacks if there's differing risk for different projects. And this basically says that using the firm Y whack will lead to incorrect investment decisions where we where too many lowrisisk projects would be rejected and too many high-risisk projects would be accepted. So basically what the divisional cost of capital concept is it it says that it dictates the different business units or project types should have different discount rates that reflect their unique risk levels. So let's dive into the risk differences between US and the international content. So for US we can see that the market saturation is higher and the revenue volatility is likely lower and the competition is high. And then cash flow risk it's likely lower. And then the conclusion for overall is that there's lower risk compared to international. But for the international the market saturation is lower, the revenue volatility is likely higher. There's the competition would vary by region and then the cash flow risk would likely be higher. So overall this in international content would be more high risk than the US content. So then this down here basically says how does this project specific wack kind of relate to Netflix in this scenario and it says that they would more likely be accepting the riskier international content over the US content because the return for the international content would be higher than whack but the return for the US content would be lower. So to adjust for the different risk for the different projects and to have different whacks for each project, you would need to adjust the firm whack rate with the risk adjustment. So you're either going to add risk to the whack or you're going to subtract the risk adjustment from the whack. And you can do this using the pure play approach where you identify a publicly traded company that is primarily involved in the high-risisk activity and then you find their unleveraged beta, relev capital structure to find the project specific cost of equity. So here it outlines those steps and the method that you would use to adjust the whack. And then my recommendation for the discount rate selection would be not to use the firmwide rack whack for these two different projects, but you should adjust the whack. And so the discount rate for the higher risk international content projects would be the firm's whack plus the risk premium and the discount rate for the lower US content projects would be the firm whack minus the risk reduction. And so down here is an example of what it would look like for having different project whack. So here in the middle we have the firm's whack and then at the top we have the US content whack and you can see that this whack would be lower. Let's just say like 9.7% and the reason the whack would be lower is because the US content is a lower risk profile but then the international content would have a higher whack. Let's just say 13.7% and this would be because it is higher risk. Next, for the validate stage, let's cross check with the industry benchmarks and with peer companies. So, I'm not going to dive into a lot of how Amazon um compares to Netflix because we don't have a lot of time, but to really dive in on Netflix versus Disney. So, Netflix has a whack of 11.20 and their debt weight is 6.1%. And then their business model is Pure Play, a global streaming platform, high growth but volatility. And then Disney has a whack of 8.2% 2% with a debt weight of 30% and then they are very diversified and also Amazon is kind of in the same place as Disney because they are also very diversified. Netflix does have a whack of 3 that's 3% higher than Disney and this is driven by three main factors. The business risk, the financial risk slash the capital structure and the cost of equity. So for the business model slash systematic and systematic risk since Netflix is a pure play high growth subscription dependent company they're very very sensitive to changes in investor sentiment regarding technology and growth stocks and this is reflected through their high beta and so they're going to need to constantly um invest in these riskier content investments which also increases their risk. But on the other hand Disney is more diversified. stable cash generating divisions like their parks and other products um provide counterweight against the risky streaming service and so this diversification acts to lower Disney's overall risk and yeah so capital structure and tax shield since Netflix is extremely equityheavy um this does signal low financial distress risk but it forces the company to finance almost everything using equity and so they're growing the benefits of the tax shield which makes their whack become higher. And then Disney has a robust 30% debt to debt to value ratio and by utilizing the more cheap debt they are getting that tax shield. They're getting those benefits and it lowers their whack. And then lastly, the cost of equity component. Since Netflix's cost of equity is so high at 11.65, Then it is compared to the cost of debt percentage which is 4.58 because whack is an average weighted towards the largest component. Netflix has a lot of equity. It gets a lot of capital from its equity but not a lot from its debt. So the whack is going to be pushed higher because of this. So because Netflix is at such a higher has such a higher whack compared to the industry, it puts this them at a disadvantage because to justify the same project, Netflix has to generate higher returns than competitors like Disney. And then for competitive implications, since Netflix is higher whack has a higher whack, it puts it at a competitive disadvantage in capital budgeting because Disney could go for a project that has a lower return but Netflix can't because its whack is higher. So it has to pursue those higher return projects. So on to evolve. How does whack apply to capital budgeting and valuation? So its application in capital budgeting is it that it's the hurdle rate. So whack is the discount rate used to find the present value of projects future cash flows. So the decision rule would be that Netflix should accept the content investment if the MPV is greater than zero. And this means the project is expected to generate a return greater than whack. And then whack also serves as the benchmark against which the project's calculated IRR is compared. So the decision decision rule for this would be that Netflix should accept the project if the irr is higher than whack. And then whack is the standard hurdle rate but again we should not be using this for different projects that have different risks. And then how does it apply to firm valuation? It's discounting it's used for discounting future cash flows. So WAC is the foundational discount rate used to estimate Netflix's enterprise value through the DCF method. If whack decreases then the enterprise value will be higher because the future cash flows will be discounted less aggressively resulting in higher present value for the entire firm. So lastly reflecting we're going to be looking at the insights on optimal capital structure and the financing strategy. So for the $5 billion content investment, my recommendation is that Netflix should proceed with the three billion in additional debt issuance because that whack was lower. The current whack was 11.22, but then when we added that debt, it was 11.20. So this is good. The rational is that the current capital structure is not optimal with the high percentage of equity. Adding debt is the fastest way to reduce the overall whack and increase shareholder value. So, what's the benefits of the extra debt? The benefits would be that the debt is costing around 4.68% after the tax, which is way cheaper than the equity at 11.65. And so, by substituting equity for debt, the WAC decreases, moving Netflix closer to its industry peers. And then the interest paid on the new debt provides a valuable tax shield, direct directly lowering that whack percentage. So, you might be asking yourself, what's the trade-offs between having more debt than equity. And so for the cost for debt financing the cost would be low. For equity it would be high. For risk debt financing would be high financial risk. Equity financing would be low financial risk. For the control debt financing would not dilute ownership but equity financing would dilute ownership and existing shareholder control. And then for flexibility, debt financing decreases future financial flexibility and equity financing maintains high financial flexibility. So the optimal strategy for Netflix would be to implement more debt and kind of balance out that debt to equity ratio so that they're getting that full tax shield benefit and it lowers their whack. So what is the debt issuance impact if they are getting more debt? This will the impact would be that it's going to reduce financial flexibility by adding fixed interest obligations. However, if the in investment generated returns above the new whack, it increases the overall size of the firm and it its future investment capacity. But what's the long-term goal? By optimizing the capital structure, Netflix can achieve a lower, more sustainable whack. And the lower whack translates to a lower hurdle rate allowing the company to approve a wider range of profitable content projects and compete with more effective compete more effectively against lower wack rivals like Disney and Amazon for example. And then lastly I want to just point out the very importantness of using the project specific wax. And so while the firmwide whack is important for overall corporate valuation, it's not good for comparing different projects. And so using the average 11.20 whack will lead to the whack trap which will result in rejecting profitable low-risk US content projects. But then would we would be accepting value destroying high-risk international contact projects. So this was session nine. Thank you for listening.",
  "video_url": "https://youtu.be/PYvOTM9kQvw"
}