{
  "student_name": "Kaawon Kim",
  "org_defined_id": "037356171",
  "username": "kim4574",
  "email": "",
  "transcript": "Hello, my name is Kan and this is my management 310 assignment for session 8 or session 9. And today I'll be walking through a full weighted average cost of capital analysis for Netflix for my assignment. Um the context is that there's a hypothetical $5 billion content investment and I'll be applying the full driver framework today. Um, first I'm going to start by defining the problem and then go into the construction of the formulas and variables and then go through the calculations of the cost of equity, cost of debt and then the weighted average cost of capital before and after the 3 billion debt insure issuance and then I'll also evaluate project specific discount rates compare Netflix to Disney and Amazon and then give some strategic recommendations. Um, I'm also going to be talking about how you can leverage technology, automation, modeling tools to improve the cost of calculation, estimation, and decision making. So, first we're going to be defining the question that we're trying to answer and the sub questions. So, the question is, Netflix is considering a major $5 billion content investment and then determining whether this investment creates value. Um, and you need to accurately estimate the WACCC or the weighted average cost of capital, which I'll now be referring to as the WACC. And that represents the minimum return or that hurdle rate that we talked about in previous chapters that a project must earn in order to compensate debt and equity investors. Um, and so some sub questions that we're going to be answering are what is Netflix's current WACC? How would it change if it was issu if an additional three do $3 billion uh debt was issued? Um how should US content and international content use different hurdle rates? How does Netflix's WACCC compared to peers like Disney and Amazon? And then what should the capital structure of Netflix's target be going forward? And then um it's going to matter because if you misestimate the WACC, you're going to either overinvest in risky content that might not give you as much of a return or underinvest in projects that would have generated much greater shareholder value. And so first I'm going to be moving into the analytical foundation. And so the WACC calculation is the market value of equity divided by the total firm value. Then you're going to multiply that by the cost of equity and then add that to the market value of debt over the total firm value times the pre-tax cost of debt. And then you're going to all multiply that by the tax shield, which represents that interest expense um is tax deductible. And so it's going to be EV over R sub E plus D over V or E over V * R sub E plus D over V * R sub D * 1 - T, which is that tax shield. And then the cost of equity for the cap m um that like r sub if you break that down even further is going to be what we talked about in previous chapters is going to be that risk-free rate uh plus the equity beta or like the systematic risk that you're taking and then the market risk premium and then the after tax cost of debt or the r subd* 1 minus t. The R subd is going to be the yield on Netflix's debt. And then that's going to be 5.8 because Netflix is tripleB plus. And then the T is going to be the corporate tax rate which is 21%. And that our R subd is going to be 5.8%. And so some of the values that we were provided were was that the market cap for Netflix is 200 billion. The market value debt is 13 billion. The beta is 1.3 fairly low. The risk-free rate is going to be 4.5. The market premium rate market risk premium is going to be 5.5 and then the debt yield is going to be 5.8 and the corporate tax rate is going to be 21%. And those are going to be used in the calculations. So first for the cost of equity we have that um equation for from before which is the R sub F plus um the equity beta time market risk premium. And using the values from before that's going to be 0.045 045 + 0.0715 and that's going to be 0.1165 which is 11.65%. And that's the equity the riskiness of Netflix's equity relative to the market. And then next you're going to calculate the after tax cost of debt which is going to be the 0.058 value that we had and then one minus that corporate tax which is 0.21. And so those two numbers multiply multiplicated is going to be 0.04582. And that gives you a percentage of 4.582. That's the tax shield and it reduces Netflix's borrowing cost. And then the current capital structure is going to be um the the um the V= E + D which equals 213. And if you take those ratios, E over the current value, um that's like the or like the total and then D over the total, that's going to be 200 over 213 = 0.9385. And then D um over V is 13 over 213. And that's 0.610. that shows that Netflix is heavily equity financed instead of debt since the um value for equity over V is much higher than the debt over the total um compared to maybe some other business models. And so if you calculate and put everything together, that's going to be 0.9385 * 0.1165. And then you're going to multiply or add that to 0.610.0610 * 0.04582. 04582. Add those two numbers together, you're going to get 0.1127. So that means rounding, you're going to have a current weighted average cost of capital of 11.21%. And so that's before issuing the $3 billion of new debt. So now we're going to consider that instead of 13 billion, it's going to be 16 billion. So if you have the new firm value, even though you're taking on like that new debt, that's going to add to the total value. So instead of 200 + 13 with the equity and debt, it's going to be 200 + 16. So it's going to be 216 is that new total value. And then your new weights are going to be um your equity is going to stay the same. Um it's going to be 0. Well, like the top is going to stay the same, but your weight is now going to be E over that new V, which is 216. Um so you're going to have 200 over 216. That's going to be 0.9259. And then the new debt is 16 over 216. And that new weight is going to be 0.0741. And then if you take those values and plug them into the weighted average cost of capital equation, your new post issuance um WACCC is going to be 11.12. The additional debt slightly lowers it, but not by very much, about a 0.1% difference. And then going into project specifics, um if you use the US content as a baseline, the international content carries extra risk premiums. And so you need to add extra BPS for assume 200 extra for FX volatality, political risk and regulatory uncertainty. And so that is going to be a new the US was the 11.21, but the international is going to be um 13.2. 21. And so now we're going to kind of do a sanity check and make sure that these make economic and industrial sense. And so Netflix's beta is high. And so an 11 to 12% cost of equity seems like appropriate. And then the big tripleB plus um debt at 5.8% is consistent with market capital market conditions. And the Netflix's 11% WACC is higher than the media industry average of about 8 to 10% and it aligns with streaming only risk um that they only have one business model and adding reasonable amounts of debt lowers the WACC because Netflix is underleveraged right now. Um and they have most of their value in equity instead of debt. And so that kind of checks out. And so based on these results, here are some strategic recommendations for Netflix. So first would be to gradually increase leverage and it only has about 6% of debt in its current capital structure. And based on the WACC movement, raising debt to 15 to 20% would reduce the WACC by 50 to 100 BTS without harming the credit rating. And then for um the project specific hurdle rates, you're going to use 11.2% 2% for US content and then 13 to 14% for international productions. And that's going to ensure that there's appropriate risk adjustments and greenlining decisions. If you want to improve the predictability of content return on investment, you Netflix could leverage machine learning for subscriber turn modeling, predictive models for completion rate rates or datadriven greenlighting algorithms. And that's going to reduce the beta and lower the cost of equity over time. It could also explore hybrid financing. So structure content financing, having convertible debt, and having library back credit facilities. Those are all going to lower overall financing costs. So thinking in like the big picture, um the WACC is definitely dynamic. It's not static and changes in the leverage shift or like the hurdle rate must be recalculated regularly to make sure that you're making current up-to-date decisions. And then content is definitely not uniform in risk. And so you have to think contextually about different projects in the US if they're domestic or if they're international. And then if you look at peers, we looked at different streaming platforms like Disney, Amazon. Disney's 8.2 2 WACC highlights the benefits of diversification and higher and it's like a still higher but very safe leverage and then um speaking of that technology is always central to future capital allocation you can integrate technology in a few different ways and so um some ways would be like an automated dashboard that keeps the WACC up to date you can use Python Excel or even like PowerBI or Tableau And you can build real time dashboards that pull treasury yields through API, market caps through financial data feeds and the data from rolling regression models. That's going to ensure dynamic WACCC updates and you can make those up-to-date decisions. Next, you can use machine learning models to predict subscriber reactions, forecast content profitability, and overall model those cash flows. Um, and then you can also have an automat automation of cap and input. So you can integrate the information from FRED or Fred API for risk-f free rate or Bloomberg or Capital IQ API for betas market and um indices for real time market risk premiums and this overall is going to reduce that clo human error and increase decision-m speed. So overall summary is that Netflix's current weighted average cost of capital is about 11.21 21 and adding 3 billion of debt should slightly lower it to 11.12 and in the US con content they should use an 11.2 two hurdle rate while you international should be priced closer to 13 to 14% since there's much higher risks in international markets. Um compared to peers, Netflix faces a higher cost of capital due to higher risk and lower leverage and most of their um equity is or I mean most of their capital structure is in equity instead of debt. The optimal strategy is to gradually increase leverage, use dis differentiated discount rates, leverage data technology for capital allocation and then continuously refine the cost of capital model. Uh thank you.",
  "video_url": "https://youtu.be/oSdDtDDxXtI?si=jIOe5UXmrdV8ksur"
}