{
  "student_name": "Kaawon Kim",
  "org_defined_id": "037356171",
  "username": "kim4574",
  "video_url": "https://youtu.be/KyHJvmsv3wM",
  "transcript": "Hi everyone, my name is Kan and this is my management 310 session 11 video assignment where I'll be using the driver framework in order to evaluate Apple's proposed $90 billion share repurchase. I'll be walking through the driver stages and today I decided to use Google Collab in order to um complete this assignment. I will have a Python notebook as my main tool and it's going to let me parametric meterize my buyback uh compare against alternative uses of cash and quantify how different stakeholders are affected. Uh it's going to retail stakeholders, institutional investors, management and employees with stock options and bond holders. So first I'll start with the divine define and discover stage under driver. Um so we're first going to define the problem. So, Apple has $165 billion in cash and investments, hundred billion in annual free cash flow, and $185 share price. The price to earnings ratio or PE of about 30 um is simply market price divided by earnings per share. So, it tells us how many dollars investors are willing to pay for $1 of earnings. And then it has a 15.5 billion shares outstanding and $110 billion of debt. The proposal is a $90 billion buyback over one year, which is roughly 10% of actual's market capitalization. And so the assignment is asking, does this buyback create value or uh relative to alternatives or does it mostly transfer value between the stakeholders? So by value creation, we mean increasing the total economic pie. Um the higher present value of future cash flows, better return on vested capital, and stronger long-term competitiveness. And by value transfer, we mean uh keeping the pie the same size, but rather shifting wealth from one group to another um from future bond holders to current equity holders without changing the size of the total pie. Um so the key choices for Apple are going to be approve the $90 billion buyback, pay a onetime special dividend, use the cash for strategic AI or VR acquisition, pay down debt, or increase R&D or research and development. So the main financial concepts that we are going to explore are capital structure which is a mix of debt and equity that a firm uses agency problems conflicts of interest between managers, shareholders, employees and creditors. Signaling how financial decisions like buybacks or dividends and info to the market about a management's private views of value and risk. Capital allocation discipline. How consistently a company directs its cash into the highest risk adjusted return projects. My goal of my analysis is to answer three questions. Uh does the $90 billion buyback improve the risk adjusted value of Apple and not just EPS or earnings per chair per share? How does it change incentives and outcomes for each major stakeholder group? And compared to dividends, acquisitions, debt reduction, and R&D, is the buyback the best use of marginal cash? So that's the define scap step. Um if I scroll to the data and assumptions section in the notebook, I enter the discover stage. So I collected and organized the um key or core inputs here. So we have the share this is pulling from um this is pulling from a CSV file with different data points about their financial health. And so we have things like their share price, the shares that are outstanding, the market cap roughly $2.9 trillion, free cash flow 100 billion per year, existing debt 110 billion, cash and marketable securities 165 billion and um ownership data. So, Birkshar Hathaway owns about 6%. The CEO holds 3 million shares. Retail investors hold on to the other um onto on the order of hundreds of shares each and employees have stock options with a $170 strike price. Um some um constraints and frictions is that Apple can't spend all 165 billion because it needs operating liquidity and flexibility for future downturns. Large buybacks can attract political and regulatory scrutiny as well. Options and RSUs means employees care and both share about price levels and volatility. Bond holders care about leverage and interest coverage ratios. And um in this stage I'm not coding quite yet, but rather building a um an understanding of the problem. So here the Python script is able to give a liquidity or overview market context balance sheet items um which is pulling from here the um the buyback objections objective special dividend as well as debt rejections and an overall strategic insight um given the different um metrics that it was given because it's integrated with AI it's able to calculate um fi the actual financial impacts and metrics that would um be used. So for each scenario it computes a new share account, earnings per share, leverage metrics such as the debt to equity and net debt to IBIDA, the ownership concentration especially for large uh holders like Birkshshire and management. um option moneyiness for employees meaning how far in or out of the money their options are given potential price changes. Um and then as for stakeholder outcome mapping the different payoff channels are for retail holders I care about their total return. Uh buybacks can lift earnings per share and under some assumptions even share price. Dividends give immediate cash but may be t taxed less favorably or more favorably uh depending on your jurisdiction. For intern institutional holders like Birkshshire, I care about ownership concentration and long-term compounding. They may prefer buybacks when the shares are undervalued because it increases their percentage ownership at no extra cost. As for management, I'm going to be focusing on EPS-based compensation. Buybacks can mathematically mechanically boost EPS even if total earnings stay flat, which is a classic agency issue. And then for employees with options, I track how the buyback could affect share price relative to their $170 strike. For bond holders, I track leverage and interest coverage. Levering up to um fund buybacks can transfer risk from to equity. So after um the Python code goes through the calculations, it's able to um input the whole model um use the models in order to um come up with these values that are easy to adjust if the data is updated. And so here they also not only have the financial and quantitative impacts of the buyback such as um half a billion repurchase shares, the new number of shares outstanding, but it also has the qualitative impact. And so there are different things that I said I would focus on. And so here there have ownership percentages. And so uh with the buyback the change is that retail investors um will see their ownership percentage increase if they hold on to their shares. Institutional holders like Birchar Hathaway which typically hold significant states may not participate in the buy buyback but they would also see proportional ownership increases. Um and then for a management they would also experience an ownership increase without necessarily acquiring more shares. Um they also have a qualitative impact on return on invested cap capital and then um the ownership percentages. And so um those are going to affect different parties that hold stock in different way. And so another thing that this notebook does is evaluate alternative uses of cash. And so we kind of talked about different alternatives that they use that they could use um instead of a buyback. it could issue a special dividend, strategic AI or VR acquisition, debt reduction and incremental R&D or research and development. And so if we kind of look at the different uses that it could it could um they could invest in these are the extracted alternative amounts that would be required. And then I also need it also is going to calculate the financial impact for each and making the necessary assumptions for each alternative. And so it's going to calculate that here. So if we have the special dividend, we have the new net income, the VR acquisition, debt reduction, and incremental R&D. So this is using those same values that we saw before but applying different formulas to them in order to um in order to to make those different calculations. So this is just a more in-depth and slightly more qualitative explanation on those different alternatives. So um they also have a summary comparison with a little chart here and the key observations is going to be that the AI/VR acquisition is going to show the most increase in earnings per share followed by incremental R&D and then the share buyback and the special dividend is going to have no direct impact on EPS. The leverage is going to be that the $90 billion buyback results in extremely high leverage due to negative shareholder equity indicating significant financial risk. Um and the AR acquisition is AI/VR acquisition also significantly increases leverage. Debt reduction while increasing leverage relative to baseline also reduces total liabilities which is a key difference. And then R&D leads to the lowest increase in leverage. Uh the acquisition has the highest calculated return on invested capital reflecting its potential to generate significant net income and the buybacks is theoretically higher but it comes with untenable financial structure in this model that it created. Some ways that you can um you can kind of test this model sanity for the validate stage is if you um if you set the buyback size to zero in this model, the model should revert to the baseline share and um baseline share count and EPS. And then if you allocate more than 165 billion, which is its maximum, it should flag an error or have a negative cash balance. And so um validation is essential because corporate finance models can be extremely precise and still completely wrong. And so this step ensures that the notebook reflects the core theories we use in capital structure and valuation not just math. And so they also have the different effect of those alternative decisions on different categories of stakeholders. So if we had a special defant, how would that impact our retail shareholders, our institutional investors, management, employees, bond holders? Um and then for the AI/VR acquisition on stakeholders and it gives you a full breakdown on those numeric but then also qualitative um qualitative impacts as well. And so um from a value creation versus value transfer perspective, if the stock is fairly valued at a um price equity of 30, a buyback is most likely a value transfer toward remaining shareholders and away from selling sh um shareholders. If management believes the intrinsic value is higher than 185 and the market is underpricing Apple, then repurchasing shares is like investing in its own undervalued stock. Um that can be similar to true value creation. Um that can be true value creation similar to a positive NPV project. And then um if you look at the opportunity cost, if you um if you deploy that $90 billion into ARVR projects that earn a sustainable return on invested capital above its cost of capital, that is a stronger long-term value creation than simply reducing share count. Um however, acquisitions carry integration risk and a history of overpaying. um and research and development may be wasted if it's not a truly disciplined. And so again, these have the analysis of the different decisions that you could use and how they would create value creation or value transfer. And so we see with the special dividend, it's a value transfer mechanism. The AI is value creation. and it's going to be a very it's a much more um it's a much more sustainable return on vested capital. And then um in the notebook he also show how net debt and IBIDA to IBIDA and interest coverage change if Apple uses the 90 billion for debt repayment instead of buybacks. And so it could be value transfer or value creation depending on the outcome. So yeah, um in the final reflect stage, I take a step back and um think about what it's really um think about like what do I actually recommend looking at this? And so, um, after looking at all of the different alternatives uses of cash along with the help of the notebook, I would personally recommend that um, oh, this is um, there it is. Based on what the notebook recommends and also what I've been learning throughout the semester, I would recommend that Apple divides its 90 billion capital allocation into combination of strategic AI/ AR acquisition, debt reduction, incremental research and development um over the repurchase. And so while a share repurchase offers immediate benefits to shareholders, the extreme leverage resulting in negative equity and infinite leverage ratio under the buyback scenario signals a significant financial risk and the alternatives balance present a more balanced and potentially more sustainable value creation opportunities for Apple. When we think about things like portfolios and we talk about diversifying and managing our risk, I think that also plays a role in how companies decide to use their money. And so by spreading it out towards these different initiatives, I think Apple can decrease their risk in um how they choose to allocate their funds. So yeah, that was my assignment. Thank you so much and I hope you have a good day."
}