{
  "student_name": "Tanmayi Sharat",
  "org_defined_id": "035964608",
  "username": "tsharat",
  "video_url": "https://youtu.be/43Ysi0VWfAA",
  "transcript": "For this project, I built an AI-powered variance explainer.\nThe goal is to take a basic budget versus actual table and automatically turn it into a clear, management-ready narrative using AI.\n\nInstead of manually writing variance explanations every month, this tool generates a first draft explanation that finance teams or managers can actually use.\n\nProblem Definition (DRIVER – D)\n\nThe problem I'm solving is that variance analysis is repetitive and time-consuming.\n\nFinance teams spend a lot of time:\n\ncalculating variances,\n\nsorting through what matters,\n\nand then writing explanations that often follow the same structure every month.\n\nThe numbers are easy to calculate, but explaining why something happened and what it means takes time. That's where AI fits well.\n\nApproach and Tools (DRIVER – R)\n\nMy approach was to separate responsibilities:\n\nPython and pandas handle all numeric logic\n\nStreamlit handles the interactive user interface\n\nAn AI language model handles explanation and narrative\n\nThe AI never calculates numbers.\nIt only explains results that were already calculated correctly in code.\n\nThat separation is intentional so the output stays accurate.\n\nWalkthrough: How the Tool Works (DRIVER – I)\n\nI'll walk through the app.\n\nAt the top, the app explains what it does and how to use it.\n\nFirst, the user uploads a CSV or Excel file that contains:\n\none label column, like Account or Department,\n\na Budget column,\n\nand an Actual column.\n\nAfter uploading the file, the user selects:\n\nwhich column is the label,\n\nwhich column represents Budget,\n\nand which column represents Actual.\n\nThe app then calculates:\n\nvariance value as Actual minus Budget,\n\nvariance percent as that difference divided by Budget.\n\nIt sorts the table by absolute variance percent, so the biggest drivers appear first.\n\nVariance Results and Validation\n\nBefore involving AI, the app clearly shows:\n\nthe full variance table,\n\nand the top positive and negative drivers calculated mathematically.\n\nPositive and negative variances are explicitly separated in Python, not by the AI.\nThis prevents the model from mislabeling results.\n\nIf the data is invalid, for example if there are not enough numeric columns, the app stops and shows a clear error message.\n\nTrend Analysis (Loop 3 Enhancement)\n\nIf the dataset includes a time or period column, such as Month or Quarter, the app adds trend analysis.\n\nIt:\n\ngroups Budget and Actual by period,\n\nrecalculates variance by period,\n\nand displays a line chart showing how Budget and Actual change over time.\n\nThis gives additional context beyond a single snapshot and allows the AI to comment on trends, not just one-time variances.\n\nAI Explanation Output\n\nOnce the calculations are complete, the user clicks Generate AI variance explanation.\n\nThe AI receives:\n\nthe top positive variances,\n\nthe top negative variances,\n\nand optionally a trend table if available.\n\nThe AI is instructed to output explanations in this order:\n\nExplanation of variance\n\nPositive variances\n\nNegative variances\n\nCFO summary\n\nAll explanations are written in bullet points for clarity.\n\nThe AI does not invent numbers or move items between categories.\nIt only explains what the system already calculated.\n\nValue and Validation (DRIVER – V)\n\nThis tool solves a real problem because:\n\nit reduces time spent writing repetitive explanations,\n\nit produces consistent, structured narratives,\n\nand it's usable by non-technical users.\n\nI tested it with multiple datasets, including multi-period data, and verified that the explanations always match the calculated results.\n\nExtensions and Scalability (DRIVER – E)\n\nThere are several ways this could scale:\n\nadding forecast versus actual comparisons,\n\ntracking cumulative variances over time,\n\nor exporting the AI explanation directly into a report or slide deck.\n\nThe structure already supports those extensions.\n\nReflection and Learning (DRIVER – R)\n\nThe hardest parts of this project were:\n\nlearning how Streamlit reruns scripts on every interaction,\n\nmanaging errors and edge cases cleanly,\n\nand prompt design to keep the AI grounded in the data.\n\nThe biggest takeaway is that AI is most effective when it's constrained.\nLet code handle logic and math, and let AI handle interpretation.\n\nClosing\n\nOverall, this project demonstrates that I can:\n\nbuild a working, interactive tool,\n\nintegrate AI responsibly,\nand solve a real finance problem in a practical way."
}