{
  "student_name": "Evan Sleeth",
  "org_defined_id": "038072973",
  "username": "esleeth",
  "email": "",
  "transcript": "Hey everyone, in this video I'm breaking down my WACC analysis for Netflix and explaining how their cost of capital affects a potential $5 billion content investment. I'll walk through the numbers, show how additional debt changes the risk profile, and compare Netflix to other major media companies like Disney and Amazon. Let's get into it. So we're looking at Netflix with a $200 billion market cap and about $13 billion in market-value debt. Their equity beta is 1.3, their bond yield is 5.8%, and they're taxed at 21%. The risk-free rate is 4.5%, and the market risk premium is 5.5%. The goal here is to estimate the current WACC and see what happens if Netflix takes on an additional $3 billion in debt to help fund a $5 billion content investment.To find the cost of equity, I use the CAPM formula: risk-free rate plus beta times the market risk premium. That gives Netflix a cost of equity of about 11.65%. This makes sense because a beta of 1.3 means Netflix's stock is riskier than the market, so equity investors want a higher return.Next, I use their BBB+ bond yield of 5.8% and adjust it for taxes. Because interest is tax-deductible, their after-tax cost of debt comes out to about 4.58%. That's relatively low, which is why Netflix often raises debt to finance content. Using the current capital structure — about 94% equity and 6% debt — Netflix's WACC comes out to roughly 11.2%. That basically represents the blended return that both debt and equity investors require. If Netflix adds another $3 billion in debt, its weight of debt increases and its weight of equity decreases. That slightly shifts the capital structure, lowering the WACC a bit because debt is cheaper than equity. But the trade-off is higher financial risk, which eventually increases both beta and debt costs if they borrow too much. Disney runs a 70/30 equity-to-debt mix and has an 8.2% WACC. Amazon's Prime Video uses Amazon's corporate WACC of 9.5%. Netflix is higher than both, sitting in the 11% range. This reinforces that Netflix is one of the riskier major media players and needs high returns on content investments to justify that risk. So overall, Netflix's WACC is around 11.2%, and additional debt would lower it slightly but increase leverage risk. Compared to Disney and Amazon, Netflix operates with a higher required return, which means its content investments have to generate more value to be considered worthwhile. That's the full breakdown of the WACC and how it ties into Netflix's strategic decision-making.",
  "video_url": "https://youtu.be/EN1RtUsJ5-o"
}