{
  "student_name": "Silas Bowman",
  "org_defined_id": "036111483",
  "username": "bowma177",
  "video_url": "https://youtu.be/aZO3E_TBeu8",
  "transcript": "All right. Hello, my name is Sas Bowman. This is the Purdue Finance Dashboard slash app. I'm a smart money dashboard built for college students who are juggling work, rent, subscriptions and school costs. I'll walk you through how it works, who it's for, and what I learned building so.\nSilas Cameron Bowman 0 minutes 21 seconds\nThis is a single page app with real functionality, not just mockups. At the top you can see my monthly income. This is editable. This is on its own app here, so this is editable. Go in, change this to 1800 and you know, let's say $200 savings tool.\nSilas Cameron Bowman 0 minutes 38 seconds\nInstantly updates here serves our savings goal. At top you can see month income, total spent so far, how much saved to spend and my savings goal. All these numbers are calculated from the data in the app. Next if we go down to the add transaction.\nSilas Cameron Bowman 0 minutes 54 seconds\nLet's say we went to Starbucks today, got $8.\nSilas Cameron Bowman 1 minute 1 second\nAuto populates food and dining and at expense that uploads here showcases in recent transactions. As soon as I hit add, you can see the total spent and safe to spend changes as well. So the total spend went up to 155. Safe to spend is 1200.\nSilas Cameron Bowman 1 minute 21 seconds\nAnd then this updates automatically. So when a new transaction comes up, it shows in the transactions list. Then additionally this also goes into the spending analysis.\nSilas Cameron Bowman 1 minute 37 seconds\nSo for the fixed bills and subscriptions tabs who are right here, this additionally is editable so I can change the amounts and add new ones as my situation changes and these roll into the monthly spending calculations.\nSilas Cameron Bowman 1 minute 55 seconds\nSo I go here to add bill bill name. Let's just say it's a new subscription. So I'm deciding I wanna use do ChatGPT right? So.\nSilas Cameron Bowman 2 minutes 8 seconds\nChatGPT $3 a month I think is the normal it's.\nSilas Cameron Bowman 2 minutes 16 seconds\nI bought it in the middle of the month because I need help on homework. So it's the 14th today, 14th of the month and it's a subscription, so add bill.\nSilas Cameron Bowman 2 minutes 36 seconds\nAll right, add bill and then that goes into the bottom right here. So as you can see, it also showcases, all right, you need to pay this soon. That's super easy and awesome to look at. Like, all right, I put input all of my information, everything I'm paying for and.\nSilas Cameron Bowman 2 minutes 56 seconds\nAnd it tells me this is due soon. This was due on the 10th, due on the 5th, due on the 1st, etc. Splitting this with roommates. Super awesome to look at and super easy to look at. So now if we go past this and go down to the.\nSilas Cameron Bowman 3 minutes 12 seconds\nSpending analysis chart showcases by category what our spend is and how it's used and then overtime what the daily spend looks like and then you can see what the weekly spend looks like obviously since.\nSilas Cameron Bowman 3 minutes 28 seconds\nUm.\nSilas Cameron Bowman 3 minutes 29 seconds\nI've only done today. This is what it's gonna look like, but and then what else? So on the right here is also an AI financial coach. So I can go in and say how am I?\nSilas Cameron Bowman 3 minutes 45 seconds\nDoing this month, I spelled that wrong, but you're doing great this month with a monthly income of 1800, only spending 155 so far. You're well below your budget, allowing you to comfortably meet your savings goal of 200. So that's awesome. It tells you exactly what your savings goal is, obviously, since I just started.\nSilas Cameron Bowman 4 minutes 4 seconds\nUm, the rent isn't shown yet just because I haven't paid the rent yet 'cause I made this earlier, but this showcases everything that you need to do and updates automatically when you need to do it. Um, also, there's something really cool that.\nSilas Cameron Bowman 4 minutes 20 seconds\nI liked here that was input that I worked on is a what if lab your hourly rage. So what the hourly rage looks like and then extra hours per week and then what does canceling subscriptions look like? So if we cancel Spotify.\nSilas Cameron Bowman 4 minutes 37 seconds\nIt shows the total impact per month, and it also shows the total impact per year that you can be saving if you're canceling these subscriptions. So this adds up. It's super nice to see.\nSilas Cameron Bowman 4 minutes 52 seconds\nThe clear use case is really just college students that I felt this is something I need. I pay for everything in college and sometimes it gets tough when I want to go out and hang out with friends, but I don't know how much money I should be spending and how much I owe. So it's really for students who are part time, full time, have to manage rent, subscriptions, food, social spendings without a lot of time.\nSilas Cameron Bowman 5 minutes 12 seconds\nOr financial knowledge. I've already showed this to a couple friends of my fraternity. They liked it. It's all on one page. It separates fixed bills from everyday spending and that it tells them a simple number. So how much is safe to spend or invest this month? They specifically asked for an easier way to see how extra work hours are cutting subscriptions.\nSilas Cameron Bowman 5 minutes 31 seconds\nWould change their budget, so I input that as well. So that's what the Whatif lab really does for. This app is fully functional end to end. I can add, edit bills, log transactions, see charts, update, talk to the AI coach in one continuous flow. It's currently running inside base 44 as a working app and I could easily deploy it.\nSilas Cameron Bowman 5 minutes 51 seconds\nTo the web if I wanted a public link. Building this has really taught me a lot. Hardest parts were getting all the cards to stay In Sync with one source of truth so they don't show stale data. When I first doing it was creating iterations. It would just keep old data in there and they just wouldn't update the new data.\nSilas Cameron Bowman 6 minutes 11 seconds\nAlso making the layout feel clean and less cluttered. Working with this, it was difficult because at first it was just a full page and you had to scroll, scroll, scroll forever. So working to get these cards looking amazing and usable was also hard.\nSilas Cameron Bowman 6 minutes 27 seconds\nAnd then wearing the AI so it reacts to the real data instead of just answering generically was important too. I'd say if I had more time and had a full semester work on this, I'd add authentication so each student can have their own secure profile. Let's users see multiple savings goal like a spring break or emergency fund.\nSilas Cameron Bowman 6 minutes 45 seconds\nUm, adding like a whole nother section to that. Um, and maybe work on like strengthening the AI coach and putting a true um.\nSilas Cameron Bowman 6 minutes 57 seconds\nLike detailed program in there. It obviously gives recommendations, but I'd be interested to see what else I can do. So yeah, that's my final project. Thanks for watching.\nSilas Cameron Bowman 7 minutes 13 secondsHope you enjoyed and this is a ready to use app."
}