{
  "student_name": "Alexander Emenhiser",
  "org_defined_id": "035713425",
  "username": "aemenhi",
  "video_url": "https://youtu.be/mDBY2FXruNw",
  "transcript": "Hello, my name is Alexander Emenhiser and this is my video for the capstone project or I guess technically session 13. Um, today is Monday, December 8th, and I am in the 10:30 section of management through 10, and I am really, really excited to be able to talk about this today. Um, because this is finally the time where I'm kind of able to sort of come up with my own thing. We've done a couple of mini projects before this that have allowed me to kind of explore building different sort of finance things to help people. Uh but this is where it all comes together and I get to build something uh pretty unique, pretty big um to solve some sort of problem that people are having. And throughout this video uh I plan to obviously uh use the driver framework of learning like we've talked about so much in class this semester and go through kind of what I built. So the problem or the driver uh define stage uh as we can see here is um you know what's the problem that I'm having. So when trying to come up with something to do um one of the first things that I thought about was how much trouble people my age have budgeting. um especially uh at this age uh we have so many finances with student loans and everything else that it can be a real hassle and even in clubs I'm a treasure of actually two different clubs here at Purdue and uh budgeting is uh become something that has been pretty uh dominant in my life takes over a lot of time um and a lot of effort and it I think it can be streamlined mind a lot easier. So, I wanted to create something that sort of gives an overall view um of your finances. So essentially all you have to do is sort of um put in all of the data points and then based off of you know the data points that you have and the different categories uh my project would um kind of analyze it and give you a suggestion. So, I had this idea and I really thought it could be a good thing to use, but I kind of struggled with, you know, where I could go to make something like this. Uh I initially was going to do something where I was going to create a new G GPT model um within Open AI but then I realized that uh I had to pay you know a bunch of feed for that and it really just it wasn't going to work out. So the next best option was that I went to Replet and I had already used the site earlier in the semester for mini project one. Um and I was really proud of uh how everything was going to come together. So I thought that this would be a perfect place to go to um for that. So I was able to kind of use the assistance of AI to sort of uh generate all the necessary background code um for the work that I wanted to do and then I was able to kind of uh adjust it accordingly and then put it into the replet system and then it would be able to kind of compile all of that stuff together um neatly into the thing I'm going to be going through later. Uh there were a few issues that I ran into. The first was um I ran out of my free trial on Replet uh because of the rule of 72 calculator. So I didn't end up buying uh sort of more premium version of that. Um which was able to solve a lot of those issues. And then another issue was I needed an API key. So you can't see it fully here which is good. Um, but I was able to uh with the assistance of AI find a site that would uh be able to give me an API key for free uh because I didn't want to pay anything more than I already had for this project. And I found this website and it was able to generate me a free API key and then I was able to um put that into my replet project and it was able to produce an output for me um that was valid. So that was really good and really satisfying to uh go through all those hurdles because it is uh challenging. I think that's the most challenging part um of a project like this is getting through all the I guess sort of like financial hurdles or technical hurdles. and it allowed me to really focus on the actual product uh that I wanted to produce and not get frustrated um with you know not having authorization or something like that. So now that I've sort of talked about sort of what I want to do build and you know why I think it's so so important and then also talked about uh the uh our stage of the driver framework the represent and the next stage is going to be implement. So, we're going to go here. This is my project that I was able to create. This is a student organization budget analyzer. And essentially what you do is you take, you know, you can have, as you see here, a PDF file or an Excel file, which is going to be the main two um that contains uh all of the stuff from your budget. And then, uh you're going to be able to drop the file in here. And based off of the data that you put into the file, um this uh will give you sort of an overview of your of your budget and you know where you can improve and stuff like that. So since the implement stage is to build, break, fix, repeat, I already about the uh challenges that I had with it, but now we can finally see our output here. And I actually have a Excel file here that I was able to kind of put together. I mean, it's just, you know, basic stuff where, you know, was, you know, expenses, income, um, not nothing real, but just something that sort of allowed uh, the project that I'm working on to sort of analyze it and give me some data points on it. So, we can see here uh, all of the data that we have here. And then so now I'm going to take that data, that Excel file. I'm going to drop it here and then we're going to analyze our budget. And this should Yes. Perfect. So this gives us an overview, which is really cool. Um I I guess I didn't realize that something like this could be created. um so easily. Uh this would have been really helpful to have uh earlier in the semester when I was doing a lot of the budgeting uh for a lot of my clubs. But um uh this gives me, you know, the summary here of everything. Uh it gives me some of my risks that I have. So overspending risk, insufficient reserve for emergencies is really high. uh high expense and events categories, medium bank fees, low risk, it has some cost recommendations here, which is really interesting. Um it has our projected surplus/ deficit because here we're working in a deficit. Uh it has our spending by category here. Um, and then I guess you may not be able to see fully, uh, but it has a graph here that represents our income and expenses. And we see at least from this little mock that I did here, our expenses are a lot higher than our income. But this was really, really uh, easy to make. And I mean, all I had to do was put these numbers in an Excel file. Um, a lot of the work with budgeting is doing the analysis and figuring out, you know, what you need to do. I mean, this is the stuff that, you know, you put in the Excel file, you don't have to think about at all. So, having a tool like this, I think, is really, really valuable. So, you know, that goes to our validate stage. Does this solve the problem? And yes, I think it does. Uh the issue that I wanted to fix was um students especially or just people my age don't really know how to budget or they don't know where to allocate their stuff efficiency. I mean they know how to look at uh listed numbers and add and subtract them. They they don't understand what that means or where everything's coming from. And our analysis here does everything like that. I mean it gives us cost recommendations which is huge. Um so you know I think this is really valid. Um I had one of my partners um from class John Gasho actually use this um template. he's in a fraternity and so he was able to uh here in the past couple days uh sort of input their uh fraternity budget into the uh framework here that I created and it was able to give them some recommendations on what they could do better. So, you know, this is something that uh I've had people use and I think it's something that I would want to be published and I actually might publish it uh because it's pretty cool. So now the next question is I guess to evolve and we have here uh some cost recommendations uh which is helpful but uh I guess the next step would be uh sort of figuring out a way to make this sort of explain how to do that because at least in the recommendation stage um it's telling you what it is uh but it isn't really telling you how. So I think the how question is something that uh knowing would be very valuable moving forward and if I were to evolve this project further um I think that's where I would have my next steps go towards. Um but regardless I think this is very very valuable but moving moving forward I think the how would ultimately u be the the biggest thing. So\nuh let me see here um does it work? Yes it does. Uh anyone care? I mean, I had my partner in the class use it and he uh thought it was thought it was valuable. Um, I was able to learn how to use AI APIs or yeah, and so going into this class, I didn't really understand all of that. Um, but this project allowed me to sort of think outside the box and sort of create my own thing. Um so now you know answering all those questions and demonstrating uh how effective uh this uh budget analyzer is um leads me to my final talking point uh of the semester which is what did I learn about uh building with AI? And I got to say going into this class, uh, I was a little nervous. Um, when I first heard about all the coding and all the AI usage that would be done, um, going in. I had didn't really have uh, a whole lot of experience with um, sort of technical work. Uh, I am an actuary which does have a lot of technical work involved with it. Taking this class was very valuable. Um, but I had done a lot of the math. So, a lot of that math was done by hand and so I haven't really thought about how I'd be able to apply that uh to AI or anything like that. So a lot of the material that we talked about in this class this semester I was already familiar with but I hadn't thought about it in a technical aspect and you with building with AI not only for this session but the whole year um I was able to learn you know it's really easy to use and it is really valuable and something that is truly going to change the world moving forward and my generations had a great sort crossroads where we were able to go to school without AI and now we're in school with AI. So seeing sort of the differences um is very very eye opening. Um so I'm definitely excited and I've definitely been able to take a lot out of this class that I will continue to use uh in my future career moving forward. Um, so I have had a great time building all of these sessions. This was definitely my favorite. I'm I'm was really excited to sort of use my creative freedom and solve a problem that not only myself, but a lot of people my age have been having. Um, and this is definitely something that I think I'm going to use moving forward. Um, I just got elected to, well, I talked about it, but I just got elected to be a treasure of another club here at Purdue, and this one is a lot more intense, and there's a lot more budgeting involved. So, having something like this to sort of do all of that grunt work, uh, analyzation will be really helpful, especially as, uh, a student full-time. um that'll kind of take some of the time away that I'd have to spend uh analyzing the budget. So, I hope that you found uh this budget analyzer as valuable as I am. I have and I had a great time building it and I've had a great experience in this class uh this semester and I look forward to connecting again soon. Thank you."
}