{
  "student_name": "Sam Eichstadt",
  "org_defined_id": "035801901",
  "username": "seichsta",
  "video_url": "https://youtu.be/OtpGqVHA5b0",
  "transcript": "Hello my name is Sam Eichstedt and this is my session 11 assignment.\nSession 11 assignment.\nSo for this we were tasked with to evaluate Apple's hypothetical 90 dot $90 billion share repurchase using the driver method as an active independent analysis who must determine whether the buyback creates value relative to alternative uses of cash while balancing stakeholder incentives.\nJust a little oversight on the capital allocated allocation snapshot. We have a liquidity of $165 billion in cash and investments, $100 billion in an annual cash free flow, free cash flow, sorry.\nSome market context $185 share price.\nP/E ratio of 30, dividend yield of .5% and 15.5 billion outstanding shares. The balance sheet has $110 billion of debt. Berkshire Hathaway owns 6% of the company. CEO holds 3 million shares.\nRetail investors average 100 shares and employees have $170.00 strike options.\nSo our proposal is the $90 billion buyback executed over one year. This $90 billion is roughly 10% of the market cap.\nAlternatives, $6 special dividend, strategic AI slash VR acquisition, debt reduction and incremental or research and development. So we were tasked with delivering a recommendation that explains stakeholder impacts, agency considerations and value creation versus trader or value.\nTransferred outcomes.\nSo for my driver framework I came up with the following so.\nDefining the decision, the DEO Driver is Apple is considering deploying $90 billion of cash towards a share repurchase and we must determine whether executing this buyback creates greater stakeholder value than alternative capital uses such as dividends, AI slash VR acquisition.\nDebt reduction or incremental research and development while accounting for agency issues, value transfers and stakeholder incentives.\nSo reviewing our facts, like I stated earlier, we have $165 billion of cash in cash investments, $100 billion in annual free cash flow, $110 billion in debt, stock price, 185 profit or P/E ratio of 30, blah blah blah.\nWe just talked about all this. So identifying stakeholder incentives, CEO is 3 million, 3 million shares. He benefits from earning per earning per share accretion and share price support. Buybacks can offset dilution from stock-based compensation, so.\nYeah, that'd be good for management. For the employees, they have the stock options at $170.00 instead of the 185 stock price. It supports kind of them buying it because they get a discount, pretty much making money.\nLong term value from research and development and strategic innovation also affects job stability and growth prospects. So that's bad for employees because their job's less stable and it's harder to grow in the company.\nSo institutional investors, people like Berkshire, BlackRock, Vanguard, all those big, big, big companies with trillions of dollars to invest. Those are what our institutional investors are. In this case, it's Berkshire Hathaway.\nPretty much people with a ton of money that invest in the companies and hope for a great return. So these institutional investors prefer to be disciplined in order to get or they prefer disciplined capital returns. Buybacks can be tax efficient versus dividends.\nSo that's why they'd rather have the capital returns. They may prefer undervalued purchases. P of 30 suggests limited undervaluation. Retail investors are just your normal investor.\nBenefit from share price support. Some may prefer dividends for liquidity, so they know they're getting that money. They know that's like pretty much a guarantee based off of the past. So the value creation assessment, the V driver is the buyback value creation. The positives earning per share increases and share count falls mechanically.\nBoosts valuation metrics, signaling effect, strong confidence in cash flow durability, tax efficient returns versus dividends, yada, yada, yada. Some of the concerns the stock be may be fully or overvalued with a P/E ratio of 30.\n30 P/E ratio is the price over the earnings, so repurchasing at high multiples destroy value and that's the P/E ratio of 30 is pretty high. That's why it's signaling that it may be overvalued.\nSo some of the risks repurchasing at elevated valuation could impair long-term shareholder value. This reduces liquidity buffer in a volatile macro slash AI arms race environment. Strategic risks under investment in AI, so it should be our could weaken Apple's competitive trajectory.\nLarge buyback could signal limited growth opportunities affecting perception. So how people see them. Agency risk CEOs equity incentive may be biased towards buyback that boosts EPS in the short term. This is because the CEO has 3 million shares.\nAnd if the earnings per share goes up, his earnings per single per one of the $3,000,000 shares go up. So he'll be making a lot of money and that's why it introduces this bias towards the buyback. So yeah, we'll get into my recommendation in a minute.\nFirst, I wanted to go over my use of Colab and A I. So I went in and I asked A I to do a complete analysis over this $90 billion buyback.\nSo things I asked it to kind of answer was to quantify that stakeholder outcomes, compare buyback versus dividend acquisition, debt pay down, research and development, flag value creation versus value transfer.\nAnd give me signaling such perception notes in a structured way. So I took this and I'm told it to make me a massive Python code, which you can see here it did. I copied all this into Colab and click run here.\nAnd you can see this code gives me this output. So base case share price $185 shares outstanding 50.5 or 15.5 billion market cap is 2 point.\n867 trillion dollars earning per share $6.17 cents net income 95.6 billion debt 110 billion and D divided by equity of .04 so.\nUm, here we have.\nEarnings per share price in leverage by scenario. The baseline of shares outstanding is 15.5 billion with EPS 6.167. So that's what we know.\nAfter the buyback there will be 15.014 billion shares outstanding with the earnings per share of 6.366 over that 6.167. We can also see the price goes up around $6 from the buyback to the original.\nOn.\nAnd then that's the first case is the buyback. Second case is the special dividend. So the shares outstanding would still be 15.5 billion. The price would be 1.66.167. Yep, so that wouldn't do much debt reduction.\nStill have here the price would increase, earnings per share would increase, same shares outstanding, but less debt.\nAI slash VR acquisition, we can see here the only thing that increases is earnings per share and the price of the stock. So we can see that would kind of be a bias towards the CEO as well. And then finally incremental research and development.\nThe things that increase here are earnings per share by a little bit. The price would actually increase by $3 instead of that nine that was before. And then, yeah, so next.\nSo here's what would happen with the stakeholder wealth by scenario, assuming no shares sold. So Berkshire with 6%, the baseline wealth is 172,000 million. That's 172 billion, I believe.\nRight. Yeah. Um.\nSo CEO has $555 million in shares. Buyback would make them a little bit more by around 20 million.\nSo the dividend wealth in millions is 556 million. Retailer investors would have little to no increase. So it really benefits the people with a lot of shares like the CEO in Berkshire and the other institutional investors.\nOK, employee option intrinsic value per option. Baseline has a value of $15.00, buyback has a value of $21.00, special dividend of $15.00, debt reduction of 17.63, an error slash VR acquisition of 22.742.\n742 and an incremental research and development cost of 18.871.\nValue creation, diagnostics, buyback, trading above intrinsic value estimate. Premium versus intrinsic is 8.8%. Heuristic verdict is of how you transferring slash destroying. So we don't think this is really how you creating. This is more just transferring the value to somewhere else.\nSo that's that's for the buyback. We think the buyback is value destroying slash transferring. The A I slash VR acquisition return on invested capital is 10% versus a lack of 8%. So with the return on invested capital is 10 versus the cost of eight, this is value creating.\nSo we're making pretty much 2% incremental. Incremental R R&D has a 20% return on invested capital versus a whack of 8%. This is value creating. We're making 12%. This is actually a great answer.\nOK. So we'll get back to the qualitative notes. So I I divided these into three different steps, signaling, perception and governance, signaling for the buyback signals confident in cash flows at a high P/E maybe.\nMay be read as a lack of growth opportunities. Agency such governance management employees with options benefit from near term EPS, accretion and price support. Long term discipline at a premium to intrinsic value can be criticized as poor capital allocation.\nSo people could think we don't know how to allocate our capital properly. So we're just buying back a bunch of shares. The special dividend, this signals excess cash plus willingness to return capital can be seen as less commitment than permanently higher regular dividend.\nAgency source governance. Less scope for management to invest poorly, but no strategic upside to this dividend. Long term discipline. Neutral one-off return doesn't really matter. OK, debt reduction. This signals conservative stance.\nPrioritizing balance sheet and resilience for the agency and governance. This improves bondholder safety. Maybe unnecessary debt is cheap and well covered, so this might not be a great option for the acquisition AI such VR. This signals strategic commitment to the next generation platforms and growth like AI is an up and coming thing, so it.\nIt's like, hey, maybe they're trying to grow agency and governance, execution and integration risk. This can create or destroy value depending on the discipline. So we don't really know what's gonna happen. So it's obviously a risk is pretty much what that's saying.\nIf return on invested capital is greater than WACC, this is strongly value creating and shows a growth mindset for the company. Lastly, we have the incremental research and development. This signals a focus on innovation and product and the product roadmap. So this this tells everybody, hey, we're looking at the future, we're getting ready to research this stuff and kind of come up with new things.\nAnd like it said, innovate. And yeah, so for the agency and governance, it's harder to measure risk of waste, but also the core of Apple's note. Like we all know, Apple's a very innovative company. They come out with something new every single year. So yeah.\nThe long term discipline historically strong for Apple and it supports long term cash flow ecosystem.\nOK. So with all of that, we'll go back to the recommendation. So the recommendation I came up with this was to ask you a scaled down buyback combined with a strategic reinvestment, $90 billion is way too large given a high valuation and strategic opportunities.\nRepurchasing at a price earnings ratio of 30 limits value creation and destroys long-term shareholder value. Reallocate capital towards strategic AI, slash VR and research and development. Those things both had a higher return on invested capital than weighted average cost of capital.\nMaintain financial flexibility and balance stakeholder incentives. So this is a proposed mix, 40 to $50.40 to $50 billion buyback, 20 to $30 billion strategic AI such VR acquisition budget and 10 to $15 billion of incremental research and development, minimal dividend or debt reduction.\nHas really low impact and one off dividend isn't gonna make anybody say, Oh well, let's go buy this stock and so yeah."
}