{
  "student_name": "Jacob Youngworth",
  "org_defined_id": "035845246",
  "username": "jyoungwo",
  "email": "",
  "transcript": "Hi everybody and welcome to my session 10 assignment which covers capital budgeting. Um obviously we're going to be using the driver framework in order to solve this problem and to work through our analysis. Um so we're going to be looking at the cost of capital analysis for a Starbucks's proposed flagship roaster. I'm requiring a $12 million upfront outlay um that's expected to operate for a total period of 10 years using their 8 12% weighted average cost of capital as the hurdle rate. We're going to get into the parameters and everything like that using the driver framework to solve our problem. So first we're going to jump right into the first stage which is define and discover. Really just to look at what do we understand right now? What are our known parameters and what do we need to be figuring out. So our general objective for this problem is to evaluate the $12 million 10-yearong Starbucks flagship roastery project and determine if there is economic value that is created. If there is economic value created, that's a good thing. That's a positive. If there's not, then um this project, this um cash flow thing would not be beneficial. And we're going to look at the weighted average cost of capital at 8 and a half% as well as net present value to kind of understand does this make a little bit of sense. So let's jump a little bit into some known parameters that we have. We calculated and we collected all of these from the stem of the problem given on the textbook. So the first is the initial investment. We know there's a total cash outflow of actually $12.5 million in year 0. It's $12 million of building equipment and training which is depreciated straight line over 10 years. But there's also that $500,000 in working capital which is deployed at launch and then actually only recovered in year 10 nearing the end. The time and rate so this total project length is 10 years and our discount rate for our rated average cost of capital is that 8 12%. A little bit into tax and terminal value. the corporate tax rate is given at 25% and then that terminal value is $3 million and that's the amount of money that's gotten back at the end of year 10. And then in regards to depreciation, this is going to be a straight line depreciation problem over 10 years. Um, which pretty much results in a tax shielding expense of about $1.2 million annually. It's that 12 million divided by that period of 10 years. Now, here are our revenue assumptions down at the bottom. starts off um pretty basic, $8 million of revenue in year 1. And then it skyrockets for the next few years. From years 2 to 5, it's going to be $11 million over those years. And then it slows down just a little bit over the last few years between 6 and 10 going at $9 million a year. Then we have two different types of costs that are always looking that we're always looking at in a problem. The first are variable costs um which change. Variable costs are your cost of goods sold in this problem and that is 40% of your gross revenue. So it's going to change based on your revenue per year. Then your fixed costs don't change every single year. That's your labor, your rent, your utilities, your marketing, etc. Those are given up here in the stem of the problem. And we're going to look at two different metrics throughout this problem. We're going to look at the net present value as well as the internal rate of return. Um for net present value, we're going to look at to see is the project going to make money. Is the net present value of the project over $0? And if so, we're going to accept the project. Same thing looking a little bit at internal rate of return. We're going to look at it if it exceeds the weighted average cost of capital of 8.5% that was given in the stem of the problem. We're also going to look at profitability indexes as well as payback periods when we are solving our problem. Now, let's move a little bit into the representation side of things where we're kind of going to build out exactly what we're going to be talking about throughout this project and how we're going to be solving it. I built out a flowchart right at the top right here to kind of show the analysis throughout the project. So, we're right here in the represent stage. We're going to get into Google Collab in just a few minutes. But the biggest thing with this part is looking a little bit into the necessary financial formulas that we're going to be using throughout this problem. So the first one right over here is the total incremental free cash fl free cash flow equation, which is your total sum of cash flows per year. So your total free cash flows is equal to your operating cash flows multiplied by that ch or minus that change in your net working capital minus that net change in whatever right over there. So that all works together to kind of understand how much actual cash is generated per year for this specific project. So it helps us to look at it. Does it make sense in a total standpoint? We're going to look at it over that 10-year period and if it's positive, it works out. Operating cash flows is really what we're going to be looking at throughout this project. It's your really your revenue and how much money you're making throughout this project. It's your cash generated from your operations. So right here, your earnings before taxes multiplied by that corporate tax rate, which right here is going to be 25%. And then adding in that depreciation shield of $1.2 million per year that we use throughout this problem. And then right over here, we have net present value as well as the internal rate of return. Those are both very important to look at um when comparing it to weighted average cost of capital and everything in regards to that. So that's a little bit behind the scenes of what we're going to get into. Now let's jump right into the implementation side of things as well as the next few stages which we're going to be done in Google Collab. So we're going to go right over to here. So we built our model out. We ran it through Python. So now we're going to look a little bit at the results that came out that came from this specific problem. First of all, we always want to import our necessary data analysis software as well as anything that we need in order to solve the problem and then comment it throughout the way so that we know what's going on. The first thing and the most important thing that we built out throughout this case was the base cash flow model as a chart. This is the incremental cash flow schedule. It's really the heart of our analysis. It's really what we're going to use to show the inflow and outflow over every 10-year period of this roaster. So, we're going to start right over here. actually at year zero, not even during that period. You can see right over here a total outflow of $12.5 million. That's that $12 million initial investment as well as that $500,000 working capital that we're going to get back at the end at the end of those 10 years. The goal of this project is to see can we make back that $12.5 million over that 10-year period of time. And it's actually really interesting because to interpret this chart just a little bit better, I built another chart right here which shows some red and some green visualizations. You can see right over here it's split up kind of into three phases. It kind of goes in a curve just like that. Your first phase over here on the left in year zero is your initial investment. You're paying $12.5 million. It's going all the way in the negatives. You're losing a lot of money in that. But that simply just represents the hurdle the project must overcome. Your future returns must equal or be more than this $12.5 million to make this project make just a little bit more sense. Then let's look into your high operating returns. Here's year 1 through year 5. Year 1 starts positive at $1.2 million in revenue. While revenue is a or in profit, while revenue is just a little bit lower, we actually see benefit because our earnings before income taxes was actually zero. We didn't pay any corporate taxes. That's just kind of the way that the situation worked with everything going on. So, we maximize the cash flow that we get from operations in this case. Um, and then years 2 through 5 are our peak operating period. Our free cash flows jump up to $2.7 million. It demonstrates the efficiency and the success of the initial flagship launch, attracting customers and high volume sales. It's also because our revenues during those years are a little bit higher and our fixed costs are always the same. Your fixed costs are going to be the same no matter your revenues, which is very important to look at. And then it drops down just a little bit between years 6 and 9 down over here. Stabilizes at about $1.8 million here. Your revenue is going to drop, but your cash flows are still positive, which is a very important thing to look at. The most important thing is right over here. It's year 10 over here. It's $5.3 million in positive cash flows. It's boosted by two different events that are actually not operating related. It's the $3 million terminal value gotten at the end which kind of represents the salvage value or the sale price of our assets. Maybe we were to sell our land or sell our equipment in that building and also that $500,000 recovery of the initial working capital which is always important to look at. So down here we also summarized our key metrics that we're going to be looking at throughout this stage that are going to be used to help drive the rest of the analysis in the problem. The first one, the most important one is net present value. So simply it's the current dollar amount of value that the project is adding to the company. We want it to be more than zero. Right here it's 3.02 million. That's a positive number. That's a great thing. So we're going to accept this proposal in the case of net present value because it's going to be making that money. The next one is internal rate of return. Right here is says it's 13.25%. Your internal rate of return simply put is the discount rate that makes the project's net present value exactly zero. And in the stem of the problem, it gives us 8 12% as that benchmark value. Because that 13.25% number is larger than that 8 12%, we're going to accept this project proposal as well, just correlating with that net present value. We have a few other metrics down here as well, specifically profitability index and our discounted payback period. Profitability index, which says it's 1.24, simply tells us for every dollar how that we invest, how much money we're going to get back in terms of present value. If you put a dollar in today, you're going to make $1.24, which is great. And then also discounted payback period is 8.21 years. Our overall period is 10 years. So this is saying that you'll make your money back in that 8.21 years, which is shorter than the project life. That's a great thing as well. Since we know the net present value and internal rate of return match based on the scenario, we can move on to the validation side of things where we're going to understand and make sure that this data that we calculated is actually correct. So we brought it all right down here. I actually brought down all of the metrics one more time just to make a little bit more sense. Really, this validation stage is a simple stage. It's to verify all of the cash flows within this model to ensure that they actually make sense mathematically and do a little bit of math behind the scenes. So, we're going to look at the incremental cash flow schedule first. It correctly accounts that $12 million investment as well as that f $500,000 net working capital deployment resulting in that expected outflow of the negative $12.5 million in that zero. Your depreciation does work out because $12 million divided by 10 is that $1.2 million. And in year 1 as well, your earnings before income taxes is zero. This all works out. And then looking all the way in the end, that terminal cash flow is right over there at 10 million. Year 10, our final cash flow is of $5.3 million. It works out with that operating cash flow of 1.8, that $500,000 from the net working capital, and then that $3 million terminal value. That all adds up correctly and makes just a little bit more sense. Our net present values and internal rate of returns also match up perfectly. Just looking a little bit more in the math math side of things, as well as that discounted payback period and everything like that. So now that we've calculated and ensured that all of our data is correct and our values are correct, let's look a little bit more into the evolution of this problem. Maybe if scenarios are not always how we look, maybe a little bit of sensitivity analysis as well. So we're going to scroll down. We broke it down into a total of four different scenarios that we're going to look at. Our goal of the evolve stage is to kind of help build out our recommendations and synthesize the results of each of these scenarios. based on all of the data to kind of help create a risk mitigated a risk understanding recommendation for Starbucks to kind of see how they can move forward. So the first one is to look at that base case that weighted average cost of capital at 8 12% that's what we calculated in the start pace what we did throughout the implementation side of things net present value is 3.02 your internal rate of return 3 13.1 13.25% right over here 1.24 8.21 21 years. We're going to accept this decision. That's a great thing. We're going to use that as a baseline for this scenario. Our next scenario is the weighted average cost of capital changing. We're going to look if the weighted average cost of capital goes up by 2% as well as when it goes down by 2%. So when it goes up by 2% up to 10 12% when weighted average cost of capital increases the discount factor increases which means that the present value of future cash flows is lower. It reduces our net present value, but actually in this case, our profitability is still strong enough. We're still making enough money where it makes sense to continue on with that project proposal because even when you increase that weighted average cost of capital, your net present value is still 1.63, which is greater than zero. Your internal rate of return actually doesn't change, which is something interesting to look at because it's based directly off not the weighted average cost of capital and that number, but other calculations and values. your profitability index drops just a little bit, but it makes sense just because you're not going to be making enough money, but still accept this proposal. When it drops, it's even better. Your net present value goes up from 3 million to almost $4.7 million. Your profitability index increases as well. We're going to continue to accept this decision. The project really is highly resilient to market fluctuations and changes in cost of financing, so it's stable and something you always want to look at when making decisions. The issue with this looks at a revenue decrease. So we look at a revenue decrease of about 20%. Which isn't which isn't super which isn't super possible which isn't going to happen very often. But maybe in a situation like COVID or another economic downturn revenues could drop by this value. And let's say this scenario is done in this time your net present value plummets all the way down to negative $2.75 million. So, you're going to be losing $2.75 million on top of that initial investment that you're putting in. When revenue decreases, cash flow is impacted because your gross profit is decreasing as well as your earnings before tax, which actually limits your tax deductions and by result actually lowers your operating cash flows. So, it's very important to look at this from a different side of things. Your internal rate of return is only 3.8% less than that.5%. You can see right here the decision over here is to reject because you're not going to be making the money. You can see right here it's a big red bar into the negatives. You do not want this to happen. We're going to use that to help synthesize our recommendations and build out a full reflection. So while we're looking at this out, we kind of want to understand how we're going to accept this decision. And our recommendation and my recommendation for this is to kind of go with a conditional acceptance. What does a conditional acceptance mean? kind of means to look at the overall project to look at the state of the market to look at the state of the economy and except based on specific circumstances only accept if certain things are hit. The investment should only proceed if strict risk mitigation strategies are in place to ensure that nothing like a revenue drop actually decreases your net present value and pushes it into the negatives. We're going to look at two different risk assessment policies. is a revenue uncertainty critical risk. That first risk focus is to secure your high volume long-term wholesale contracts. Um, hotels and airlines already have this. They help to derisk it. It helps to keep about 30% of initial sales right over there. It makes sure that they're going to stay profitable even in bad situations, even in economic downturns. And also a little bit of a strategic focus. We're going to look at that final approval and it's going to be contingent upon securing an optimal hightraffic location, helping to guarantee our peak demand and ensuring that our weighted average cost of capital stays above that 8.5% margin. Now that we looked at a few of these specific scenarios, we looked at what is positive, what are we going to accept, and then what we're going to reject. Let's build it out into our reflection stage, pull everything together using the driver framework, and kind of build out our final acceptance proposal. We've reached our final stage. We're going to look a little bit more into the driver framework process in just a little bit. Um, but just going over it one more time. Our conclusion, the basics, biggest success of this process is actually taking the simple accept decision and turning it into a conditional acceptance based on that evolve stage. So why are we going to conditionally accept? This seems a little bit complicated. This seems a little bit weird. Our base case is perfect. It's highly profitable. Our net present value is $3 million. Our internal rate of return is positive as well versus our weighted average cost of capital, which is great. So, we're going to be creating a positive value. The issue is it's very fragile based on revenue. A 20% sales miss actually results in net present value less than zero. It's at -2.75 million. That totally destroys our entire project. Um, and our mitigation is required. We need to have some sort of plan in place to help ensure that the acceptance is contingent upon implementing strategies to help secure that sales. Everything else can go to everything else can kind of be adjusted a little bit. The interest rates and everything like that can change, but sales is the big thing. If your revenue decreases, it's going to impact this specific problem. And that's a very important thing to look at. And now really just an analysis of this driver framework. We built it out into a few different stages. It was very interesting to look at it. We built out that financial integrity and value using the implementation and the validation side of things. Looking at the model math with depreciation and terminal cash flows, net present values. Then looked a little bit into risk exposure and mitigation, some sensitivity tests throughout the evolve stage to kind of figure out what made sense and what didn't. and then finally built it out nearing the end into the define and the evolve stage nearing the reflection stage with a strategic alignment building out a final recommendation based on financial results that we built out in the implementation side of things as well as also the evolve stage and things that we have learned. So let's go straight here back into the stem of the problem. Wrap everything up. Overall was really interesting to look at it. Look a little bit into capital budgeting to look at the net present value and look at cash flows to see even a large investment in the beginning can have positive outlooks in the end. It's important to look at it and look at different scenarios that might come about to ensure that you are prepared for everything else that goes on. That's all I have for today. Thank you again and I hope I answered all of the questions.",
  "video_url": "https://youtu.be/dWW1VLTJtSc"
}