{
  "student_name": "Adisyn Nichols",
  "org_defined_id": "037075344",
  "username": "nicho307",
  "video_url": "https://youtu.be/r5Kt9ndE05o",
  "transcript": "0:06\nHi, I'm Addison Nichols. This is my\n0:07\ncapstone project. So, the problem that I\n0:10\nidentified is that small business owners\n0:12\ndo not always have access to legal teams\n0:14\nto help them navigate things like cash\n0:16\nadvances and other contracts that\n0:17\ndisguise themselves as standard loans.\n0:20\nThey're full of confusing jargon like\n0:21\nusing a factor rate instead of an\n0:23\ninterest rate to disguise\n0:24\nextraordinarily high APRs. There are\n0:27\npeople who are in the business of making\n0:28\nmoney off of other people's ignorance to\n0:31\nwhat's in a contract. What does it mean?\n0:33\nWhat is it really implying? Um, and this\n0:36\nis something that people without legal\n0:38\nteams can struggle with a lot. Um, and\n0:41\nit's not exactly the most accessible\n0:43\nthing to figure out because of all this\n0:45\njargon. It takes a lot of experience to\n0:47\nidentify these kind of things. So, who\n0:50\nhas this problem? Small business owners,\n0:51\nfounders, and freelancers that lack a\n0:53\nCFO or legal team. So pretty much anyone\n0:55\nwho is going to sign a contract that has\n0:58\nto do with finances that doesn't have a\n1:00\nlegal team. So my approach is that\n1:03\ninstead of a traditional calculator, I\n1:05\nmade an agent that takes raw legal text.\n1:07\nIt extracts the hidden variables and\n1:09\nreconstructs the cash flow to reveal\n1:11\nwhat is actually happening in digestible\n1:12\nterms. My tools for this were Google AI\n1:15\nstudio and Gemini. So for my build,\n1:18\nbreak fix, and repeat. What implicit my\n1:20\nfirst loop was just an AI agent that\n1:22\nacts as skeptical CFO which ignores\n1:24\nlegal liability and only focused on cash\n1:26\nflow risks. The break in this was that\n1:29\nit ignored legal liability and also did\n1:31\nnot distinguish between payment\n1:32\nfrequencies. AI tends to be really\n1:35\nconfident with its math and sometimes\n1:37\nit's not always right. So what I did to\n1:40\nfix this was refined the prompt to\n1:42\nexplicitly search for payment frequency\n1:44\nkeywords and also added a show\n1:45\ncalculation logic part for verification.\n1:49\nIn the second loop, I added the detailed\n1:51\nfee structure and cost of capital\n1:52\nbreakdown that it will output. And then\n1:54\nin the third loop, I had it categorize\n1:56\neach predatory covenant or risk as\n1:58\nlegal, operational, or just any category\n2:01\nthat it fits into. So, does this solve\n2:04\nthe problem? I had Gemini independently\n2:06\nfrom the one used in this app to\n2:09\ngenerate two contracts. The first of\n2:11\nwhich is kind of predatory. So, we're\n2:15\ngoing to go ahead and paste it in here.\n2:16\nOn the left side, it'll just explain how\n2:18\ndoes it work, what will it give you, and\n2:20\nalso provides a disclaimer that it's\n2:22\neducational financial analysis, not\n2:24\nlegal advice. That's just part of the\n2:25\nethics of using this. Um, you know, it's\n2:28\nnot necessarily certified like a lawyer\n2:30\nis through the bar and years of\n2:32\nexperience, but it is something that can\n2:35\nbe helpful when you don't have access to\n2:37\nthat and something to consider and then\n2:39\nobviously have a second opinion on. So\n2:41\nwhat we see in this predatory contract\n2:43\nis that there it uses a factor rate\n2:45\ninstead of interest rate. Again, this\n2:47\nusually disguises abnormally high APRs.\n2:50\nWe also see further down here that\n2:53\nthere's no discount for early repayment,\n2:55\nwhich is just kind of strange. So what\n2:57\nwe'll output is that this is a fail. We\n2:59\nshouldn't take this um contract. Nobody\n3:03\nshould because we see that the true\n3:04\neffective APR is 176%. Which is\n3:09\nextremely high. So, this will also show\n3:12\nthe calculation log logic as to how it\n3:14\nreaches the APR. So, those steps are\n3:17\njust laid out. It's a pretty basic um\n3:20\nway to do it. Um and so it just has this\n3:24\nto verify because sometimes the math\n3:26\nisn't always right and we always want to\n3:28\nbe able to check it oursel. So, then it\n3:30\nwill also give us an executive summary.\n3:32\nUm this is an extremely predatory\n3:34\nmerchant cash advance and the true\n3:36\neffective APR is astronomically high.\n3:39\nAnd so the repayment structure is also\n3:41\ndaily which is something we can see in\n3:44\nthis. So\n3:46\nback here we can see that they have to\n3:49\ndebit each business day. And so that's\n3:52\nalso like a predatory factor and that\n3:55\nthere's like a confession of judgment\n3:57\nand a personal guarantee which me\n3:58\npersonally I would have no idea what\n4:00\nthat was if I was a small business\n4:02\nowner. I would just kind of assume it's\n4:04\nstandard. So this is why it's such a\n4:06\nhelpful tool to have when you don't have\n4:08\nthat kind of background. And then we\n4:10\nwill also see a fee structure breakdown.\n4:12\nSo there are also fees included in this.\n4:14\nThere's an origination fee for the um\n4:17\nloan. There's an NSF fee which is like\n4:20\nany failed daily debit. Like if it the\n4:22\nthey debit for the money that you owe\n4:24\nand it doesn't happen. The charge is 500\n4:28\nwhich is really high. And then there's\n4:31\nalso just no early repayment discount,\n4:33\nwhich is just odd. And so it also will\n4:36\ncategorize fees. So the confession of\n4:38\njudgment, what this tells us that the AI\n4:41\nbreaks it down is that the funder can\n4:42\nobtain a judgment against the merchant\n4:44\nwithout a trial in the event of a\n4:46\ndefault. So this obviously gives the fun\n4:49\na lot of power against the person\n4:51\nsigning this loan. And then I'll also\n4:53\njust go over other things within that,\n4:56\nbut basically it just breaks it down. It\n4:58\ncategorizes everything pretty nicely,\n5:01\nlike kind of quantifies the risk. Is it\n5:04\nhigh? Is it medium? Is it low? And so\n5:06\nthat's something that's just very\n5:08\nhelpful to have as someone who isn't\n5:10\nfamiliar with these legal terms. So then\n5:12\nto test it again, we're going to put a\n5:14\npretty standard commercial loan payment\n5:17\nin there and then have it analyze. So\n5:20\nwhat we see for this one, it uses an\n5:22\ninterest rate instead of a factor rate,\n5:24\nwhich is already a good sign compared to\n5:25\nthe other one. We'll lay out the term,\n5:28\nsays it's monthly installments, gives\n5:31\nyou the amount of principal and\n5:33\ninterest, um that they can prepay this\n5:35\nin whole at any time without penalty or\n5:37\npremium. And basically just a pretty\n5:41\nstandard contract. So what we see in\n5:43\nthis output is that it's a pass. This\n5:46\nisn't a bad contract. It's definitely\n5:49\nmore safe than the other one. So the\n5:51\ntrue effective APR we calculate is 9%.\n5:53\nThis is with the calculation logic. So,\n5:55\nwe use our stated principal and the\n5:57\nmonthly payments which do include\n5:59\ninterest um\n6:02\nto find the interest and then kind of\n6:04\nback into the APR basic standard\n6:06\ncalculations, but it's laid out here\n6:08\njust in case. And so, this one says that\n6:10\nthis is a straightforward commercial\n6:12\nterm loan with reasonable effective APR\n6:14\nover a 5-year term. There's no\n6:16\nexplicator explicit predatory covenants\n6:19\nor hidden fees. Um, and then there's\n6:22\njust a little bit of a difference\n6:23\nbetween the interest rate and the APR\n6:25\nthat we calculate, but this is due to\n6:27\nthe it uses 360 days a year. We don't\n6:30\nsee um any explicit fees and there's no\n6:33\nmajor red flags detected. So, that's\n6:36\nkind of validating it. It appears to be\n6:38\na pretty good tool for this kind of\n6:39\nthing um when you don't have the\n6:42\nbackground that you might need to fully\n6:45\nunderstand those. So, how can this\n6:46\nscale? Currently, it relies on text\n6:49\npasting. This can be scaled by the\n6:51\nability to upload a PDF of a contract\n6:53\ndirectly, which would also maintain\n6:55\nformatting and just kind of make things\n6:57\ngenerally easier so you don't have to\n6:58\nworry about like a table being lost. And\n7:00\nthen as for what's next, this could be a\n7:02\nbeneficial tool to integrate with other\n7:04\naccounting platforms that store a user\n7:06\nuser's actual cash flow. So this could\n7:09\nbreak down if they can really afford\n7:10\nthis loan based on their true cash\n7:12\nflows. So what I learned about building\n7:15\nwith AI, I learned that while it is\n7:17\npretty great with qualitative analysis,\n7:19\nit can have small oversightes and math\n7:21\nthat need to be verified. It will be\n7:23\nvery confident about it, but there are\n7:25\njust some small nuances that sometimes\n7:26\nit just doesn't catch. So the solution\n7:28\nfor me for that was not making better\n7:31\ncode, but instead engineering better\n7:33\nprompts and kind of having this guide\n7:35\nfor the AI step by step, um, which is\n7:37\nwhat I did in my prompt here. I kind of\n7:40\nhad it um\n7:44\nI had it kind of lay out the steps. So,\n7:47\nestimate the effective APR, show the\n7:49\nmath, flag the cash flow killing\n7:52\nclauses, and give a past fail verdict.\n7:54\nSo, being able to just guide it step by\n7:56\nstep and doing better prompt engineering\n7:58\nis my main takeaway in what I learned\n7:59\nabout building with AI from this. Thank\n8:01you."
}