{
  "student_name": "Jonathan Hinds",
  "org_defined_id": "037200739",
  "username": "hindsj",
  "email": "",
  "transcript": "Hello. Uh I'm John and today we are going to be going over our session nine the cost of capital. Uh so our WACC analysis and uh first part of our discover our uh driver framework is to define and discover. So we have our assignment right here. Calculate the weighted average cost of capital or WACC uh for Netflix in connection with a hypothetical 5 billion content investment decision. Your analysis must determine the current WACCC, evaluate the impact of additional debt financing, assess project specific versus firmwide discount rates, and compare Netflix's cost of capital to industry peers. Uh so we're given a whole lot of stuff for our find and discover. Um, so we're given some of Netflix's f like hypothetical financial parameters. So market cap, um, total debt, debt, equity, bond rating, corporate tax rate, and current stock price. We're given some, uh, sample market conditions here too. We also have uh, see the context. So the WACC of Disney, Amazon Prime Video and uh or Amazon and uh that Netflix is considering a 3 billion additional uh debt issuance for content investment. And lastly, what we're looking to calculate today is our required analysis here. So, right there. Um, and to calculate Netflix's current WCC, um, we're also going to determine the, uh, WCC after the $3 billion, um, debt issuance. We're going to evaluate project specific WACCC. So, US versus international content, and we're going to compare Netflix to Disney um, on their WCC's, and I'm going to explain the difference. And lastly, what I'm going to do today is I'm going to recommend an optimal capital structure strategy. Um, yes. Yep. Okay. So, um, representing and implementing uh, with AI, I made a Google Collab interactive Python notebook uh, to help me out today. And we're going to have our uh, define and discover variables here. um those were just uh imported right from all this, you know, fun stuff right there. And so we're going to have our equity, our debt. Um we're going to have our like new debt issuance for our um example. So that's our 3 billion. Uh we have our RD, which is our cost of debt. We have our tax rate. We have our risk-free rate. We have our market risk premium. We have our beta, which is beta. Um so 1.3 for this. and we have our Disney's WCC for our um Netflix versus Disney. So, first step is we're going to calculate the cost of equity using CAPM and refresh. What that is, it's the um um it's it's the risk-free rate um plus beta times the market risk premium. Yes. Okay. And that is going to put us out with 11.65%. And why we want to calculate that is because we're going to need that value. Uh we have it represented in the code as K. Uh and K is going to be used to calculate our current WACC as well as our new WACC. Now, we are going to want to also find our total value, which is just our equity plus our debt to calculate our current WACCC. Now, moving on, we're going to calculate the current WCC. So, this first part is pretty standard. It's just equity divided by the current um value times our um uh cost of equity. And we're going to take all that and add that with our debt divided by our um total current value. And this is right here is uh the important part um which is our cost of debt uh times 1 minus the tax rate. So uh 21%. And why I want to highlight this part here is because we're multiplying the interest rate by um our one minus tax rate. And why we're doing this is because the interest payments are taxdeductible. So the government is is subsidizing our debt here, making the real cost of um debt much lower than this 3.8 here. Uh yeah, and running running that formula, uh it's going to put us out with 11.22% for our current WACCC. Now, we're going to be doing the same formula except for we're subbing in all the currents for the news. Uh, and we have some, uh, here are our formulas to find the new values that we're going to be using to substitute. So, our new debt is going to be the original debt plus the 3 billion in new debt issuance. And our new total value is our new debt plus the um, equity. So, we're going to get a new debt. We're going to need a new uh total value. And we're going to do the same formula except for with a new value, new debt, and new value. So, that's, you know, we're just replacing the current that those two with the news. And we're going to run that. And that's going to put us out with 11.13%. And now we're going to move on um to the like step number four I guess just yeah um which is going to be our um calculation of project specific rates. And so it's this is just pretty straightforward. Um, our US content rate is the exact same as our new WACCC. Um, Netflix is a domestic company. They're going to be uh they're going to represent the US content um at 11.13%. And so we know that the um um international com um international content has a 2.0 zero risk uh percent risk premium and um it's also just a pretty simple formula. We just add our new WACCC plus our 2%. So, and that's so 11.13% equals 13.13%. And that's the difference between our project specific rates. So, it's just 2% additional premium for international content. Now, um, we're going to talk about the spread between Netflix current WACCC and Disney WACCC. That number is 3.02. Disney currently has the 8.2% um, WACC. And so that is um, that creates the spread of 3.02 uh, between Netflix and Disney. And because Disney has the lower WACCC, it it makes it um overall uh I guess um I want to say yeah uh it means it means that Disney has almost a cheaper currency to work with and invest with because Netflix has to um work harder for uh um compared to Disney because Netflix has the higher WACCC which means they have to work harder to be able to achieve their required return um comparatively to Disney with only a uh 8 um 2% um and because they only have 8.2% they have a cheaper currency to invest with. Um and lastly um the recommendation um I'm I'm just saying that the um uh the strategic position that they should assume is that they should go with the deal the proposed $3 billion debt issuance is recommended as it lowers the cost of capital from 11.20 22% to 11.13%. So, uh it's pretty straightforward. Um in finance, um we're we're looking at um two um WCC values are are uh or older and new. And um I'm saying go with the new because it's a lower value. Why we want a lower value is because you can um if if you're lowering your your your cost of capital without taking on any additional risk, you're increasing the value of the company. You're you have it costs you less and you're not taking on any more additional risk. You're increasing the value of your company. And that's that's put it simply. The uh the whole point of um WACC is that it's it's basically a measure of um the return um that a company must earn on its projects to satisfy both its shareholders and its lenders. Um so where the equity comes from and where the debt comes from. So, to be able to make both of those people happy, um they have to um earn at least what their WACC is. Uh so, we're going to use our new WACCC for Netflix here, uh as an example to explain. All that means is that's the baseline of where Netflix must earn to keep people happy. if they are under if they're returning um per quarter, per year, whatever. If they're returning under 11.13%, then they are um losing uh value. They're losing value. They're losing company value and um their shareholders and uh the lenders are not going to be happy with them. And vice versa, if they're over that 11.13%, people will be happy. The um because that's increasing profit for the shareholders. The lenders are getting their money back. Um they're increasing value for the company. It's a win-win-win situation all around. And yeah, that's about it.",
  "video_url": "https://www.youtube.com/watch?v=z-8vNRzXkXI"
}