{
  "student_name": "Priya Gaddam",
  "org_defined_id": "037145385",
  "username": "gaddam10",
  "email": "",
  "transcript": "Today we will determine if Starbucks's proposed flagship roaster creates value and we'll also recommend an accept or reject decision supported by driver documentation and given values. So first define and discover. So this project is a hypothetical 12 million capital investment by Starbucks for a new roaster and flagship store. The investment is being evaluated over a 10year project life to determine its financial and strategic viability. So some of the parameters that we were given, we were given their initial investment which we're going to refer to as um CO and that was $12 million. And then the project life is 10 years and the discount rate um the weighted average cost of capital is 8.5%. And then the corporate tax rate is 25%. Then the depreciation method is a straight line over 10 years. The terminal value is 3 million and then the working capital is 500,000 and the initial out the initial outlay is recovered at y equals 10. So the project lifetime the sum revenue and cost assumptions. So we'll be dividing it in year 1 years 2 to 5 and then years 6 to 10 and we can see the revenue and cost assumptions. So for year 1 we assume the revenue to be 8 million and then for years 2 to 5 we assume the revenue to be 11 million and then from years 6 to 10 we assume the revenue to be 9 million and then the cost of goods sold will be 40% of the revenue and then the labor will be 2,500,000 the rent and utilities will be 800,000 and the marketing will be 300,000. Um, but this differs from years 2 to 5 and years 6 to 10 because that'll be 100,000. So, so far cost of goods sold, labor and rent and utilities, those will be fixed for every year. And so the required outputs and deliverables, so the financial metrics, the scenario analysis, the recommendation and documentation, we'll go through all that in this video. So for our represent stage um we're going to be calculating all the values with Python code and financial models. So the financial model formulation we'll be looking at annual free cash flow and for a given year this will be calculated using this formula where this variable um represents operating cash flow and it's calculated using the tax shield method using this formula and then two the initial investment will be given using this formula a value of -12,500,000 and then we have our capital budgeting budgeting metric metrics. So net present value which is the sum of the present values of all future cash flows minus the initial investment. And then we have our internal rate of return. So this is the discount rate that makes the net present value of all cash flows equal to zero. And then we have a profitability index. And so um the present value of future cash flows. So here's our analytical plan. So this is covered in the Python code. So here's the Python code. And so we just have to download the financial model to be able to calculate the financial um equations. So that's an important first step to make sure that our um results are accurate to um financial models. And so we have our project parameters. Those were the values that were given to us at the beginning of the assignment that I covered in the discover section. And then we have our revenue data, our cost of goods sold rate, all those values. And then we have our cost per cash flow projection function. And so this is just the different years. And then we also have some um equations as well. And so just some more information and um uh the things that we want to find. So, depends value, irr um all those and so we get a net present value of around 4,300,000 and then our internal rate of return is.13 so 13%. And our profitability index is 1.35. Our payback period in years is 12 and um around like 12 to 13 years. And then our discounted payback period in years is around 23 24 years. To quickly update, there was an error in the code which um provided incorrect values for the payback period and the discounted payback period as well. So the correct value for payback period in years is around five years and then the discounted payback period in years is around 8 years. And so now our implementation stage that was just what I went through with the Python code and here were our results. And so the net present value that was above zero. So we're going to accept this decision because we know that we'll gain a good return um by opening a new um roaster. And then our internal rate of return was around 13% which was above the weighted average cost of capital of 8.5%. So we're also going to accept this value. And then our profitability index was 1.35 which is above one. So we know that this investment will be profitable and we'll follow through with it. And then our discounted payback period of 8.21. We're also going to accept that because the project um time period is 10 years. And so since we'll be able to um receive a good payback in about 8 years, we know that we can recover our investment within the project lifetime. And so now verify um the verification stage confirms the calculation accuracy and extends the model to conduct required sensitivity analysis. Um so we know that our values are correct since we use the Python code which should calculate correct values and our break even analysis the project crosses the break even point since the net present value was above zero um somewhere between the -10% revenue drop and the negative 20% revenue drop and so the approximate break even revenue threshold a revenue drop of approximately 13.3% would to result in a zero NPV. This means that Starbucks must be confident in achieving at least 86.7% of the projected base case revenue to cover the cost of capital. And so next our evaluation stage. So this evaluation will synthesize the financial results and integrate non-financial considerations to form the final decision. So our investment decision so based on the quantitative analysis and on the values we got um the project is recommended for acceptance since we know that we're going to be making um a positive return. So the financial justification so our positive net present value of around 4 million and the internal rate of return of around 13% um exceeding the WACC of 8.5% demonstrates that this project is expected to create economic value and our risk assessment the project is highly sensitive to revenue failing the negative 20% downside scenario and this suggests a need for a higher risk mitigation strategy focused focus on market execution and operational efficiency if we really want to make sure that this project is as profitable as it profitable as it can be. And so next our strategic value. So the investment is critical for B for brand premiumization and establishing a competitive mode in a high-profile urban market. So this intangible value justifies accepting the risk especially since the project survives a moderate 10% revenue drop. And so some non-financial strategic considerations. So strategic fit. This aligns with Starbucks's pivot towards experimental retail and higher margin reserve concepts differentiating the brand from standard coffee shops and um brand enhancement. The flagship store acts as a globally visible brand billboard providing an elevated customer experience that reinforces luxury perception. And then real options value. The roster provides a platform for expansion allowing Starbucks the option to calculate re to the option to scale regional coffee supply without additional major capital expenditure later. So by looking at both financial and non-financial considerations, we can confirm that um by opening up new roaster, Starbucks will be able to um gain more profit and gain a better place in the market as well. And now the reflection stage. So the execution of this capital budgeting assignment using the driver framework successfully provided a structured and verifiable approach to the investment decision. So our certainty of investment and strategic confirmation. The primary objective was to determine the project viability and the analysis confirms a strong recommendation for acceptance since the base case yields a highly positive and net present value of around 4 million. and an internal rate of return of 13% which exceeds the 8.5% hurdle rate. And so we're certain through our financial calculations that we should go through with this project. And now the strengths of the analysis. So sequential progression. This analysis strictly adhered to the driver stages ensuring the methodology was sound before any calculations were executed and resolution of ambiguity. The process was robust enough to resolve the initial discrepancy in the payback period calculation confirming that the project pays back capital quickly in approximately 5.28 years and risk identification. The verification stages sensitivity analysis immediately identified revenue volatility as the crit the critical risk factor with the calculated break even threshold of around 13% in the revenue drop and this knowledge allows management to proactively focus risk mitigation efforts. So some limitations and potential improvements. The depreciation simplicity. The model used simple straight line depreciation, a more advanced reflection of reality, but incorporate the MCS modified accelerated cost recovery system appreciation, which would slightly accelerate tax savings and increase the net present value. And then scenario granularity. The best worst case scenarios could be refined by linking changes and operational costs to revenue changes creating a multiffactor scenario model. And so our learning objectives were confirmed because we were able to um apply the free cash flow calculation including proper treatment of working capital adjustments and terminal value. And we also confirmed the net present value decision rule and used the IRRa as a comparison against the corporate hurdle rate. And then we also integrated qualitative analysis with quantitative metrics reinforcing that financial analysis is a tool for informing not dictating strategic capital allocation. So this is my driver analysis on deter determining whether Starbucks should open a new roaster using given inputs. And I also used Gemini as a framework, but I went ahead and made sure that all the calculations and the analysis was correct with the correct values as well. Thank you.",
  "video_url": "https://youtu.be/oBC0n39YP_g"
}