{
  "student_name": "Jon Parrett",
  "org_defined_id": "037141383",
  "username": "parrettj",
  "email": "",
  "transcript": "Our task was to find the um financial data for GameStop and the S&P 500 and verify it. And um one of the points was to find if it was accurate that GameStop was traded at 4 cents in August of 2020. We found that this was incorrect because um the u minimum closing price was $14 and the maximum is $135 an average of 117. So there's no way it could have been 4 cents. We can verify this because or we found this by simply um writing some simple code and it pulled from the GameStop data and the S&P 500 data frames and as well is used a start date of 2020 August 1st and end date of 2021 um March 31st just to verify these um that we have like the time period right which it did and so it is impossible this was traded at 4 cents. And then to just to show more of where we got this information from, we um built out a table just to see all the data points it pulled out. So these are the dates and this was the closing of GameStop, the high of GameStop, the low, open, and such. And so um these are basically just numbers of what they were typically traded at. And so yeah, that's how we represented it. And it's um the GameStop return and the S&P 500 returns over here on these same dates. um comparing the two and okay and we implemented this data by using a OS model. This model just kind of tests like its significance and um how good the data is making sure that what we're using is like the data we're using is um trustworthy. So looking at this we can pull from um the end. Okay. So alpha which um alpha interprets like um it's basically a test saying how your portfol port portfolio did. It runs it through a few tests and it gives you a number of how well it performed performed with the um with the um stock market. And so zero would be like hypothetically perfect. And so this one has a 00.94 which is really good. And then it has a beta of 1.7072. That is how much it fluctuates in the market. Um meaning like how much it can react. So um like considering a perfect market is a one and something that doesn't move with the market or moves like negatively with the market would be like a zero. So this is a 1.702 1.7072. So this moves um like 1.7 it fluctuates 1.7 times the um the average market. So that's not crazy at all. Further we get to validate and uh we can validate these numbers basically with the alpha and the beta we found. So we know that these numbers aren't ridiculous. And also we are finding the abnormal returns and the [ __ ] accumulated abnormal returns. So that's what it's finding here. So the average abnormal return was a 2989 and um observed 14 times and that's also not a crazy number at all. So meaning um like anything that was significantly out of the blue like according to the market that's what this is trying to find. And then it's looking for the t statistic and the p value. The um the p value is also just looking for abnormal abnormalities and anything or sorry it's p value testing its significance also and um so this would mean that that return is significantly significant at 5% level this is at 003 which is good. Um so that means they have a 90 96.5 97 yeah 96.5% confidence in their um in their information and then the so yeah. Okay. Um the abnormal returns are um like it's just a simple formula and oh sorry wait real quick. These are just um verifying like our findings. So you can see what we're looking for is randomness and these are all very random. So this is good for to validate our information and to get further back into um abnormal return. It's your actual return minus your expected return. And so that's how you can find that. And then your cumulative is just finding all of those and then um like adding it. Okay. And then evolve. We just to evolve the code. It I mean it was really long and I wanted more verification. So I added these charts just to visually see the randomness. It's easier than just looking at a bunch of numbers. And so that's how we evolved that. And then also um I had it kind of define some of the um terms that we were looking for. So weak form deficiency is an existence of significant returns during the event window suggested a strong reflection of weak form market and then semi strong is semi and then strong efficacy and so on. Um and this the GameStop information that we pulled towards points towards significant. So that is good for us. And then these are just laying out more terms like hurting behavior would be seeing everyone seeing a lot of people invest in something so you jump onto it. That's what that would be. Social media influence. These are just all ways someone could be uh inclined to invest in something. And so these are all things we're looking for. Okay. And then lastly, we did our um reflect stage and we came with the summary. So, was GameStop trade at 4 cents? No. The price was $14 and maximum 135. So, there's no way. Um, was the prompt accurate? Um, yes, because the event the admiral returns. So it's confirmed this was correct because we tested the significance with the emerald returns and then some key findings um the CAPM style um yielded an alpha of um 0.09 09 or sorry yeah 0.094 094 and a beta of 1.7072. I already went over this. Um, and the returns, sorry, the abnormal returns went over that accumulating substantial performance related to the market and model expectations, meaning um it did better than people expected. And then we test the statistical significance. Um, the market efficacy went over if it was weak or strong. and we validated that it was a strong form of efficacy. And then some biases we went over such as the um like hurting mentality or social media influence and so on. So um I believe that's all I need to cover. Yep. I'll say that's it. All right. Thank you.",
  "video_url": "https://youtu.be/OtJSZJelCtE"
}