{
  "student_name": "None None",
  "org_defined_id": "033940131",
  "username": "kfsales",
  "video_url": "",
  "transcript": "All right. Hello everyone. My name is Kevin Sales and for this mini project, I built an AI powered negotiation assistant using N and Open AI. And the goal was to create a tool that can help users prepare for salary negotiations and evaluate the level of risk in negotiating different strategies or when it comes to negotiating utilizing different strategies. So in real life, negotiation can be stressful. People often don't know what to say, how aggressive to be, or whether this approach might backfire. So, my assistant solves this problem by giving personalized negotiation advice, generating scripts, and labeling each strategy as low, medium, or high risk so users understand the potential impact of their decisions. So, my workflow has four main components. when chats are received AI agent using open um AI GPT 4.1 mini simple memory and Google sheets interrogation and when chats are received so this just essentially triggers the workflow and the AI agent this will be the brain of the system and the simple memory is just there so it stores the session context so the assistant remembers previous messages and continues the conversation naturally and the Google sheets ination here is just to ensure that every interaction is logged. I record the user's question, the AI's answer, and the risk score. And this lets me track trends or analyze high risk negotiation patterns. So, let's see how this works. So, I'll type in a simple prompt like, how do I negotiate a raise when my market rate is higher than my current pay? So, if I do that, so if I go ahead and just input my already input my script. We'll have that and the AI agent process it using the promp by bill. So, it's going to go um give us a step-by-step strategy, a word for word conversation script, an optional email template and a risk label such as low, medium, and high like I uh previously mentioned. And at the same time, the workflow is going to be logged into my Google sheet. And I'll show you that here in a sec. And you're going to see that a new row appears with all three pieces, the question, the answer, and the risk. And this um this just makes the assistant both interactive and audible. So now that the agent has correctly already um this successfully executed, we can go to my worksheet. And if we go down to the most recent question here, and here is my question that I asked previously. My question was, \"How do I negotiate a raise when my market rate is higher than my current pay?\" And here's here's the question. How do I negotiate a raise when my market pie is higher than my current pay? And we're going to see the answer here. So, negotiating a raise when your market rate is higher than your current pay requires preparation, professionalism, and here clear communication. And here's a step-by-step approach you can use. So, here it goes and lists the step-by-step approach. And you know, this is pretty um this is pretty clear reasoning. It's pretty easy to follow. And something that I do like about this is that it does give you an example of how you could utilize this. So, example phrasing, it says, \"Thank you for meeting with me. I've enjoyed contributing to our team in Garuro. I've done research on the market salaries uh for project engineers in our area and I found that typical range is between X and Y. Currently, my compensation is this considering my experience and recent achievements alike.\" And you know, this is what I really like. And at the end here you can see about the risk I was talking about. This is low. And the reason why this is marked low using the AI model is that I made it I gave it a prompt that it assesses the question and how risky it is. So this question is how do I negotiate? This is a fairly simple question and this is a question that is asked all the time in in the construction world or in the business world or just in whichever industry you find yourself in. These are going to be um questions that are typically asked and for that reason it was labeled below. So I also expanded the system with a roleplay mode. So if I say let's role play act as a resume act act as my manager, the AI then switches to a simulated manager persona and pushes back realistically and lets me practice difficult um conversation. And this makes the tool just feel more like a real life negotiation coach. So I also built a system uh I also built a safety net. Actually let me let me quickly demonstrate an example of this where I utilize this. So I put here this is one of my previous questions. So I said let's role play. You're my manager and ask for a range and it says understood. Let's start the role play. And you ask for a range and then here it goes. Here's the question that the manager asked. I understand you like to discuss a race. can you share why you believe this is a race is warranted at this time and boom right then and there you could also have provided a response the AI would have gave you a an answer or a push back and you know this is a good practice to simulate a real life conversation between and when you're done you just simply say let's stop role play and it says exiting roleplay mode how can I help you next and you can go back to asking questions like I showed here previously So I also built a safety net into the system as well. The system always includes a disclaimer that this is not legal or HR certified advice and the risk label helps prevent users from blindly following aggressive or risky strategies. And you know, the risk label to me was the most important part because, you know, sometimes people follow um advice blindly and they're not really knowing or they unknowingly get themselves into situations that they may not be able to get themselves out of. So, the way this does and the way this model helps is really just pushes an individual in the right direction without being too aggressive or risky or if they do want to be risky that it lets you know that this is going to be a risky approach. But if this is how you want to go about it and you believe that this is the right way, then that's fine. But again, these safeguards are there just in case because some people sometimes would feel more confident going to negotiations with with medium risk um answers or questions or or push backs. And you know, this is just one of the many safety nets that I've built into this system. So in summary, my AI negotiation tool meets all the project requirements. It uses an AI model, memory tools, and real life um real time data logging. It's interactive, practical, and demonstrates how AI can support financial negotiation decisions. Thank you. And and I hope you guys enjoyed my demonstration. I hope you found this tool useful and yep, have a great day."
}