{
  "student_name": "Kendra Zylstra",
  "org_defined_id": "034289869",
  "username": "kzylstr",
  "video_url": "https://youtu.be/jRne1WZ3ct0",
  "transcript": "Hello. Today we are going to be doing a corporate financial decision analysis. So our goal is to determine whether Apple's hypothetical $90 billion $90 billion share repurchase creates more value and better align with stakeholder incentives than four alternative capital allocation strategies being dividend acquisition, debt reduction or R&D. We're going to be using the driver framework today. We're going to be going through each step and then in the implement stage we'll look at some code and I'll walk through that step by step. But for now, let's just jump right into it with our first step which is to define and discover. As I already mentioned, we know our problem is this question. Is Apple's proposed $90 billion share repurchase the best use of capital or does a superior option exist among alternatives being dividend acquisition, debt reduction, R&D when considering value creation, stakeholder incentives, and agency risks. So our objective is to model and compare the five capital allocation strategies using quantitative quantitative metrics such as EPS, ROIC and leverage and qualitative analyses such as stakeholder impact and signaling to deliver a definitive discipline recommendation. Furthering our define and discover stage, we want to just make sure to outline really clearly our key financial inputs. So this is a table here of our given data. So we know that the value for the liquidity which is cash and investments is $165 billion and the purpose for this is fund is a fund source for buyback dividend acquisition R&D and then our annual free cash flow is 100 billion and this is an indicator of sustaining capital returns and future investment. Our current share price is 185 which is used to calculate shares repurchased. And we know that that equals approximately 486.5 million shares for our shares outstanding. That's 15.5 billion which is our ba the base for all of our APS and ownership calculations. The P over E ratio is 30 times. And this is used to back into our initial EPS and net income. The total debt we know is 110 billion which is our base for the leverage calculation. And finally the buyback proposal size is 90 billion which is the cost of the primary scenario. Now with another table we want to outline our critical modeling assumptions which is our inferred data. So the assumption of cost of debt is our 4.74%. This is our initial value that we're going to use in the model. And the reason for this is that based on the current market data for a large cap company like Apple um and it's used to calculate interest savings which is debt reduction and WACC or corporate tax rate is 15% which is based on Apple's historical effective tax rate and used for calculating the after tax cost of debt. Cost of equity is 8.1% which is based on current market data and CAPM and used for WACC analysis. The hurdle rate or WACC is approximately 8%. The WACC is the minimum ROIC required for any investment or acquisition over R&D to create value. Our ROIC for new investment is about 12% hypothetically and this is an assumed rate of return for the strategic acquisition R&D project. So since this is 8% or greater than 8% the investment is assumed to be value creating which is a really key comparison point that you want to remember. And then third are our guiding financial theories. Here's another table in our define discover stage. And this is kind of our analytical lens that we want to have um and start with before jumping into the other parts of our driver framework. First, the agency theory. This is relevant to the capital allocation decision because it evaluates the conflict between management which is a the agents and shareholders which are the principles regarding capital use. The key stakeholder impact and implication management highly incentivized for the buyback due to options like the $170 strike and EPS targets. This creates an agency problem if the stock is overvalued. The signaling theory explains how the market interprets firm action and management's underlying belief about the company values. This is important because buyback signals belief that the stock is undervalued. Acquisition or R&D signals confidence and long-term growth. Dividends dividend signals temporary cash surplus value creation versus transfer. Excuse me. This distinguishes whether the capital is deployed to generate a return greater than the cost of capital when ROIC is greater than WACC. Implication for buyback or dividend is primarily a value transfer from company company cash to shareholders. For acquisitions R&D, the primary book focus is value creation if RIC is greater than WACC. And then finally, the capital structure theory. This is how the company's mix of debt and equity affects the overall firm value and financial risk. The implication for buyback dividend is that increases leverage or risk by shrinking the equity base debt reduction. The implication is that it decreases leverage potentially lowering the overall cost of capital and increasing the debt rating. Now I want to move into our second stage of our framework which is the represent stage. So first we're going to go over a model structure and then analytical road map and automation and then finally we're going to visualize our plan which is the value and risk tradeoff.\n\nFirst representing the model structure we have three different components here. We just want to represent this before actually creating the model. First we have the input section and this meets the requirement of the parameters and um this includes the given data and inferred assumptions and allows easy modification in the golf stage. And then we would like our calculation engine which helps with automation and automates the core metrics for all five scenarios. the new UPS, new leverage and new and the ROIC over verse WACCC, excuse me. And then finally the output and toggles which is the scenario toggles that we need in our model. So a single toggler switch allows instant comparison between buyback, dividend, debt reduction, acquisition, R&D scenarios dynamically updating the final out table. Secondly, we would like to represent by creating an analytical road map and automation. We would like to first calculate the metric of our new EPS and we have the formula for that here. The base net income plus change in net income over new shares outstanding and this measures the mechanical or value driven earnings per share boost for shareholders. Secondly, the leverage shift is total debt over total equity. This is our debt to equity ratio which measures our financial the change in financial risk profile which is critical for the bond holder impact analysis. Next, our value creation test compares the scenario ROIC to WACC, which is our fert rate. This confirms whether capital is genuinely creating value or merely transferring it among stakeholders.\n\nFinally, we have our ownership change. Our new ownership percentage is initial stake over new shares outstanding. This quantifies a specific impact on institutional holders such as Birshshire Burp stake in the buyback scenario. Our third part of the represent stage in this analysis is a visualization plan which shows our value versus risk trade-off. So in our chart the bars or the primary yaxis is the financial metric of the new earnings per share or EPS and there's a big analytical purpose for this. This measures the value or the reward to shareholders. The taller the bar the better the financial performance metric. Secondly, the secondary y-axis or the line models are leverage or debt versus debt over equity ratio. This measures the risk assumed. The higher the line, the greater the financial risk introduced, which is really critical especially for the bond analysis. And finally, the x-axis um is the five scenarios that we talked about which compares the buyback, dividend, debt reduction, acquisition, and R&D alter alternative side by side. So this is kind of our plan for how we're going to visualize it which is a critical part of the represent stage. Now we'll dive into the implement stage. So I will share my other screen here. So here is the Python code that we have written here. Um and there's the code here and then we ran the code and the results are down here. So I'm going to kind of go through this not exactly word by word but just kind of block by block to set the stage for the code and then interpret it once it is ran. So diving right in here, step number one is our parameterized inputs, which we know that we want to make sure that we have parameters. So these are really important to start with and just defining all values are billions as percentages and it's based on the defined discover stage. Those numbers that we talked about in that stage are implemented in the implement stage. So we know that our P O is 185, which is our current share price. The initial shares outstanding is 15.5. Our initial total debt is 110. The cash and investments all these are in billions is 165. The base net income which is calculated shown there as P 0 divided by P * initial N is 95.6. The buyback or allocation size is 90. The special dividend per share is $6. We really want to make sure that we have these critical assumptions or inferred data. That way it's consistent throughout the analysis. The corporate tax rate is 15%, the cost of debt is 4.74%. The hypothetical ROIC for acquisition or R&D is 12%. Our base case calculation here is shown that the equity market cap is P 0 * the initial N. Our leverage base is initial debt divided by equity market cap. Third, our scenario calculations. This is the automation part of the technical requirement. So first we defined the parameters and now we would like to make sure we have the automation. So we have a few different scenarios here because we know we have the different scenarios that we're going to compare. The first is the buyback or the share repurchase. So we have calculations here and we want to assume that NI is stable in the short term. The EPS buyback is NI base divided by the new N. The leverage buyback is the initial debt divided by equity market cap minus buyback size. The special dividend the cash dividend equals dividend DPS time initial N. Then we know that the leverage the EPS dividend is NI base divided by N initial and there are no there's no mechanical change to N or N. The leverage dividend is the initial debt divided by equity market cap minus minus cash dividend. The debt reduction we have interest savings pre-tax equals buyback size times R&D. The NIC increase debt equals interest savings pre-tax times one minus tax rate. EPS debt red equals NI base plus NI increased debt divided by N initial. And then our leverage debt red is debt init our initial debt minus 5 size divide by equity market cap. And then we know for the value creation test we want to do the acquisition divided by R&D. So for this we assume that the investment yields the assumed new ROIC. The NIC increase growth growth equals the buyback size time ROIC new time 1 minus the tax rate. The EPS growth equals NI base plus NI increase growth divided by initial N. The leverage growth is the initial debt divided by equity cap. So we know that the leverage is unchanged but the cash decreases cash decreases in this scenario. Our fourth step is the comparison matrix which is really important to be able to see it visually really well and this is the consolidation of our results. So this is just kind of defining the parameters there of the columns orientation things like this and then adding a base for some context calculating the EPS a creation there and then just some more like formatting things things like that and then fifth our visualization. And so this fulfills the requirement of visualizing it which is really important and really helpful as we continue this analysis. We would like to visualize at least one stakeholder comparison and we're doing the EPS versus leverage. We're going to remove the base case from the visual comparison for a clearer scenario analysis. Then for plot one, we have our new EPS which is going to be in bars. Our plot two is leverage which is our line on our secondary access. We have our title which is EPS impact versus financial risk leverage by scenario and the legend there and then finally the agency and stakeholder narrative notes here\n\nwhich we'll see it all played out here once we run the code. So we ran the code and that is shown here. So first we have this little comparison here. So our base EPS is $6.17 our base leverage is 3.84%. So this is a really helpful table to compare for all of the five cases which are acquisition R&D base case buyback debt reduction and dividend listed alphabetically there. We have our four different things we're looking at for each of them. So the new EPS and dollars the EPS accretion and percentage our leverage which is our debt equity market and then finally our value outcome. So you can see here that for example for the acquisition R&D it has a the highest um new EPS the highest EPS accretion the leverage is 04 for all of them except for for the debt reduction and then you know that the value outcome for acquisition R&D is value creation the base case is our baseline that's that is its purpose there um both the base case and the dividend have 0% % in EPS accretion and then the buyback here has um its purpose is value transfer it has relatively high or middle ground new EPS um same thing with the EPS accretion and kind of a similar thing for the debt reduction but the debt reduction has a really low leverage and its value outcome is a risk reduction so here we have our really helpful visual chart that shows the EPS impact versus financial risk or leverage by scenario. So we have our four capital capital allocation scenarios here. We don't have the base case just to take it out for kind of ease of looking at it. And we have our the new PSN dollars here versus the leverage ratio which is the debt market market equity. Um and you can see here here is the risk and the risk really really dips in debt reduction. The risk is relatively high for the other three. And then you can see here how the new EPS and the leverage um are all kind of similar in a similar range, but the acquisition R&D is the highest and then the dividend is the lowest. So here's a really helpful interpretation here. Our qualitative stakeholder and agency considerations, which that was this part of the code here that we didn't focus on too much was the number six. So we want to look at this qualitative consideration. So for number one for the buyback this creates agency risk management incentive via options and increases the institutional investor ownership concentration. Second the dividend has the highest tax burden on retail investors and the is the least flexible use of cash. Third are debt reduction. Its primary benefit is to bond holders because it is a credit rating improvement and risk reduction. It is moderate but high quality EPS lift. Finally, the acquisition R&D is the highest long-term reward potential due to its high EPS, but it is also the highest execution risk, which is a lot of uncertainty as far as value creation goes. So, here's our code here, and we're going to hop back to our PowerPoint to finish our driver framework. So once we have implemented what we learned in the define a discover and represent stage we want to validate. So we have um four steps here five steps to our validate stage. Um so we're going to go through that. So first we want to identify the critical assumption to validate what we kind of figured out. So first we want to validate that the primary assumption driving the value creation scenarios or acquisition R&D is the hypothetical return on invested capital or ROIC of 12%. This is absolutely critical because our WACC which is our hurdle rate is assumed to be about 8%. So since 12 is greater than 8% the investment is flagged as value creating and delivers the highest EPS boost of $6.76. If the actual ROC is lower the investments may destroy value want. So we validated that critical assumption. Secondly, we're going to validate and define our sensitivity scenarios. We will test three scenarios around the assumed ROIC. The worst case scenario, hypothetical ROI is 5%. The result value resulting value outcome is that it's value destroying because the RAC would be less than WAC. To break even, we would do 8% which would be value neutral or RA equals WACC. The best case would be the 12 ho hypothetical 12% ROIC which is our base case assumption and is value creating as the outcome. Next we want would like to execute this. So if in our code we would change the RIC new parameter and rerun the script the worst case would be the 5% we would update the parameter to 0.05. The resulting NI increase we can calculate here would be 90 billion time 5% time 1 minus 0.15 equaling 3.83 billion. The new EPS is 95.6 + 3.83 divided by 15.5 which would be 6.41. So the worst case scenario here the RIC is 5% and this is for the acquisition R&D. The new EPS is 6.41. The comparison of this is higher than the buyback at 6.37. The debt reduction there's no RIC. The new EPS is 6.4. It would be slightly lower than acquisition R&D\n\nR. And then we would like to look at the break even ra which would be 8% once again changing the script from the RA new changing it to 8% or 08. The resulting NI increase would be 90 million * 8% * 1.1 excuse me 1.1US.15 which equals 6.12 bill. The new EPS or acquisition R&D would be 95.6 + 6.12 / 15.5 equaling 6.56. The scenario here is our acquisition R&D or break even point. The RIC is 8% the new EPS is 6.56. Our comparison conclusion is that this is significantly higher than the buyback debt.\n\nSo our conclusion after validating this we can confirm that the acquisition R and D option is highly robust. So that is a big reason why the validate stage is so important to validate our conclusions that we already made to ensure that they really are true and can be trusted. So even in the worst case scenario which would be the 5% RIC the resulting EPS of 6.41 Number one, still beat EPS from the $90 billion buyback of 6.37 and the debt reduction of 6.4. Our key finding here is that the buyback is the least efficient EPS generator among the three long-term options of buyback, debt, and R&D acquisition regardless of the actual return on the growth investment unless the ROIC is practically zero. So, we can validate, we can conclude this and have it validated based on what we just did in this stage and the stages prior. Next, we want to evolve. We have a few key parts of evolving what we have already learned and discussed. Number one would be integrating agency theory or management incentives. We must evaluate how each option impacts management and employee incentives, especially concerning the $170 strike options and the potential for the agency problem. So we have a table here which I'm not going to go into detail but you can look at more in detail um because it's just like a hypothetical how it can evolve. So we have these four options the management instead of impact and the agency government implication. So there are more descriptions here on the slides but I'm just going to kind of go over the overall conclusion about evolving it. So if we did the share repurchase, it is the highest short-term incentive and the agency risk is the highest for this. For acquisition R&D, there's a high incentive, but it's high to execution risk because it creates a mandate for long-term growth and strategic vision. It is the lowest. It is the lowest agency risk um and a lot of value creation, which aligns with the long-term shareholders interests. The special dividend is a low direct incentive. Um and the implication for the agency or governance is neutral. And then finally the debt reduction. There's a really low incentive because even though it reduces risk, it does not create the high profile or short short-term boost and the governance is positive because it signals financial discipline over short-term financial gains. Secondly, we can evolve it to integrate the theory and market perception. We analyze how the capital markets are likely to interpret each choice regarding long-term capital allocation discipline. Once again, I'm not going to go into too much detail, but we have the four options. The market signal and the capital allocation discipline. If for the share repurchase, the market signal is undervaluation. And this is the this is the strongest signal that management believes that stock is chip is cheap. And the allocation discipline is very mixed because it's seen as discipline. If the stock is truly undervalued but is opportunistic and dis and potentially disciplined if it prioritizes EPS over federal investments for acquisition. It shows commitment to growth and a lot of high discipline for special dividend. The market signal is excess and non-permanent cash and it's moderate discipline for debt reduction. It signals focus on stability and cost of capital and shows a lot of high discipline. Third, we would like to evolve the recommendation refinement. So the validate the validate stage prove that the acquisition R&D and debt reduction provide higher or comparable EPS gains in the buyback even in the worst case scenario. The evolve stage confirms this because the buyback carries the highest agency risk and provides the least efficient EPS lift. The acquisition RD option aligns with incentive aligns incentives with value creation and provides the highest strategic benefit. The debt reduction option provides the best outcome for risk reduction and governance. This qualitative review strongly refineses the recommendation away from the buyback forcing a choice between growth acquisition R&D and stability debt reduction. And then we are up to our final stage of the driver framework which is to reflect. So we first want to reflect on all of the rest of the driver framework and we reflect and see that there is a clear trade-off between growth value creation and stability and risk reduction. So the comparing these three scenarios acquisition or R&D has by far the highest final new EPS of 6.76. The governance and risk profile is a low is the lowest agency risk and highest execution risk and it is value creation rather than transfer. Debt reduction is a 6.4 EPS which is best for bond holders reduces WACC and risk and is a kind of a mix of risk reduction and moderate value creation. And then finally the share repurchase is 6.37 as a new EPS which is the lowest of the three. It has highest agency risk based on CEO and options and increases leverage and is value transfer rather than creation. So to reflect on this, our final recommendation is that based on the quantitative superiority demonstrated in the implement and validate stages and the positive governance alignment confirmed in the stage. The final recommendation is a split allocation prioritizing value creation and balance sheet discipline. The recommendation is to allocate the $90 billion as follows. So we want to allocate 60 billion to strategic AI VR acquisition and R&D. And this is because this choice provides the highest potential EPS growth, the 6.76 verse buyback 6.37 and has proven robust even under low return assumptions. It aligns the company with long-term strategic goals and avoids the agency risk, the high agency risk of the buyback. The shareholders and management are the stakeholder benefits. And then we want to allocate the other 30 billion to de debt reduction. This provides an immediate high quality EPS lift via interest savings while simultaneously reducing leverage and financial risk. This sends a strong signal of a balance sheet discipline to market. The bond holders and shareholders both benefit in this case. The conclusion of our buyback proposal is that the hypothetical $90 billion share repurchase is rejected because it is actually the least efficient path generating EPS among the long-term options and carries the highest governance risk due to the optics of management boosting option value. It primarily results in value transfer while the proposed split allocation achieves both value creation and risk reduction. So overall this project was really interesting to me. I learned a whole lot about um corporate financial decisions and how they process those. It was especially interesting to me. See if I can find a slide. um to kind of consider like the\nto consider um yes here like considering the agency theory integrating the agency theory with this problem and kind of exploring management incentives. kind of reflecting on this project, this was kind of a really big aha moment for me and really interesting to think about who would actually be affected um kind of throughout there was a few moments um just kind of thinking about this and then here when we kind of put it all together of just thinking of who it would really be affected and in this case like um the imple imple implication of the on the agency and govern governance um like if it's a high or low agency risk and then also the market perception was really interesting to me. And another kind of big moment that kind of tied it all together for me was looking at this and kind of considering what these different options like. We had these four different options besides the buyback and how this would send different signals to the market and um how this would like reflect the amount of high or low or moderate discipline that the corporation had based on this. So, it was really interesting to me and I hadn't known a whole lot about corporate finance before. So, it was really interesting to learn about that and um kind of now think of when corporations do different things with their finances in the news that I read, I can um kind of reflect on this project and know a little bit more about the market signals and things like that. So, overall super interesting and learned a lot. Thank you."
}