{
  "student_name": "Nick Eldi",
  "org_defined_id": "037437763",
  "username": "neldi",
  "email": "",
  "transcript": "Certainly. Here is the word-for-word transcript of the video you provided. --- ## 📝 Video Transcript Hello, my name is Nicholas Eldy. This is session 9 for Management 310. The overview we're given is that Starbucks is proposed to a flagship rotisserie that requires a $12 million up front outlay and is expected to operate for 10 years. Use the firm's 8.5% WACC as the hurdle rate to determine whether the project creates value or to recommend an accept or reject decision supported by DRIVER documentation. So, our initial, so let's go through the slides. Great. So, based on my last video, I wanted to make it a little more organized in the beginning and all the way throughout. So, to add some more structure, I added an executive summary and we're going to uh discuss the findings first, then walk through the DRIVER framework to see how we got there. So, the recommendation is to **accept** the Starbucks Rotisserie Project, and the justification for it is that the project yields a **positive Net Present Value** of $3.2 ish million, and an **IRR of 12.56%**, which comfortably exceeds the **8.5% Weighted Average Cost of Capital (WACC)**. This indicates the project creates significant shareholder value. However, **sensitivity analysis** reveals the investment is highly vulnerable to a **decline in projected revenues**, necessitating a strong, sorry, a strong uh **validated revenue strategy**. Excuse me. Okay. So, let's now dive into the DRIVER framework to see how we got here. So, the, we have our goal here and discover is to determine the financial ability of the 10-year Starbucks Rotisserie Project by assessing its ability to generate shareholder value using 8.5% WACC as our hurdle. So, here we have a list of parameters, their values and the role in the analysis. So, our **Initial Capital (CapEx)** is $12 million. The **Working Capital ($W C\\_delta)** is half a million. **Discounting Rate** is 8.5%. **Project Life** 10 years. **Tax Rate ($T\\_c)** 25%. **Depreciation**, we're going to do straight-line over 10 years. And the **Terminal Value** is $3 million. So, let's move on to the represent stage where I had Gemini formulate the, put it into the formulas for us. So, we have the **Initial Investment ($CF_0$)**. So we have the capital investment, initial capital investment plus our change in working capital outflow. And that's going to be a negative value because it's outflow. So, we have $12 million plus our half a million gets us a negative $2.5 million, $12.5$ million, excuse me, as our initial investment. The **Annual Depreciation** is going to be our initial investment over the project life, which is going to turn out to be $1.2$ million per year. Our **Operating Cash Flow (OCF)**. We are going to use the tax shield approach. So, our operating cash flow equals our revenue during the time minus our operating costs during that time times 1 minus the tax rate plus our depreciation times the tax rate. The **Terminal Value After Tax ($TV_{AT}$)** is $T V_{A T} = \\text{Salvage Value} - (\\text{Salvage Value} \\times T_c)$. Assuming a zero book value, the entire salvage value is taxable gain. Therefore, we plug it into the formula where salvage value minus salvage value times our uh tax equals our terminal revenue after tax. So, we have $3$ million minus $3$ million times $0.25$, and that gets us $2.25$ million. Well, wait. Two and a quarter million. Um, so let's **Implement** now that we have run the calculation we have defined, represented. Let's move on and put it into a chart so we can actually visualize the cash flow schedule. Our first year, or actually our year 0, of course, no op- no revenue, no expenses, no depreciation, la da da da da. It's just what we calculated before, our $CF_0$ is $12.5$. But, as we move on to the first year, that's when our numbers kick in. Okay, over here. Revenues $8$ million in one year, $11$ million in years 2 to 5, $9$ million to years 6 through 10. Okay, let's go back. That's what this is displaying. So, we see that we have $1.2$ million cash, positive cash flow, first year. Years 2 to 5, we'll have $1.7$ million per year. Years 6 through 9, we'll have $1.8$ million per year as our cash flow. All right. So, let's move on to the **Core Capital Budgeting Metrics**. So, here are metrics and the uncalculated results. So, we have the **Net Present Value (NPV)**. Turns out to be $3.2$ ish million dollars. So that is above zero. Since it's positive, and since it's positive, it creates value for the shareholders, so we are going to **accept** this Net Present Value. Moving on to the **Internal Rate of Return (IRR)**. That should not be a dollar sign. Sorry. Internal Rate of Return is $12.56$ for all intents and purposes. So, uh since our IRR is greater than our WACC, we will **accept**. Our **Profitability Index (PI)** is $1.26$. Above one, so we **accept**. **Discounted Payback** is uh within the 10 years, at $7.56$. And the same thing with the **Simple Payback Period**. We will accept it since it's within our time frame. Let's **Validate** the Model Verification and Sensitivity here. So, the positive Net Present Value and the IRR support the decision to accept the project. To validate the robustness of the decision, though, we will perform two sensitivity analysis tests. Okay? We will first do WACC fluctuation of 2%. We run these and we find that uh even if we increase 2%, we are uh in the positive for our Net Present Value, our IRR is the same, so we accept. However, if we go down to the **revenue being decreased by 20% in Scenario 2**, we have to **reject** that scenario because we have a very big negative, negative $2$ million in as our Net Present Value. So, conclusion is that a **20% decline in revenue causes the NPV to become significantly negative**, and the IRR to fall below, way below the WACC. This means the project's fate is **highly sensitive** to achieving its growth phase revenue targets, indicating **revenue risk** as the primary threat to value creation. So, let's **Evolve** from this. So, we know that the strategic rational is that the rotisserie functions as a brand enhancement. That's a vehicle. So, this is an intangible strategic value and it supports the investment. But, the analysis provides that the value proves, sorry, that the value is not high enough to justify the project if base-case revenue is missed. So, **actionable insight** here is that the Starbucks management must focus its effort on **marketing and operational excellence** to ensure that the $11$ million target revenue for years 2 to 5 are actually met. This period is the most critical driver of positive NPV. All right, so some **takeaways** after uh using the DRIVER process and uh we've provided a uh disciplined, systematic approach uh to evaluating this major capital expenditure, right? So, the crucial decision between accounting income and cash flow was highlighted through the correct application of the depreciation tax shield. Therefore, correctly handling timing and after-tax treatment of working capital and terminal value was really essential to determine the final cash flows. You have to know what to include and what not, right? So, the **conclusion for the board** here is that the rotisserie is a value-creating project, offering a strong return relative to the cost of capital. However, our sensitivity tests show that the margin for error is tight regarding revenue. We recommend acceptance, but we must implement **strict revenue tracking** and **contingency planning** for potential market slowdown or lower-than-expected premium customer turnout. The investment creates value, but demands rigorous execution. All right, thanks for watching. Hope that was helpful.",
  "video_url": "https://youtu.be/jm72sAMB0NQ"
}