{
  "student_name": "Silas Bowman",
  "org_defined_id": "036111483",
  "username": "bowma177",
  "email": "",
  "transcript": "All right. Silas Cameron Bowman 0 minutes 8 seconds Hello, my name is Saz Bowman and we'll be going over session 8. So the objective of this analysis is to investigate the 2020-2021 GameStop short squeeze. So the core question was whether the GME event represents A fundamental failure of the efficient market hypothesis or if it can be explained. Silas Cameron Bowman 0 minutes 28 seconds Over can be explained as a rational, albeit extreme market correction. This is my define discover represent an implementation plan stage. So the hypothesis tested reform so the GME event did not violate. Silas Cameron Bowman 0 minutes 44 seconds Uh. Silas Cameron Bowman 0 minutes 46 seconds Violate weak form efficiency. This will be difficult test without technical analysis and then the strong form. The GME event violated the semi strong efficiency. We will hypothesize prices did not instantly and rationally reflect publicly available information. Silas Cameron Bowman 1 minute 2 seconds But instead reacted with significant delayed in irrational surge and then H3 with the behavioral price action is better explained behavioral finance concepts then then by the EMH so. Silas Cameron Bowman 1 minute 17 seconds Next, so the the the data sources, so the price volume and data historically. Silas Cameron Bowman 1 minute 24 seconds Shown here the for GME in the market benchmark. So taking that from Yahoo Finance via the Python library and showing that through 2020 to 2021 as you can see here with the data validation saying the assignment prompt obviously requires verification of the same in GameStop traded. Silas Cameron Bowman 1 minute 44 seconds At .04 in August 2020, showcasing that, but the finding was that the it's factually incorrect and verified the historical data from Yahoo Finance shows that the split adjusted low for GME in August 2020 was 104 then and the analysis will proceed using that verified figure. Silas Cameron Bowman 2 minutes 2 seconds So claims to be tested, the retail trading volume increased tenfold. Those be tested by calculating the ratio of peak squeeze volume to prevent average claim to analyst fundamental value estimated 10 to 40 per share. Those be taken a given a baseline for fundamental value. So the representation. Silas Cameron Bowman 4 minutes 57 seconds Yeah. Silas Cameron Bowman 5 minutes Yeah, so then the scripty stats lingress. Silas Cameron Bowman 5 minutes 6 seconds Showcase the technical information of CPM using the Scripty stats lingress to run a full regression on GME's returns against S&P 500. So this single line calculates the beta. I'll show you that. Silas Cameron Bowman 5 minutes 21 seconds So from the skippy up here and then it brings it down stage 3 and runs it here so calculates that so. Silas Cameron Bowman 5 minutes 33 seconds This this calculates the beta and most probably the alpha the intercept and then testing that on the tenfold claiming by dividing the the peak squeeze volume by the pre-squeeze average. This gives us our empirical volume multiplier. So showcasing the where's my. Silas Cameron Bowman 5 minutes 50 seconds The assuming risk going in and calculating the abnormal returns based on the CAPM, the volume analysis testing the tenfold like I just said and then risk addressed return showcasing the Sharpe ratio on that and then with the stage 4 showcasing the output, So what it's gonna output. Silas Cameron Bowman 6 minutes 7 seconds Which I'll just go over later and then plotting abnormal returns on the visualization of the graft, the graph I should say. So now showcasing this code, so what it put out here. Silas Cameron Bowman 6 minutes 22 seconds So this code executed validated our hypotheses with three key findings. First, the volume multiplier was 18.3. Silas Cameron Bowman 6 minutes 30 seconds As you can see down here 18.3 and the prompts tenfold claim wasn't just correct, it was an understatement. This confirms the hurting of the hypothesis and 2nd the CAPM beta was -1. Silas Cameron Bowman 6 minutes 46 seconds -1.9 around -1.98 In this powerful anomaly, a beta of one means moving with the market. So a beta of -2 means moving against the market with double the volatility. This is empirical proof that GME completely decoupled from marketing fundamentals. Silas Cameron Bowman 7 minutes 3 seconds And third, most importantly, the daily alpha was 4.3% so. Silas Cameron Bowman 7 minutes 10 seconds Right here, daily alpha 4.3 in an efficient market, the alpha should be 0. Finding a daily abnormal return of over 4% statistically significant and persistent is a smoking gun quote UN quote that that massive predictably profits were predictably. Silas Cameron Bowman 7 minutes 28 seconds Profits were possible. So this is a definitive definitive violation of the semi strong form EMH and then when we go down into the the actual graph here. So this chart generated by the code visualizes the inefficiency. So you're looking at the daily abnormal returns. Silas Cameron Bowman 7 minutes 47 seconds The alpha as you can see in the late in late 2020. Silas Cameron Bowman 7 minutes 53 seconds This the bars are small and centered, so as you can see here, just centered around zero and just as EMH would predict. Then in January 2021, the mod shows a massive multi-standard deviation spike in the alpha and this directly addresses your feedback to see the visualization. Silas Cameron Bowman 8 minutes 13 seconds So this strengthens the analysis and clearly shows the moment market efficiency failed, as you can see here with this massive spike. Um. Silas Cameron Bowman 8 minutes 23 seconds So which form of efficiency was violated? The semi-strong form was definitely violated. So public information like 140% short interest was available for months, but the market failed to price it in. Silas Cameron Bowman 8 minutes 39 seconds The price only moved after a social media catalyst hurting, not not when the information became public. This event is a perfect example of limits to arbitrage. Rational search sellers were right. The stock was overvalued, but they were forced to liquidate from margin calls before the price corrected, and in fact their liquidations drove the price even higher. Silas Cameron Bowman 8 minutes 57 seconds My final reflection in this is GME event shows that the financial theory in real-world markets can be two different things. So a rational investor as defined by the EMH would have shortened GME based on its fundamentals. However, a rational short seller in the world. Silas Cameron Bowman 9 minutes 13 seconds Went bankrupt. So the market anomaly persisted longer than the short sellers could remain solvent. And this is the limits to arbitrage arbitrage concept in action. So the market was inefficient, but the inefficiency couldn't be corrected by rational actors. Silas Cameron Bowman 9 minutes 30 seconds Because the risk of return was too high. Overall, this assignment taught me that while the data-driven analysis grounded through like CAPM is our best tool, we must also account for behavioral factors in the market structure because this code proves hurting and short squeezes can temporarily overwhelm any model or efficiency. Silas Cameron Bowman 9 minutes 48 seconds Um. Silas Cameron Bowman 9 minutes 50 seconds Thank you.",
  "video_url": "https://youtu.be/InQlvOm_Y4I"
}