{
  "student_name": "Alejandro Jervis",
  "org_defined_id": "036132121",
  "username": "ajervis",
  "video_url": "https://youtu.be/5gSvEeB8Zgo",
  "transcript": "Hello, my name is Alejandro Jervis, and Session 11 is Corporate Decisions and Incentives. In this session, I'm taking the core ideas behind capital structure choices and connecting them to a simple Python model that shows exactly how leverage can reshape financial outcomes even when the underlying business doesn't change at all. Corporate finance may seem like a world of formulas and balance sheets, but decisions between debt and equity are ultimately decisions about who carries risk, who captures reward, and how managers navigate competing pressures from investors and creditors. Shareholders generally prefer higher upside and stronger ROE, lenders care about repayment certainty and long-term stability, and managers must walk a tightrope between hitting growth targets and avoiding financial distress. Using the DRIVER method, I begin with Define/Discover, where I clarify the goal: not simply calculating ROE, but understanding how financing choices alter incentives when operations stay constant. To make this clean and controlled, the code fixes EBIT at 1.5 million dollars and sets the corporate tax rate at 25 percent, effectively freezing the business engine so that any changes in performance arise purely from capital structure differences. In Represent, I translate that concept into two simple but powerful scenarios: Scenario A, an all-equity firm with 2 million in equity and zero debt, and Scenario B, a leveraged firm financed with 1.55 million in equity and 450 thousand in debt at a 7.5 percent interest rate. This split immediately reveals how financing changes the economic landscape: Scenario A offers stability and low risk, while Scenario B introduces fixed interest obligations but also reduces the equity base, which is the key mechanism that amplifies ROE. In Implement, the Python code carries out the financial logic step by step—calculating interest expense, EBT, taxes, Net Income, and finally ROE in both scenarios. Scenario A gives us a clean operational baseline, while Scenario B demonstrates the leverage effect: even though interest lowers Net Income, ROE often increases because earnings are being measured against a smaller equity base. The code's final printout compares both ROEs directly, letting us see in real time how a firm can deliver higher returns to shareholders without generating a single extra dollar of operating profit. In Validate, I assess whether these numerical results match established finance theory, and they do perfectly: unlevered firms produce stable, predictable returns, while levered firms produce higher ROE in good periods but face increased sensitivity and distress risk when earnings fall. This tension explains the classic conflict in corporate finance: shareholders may push for more leverage to boost returns, while lenders and managers often favor caution to preserve solvency and operational flexibility. Finally, in Evolve & Reflect, I consider how the model could be expanded—for example, by adding downside EBIT scenarios to illustrate how leverage can rapidly erode equity, modeling interest-coverage ratios to show when lenders begin to worry, or creating adjustable inputs to let users experiment with different debt levels and observe how incentives shift as leverage rises. Reflecting on the entire exercise, the DRIVER method helped transform a simple Python script into a conceptual lens: the company's operations never changed, yet financing alone transformed the experience of shareholders, lenders, and managers. This demonstrates the heart of corporate decisions and incentives in Session 11—capital structure is not just a mathematical choice; it is a deliberate design of incentives, risks, and strategic behavior that shapes the entire financial personality of a firm"
}