{
  "student_name": "None None",
  "org_defined_id": "037907174",
  "username": "saini52",
  "video_url": "",
  "transcript": "\"All right, so this is the mini project number three, uh, where we were basically told to kind of amplify our other projects and make something that's really useful, hopefully in the real world or kind of get a good start for it. So I decided to kind of create a car purchasing decision tool using ChatGPT in particular. So, the first thing I did before even creating this is I actually went on the internet and just kind of researched. I recently bought a car too, so I kind of knew a few things that a lot of, um, bureaus look for when you're getting approved for like a loan or just something along those lines of like, you need a good credit score and you need, you know, an annual income of this, and you should have this much in savings and, you know, etc., etc., um, to really just amplify kind of that idea.\n\nNow, for the program that I made, it's not really a direct bureau program where they're going to actually put in your information, hence you don't see like, uh, sensitive information like, you know, your credit score or your address or um, like any history of any sort, I don't know, whatever. It's more of this kind of online tool where you can just kind of put some basic values in to kind of see. Everyone knows their credit score. Everyone knows that if you have an 800, you're probably going to get the loan, and if you have a 300, you're probably not going to get the loan, regardless. So, those values I think are very common, but it's the stuff like how much income you should be making and how much you should have in savings that I think people get a little bit more confused on where that gray, you know, borderline is of what's good and what's bad.\n\nSo, that's what I made this for, which is the Car Purchase Decision Tool. Um, okay. So, the first thing I have is country. Um, I decided to do seven different countries right here. The reason being is because each country has different interest rates and different, um, like variables and I would not be able to do every country and there was no like, um, person who has like an API that I could have imported that did the way, or the work the way that I wanted it to. So, I decided to just make these the main here. So, I have US, Canada, UK, Australia, Germany, India, and Japan.\n\nSo, let's say if the person is on our program and they're living in the USA, you can do a city/state. So, I'm just going to say Noblesville, Indiana which is where I am right now. And then, um, for the annual income, we'll make up a random income of let's say 3,000. That's my annual income. Um, and for savings, we can say, okay, maybe I've saved a lot of money, maybe I worked a little harder over the summer, so I have $6,000 in savings. And then your loan term in your year. So, um, let's say I'm going to need approximately four years to do this loan, or I need at least four years of that to carry over.\n\nSo then when you click Evaluate, this AI kind of tool assistant gives you a lot of information down here that kind of helps you understand. So, it's saying that no, it may not be financially smart to buy a car right now. And the score that it gave us was an 18 out of 100, um, which is very low. So, the first thing right here is the average APR. So, right now in, um, the United States, just as a whole, it's around 7.2% and that's what it's going to use to calculate more figures for you. So, it's saying that some savings exist, but increasing them would improve your cushion. It's a very low income that can strain your monthly budget, um, balanced loan term, which is a reasonable compromise between payment and interest. Um, average auto-loan interest rate in USA: 7.2%. Location note: living in Noblesville, Indiana may change insurance, fuel, and parking costs which affect affordability. So, it kind of gives you a feedback of everything, um, tells you the auto-loan interest and where we live. So, it kind of gives us some information and it gives us an 18 out of 100.\n\nNow, if I do the same thing, let's say in India, and I put it, their APR is 9.5%. Our score really doesn't change much since the interest rate doesn't change much either. Um, so now let's say my average or my annual income is $30,000, and I have $6,000 in savings, and I want to make the loan five years. Um, it's still not saying that it's good. The reason is because our score we scored 28 out of 100 during the uh, the metrics that I've set for this AI to kind of evaluate on. There is some savings, there's a pretty good income, um, balanced loan, but it's still not a very good idea.\n\nSo now let's say we're super rich, right? Let's say we are making $100,000 a year, which is a very high salary. Um, and we have $50,000 in savings and I want to get a loan for 10 years, so I'm going to increase the longevity of this loan. If I click Evaluate, it still says maybe. Which to a lot of people like $100,000, having $50,000 in the bank, seems like it's a lot, but what the tool I think differs from other tools is it calculates everything in your life, not just if it's good enough to buy the car, which is what I like about it. Um, so it'll think about like your food, your housing. It kind of puts factors in that maybe you potentially might not even have, but it's better to over-calculate than to under-calculate. So, with that being said, we got a 60 out of 100, which is a much higher than the last two that we've done. And it's saying consider the car price, APR, and your monthly budget before deciding. So, it says you have very strong savings which we do. Very high income, uh, longer loan reduces monthly payments but increases total interest paid, which is also very important. So that 7.2 would kick in and, uh, uh, talks about our 7.2 and where we live. So, which is also um, very important to keep in mind.\n\nNow, if I make it two years, it actually goes lower because now we're going to have very high payments even though we're paying less interest. So, let's say I have $100,000 in my savings... Or we'll do $40,000. I think it can't... Oh, they're saying the same. Oops, my bad. So, it just kind of can overall give us a good idea of, you know, what we need to look for in, um, our like purchasing decisions, and it just kind of highlights that for us.\n\nSo, if I say like, let's say I want to live in Australia, right? And um, actually, we'll do Canada. And we will do Toronto. Oh my god, I can't spell Toronto. Toronto and we're making $35,000 a year. We have $100,000 in savings. Our score went a little bit higher. So, in Canada, right now the average interest rate is 6.5%. Now, it is also important to keep in mind that the uh, AI kind of transfers the calculations to the currency that we are in the country for. So, um, this is Canadian dollars. Um, so it's a high but it's actually lower in terms of the US. So, putting that into perspective, it doesn't do big of a change. Um, but it says, you have a moderate income, longer loan reduces monthly payments, kind of the same stuff that it says, but it also says in Toronto it may change insurance, fuel, and parking costs which can affect the affordability. Which is really cool.\n\nSo, to kind of put in perspective for, or to analyze it under the DRIVER framework, the part that we're trying to Discover is our income, our savings, our location, our loan term, our country interest rates. Right? These are the things that are very important, the variables that will change our decision. We could have the same amount of money, but depending on what country and where you live and your other parts of your life's financial status, it can vary very deeply.\n\nUm, so it's very important to calculate that Risk to see why, and the AI can actually analyze everything with less of a bias than a human would, um, which is very nice. For the R part, which is Reason, it's how can we incorporate AI as the brains and make it 10 times smarter? As humans, if you were to give me these inputs, I could probably tell you very similar stuff to what the AI is saying right here, um, probably as a job of some sort that I would be paid for. So, you'd probably be paying the service. Here it's for free. You just put plug in your numbers. Um, as again, for me, maybe I have to actually search up the interest rates for places. AI can just pull them right away, um, making this just 10 times more efficient and overall just better, um, and saves a lot of people a lot of time and money.\n\nTo Implement, we used um, or I used personally coding. I used a mix of Java, HTML a little bit for the GUI, and another one called TextScript, I think. Um, those three combinations of code. I used AI to help build kind of a framework, and then I was able to input like which things I wanted to put on here, how I wanted the GUI to look like, um, and all that good cool stuff.\n\nFor the V part, which is Verifying, um, how can we confirm that AI is telling us the truth? Well, in fact, if you do search up, um, an interest rate for the United States, it's going to give you different ones, right? So, what the AI does is it calculates the average and will push it up or it will curve it up. And the reason we always want to curve up and overestimate is because it's better to have less of something than, um, or sorry, it's better to overreach on something than to have an under-reach. It's better if you had $50,000, you know, um, saved up than having $45,000 but thinking you had $50,000, if that makes sense, right? It's but it's better if you had, if you had $45,000, but you actually had $50. Always overcompensating is better. So, even the interest rates get rounded up because if you can afford an 8%, then you can certainly afford a 7%, but it wouldn't work the other way around.\n\nFor E, which is Evolving, kind of how can we make this tool useful? I think for project one or two, I did something very similar where I was like calculating stuff. I forgot what the exact thing that I was making the project do, but um, this one is what makes it really cool is there's actually an AI mentor kind of actually giving you answers that are more customized. It's giving you a score. It's kind of grading you on your financial choices that you've inputted, um, which is nice because you could really get a yes or a no reply, but this kind of hones in on more details and explains why it's saying no or why it's saying yes, which is cool.\n\nAnd kind of reflecting over it all, it's really important to know that AI can become the brain of any project, but it still requires our thinking. Um, during the initial steps when I was kind of creating a framework with ChatGPT and Gemini, they were getting a lot of values wrong. A lot of the interest rates, I think for one the US one was like 15% at one point, and I was like, that does not make sense. You have to verify stuff, you have to just continue to, you know, make sure you're getting the right answers. So, it's really important to research, research, research and make sure everything is going good. Even AI's code is not correct. Half the time there was a lot of bugs running that I actually had to go into, um, like an IDE, which is like compilers, which I used VS Code, and actually had to go in and, you know, work on that.\nBut, other than that, that's kind of all I have for this project. Um, I think it's really useful. I think it's really cool that AI can do so much cool stuff, and we're just getting the start. So, it's really important to use it smartly, but also use it very efficiently.\""
}