{
  "student_name": "None None",
  "org_defined_id": "037977947",
  "username": "guadara",
  "video_url": "",
  "transcript": "Hello everyone and welcome to my mini project 3. Today we will be discussing how to build an advanced AI financial tool for our own sake. So what we will be doing that makes it different, of course, is it's going to understand context, it's going to be able to explain complex concepts, provide personalized insight, and answer 'why' not just 'what.' So essentially we have to build on from our Mini Project 2.\n\nSome inspiration examples that we have is going to be our Financial Statement Explainer. That's the inspiration example I'm going to be going with, which is going to be basically quote-unquote 'What's wrong with said company?' In my video, I'm going to be talking about Apple.\n\nSo let's just get right into it guys. So I came to Zapier and I created an account, found how to get an API key and everything. Essentially we have a six-step flowchart. So it's going to trigger when a new record is created in the financial analysis data table. Then it's going to fetch the financial statement data using ticker symbols using a webhook. It's going to calculate debt-to-equity and current ratio from financial data using code used for this. So you know, total assets, liabilities, equity, current ratio, debt to equity, so on and so forth.\n\nAnd then we're going to have ChatGPT generate initial AI analysis narrative explaining financial health of each situation. And then we're going to refine the analysis for accuracy and tone to produce final explanation. Lastly, we will update the record in Zapier table with all data and analysis.\n\nNow I just want to walk through a quick example of this. So we had a catch hook, of course, here's our URL. Then we want to analyze and return our data. So our prompt is we need to extract company name and financial analysis request from the user query. If they're asking about a specific company financial statement, extract company name, ticker symbol, and analysis focus. So our output is the name of the company being analyzed, stock ticker symbol if provided, what the user wants to know about the company's financials, and is the financial statement analysis true if this is a financial statement company request.\n\nSo then we send this prompt to AI. Here's our prompt: 'You are an expert financial analyst specializing in company valuations and financial health assessment. Analyze Apple, which is our company Apple with our ticker of AAPL. What's wrong with the company? We need to provide a comprehensive final financial health assessment, red flags, key metrics, risks, concerns, opportunities, overall assessment. We need to be specific with this.'\n\nAnd then we want to run our JavaScript code, you know, to answer the following question we just asked. So we want to have an aggressive approach. We're going to talk about higher risk growth potential, individual stocks, growth funds, emerging markets, moderate approaches such as balanced risk and reward, 60/40 stock bond mix, diversified profiles and so on and so forth. We're going to build off comparisons.\n\nLastly, we're going to run the code again to be sure everything is smooth. Then we're going to create the record in our table.\n\nSo I actually made one earlier today, let's just go through with you guys. So earlier as I said we were going to talk about Apple, the ticker symbol is going to be AAPL. So for our raw financial data, we have it generated us a code. Basically, it has quick facts, you know: the revenue of Apple 394.33 billion, the market cap of it 3.5 trillion, the net income of 99.8 billion, total debt, fiscal year, and the cash and equivalents. So that's our raw financial data that it came up with.\n\nOur debt-to-equity ratio came out to be 1.43. Current ratio came out to be 1.02. And then here's our analysis narrative: 'Apple faces several concerning trends despite strong profitability. The company is experiencing declining iPhone sales in market keys, particularly China, where competition from local manufacturers is intensifying. Revenue growth has slowed significantly, with some quarters showing negative growth. The services segment while growing may not fully offset hardware declines. Additionally, regulatory pressures around App Store policies and antitrust concerns pose long-term risks. The company's heavy reliance on iPhone revenue (still about 50% of the total) creates vulnerability to market saturation and upgrade cycles extensions.'\n\nAnd our refined explanation will be: 'While Apple remains financially robust with strong cash flows and margins, several red flags warrant attention: 1. Slowing growth in the core iPhone business, 2. Increasing competitive pressure in China, 3. Regulatory headwinds affecting App Store revenue, 4. Market saturation in developed countries, and 5. Extended iPhone replacement cycles. The company needs to accelerate innovation in new product categories and reduce iPhone dependency to maintain long-term growth trajectory.'\n\nOf course, we have our company name which is going to be Apple. We have the question which I asked which was 'What was wrong with the Apple company?' It gave us a financial health status as Warning Signs. It identified the key issues such as declining revenues, market competition, and so on and so forth. Priority level is going to be High for this.\nAnd yeah, with this we were able to reflect in our video, you know, iterate, show that we improved our tool from version 1 to version 2 to version 3 by being able to simply run different AI financial tools to come up with, you know, debt-to-equity ratio, current ratios, financial data, AI analysis narratives, and so on and so forth. And yeah, thank you guys so much for tuning into my video and I appreciate it. Thank you.\""
}