{
  "student_name": "Sarah Alharthi",
  "org_defined_id": "034887536",
  "username": "salharth",
  "email": "",
  "transcript": "Slide 1 — Title \"Hi everyone, my name is Sarah Alharthi, and today I'll be walking through my analysis of Netflix's cost of capital using the DRIVER framework. I'll explain Netflix's current WACC, how issuing new debt affects it, how WACC changes for different types of projects, and finally how Netflix compares to Disney and Amazon.\" Slide 2 — DRIVER Overview \"I structured the presentation using DRIVER because it keeps the analysis focused and makes sure each part builds to a clear recommendation. I'll begin with defining the problem, then show the key inputs, interpret the calculations, validate the results, and finally provide the strategy Netflix should follow.\" Slide 3 — Define the Problem \"Netflix is evaluating a five-billion-dollar content investment. To decide if this is financially attractive, the company needs an accurate measure of its cost of capital. Leadership also wants to know if they should issue three billion dollars of new debt and whether content projects should use different discount rates depending on their risk. Lastly, Netflix wants to know how its cost of capital compares to competitors.\" Slide 4 — Research & Inputs \"These were the key inputs provided: Netflix's market cap is $200B, debt is $13B, beta is 1.3, and their bond yield is 5.8%. The corporate tax rate is 21%. For market conditions: the risk-free rate is 4.5% and the market risk premium is 5.5%. These inputs allow us to calculate the cost of equity using CAPM, the after-tax cost of debt, and the firm's capital structure.\" Slide 5 — Formulas \"The cost of equity comes from the CAPM formula: risk-free rate plus beta times the market risk premium. WACC is the weighted average of the cost of equity and the after-tax cost of debt, using market-value weights of equity and debt.\" Slide 6 — Cost of Equity \"Using CAPM, Netflix's cost of equity equals 4.5% plus 1.3 times 5.5%. This gives us 11.65%. This is high, but it makes sense because the streaming industry is volatile and investors demand higher returns.\" Slide 7 — Cost of Debt \"For the cost of debt, Netflix's BBB+ bonds yield 5.8%. After subtracting the tax shield, the effective cost of debt becomes 4.58%. This is significantly lower than the cost of equity, which will matter in the recommendation.\" Slide 8 — Capital Structure \"Netflix is almost entirely equity-financed. Based on market values, 93.8% of the firm is equity and only 6.1% is debt. This is unusually low leverage for a large media company — Disney has around 30% debt. This difference will help explain why Netflix's WACC is higher.\" Slide 9 — Current WACC (11.20%) \"When we combine the cost of equity, cost of debt, and the weights, Netflix's current WACC is 11.20%. This is above the industry range of 8–10%, meaning Netflix's capital is more expensive than its competitors.\" Slide 10 — WACC After Issuing $3B Debt \"If Netflix issues the three billion dollars of additional debt, their debt weight increases slightly and the new WACC becomes 11.13%. The decrease is small, but important — debt is cheaper than equity, and adding more debt lowers the overall cost of capital.\" Slide 11 — Project-Specific WACC \"Different content projects have different levels of risk. For U.S.-based content, the risk is lower, so the project-specific WACC is around 10.2%. International markets have more uncertainty, so their WACC rises to about 12.2%. Using project-specific WACC helps Netflix avoid undervaluing or overvaluing investments.\" Slide 12 — Peer Comparison \"When we compare Netflix to Disney and Amazon, Netflix clearly has the highest WACC. Netflix: 11.2% Disney: 8.2% Amazon: 9.5% This is mainly because Netflix's beta is higher and it uses far less debt than its peers.\" Slide 13 — Recommendation \"My recommendation is that Netflix should issue the three billion dollars of debt. The firm is severely under-levered, and adding debt provides a tax benefit, reduces WACC, and brings Netflix closer to an efficient capital structure. In the long run, Netflix should move toward a debt ratio in the 20–25% range, similar to Disney. This would meaningfully lower the firm's cost of capital.\" Slide 14 — Reflection \"Using the DRIVER framework made the analysis clear and systematic. The results show that Netflix can safely use more debt, and that project-specific WACC improves decision-making. The main limitation is that WACC changes with market conditions, so Netflix should revisit these calculations regularly.\" Slide 15 — Thank You \"Thank you for listening.\"",
  "video_url": "https://youtu.be/e6vXJpXcLbs"
}