{
  "student_name": "Vanessa Prodafikas",
  "org_defined_id": "035822663",
  "username": "vprodafi",
  "email": "",
  "transcript": "Hi, this is my analysis of Starbucks' proposed flagship roastery. I'll walk through the entire DRIVER process, show the Python model running, and present my recommendation. The core question is whether Starbucks should invest $12 million in a roastery expected to run for 10 years. Using the firm's 8.5% WACC, I need to determine whether the project creates value. The deliverables include an incremental cash-flow model, NPV, IRR, payback metrics, sensitivity tests, and a strategic recommendation. I gathered all the quantitative details: revenues, costs, depreciation, working capital needs, and terminal value. I identified the key finance concepts required: depreciation tax shields, after-tax operating cash flows, and discounting using WACC. This stage ensured I was clear on what data goes into the model before building anything. Before coding, I structured the analysis. I mapped a Year 0–10 cash-flow timeline, listed all assumptions, and outlined the transformations from revenue all the way to free cash flow. Then I planned a modular Python script that allows assumptions to be easily changed. Representing the work this way ensures transparency and prevents guesswork in the model. Here I'm showing the Colab notebook. I begin by loading libraries. Then I set up a parameter block containing all assumptions. Next, I constructed the cash-flow schedule, including revenue, COGS, labor, rent, marketing, depreciation, taxes, and terminal value. I implemented functions for NPV, IRR, discounted and simple payback, and profitability index. Finally, I ran sensitivity analysis for revenue down 20% and WACC plus or minus 2%. The model runs end-to-end and produces all required outputs. I validated the model by checking: Year 0 includes only investment and working capital. Depreciation is exactly $1.2 million each year. Working capital is recovered in Year 10 along with the terminal value. NPV and IRR point in the same direction. All numbers were consistent, so the model is reliable. I added scenario analysis to understand risk. With revenues down 20%, NPV drops significantly and IRR declines. Increasing WACC reduces NPV; decreasing WACC increases it. I also added a cash-flow bar chart to make the results clearer. Based on my base-case results: NPV: positive IRR: above 8.5% WACC Profitability Index: above 1 Payback metrics: reasonable given a 10-year horizon Financially, the project creates value. Strategically, a flagship roastery strengthens Starbucks' brand, enhances customer experience, and supports innovation. Risks include high fixed costs, revenue uncertainty, and the sensitivity results showing downside exposure if revenue underperforms. In the end, Starbucks should accept the project, but leadership should monitor revenue performance closely and manage cost overruns.",
  "video_url": "https://youtu.be/Spkm705ex6Y"
}