{
  "student_name": "Brody Springer",
  "org_defined_id": "037338416",
  "username": "spring48",
  "email": "",
  "transcript": "Hello, Brody Springer and this is for um Benjamin 310 with Professor Zay and then we're supposed to work through uh session 9 assignment with the the driver frame framework and I'm going to uh first work through the define and discover stage. Um the core task is to perform a comprehensive cost of capital analysis for Netflix in the context of a hypothetical 5 billion con content investment. The primary objective is to calculate the weighted average cost of capital at WACC for Netflix both currently and hypothetically after a new debt in uh insuence. Um and use this to inform the content investment decision. Uh the key questions to answer during this uh evaluation is what is network's uh Netflix's current WATC? What will the WATC be after the three billion dollar additional debt in uh insurance? And um how should Netflix's WAC ACC be compared to the ind industry peers Disney and Amazon? And should a project specific WACCC be used instead of a firmwide rate? And the last one is what is the optimal optimum capital structure strategy for for Netflix? Um for Netflix specific inputs, our market capitalization is $200 billion used for calculating equity the equity rate. uh total debt is $13 billion. The equity beta when we use our um our function or our our formula will be 1.3. Corporate tax rate is 21%. Bond yield percentage is 5.8% and the additional debt insurance is $3 billion. Market input uh risk risk-free rate is 4 4.5%, market risk premium is 5.5% which we use this to input for the CAPM uh formula. And then uh we use media industry WACCC range uh 8 8% to 10% as a benchmark for comparison. And then we'll um compare our peer inputs from Disney and Amazon. Um so the discovered required for formulas is WACC cost of equity and cost of debt. um which is the weighted average cost of capital, cost of equity and then uh after tax cost of debt. As we move on to our part of driver framework which is research in refined stage um we need to calculate co the current Netflix cost of equity um which we use the risk-f free rate and the equity beta and market risk premium to um figure out that the current cost of equity of Netflix is 11.65%. Um, and then we need to calculate current Netflix after tax cost of debt. Um, which we take the pre-tax cost of debt and then the corporate tax rate and multiply them together and find the app after tax cost of debt is 4.58%. Next, we need to determine the capital uh the current capital structure weights. Uh to calculate this we need the market value of equity which is $200 billion, market value of debt which is $13 billion and and then the total firm value which is 200 $200 $200 billion plus $13 billion is $213 billion. So for Netflix uh they have an equity of $200 billion which is 93% 93.9% weight and the debt is $6.10% with the $13 billion. And then as we continue on to calculate the current Netflix WACCC, um we figure out that the Netflix's current um um WACCC is 11.21%. Uh some some initial research refinement and the some um notes that we found out currently is our cost of equity is high due to the high um beta and equity weight. after tax cost of debt is relatively low to the BPP plus rating and tax shield. And then Netflix is heavily equity equity finance because it has a 94 around 94% equity rate rate. Um as we continue um uh we need to calculate the impact of the $3 billion debt instruments on Netflix's capital structure in WACC. Um the assumption of this calculation is that the cost of equity and after tax cost of debt remains constant as a marginal change in debt is unlikely to immediately change the company's credit credit uh rating or risk profile significantly. And so with this uh with this $3 billion debt insurance, the new debt would be um $16 $16 billion instead of $13 billion. And so the new total total firm value would be $216 billion. Um so the the new uh WACCC would be 0.1 11.13%. And then if we compare that to uh the current which was uh 11.21% we have an 08% reduction when we have this uh 3 billion debt insurance. Um as we compare it to um to the peers of Disney and Amazon um the WACC for Netflix was 11.21%. 21%. Disney has an 8.2%. Amazon Prime has a 9.5%. Um Disney Amazon both significantly have a lower uh WACC um than than Netflix because uh the equity weight weight is is less for both companies. Um uh the current WAC WACC for Netflix uh is the firm wide rate. Using this firm wide rate for all projects is appropriate only if the all projects have the same risk profiles the overall company. Um some required refinement um we need to estimate project risk. Determine the systematic risk associated with each content type. estimate a pure play beta which we need to find comparable uh public uh public traded companies that only focus on US content or only focus on international content and then um uh unlever/reieve beta um using the pure plays capital structure and then uh use um Netflix's target optimal uh capital structure. Um as we move on to um the I portion implement uh to simplify the simulation we we will make a standard assumption for this type of analysis cost of equity is 11.65% 65% until the debt level significantly increases. Um after tax cost of debt we'll use the 4.58% that we calculated prior and um we will test WACC at the current level the per benchmark level and the higher theoretical level. Um so at the current rate WACC result would be 11.21% the target rate of that weight would be target of 20% would uh decrease the WAC to 10.23%. 23% and then that's for target and then Disney's 30% debt rate weight would result in a 9.5% um which approaches um targets. Um and then the hypothetical 40% we'd have a 8.9 um% WACC. Um to reach a 20% debt weight and achieve a WACC of 10.23, 23 Netflix would need to uh issue $37 billion in new debt which is far more aggressive than the proposed 3 billion. Uh the WACC curve visualization confirms the initial hypothesis. Uh WCC declines sharply as Netflix moves away from its current low leverage position towards a more balanced structure. This decline is due to uh substituting high cost equity with low cost tax advantaged debt. simulation demonstrates that the $5 billion content investment should be funded with more than $3 billion in $3 billion in debt. It should be founded as a part of a larger strategic debt in insurance aimed at optimizing the capital structure. um as we verify um and validate information constant cost of debt as uh debt increases to the 20 to 30% target their risk of default rises if Netflix in in issues $37 billion in debt um their credit rating would likely be downgraded and then cost the constant cost of equity increased financial leverage makes this equity inher inherently riskier the equity beta should it increase as debt increases Um conclusion of verification the calculated WAC CCC of 8.9% of 40% debt weight is likely too low in a is likely too low in a real world scenario because the simulation ignores the rising cost of risk. The true optimal WACCC will be found at a leverage point where the benefit of the tax shield exactly offset the rising cost of debt and equity due to the higher financial distress. Um and then final recommendation uh the optimal strategy Netflix should more aggressively increase its leverage ratio from 6.1% to towards like the 20 to 30 debt range um and then lower its hurdle rate from 11.21% to 9.5 to 10.5% range. The $5 billion content investment decision should be excused as a part of a larger strategic debt insurance that optimizes the capital structure rather than just marginal $3 billion in debt proposal. Um um let's see here. Um as we move on to the E portion of driver um this stage of involvely uh involve is formally making the final recommendation acting on the findings uh officially we officially recommend that the $5 billion content investment be approved because uh it's expected return should easily exceed the WACC expect especially if Netflix executes the strategic debt insurance uh which lowers the hurdle rate. So if they in issue $37 million in uh in debt, they will um they will lower lower their hurdle rate which is the WACC. And then um key point we need to state that the investment should be financed via $37 billion strategic debt instruments rather than the $3 billion marginal debt that they had in the beginning. And then for the R, the last R and driver, um we recommend that uh that Netflix establishes periodic reviews to monitor uh its credit rating and check if the WACC assumptions remain valid. So is the is the hurdle rate actually going down when um when we issue this $ 37 this 30 billion $37 billion strategic debt instruments. Um if the cost debt rises too quickly then the firm must be ready to stop increasing leverage to prevent moving past the optimal capital capital uh structure. Thank you.",
  "video_url": "https://youtu.be/ahEcFhu3JOc"
}