{
  "student_name": "None None",
  "org_defined_id": "035626927",
  "username": "bergeror",
  "video_url": "",
  "transcript": "So the app that I have made in conjunction with the NAI and Google Gemini is a kind of financial advisor planning app. So first we'll execute the workflow and then fill this out. So I'm 21. I right now I can invest $1,000. Say I want to buy a house and I'll do medium risk in 10 years. Say I'll be 31. I feel like that's about a good time to stop renting. Um I have limited income for next two years as in school. So first we have an HTTP request that contacts Yahoo Finance and gets all the accurate data results for the market. It will then verify the results with GV not chat GBT sorry with Google Gemini and then this Gemini will extract the information from the financial profile. It will then compile that with the information from the Yahoo Finance and send that over to the second model which will compute everything, do all the math, figure out the best course of action for us and start to develop a plan. And after it's done that, it will then get a clear and concise message which it will display to the recommendations tab. If we go over here, it refreshes. So it'll give us a complete recommendation for buying a house. Um, so it gives us a hypothetical situation. Um, it's saying that I will need to be around age 35 to invest well into a house because 10 years must not be good enough. But still, I could change anything I want. If I didn't like these outputs, I could go back and try to fix it. I could re go back and interact with chat GBT if I needed to. And I think that AI changes the user experience here by making it a lot easier to get these financial results and learn more about our finances and what we're going to do in the future. The hardest part about the engineering was getting the displays to results, the results to display clear and efficiently because before it was giving me like a huge paragraph, multiple paragraphs and I was just trying to get a quick, clear and concise and this is about as good as I could get it while still having all the accurate information that I needed. Um, ethical considerations would be like how could someone misuse this to or if I get something wrong and the AI gets something wrong. Like the 35 I said I wanted 10 years but later on it says that I'm going to need more time if I'm looking forward to invest in a house. So if it screws somebody over that could reflect poorly on me. However, I have faith in the AI that I built and I would trust this with my own money as I've also used AI for aspects of my own life and I feel like it's reflected positively like I've researched how to like get a car that I've been looking for. So, I feel like this would be a good way to use the AI."
}