{
  "student_name": "Angel Guadarrama",
  "org_defined_id": "037977947",
  "username": "guadara",
  "email": "",
  "transcript": "Hello everyone and welcome to my Section 9 video. Today we will be discussing Section 6 of Section 9, Cost of Capital Analysis. So basically, once you calculate the weighted average cost of capital, WACC, for Netflix in connection with a hypothetical $5 billion market content investment decision, our analysis must determine the current WACC evaluate the impact of additional debt financing assets projects specific versus film firm wine discount rates and compare Netflix's cost of capital to industry peers as well so we have some parameters such as market capitalization total debt debt equity beta bond rating corporate tax rate current stock price market conditions such as risk free rates market risk premium media industry WACC range. We have contacts such as Disney capital structure, 70% equity, 30% debt. Amazon Prime Video uses Amazon corporate WACC of about 9.5%, so on and so forth. These are what's asked of us, what's required. We have to calculate current WACC, determine WACC after $3 billion debt insurance. Evaluate project -specific WACC, compare Netflix's to Disney and explain differences, recommend an optimal capital structure structure. And we're going to be using the driver framework to conduct all of this analysis. So first I want to pull up what I have, my driver framework. And first we want to define and discover. This is the T stage. In this stage we want to clarify that we are solving and gathering everything that's needed. The goal is to understand an applicant's cost of capital under its current structure. course after adding about three billion dollars of debt and for different types of content projects we also need to compare Netflix's WACC to competitors like Disney and Amazon and determine how capital structure choices influence strategic flexibility so that's our defined discovery part Netflix's cost of capital depends on three main elements one being the cost of equity two being the after -text cost of debt and three being the proportion of each in the capital structure We are given hypothetical by Real Estate Financial Inputs. Netflix has a market value of equity of $200 billion and a market value of debt of about $13 billion, so its financing is strongly equity-heavy. Its risk profile is presented to be an equity beta of 1.3 and its bond rating creates about 5.8% debt yield. Given a 4.5% risk -free rate and 5.5 % market risk premium, we can calculate the cost of equity using CAPM. In order to calculate the cost of equity, we must do ORF plus beta times MRP which is about 4 .5% plus the 1.3 times 5.5% that we have mentioned. This gives us about 11.65%. After our tax cost of debt, it uses the CODN tax frame. So the cost of debt is going to be after tax, of course. which is going to be about 5.8 percent and I want to multiply this by 1 minus 0.21 to get a percentage of 4.5 percent the capital structure weights users markets market values not book values so this tells us that the equity weight is going to be about 200 divided by 200 plus 13 which is equal to about 94 percent for equity weight and the debt weight is going to be 13 divided by 200 plus 13 which is about six percent these allows to compare netflix's current wcc its post that wcc after adding three billion dollars of new debt and then adjusting for product specific risks industry context matters because disney wcc about eight roughly eight point two percent and amazon prime's video using about nine point five percent roughly reflected from business models, risk profiles, and revenue diversification. Finally, the defining discovery stage clarifies in the strategic question is whether Netflix should continue leaning on debt historically, its primary source of content financing, or shift towards equity stability as it matures. This will depend on how additional leverage affects financial risk, borrowing costs, and investment flexibility. Moving on to review and reflects. Now we reflect on what this information means and what it tells us about Netflix's financial posture and strategic options. So from the calculations above, Netflix's current WACC is roughly about 11.3%, this is high compared to the industry's 10% range, and enormously higher than Disney's 8.2%. The main reason is Netflix's reliance on equity in its high beta, which shows investors see as a riskier streaming -only company with few diversified revenue streams than competitors like Disney, which also has theme parks, merchandise, and studios to stabilize earnings. They have more business ideas, essentially. We consider the impact of issuing $3 billion in new debt. The debt weight increases slightly but still keeps Netflix heavily equity-financed. The adjusted weights become roughly a new debt of about $13 billion plus $3 billion which equals $16 billion. The total firm value is going to go up by $16 billion as well, making it $216 billion. The new debt weighs about 7.4% and the new equity weighs 92 .6%. This hardly changes the capital structure enough to be meaningfully lower than the WACC, especially because adding debt could increase perceived risk and push Netflix's borrowing and costs higher the recalculated WACC after additional debt fall fails only slightly leaning around 11.1 percent still went so well above peers this shows this shows that mild leverage adjustments do not meaningfully reduce cost of capital for a firm whose valuation and beta are driven by business risk rather than debt levels when reflecting on project specific discount it becomes clear that U.S. content investment backed up by stable and subscriber bases should be used a slightly lower WACC than Netflix's corporate round of about 10-11%. International content, especially in emerging markets, has higher risk due to currency exposure, culture uncertainty, and weaker monetization models, and therefore should use a higher WACC cluster of about 12-13%. This approach keeps Netflix from underestimating risk on global projects. Comparing Netflix with Disney rules that Disney's fabricified revenue sources lowers beta and more balanced capital structure allow it to maintain a lower WACC. Netflix being more concentrated on single business line streaming faces higher market volatility, raising its cost of equity. Meanwhile, Amazon Prime uses Amazon's broader corporate WACC's about 9.5%, which benefits or Amazon's diversified flows the recalculated WACC after additional debt falls only slightly in the ending around 11.1 percent still well above peers it shows that now leverage adjustments do not meaningfully reduce cost of capital for a firm whose valuation and beta are driven by business risk rather than debt levels so when reflecting on project specific discounts it becomes clear that the u.s content investment investments backed up by stable subscriber basis should use a slightly lower WACC than Netflix's corporate around 10-11 percent In reflecting on all this, the key insight is that adding small amounts of debt does not meaningfully reduce Netflix's WACC. Instead, the company's risk profile, investor expectations, and business concentration are the major drivers. A slower, more strategic leverage increase paired with operational risk reduction and diverse fed revenue streams would have a much greater effect this sets the foundation for recommending an optimal capital structure in the implementation stage so for I for implement this stage puts analysis into concrete calculations and strategic conclusions on Netflix's current WCC is going to be below the cost of equity CAPM 4.5 % plus 1.3% times 5.5 % is about 11.65% and after-tax costs over that we're going to do 5 .8% times 1 minus 0.21 which gives us about 4.58% capital structure weights using the market values as you can see below the WACC is going to be equal to that 0.94% times 11.65 plus 0.006% times 4 .58% which equals about 10.94% plus 0.27 and if we round is up to the nearest tenth place we get 11.2 percent. Netflix's current WHCC is about 11.2 percent is about there is above the risk the industry is 8 .10 percent signaling that investors see it as a relatively high risk high volatility streaming firm. WHCC has from three billion dollars than that so for part b after new funds total debt rises to 16 billion here's equity debt total that weight equity weight assuming that that cost remains in 5.8 percent they might increase slightly due to leverage will hold constant for simplicity next to the BACC which is about 9.2.6 percent times plus times 11.65 plus 0.074 times 4.58 percent this law comes out to be about 11.13 percent results the WACC decreases from 11.2 percent to 11 .1 a very small drop that shows that because Netflix is still equity heavy small debt increases do not significantly significantly change its overall cost of capital project specified WACC Netflix should not use one the one uniform do you see for all content projects you know U.S. content investments these face lower risk due to the stable subscriber base comparison and Disney and explanation Disney has diverted revenue parks films merchandise for cruises more stable cash flows leads lower beta at least lower cost of equity uses about 30% debt giving tax shield and benefit benefits Netflix is not capturing a stronger credit rating reduces its cost of debt Netflix has a higher equity beta of about 1.3% concentration in a single volatile business line streaming a historically debt funded model but still has heavily equipped valued less diversified revenue streams is actually raises its WSEC relative to Disney and we got to verify this by the stage checks if the financial logic and strategic strategy fit Netflix's real constraints execute here we convert the insights into capital structure strategy strategy recommend strategies that should cautiously increase leverage over time but not aggressively this optimal approach is granted is a gradual shift paired with efforts should diversify revenue expand licensing gaming advertising tiers and life events so this closes out the driver's cycle by summarizing what netflix should be should do going forward and how it should apply the cost of capital framework Netflix's current WACC is about 11.2% as high for the media sector, reflecting its business volatility. Adding $3 billion of new debt bearish lowers the WACC, proving that equity risk, not leveraging structure, is a dominant cost driver because U.S. projects carry lower risk than foreign projects. Netflix should continue using differential discount rates of about 10 to 11% for U.S. and forward 30% internationally to allocate capital wisely. Compared to Disney's 8 .2% house and 9.5% netflix faces a premium because it had lags diversified cash flows in my opinion the company's long-term goal should be measuring a measured increase in leverage combined with operational diversification to lower its beta following the strategy will gradually reduce capital's cost of capital improve investment discipline and support sustainable long -term content spending. So we move on to my Google Collab. I asked Google Collab to generate some codes for me. I gave it the prompt, join the Expert Financial Data Python Notebook Generator, create a fully-readable Google Collab notebook Python that explains the following for Netflix, and put it in a little prompt using requirements and style. I use only standard Python packages available in Calab, put every calculation in the creative documented function, and use the following default hypothesis input values. Spits it all out. So this notebook provides a comprehensive analysis of Netflix's weighted average cost of capital, evaluates the impact of new debt, assesses project -specific WCCs, compares Netflix to peers, and recommends optimal capital structure strategy. and all things are based on hypothetical input values which can be easily adjusted for setups user inputs all information that's been recorded and input so we basically just input parameters financial calculation functions have been calculated so total capital is going to go to the market cap equity plus the debt market more equity was market category divided by total capital wait day equals that market divided by total capital calculate WCC unlevered the beta check when I was just current WCC generate this code Netflix cost of equity is about 11.65 % and after-tax cost of debt is about 4 .5% as we calculated Netflix's weight. Equity weight is about 93.9% while we calculated Netflix's debt weight is about 6.10% which is accurate. We used it to calculate Netflix's WACC after issuing the $3 billion of additional debt. As you can see, it spits up similar numbers than what we have. Current debt spread of about 1.3%, new bond yield, new after-tax costs of about 4.6% and so on and so forth. We must evaluate the project specific WHTC. So in order to do this, we must do international content projects, identify our risks, higher risk lower risk is u.s content projects method b of course add and remove project risk to premium to corporate wcc so on and so forth basically here it just shows everything that was calculated the u .s content method a is just a beta of about 0.5 percent making it 1.15 percent beta Virgin the basic will be about 10.44 percent international content as well it might be of course now we got something else compared netflix's w h c c to disney so the drivers of difference netflix's w h c c is 11.22 it's compared against disney's 0 .8 sorry 8.2 and amazon's 9.5 netflix is currently higher than disney this could be You might notice a higher perceived business risk, of course, as we mentioned earlier. Their cash flows aren't the same. They don't have as many ideas. Typically lower for diversified media and conglomerates like Disney. A more focused revenue stream or a different credit profile. They need to higher cost of debt. So recommended. And Netflix is also higher than Amazon's. massive scale dollars right across highly profitable segments like AWS and strong credit ratings as you can see recommended optimal capital strategy structure so using the hamlet model for cost of equity sensitivity in the case of about 0.5% for cost of debt spread widening optimal debt ratio would be about 30 percent medium minimum the VACC is about 10 .96 percent the cost of equity would be 13.6 percent with the cost of that being about 6.08 percent and the large beta would be well 1.66 here we have generated some visualizations to help So in summary, this analysis provides an overview of Netflix's weighted average cost of capital under various scenarios offering insight into optimal capital structuring and project evaluation. Current and future WSEC Netflix's current WSEC is calculated as this represents the average rate of return that the company expects to pay to all its capital providers, both debt and equity. If Netflix issues an additional billings in debt and the cost of debt remains constant, the WACC would adjust to WACC KD of about 2%. However, in a more realistic scenario where credit spreads widened and the cost of equity also increases with leverage to average costs, the WACC would become about 2% in new debt insurance. insurance is a little recap of all you know the market cap equity market day cost of equities cost of debt pre-tax and after tax weight equity and weight debt of all situations yeah thank you guys for coming in and tuning into my video and I appreciate you guys thank you",
  "video_url": "https://youtu.be/YA5kNpGTXak"
}