{
  "student_name": "Max Bradford",
  "org_defined_id": "036043612",
  "username": "bradfo27",
  "email": "",
  "transcript": "How's it going, Dr. Zang? This is Max Bradford. Um, in this uh session nine assignment, I'll present my cost of capital analysis for Netflix using the driver framework. So, let's get into it. For define, uh, the purpose of this analysis is to evaluate how Netflix should finance a hypothetical $5 billion uh, content investment. The key question is whether Netflix should have or or should issue an additional $3 billion of debt. Uh and how this affects uh its weighted average cost of capital or whack for short. I'll probably be referring to it as whack um from now on just so you know. So, my objectives are to calculate uh Netflix current whack and test the whack after the new debt, the new $3 billion debt, and then determine project specific discount rates, compare Netflix to Disney and Amazon, and then recommend an optimal capital structure. So, let's get into it. So, before coding, um I constructed the analysis into five steps. Uh first was to compute the cost of equity using the um capital asset pricing model. Second, compute the after tax cost of debt using Netflix's um BBB plus bond yield. Um and third, determine capital structure weights using market values um of equity and debt. The fourth is to calculate the weighted average cost of capital under both the current and revised debt debt levels. Uh and then finally to determine project specific um weighted um average cost of capitals for US and international content and compare Netflix's capital cost with major competitors. So that was for represent. As you can see, I have those down here. All right. And then so for implement, um, so as you can see here, I run my Python code. Uh, I begin by defining all the inputs. So Netflix is $200 billion market cap. Um, 13 billion in debt. Um, equity beta of 1.3. um as you can see here um uh and then the risk-free rate, the market risk premium and then the BBB plus yield. Um and then using these inputs, this the model calculates a cost of equity uh of of 11 point uh 11.65% and after tax cost of debt of 4 uh 58%. So let me see. I think those are probably down here as you can see here. Um so from there the script computes capital structure weights and produces a current um weighted weighted average cost of capital um of about 11.19%. As you can see um somewhere here I cannot find it apparently. Um but then after adding three billion in debt the whack decreases slightly to 11.1%. So as you can see here um and then uh this it decrease because its debt is cheaper uh than equity and then I also calculated project specific discount rates. Uh so US content uses a standard of whack while international content requires a higher whack of about 12.3% due to added country and currency risk. And then finally, I run a sensitivity model showing how whack changes as as Netflix uh increases increases leverage. So that's what you can see here. Um so the results so for validate that was my uh implement stage. Now for validate uh the results validate the economic logic. So Netflix's cost of equity is much higher than its after tax cost of debt. So modest increases in leverage um you know slightly reduced whack and then the sensitivity chart confirms a downward sloping whack curve at low debt levels um and then which is this is consistent with standard uh capital structure theory uh and the outputs are within expected ranges so industry whack averages 8 to 10% and Netflix higher whack uh is consistent with this higher volatility uh and less diversified cash flows. So then for Evolve um you know these results have important implications. Netflix can reduce its whack by adding some additional debt but it should avoid um excessive leverage that could intrude financial distress distress risk. Um, an incremental debt uh issuance helps Netflix finance large content investments at lower cost while maintaining strategic flexibility. Um, so project specific walk ensures that higher risk um international content is evaluated with an appropriately higher hurdle rate. And so for my reflect um and in conclusion um Netflix's current whack is around 11.2 um 11.2%. So this decreased slightly when the new debt was issued. Um but Netflix whack is higher than Disney's 8.2% and Amazon's 9.5%. Because Netflix uh operates with greater volatility and less diversification. So the optimal strategy for Netflix is to adopt a moderately uh levered um capital structure. So similar similar to Disney's range um while using project specific hurdle rates to evaluate international content um this structure definitely gives Netflix the lowest feasible whack without sacrificing financial stability. Yep. Thank you for listening and that's session nine.",
  "video_url": "https://drive.google.com/file/d/1mHDd4yyErXcKFEqsSnq0_ofozCMJAz7B/view"
}