{
  "student_name": "None None",
  "org_defined_id": "037980105",
  "username": "bmengels",
  "video_url": "",
  "transcript": "0:00 Hello and welcome back to our third main project, main project 3. And so in this project we are looking at building an advanced AI fans tool.\n0:12 Um, this one I built, this two I built, I use to solve a common problem. And then I call it investment paralysis is what I'm going to call it.\n0:21 Um, so here, this tool, it doesn't just, it won't just calculate, but it also explained the why behind certain complex financial trade offs.\n0:30 Um, so. So using the driver method, once again, we go down, we have some features and we have, uhm, the smarter approach.\n0:39 So again, the goal of this was to make the tool, uh, the AI finance tool, intelligent, not just faster. So we have the smarter approach, um, for certain scenarios.\n0:49 And the Y behind that scenario. Here's, we go through the I, we have the logic and tool use, uhm, we have, you know, integration of V1 to V2.\n1:01 And I also used, obviously, Google Gemini for- this, uhm, made Project 3. So here we get to the input values, or variables.\n1:09 Uhm, so with these, you know, this tool analyzes not only your, uh, your cache amount, uhm, but also your goals, like, for example, buying a house in this.\n1:21 In this input stage. Uhm, but also your risk score, and it gives you a personalized, uh, strategy you could even say, because it is different for every person.\n1:32 Uhm, so, you know, looking at this, uhm, we have- a full workflow as we scroll down, and we start to see these come in place, and we're looking for this right here, the JSON output requirement.\n1:46 So we have our code here. Uhm, it's demonstrating multi-step reasoning. Through three key phases. The first one is our external data.\n1:57 Uhm, in the HTTP request node. So that's our 10-year treasure yield. Uhm, which is right here. Oop, right. Here. And so that's our first step.\n2:11 Uhm, the next part of the node is the scenario generator. So, uhm, with this tool, I used a prompt, uh, requiring a strict JSON-structured output to guarantee.\n2:23 Uhm, Ahh. What's the words? Uhm, you could use it to guarantee that analysis is consistent, uhm, and so that's machine readable.\n2:37 So that's the second step. Uh, the third step is in, The guard rail and recommendation engine, which is a little bit lower, uhm, as we scroll down here.\n2:47 Uhm, that basically analyzes this JSON code and it's scenarios and it's like the best fit based on the user's risk score.\n2:57 Uhm, and other factors, other goals, or uhm, pins along those lines. So as we go down, uhm, we see the completed JSON snippet.\n3:09 And, uhm, so we ran a case. For example, we ran 10,000 by house in, let's say, seven years with a score of eight.\n3:18 Uhm, and so with this, uh, here's our, our guardrail final, final recommendation product. It recommended, uhm. With all the information, uh, it recommended an aggressive, um, growth scenario, and it justifies it.\n3:37 Why? Uhm, so. Uhm, but yeah, and that's just a l- little snippet of this app on-on why it does work.\n3:50 Uhm, again, the tool analyzes the why. Uh, it clearly outlines the trade officer risk. In this case, it's higher, uh, for potential.\n4:00 To be an inflation over this, uhm, example, which was, if we go back to it here, was seven years. Oop, here we are, seven years.\n4:12 And we also have our 10-year treasury yield, which is 4.5%. And that comes into play. Uhm, so using the guardrail, uhm, we're ensuring safety and a clear disclosure.\n4:24 Uhm, so, at the end of the day, this tool is not only just a finance tool, but it's an- intelligent and can make decisions based on your specific scenario and example, and it'll write it from a high or low risk tolerance or risk score, so.4:44 But yes, that is it for this mini project three. Thank you so much for- for watching, and I will see you in the next video."
}