{
  "student_name": "Princess Meshram",
  "org_defined_id": "036277056",
  "username": "pmeshra",
  "email": "",
  "transcript": "Hi, my name is Princess Meshram and this is my Session 10 Starbucks capital budgeting assignment. In this project I'm evaluating a proposed 10-year Starbucks flagship roastery. The core question is: if Starbucks spends about twelve million dollars today, does this project create value for shareholders? I'll walk through the case assumptions, the Python model I built in Colab using an AI assistant, the base-case results, the sensitivity analysis, and then end with my recommendation and key risks, using the DRIVER framework. For structure, I'm following DRIVER: first I Define and Discover to understand the assignment and the inputs; then I Represent the cash-flow logic and metrics; then I Implement the model in Python; after that I Validate that the outputs make sense; then I Evolve the analysis with scenarios and visuals; and finally I Reflect with a recommendation and what I learned. In Define and Discover, I turned the case into a simple story. Starbucks is considering a flagship roastery with a ten-year life. At Year 0 there is an initial investment of twelve million dollars in building and equipment, depreciated straight-line over ten years, so depreciation is 1.2 million per year. On top of that there is half a million dollars in working capital, mostly inventory and cash in the store. That working capital is a cash outflow at Year 0 and is fully recovered in Year 10. Revenues start at eight million in Year 1, then increase to eleven million per year in Years 2 through 5, and then normalize to nine million per year in Years 6 through 10. On the cost side, cost of goods sold is forty percent of revenue, labor is two and a half million per year, rent and utilities are eight hundred thousand per year, and marketing is three hundred thousand in Year 1 and one hundred thousand per year from Year 2 through 10. The corporate tax rate is twenty-five percent. At the end of Year 10 we assume a terminal value of three million dollars. Starbucks' weighted average cost of capital, which is also the hurdle rate for this project, is eight-and-a-half percent. In Represent, I wrote out the cash-flow logic and the formulas. For each operating year, EBIT or operating income is revenue minus the cash operating costs – that is COGS, labor, rent and marketing – minus depreciation. Taxes are simply EBIT times twenty-five percent. NOPAT, net operating profit after tax, is EBIT minus tax. To get from profit to cash I calculate operating cash flow, which is NOPAT plus depreciation, because depreciation is non-cash and only creates a tax shield. From there I move to free cash flow. In Year 0, free cash flow is negative twelve million minus the half-million of working capital, so roughly negative twelve-and-a-half million. In Years 1 through 9, free cash flow equals operating cash flow because there is no additional capex or working-capital change. In Year 10, free cash flow equals operating cash flow plus the three-million terminal value plus the recovery of the half-million working capital. These free cash flows are what I discount at the eight-and-a-half percent WACC to compute the decision metrics: net present value as the present value of all cash flows; internal rate of return as the discount rate that makes NPV equal zero; simple payback as the number of years needed to recover the initial outlay in nominal cash; discounted payback as the time to recover it in present-value terms; and the profitability index as the present value of future free cash flows divided by the initial investment. Once that structure was clear, I could code it. In the Implement step, I used Python in Google Colab and followed the KISS principle. At the top of the notebook I created a ProjectParameters section where I entered all the case inputs: the twelve-million capex and ten-year life, the half-million working capital and three-million terminal value, the revenue schedule for the first year, years two to five and years six to ten, the cost structure with forty-percent COGS, two-and-a-half-million labor, eight-hundred-thousand rent and the marketing pattern, and finally the twenty-five percent tax rate and the eight-point-five percent WACC. I also calculated straight-line depreciation there as twelve million divided by ten, which gives 1.2 million per year, so the rest of the code can just reference a single depreciation number. To build this quickly but still in a way I could explain, I used the AI assistant in Colab with a prompt that said: here is my Session 10 Starbucks capital budgeting assignment; write simple, well-commented Python code that builds the ten-year free cash flow schedule, calculates NPV, IRR, simple and discounted payback, and PI using a WACC of eight-point-five percent, runs sensitivity with revenue down twenty percent and WACC plus or minus two percent, and creates charts for free cash flow by year and NPV across scenarios, using the KISS principle and DRIVER framework. That generated a first version of the model. I then went through it, simplified anything that felt too fancy, and added comments so each piece lines up with the DRIVER stages. Below the parameters I defined a series of small functions rather than one big block. A function called get_cash_flow_details takes a year and a revenue multiplier and calculates that year's free cash flow. It pulls the correct revenue for that year, subtracts the cash costs, subtracts depreciation to get EBIT, applies the twenty-five percent tax, then adds depreciation back to get operating cash flow. In Year 10 it also adds the terminal value and the working-capital recovery. Another function, build_fcf_schedule_list, loops from Year 0 to Year 10 and builds the full list of cash flows from CF0 through CF10; for Year 0 it uses the negative twelve-and-a-half million initial outlay, and for Years 1 through 10 it calls get_cash_flow_details. I wrote npv_plain to discount each cash flow at a given rate and compute NPV, and irr_approx to search for the internal rate of return where NPV is closest to zero. A function called calculate_payback computes both simple and discounted payback, depending on whether I discount the cash flows first. Finally, calculate_metrics combines everything into a single dictionary that contains NPV, IRR, simple payback, discounted payback and profitability index for any cash-flow schedule and discount rate. Keeping the model structured like this makes the Implement step modular and easy to understand. In the Validate stage, I check that the base-case results make sense. The base-case free cash flow schedule printed from the model, in millions of dollars, looks like this: Year 0 is shown as minus twelve million, representing the minus twelve-and-a-half-million initial outlay rounded in the table. Year 1 is plus one million, which is the launch year with heavy marketing and eight million of revenue. Years 2 to 5 are plus three million each year; these are the peak operating years with eleven million in revenue and lower marketing costs. Years 6 to 9 are plus two million each year as revenue normalizes to nine million and free cash flow is smaller. Year 10 is plus five million, combining normal operating cash flow with the three-million terminal value and the half-million working-capital recovery. The free-cash-flow bar chart tells the same story visually: a big negative bar at Year 0, steady positive bars in the middle years, and a large positive bar at Year 10 when we exit the project. Right underneath the schedule, the notebook prints the core capital-budgeting metrics at an eight-and-a-half percent WACC. The net present value is two million six hundred ninety thousand eight hundred and one dollars. The internal rate of return is 12.84 percent. The simple payback period is 5.28 years. The discounted payback period is 8.21 years. The profitability index is 1.215. To validate, I ask whether these numbers line up with finance intuition. NPV is positive and IRR is above the eight-and-a-half percent hurdle rate, so in the base case the roastery creates shareholder value. A profitability index greater than one means the present value of inflows is larger than the cost of the outflow. The simple payback of about five-point-three years feels reasonable for a ten-year project, but the discounted payback of about eight-point-two years tells me that most of the economic value is earned late in the project, which is an important risk signal. So the Validate step says the model is internally consistent, but value is back-loaded. In the Evolve stage, I stress-test the model with scenarios. Using the same functions, I run four cases: the base case with original revenues and WACC of 8.5 percent; a revenue minus twenty percent case where all revenues are multiplied by 0.8 to simulate weaker demand; a low-WACC case at 6.5 percent; and a high-WACC case at 10.5 percent. The sensitivity table shows, for each scenario, the NPV, IRR, simple payback, discounted payback and profitability index. In the base case, NPV is approximately 2,690,801 dollars, IRR is about 12.84 percent, simple payback is 5.28 years, discounted payback is 8.21 years, and PI is 1.215. When revenue falls by twenty percent, NPV drops to about negative 3,084,359 dollars, IRR falls to roughly 3.14 percent, simple payback stretches to around 9.33 years, discounted payback does not occur within the ten-year life so it is effectively not achieved, and PI falls to about 0.753. In the low-WACC scenario at 6.5 percent, NPV rises to approximately 4,236,552 dollars, IRR stays the same because the cash flows have not changed, discounted payback improves to about 7.27 years and PI increases to around 1.339. In the high-WACC scenario at 10.5 percent, NPV is still positive, in the low one-million-dollar range; payback periods lengthen slightly, but the project remains value-creating. The NPV sensitivity chart makes this very clear: the base-case bar is above zero, the revenue minus twenty percent bar drops below zero and is the only negative one, and the WACC 6.5 and 10.5 percent bars both stay positive. At the bottom of the notebook I also print a short sensitivity-impact summary: a twenty-percent reduction in revenue turns NPV negative, which highlights revenue as the critical risk; even with WACC increasing to 10.5 percent, the decision remains \"accept,\" so the project is robust to realistic changes in the cost of capital. That completes the Evolve stage of DRIVER. Finally, in Reflect, I combine the numbers and the strategy into a decision. Financially, in the base case, the project has a positive NPV of about 2.7 million dollars, an IRR of 12.84 percent, comfortably above the 8.5 percent WACC, a profitability index of 1.215, and reasonable payback periods given the ten-year life. So from a pure capital-budgeting standpoint, the roastery creates shareholder value. Strategically, this isn't just any store; it is a flagship roastery that supports Starbucks' premium brand, offers a destination experience and likely has halo effects on the rest of the network. However, the risk analysis shows that the project is very sensitive to revenue. A twenty-percent miss in sales turns NPV to about negative 3.1 million and IRR to only a little over three percent, well below the hurdle rate. The cost-of-capital risk is moderate: across a WACC range from 6.5 to 10.5 percent, NPV remains positive. The discounted payback of 8.2 years means value is back-loaded; if the store underperforms or closes early, Starbucks may not fully earn its required return. Putting this together, my recommendation is to accept the roastery project under the base-case assumptions, but only if management is confident they can achieve the revenue forecast. They should closely monitor traffic and average ticket size in the first few years, adjust marketing, pricing or operations quickly if revenue trends toward the minus-twenty-percent scenario, and recognize that this is a long-term branding and cash-flow play, not a quick payback. To close, a few things I learned from this assignment: using Python forced me to translate the capital-budgeting formulas into code, so NPV, IRR, payback and profitability index became functions I could reuse and stress-test; the 8.5 percent WACC acted as a clear hurdle rate, and changing it in the code instantly showed how sensitive NPV is to the cost of capital; comparing simple and discounted payback highlighted why time value of money matters, because this project looks much safer in nominal terms than in present-value terms; and the scenario analysis made the key message obvious, that for this roastery, revenue accuracy matters more than fine-tuning WACC. Overall, using the DRIVER framework and an AI-assisted Colab notebook made the capital-budgeting process structured, transparent and easy to explain even to someone with only basic finance knowledge. Thank you for listening.",
  "video_url": "https://youtu.be/_1ANjylbOJ8"
}