{
  "student_name": "None None",
  "org_defined_id": "037279221",
  "username": "rathod3",
  "video_url": "",
  "transcript": "0:00\nHi, so this is my mini project three.\n0:04\nSo for this project um I sent in a\n0:06\nprompt into Google AI studio saying that\n0:09\nyou are an expert AI investment analyst\n0:11\nspecializing in corporate finance and\n0:13\ncapital budget budgeting decisions. Your\n0:15\ntask is to analyze the provided project\n0:17\nmetrics which are derived from a capital\n0:19\nbudgeting model. You must generate a\n0:21\nconcise strategic report that explains\n0:23\nthe decision rule risk and strategic\n0:25\nfit. So for the um input data that said\n0:28\nthis app should have um I said it should\n0:30\nhave your um project horizon in years,\n0:33\nyour working capital investment WCC,\n0:35\nyour base operating cash flow, your\n0:37\ngrowth rates, inflection years, terminal\n0:40\nvalues, net present value and internal\n0:42\nrate of return as well as some other\n0:45\nstuff. And then I told it that if NPV is\n0:49\ngreater than zero and IRR is greater\n0:51\nthan WCC then you should accept it. If\n0:53\nnot then reject it.\n0:56\nAnd then it should give a recommendation\n0:57\nlater on. So here is the app that I\n1:00\nmade. So as you can see you have all\n1:03\ninputs where it like says initial capex\n1:05\nworking capital investment wcc your\n1:08\nhorizon of years um base operating cash\n1:10\nflow phase one growth inflection years\n1:13\nphase 2 rate and to total terminal\n1:15\nvalue. And then up here um it gives your\n1:18\nnet present value your IRRa and payback\n1:20\nperiods. So for these numbers, you're\n1:23\nable to adjust them and change them\n1:25\nhowever you like. And as you can see, um\n1:28\nthe if I change the initial capex from\n1:30\n100,000 to just a,000, your IR changes.\n1:34\nSo for this scenario, we're going to be\n1:36\nusing 100,000. So um the NPV is 1.5\n1:40\nmillion over that and internal rate of\n1:43\nreturn is 138.04% and payback period is8\n1:47\nyears. And there's a cash flow\n1:49\nprojection that shows how in year zero\n1:51\ncash flow is -200. In year one, it's\n1:54\n250K. In year two, it's over 260K. And\n1:57\nthen as you get to year five, it's over\n1:59\n1.4 million. Then there's investment\n2:03\nanalysis. So if I click click on\n2:04\ngenerate report, it gives me this\n2:07\nrecommendation saying that I should\n2:09\naccept this project because the NPV of\n2:11\n1.5 is positive and is greater than\n2:15\nzero. And also the IRRa is an\n2:18\nexceptional 138.04% which is drastically\n2:21\nhigher than the weighted average cost of\n2:23\ncapital which is why you should accept\n2:24\nthis project. Um it also gives like risk\n2:27\nfactors like some risks that are in here\n2:29\num\n2:31\nlike um a critical risk factors the\n2:34\nassumption around the inflection year um\n2:37\nand stuff. And so someone who would use\n2:39\nthis is someone who is um working and\n2:43\nthey're trying to see if what benefit\n2:45\ntheir company will have by taking on\n2:47\nthis project. Maybe someone like a\n2:49\nconsultant um seeing if what project is\n2:52\ngood for the company. And why is it\n2:54\nuseful is because instead of just um\n2:59\ninstead of just like trying to like\n3:00\nfigure stuff out on your by your own,\n3:02\nyou have this app where you just like\n3:04\ninput your numbers in and it creates a\n3:06\nanalysis for you that's fast and quick\n3:08\nand easy to understand as well. Thank\n3:11you."
}