{
  "student_name": "Abha Gupta",
  "org_defined_id": "037604525",
  "username": "gupt1107",
  "email": "",
  "transcript": "Hi, my name is Aba and this is my um section 8 assignment for the management 310 class. Um in this assignment I'll be analyzing the GameStop GME um short squeeze of 2020 2021 as a case study in market efficiency. So, the goal of this assignment is to verify whether the professor's statement, GameStop traded at 4 cents in August 2022 and reached $483 by January 2021, is accurate and then use this event to test which forms of the efficient market hypothesis were violated. I'll also evaluate whether rational investors could have systematically profited from this event and whether behavioral finance provides a stronger explanation than the traditional EMH analysis. Um and then just as an overview um I used Google Collab and also um used a AI chatbot to ensure that my code was as efficient as possible and answered all the assignment questions correctly. And then I also implemented the driver framework of define, represent, implement, validate, evolve and reflect. Um so just to start off um I defined the scope in the hypothesis. So in the efficient market hypothesis, the EMH has three forms. There's a weak form where past prices and volumes cannot predict future returns. There's a semi- strong form where prices fully reflect all public information immediately. And then there's a strong form where even private or insider information is incorporated instantly. So my main objectives are to verify the price claims using real data, evaluate which forms of efficiency failed, test whether the abnormal returns exist existed and then link these results to behavioral explanations. Um and then I also just implemented I kind of represent the process visually. So the step one where I fact check um step two where I visualize step three where I model and then step four where I quant quantify. Um planning these stages is kind of just mapping out the driver framework um to make sure I'm designing my analysis before coding it. So initially I just started off by implementing all my different um Python libraries so that I could use it in my analysis. And then in this code block I went on to show how um this downloads daily open high low close volume data for both GameStop and the S&P 500 ETF which is just my market proxy. And then I kept unadjusted prices for factchecking and adjusted closes for returns. Um and that's just put over here. I also just have anything if the data download failed. um and then the daily returns from adjusted close as a percent change. From there, I defined a function called a month slice. And what this does is it isolates August 2022 and January 2021 data to verify the professor's numbers. And as a result, it shows that the August 2022 adjusted closes around $4 to5, not 4 cents. The January 2021 intraday high is $483, which is accurate. And the current price is around um uh oops, the current price is around $25, which is roughly correct. And I think the 4centent confusion arises because the postsplit adjusted prices scale historic values down by four times. Um to continue I made a section of the code where the we can show the plot of the GME's adjusted closing price since mid 2022. So looking down at this plot over here, the dashed vertical line over here, oops, it zoomed in. um shows that before September 2020 prices hovered around $4 to $5 and then um there's an upstick which follows kind of Ryan Cohen's um which could be the key event um 13% stake disclosure and then in late 2021 the price explodes from $20 to nearly $500 reflecting the Reddit possible Reddit driven short squeeze. Finally, such a discontinuity signals a semi- strong form efficiency breakdown. Prices did not just adjust smoothly to public information. Then we went on um to make a volume plot. This chart tracks trading volume. So at the squeeze peak volume searches 10fold validating reports of explosive retail activity. Economically volume spikes this large reveal hurting and attention bias which is behavioral not inforational forces. From there we made this OS regression estimates which shows the normal relationship between GME and the park. Um the formula used for it is R of GME equals A plus beta R of spy plus epsilon. The deviations um from this are expected are are expected return are abnormal returns ar by accumulating them through time we obtain car a key event study. We go on to make a function called event window. What this does is it plots centers a plus or minus 10day window on an event and tracks the cumulative abnormal return. So if we considered the Cohen stake which happened in um 0901 2020 the car of it shows that during September 2022 cohen a small positive car leads to a modest efficient adjustment. Then in January 2021, the squeeze, the car rockets upwards um with the abnormal statistically significant P is equal to zero. And then in February of 2021, car trends negative. Um this is the January 2021 squeeze. and then car turns negative showing correction once the frenzy subsided. These visuals demonstrate that the abnormal performance was both large and temporary. The t test is also shown below each graph to show that there was a statistical breakdown for each section. Um we also made a volume spike metric um function and what it does is numerically it shows the squeeze peak around 10 to 12 times higher volume than the prior 60-day average which quantifies retail dominance. Volume spikes this extreme reinforce that behavioral hurting are overwhelmed by fundamental trading. And then in my validate section, I interpret um the results relative to the EMH and behavioral finance. So for the weak form, the past prices shouldn't predict future returns. The evidence of it was that there is no pre-event drift. So the verdict is that it holds. For the semi-rong, it means that public info priced instantly. So large significant AR and C at January 2021. with the evidence. This verdict shows that it was violated. Finally, for the strong form, the prediction is that even private info priced in um with the EV even private info is priced in. The evidence for this is that hed hedge funds are lost, which shows that constraints blocked arbitrage. The verdict is that it's violated in practice. Um the market behaved efficiently under normal conditions but failed under extreme social coordination. Rational traders could not exploit the mispricing. So Robin Hood's buying restrictions and extreme borrow costs and gap risk limited arbitrage. These are classic limits to arbitrage. In my evolve section, some future extensions that could deepen the study is using intraday data for microructure analysis, examining different option markets, integrating Reddit sentiment or Google trends as explanator explanatory variables, and applying multifactor models to separate risk versus behavioral drivers. So to conclude, let's reflect on what this assignment demonstrated. First, the statement that the GME traded at 4 cents in August 2022 was incorrect. Actual unadjusted prices were around $4 to5 with the discrepancy due to split adjusted data. The $483 high in January 2021 was actually correct and today's price near $25 is roughly accurate. The plots the plots and tests together reveal a pretty straight story. The adjusted close plot showed how prices stayed flat and then almost exploded almost overnight. A visuals marker to of a semi- strong inefficiency. The volume plot proved that this was a behavioral crowd event with trading activity increasing about 10fold. The car plots confirmed statistically significant abnormal returns concentrated around public highly discussed events. The t test quantified that those returns were not random noise but genuine short-term deviations from fair value. Finally, the volume spike metric provided a numerical link to a narrative retail narrative retail order flow overwhelmed professional liquidity. To summarize these findings, the weak form EMH held prices were not predictable from past data. The semi- strong EMH broke. Public information from Reddit and short interest was not efficiently priced in. Finally, strong form EMH failed in practice. Even informed hedge funds couldn't arbitrage mispricing due to constraint. Now, could rational investors profit systematically from this? I would say no. The combination of brokerage limits, capital constraints, and extreme volatality made any arbitrage opportunity unexploitable. This underscores that inefficiencies can exist without being tradable, which is a central insight of behavioral finance. Now, behaviorally, this event showcased hurting, FOMO, attention cascades, and social reinforcement. Traders were guided less by cash flow expectations and more by group identity and emotion. And even though the market eventually reverted towards fundamental value after the frenzy, GME stabilized between 20 and $30 within analysts fair range value fair r fair fair value range of $10 to $40. That rein version reinforces that EMH is not obsolete. It's just conditional. In the short run, markets can be socially irrational. In the long run, they are self-correcting. The GME episode doesn't prove disprove EMH but rather illuminates its boundaries. Market in efficiency depends on human behavior, information flow and structural frictions. When any of those break, efficient efficiency temporarily fails. Now from an analytical standpoint, this product project taught how empirical finance tool, data retrieval, regression modeling, event study methods can rigorously test financial theory. It also showed why complete understanding of markets must integrate both quantitative analysis and also behavioral insight. Um in summary, the Gamestock the Gamestock um situation proved that markets are efficient until they aren't. Efficiency is not a binary state but a spectrum influenced by psychology, technology, and constraints. Understanding those instruct interactions is what turns financial theory into real world insight. Thank you.",
  "video_url": "https://youtu.be/rsEadz3nbJc"
}