{
  "student_name": "Vanessa Prodafikas",
  "org_defined_id": "035822663",
  "username": "vprodafi",
  "email": "",
  "transcript": "Hello — I'm Vanessa Prodafikas. For this analysis I tested market efficiency using the GameStop short squeeze from mid-2020 through early 2021. My first task was fact-checking. The assignment claimed GME traded at four cents in August 2020 — that's incorrect. Historical data show August 2020 closes roughly between one and one-sixty-seven dollars; August 31, 2020 closed about $1.67. After correcting the data, I framed the main research question: did the GameStop episode violate weak, semi-strong, or strong form EMH, and could rational investors have systematically profited? Here's the plan I implemented. I use daily adjusted prices for GME and SPY from July 1, 2020 to March 31, 2021. I estimate a market model — CAPM-style — in the pre-event window from August through December 2020 to get alpha and beta. Then I compute abnormal returns as actual returns minus expected returns (alpha plus beta times market return). Event windows include Ryan Cohen's September disclosure, the Reddit surge in late January 2021, and the peak with broker restrictions on January 28, 2021. Now I'll show the code in the notebook. The notebook downloads GME and SPY, computes daily returns, estimates the market model in the August–December 2020 estimation window, and prints alpha and beta. We then compute expected returns, abnormal returns, and cumulative abnormal returns, and mark the three major event dates on the price series. On screen you can see the adjusted close with red vertical lines for the key events. Notice the massive late-January spike that diverges dramatically from prior levels. Next, I ran statistical tests. I performed a t-test on the full abnormal return series and a focused t-test on the ±10 day window around the Reddit surge. Both t-tests evaluate whether abnormal returns differ from zero. I also bootstrap the CAR for the ±10 day window to get a 95% confidence interval. The notebook prints the t-statistics, p-values, and the bootstrap confidence interval. The p-values are small for the event window, indicating the abnormal returns during the squeeze were statistically significant and not just noise. This is evidence that the semi-strong form of EMH did not hold during the event window. Why did prices diverge so much? My interpretive analysis points to behavioral and structural drivers. On the behavioral side, retail investors showed herding, overconfidence, FOMO, and anchoring on short interest figures. Momentum dominated as traders chased gains. Structurally, short interest exceeded float, borrowing costs and margin calls forced forced covering and created feedback loops, and broker restrictions interrupted normal arbitrage flows. Hedge funds under stress engaged in risk shifting to recover losses, illustrating the asset-substitution problem under leverage. To conclude: prior to January 2021 the weak-form EMH broadly described price behavior; however, the semi-strong form was violated conspicuously during the short squeeze because public signals and fundamentals did not explain the dramatic, persistent abnormal returns. Strong-form EMH is not directly proven or disproven here — insider trading evidence is limited — but market frictions and collective behavioral dynamics explain a large part of the anomaly. From a practical perspective, ex-ante systematic, risk-adjusted profits were limited by high costs and tail risk; most profitable strategies are visible only ex-post. That ends my DRIVER-structured analysis. The notebook exports a CSV of results and a summary file for submission. I will attach the historical price snapshot used to correct the August 2020 price and submit the Colab notebook, the CSVs, and this recording. Thank you.",
  "video_url": "https://youtu.be/ZyfcDAaStZk"
}