{
  "student_name": "Spencer Beebe",
  "org_defined_id": "034593722",
  "username": "beebe9",
  "video_url": "https://youtu.be/EtXmpFkkX48",
  "transcript": "Alright, welcome to my session 11 assignment. Uh, so this week we're talking about corporate financial decision analysis. Uh, so just looking at the question here, we're evaluating Apple's hypothetical $90 billion repurchase. Umm. So I guess we'll just get started going through the driver framework here. Starting with define and discover. So Apple proposes a $90 billion one year share repurchase, which is about 10% of the market cap given the snapshot. Uh, key inputs that are, you know, given here? Umm. You know the cash investments, annual free cash flow, the share price, shares outstanding, what debt they have, umm. Basically, it's just, uh, it's just giving us all the information that we need to create this analysis here. Uh, so for the R stage represent uh, we just got the inputs here again, all the Givens, umm. And then we can do all the hand calculations. So I did all that over here. Uh, I can pull this up. So shares repurchased, Umm. It's about 486 uh million shares approximately uh new shares outstanding it's about 15 billion uh, so quite a few implied earnings and EPS using the PE ratio uh. It's a comes out to 6.16 uh, per share and then the total earnings off of that would be 95 billion umm, so that's what that comes out to there. The new uh. So if same total earnings assume post buyback, if operations unchanged, umm, the new EPS would be 6.36. Umm. And that EPS percent accretion would be about 3.24%. Uh, so from the hand calculations, just from this uh, we can tell that this would generate value. It would create value for, for Apple. With a, you know, 3.24% EPS accretion. Umm, so if PE is unchanged, uh stays at 30, then the new price uh? Goes up to 190, almost 191 uh for sure. So the take away there is the $90 billion buyback reduces uh shares by 486.5 million raises EPS by 3.24% uh implying that the share price would you know bump up around 3% if the PE uh stays constant uh but the buyback itself you know. Isn't enough value uh. To reallocate the cash, uh. It reallocates the cash to shareholders, but it doesn't create new corporate economic profit, Um. It's just not a big enough increase. So that was just the hand calculations, just, you know, getting, making sure that we're, we're on the same page there. Uh, now we can move on to the implement, which is the, the code here. Um. So yeah, going over to Colab here, so. Umm. Using the kiss framework, uh, so all the inputs of everything that we went over earlier, uh, the proposed buyback amount of 90 billion umm. You know, everything that was given, uh, was it's gonna actually generate is the, you know, the implied EPS from price total earnings from EPS buyback shares run buyback, uh, dividends, uh, run acquisition. Umm. And then it's also going to create a comparison table so we can see, you know, what the best option is versus the buyback, dividends, acquisitions, you know? Uh, so if we run the code. Uh, sorry, it's also going to show an EPS bar chart and some analytical notes that we can use, uh, in our analysis. So if we run the, the code here, uh, you know, generates. Yeah, just put this in full screen. Uh, generates all the calculations that we did by hand, Uh. Just confirms you know the. Uh, everything that we calculated, so you know, repurchase shares, 800 or 486 million new shares, about 15 billion EPS is 6.36, So a 3.24% accretion, which is exactly what we had calculated earlier. Uh, dividend total cost is 93 billion, uh, cash after dividends 92 billion, umm. So the acquisition simplified immediate earnings, so you add 9 billion, uh, EPS after acquisition is 6.74. Uh, debt reduction interest savings is about 2.7 billion, so that adds to earnings, umm, and the debt would be about 20 million. So for the R&D that assumed long term growth, you can add 1.5%, but there's no immediate EPS bump. So looking at this comparative table here, so the baseline uh is, you know, no action. Then the second line is going to be the $90 billion buyback. Uh, then we have the special dividend at $6 a share, the acquisition 90 billion debt reduction, umm. So you can just see how that, how everything effects that. So for example. Umm. I guess we could we could look at this so implied price if PE is constant, Umm. I mean, as you can see with the acquisition, that's going to be the highest implied price showing that you know, the acquisition does in fact produce some. Economic value. Um. And then, uh. This is just a, a chart showing the EPS under different capital allocation alternatives. Umm. So the baseline where it would sit just above 6 uh, if you were to go with that acquisition, clearly the highest uh bar chart here umm, so it shows that the, you know the acquisition uh. Can be can be beneficial, so it says. Suggest next steps. Calibrate acquisition, umm add tax treatment. Sensitivity analysis vary by exercise, but that's not what we're going to do here, so. Umm, this is the code basically it just you know. Gave us all the the data that we had calculated earlier by hand and it gave us this chart here. So we can go back over here, uh, so we can validate it. I mean, we kind of already validated it as we went through it. Uh, but our numbers, you know, matched on the code and from hand, uh, so. EPS rises uh, 3.24% uh, so that implied price of 190.99 uh, Berkshire stake rises uh, from 6% to 6.194. Umm, the employee option intrinsic value rises uh, from 75 mil to 104.5 and you can see that. That uh, right here Employee option value goes from 75 to 104. Umm. And then we have the leverage which jumps from .4 to .59, which increases bondholder risk. Umm, debt reduction lowers leverage 2.21 and generates interest savings. So that's, you know, real tangible value and it lowers risk. Uh, so moving on to the, the evolve stage here. Umm. So you know, what are we? What are we actually? Umm, looking at here. Uh, so. We quantified the stakeholder outcomes. We compared the buyback to the dividends acquisition. We evaluated whether the program creates value. Uh, now we can discuss the signaling effects, market perception and long-term capital allocation. Alright, so on to the Evolve stage. EPS uses the same total earnings baseline, uh. Of that 95 billion, so the leverage is simple transparent ratio, so. Umm, showing that the leverage increased. It just shows uh. You know the that the how much debt they have basically to the cash and then. Getting into the actual interpretations here. So the EPS impacts are the best short-term EPS uplift would be the acquisition as we saw from the chart there, umm. EPS rises to 6.7473. Buyback yields EPS increases 3.24%. Umm. Debt reduction gives a small EPS boost, uh, and then the dividend and R&D show no immediate EPS change. So clearly the acquisition is the the best option here. Umm, the Berkenshire CEO does get a little bit, uh, more, you know, percentage points on his shares. Uh, but it's, you know, it's really tiny compared to everything, uh, else that they're doing. Umm, so the dividend acquisition debt, R&D. Do not change ownership percentages. Uh. ROIC an earnings impact umm. So if that that reduction creates value, umm, then it lowers the financial stress probability, umm. Looking at the leverage, uh, leverages increases from .4 to, you know, .6. So that elevates the risk to bondholders, reduces financial flexibility, umm. But it also improves credit resilience. Uh, the acquisition, you know, score the highest for the strategic fit just because of the, you know, the buyback and dividends tend to lower scores because they are returns rather than growth investments. Umm, so you know, wrapping everything up. Uh, the final recommendation here, uh, approve the buyback, uh, with the acquisition, umm, but only into a dual track capital allocation plan. So proceed with the $90 billion buyback only if Apple commits to increase R&D investment, uh, maintain acquisition readiness and then, uh, implement safeguards to ensure repurchases do not crowd out innovation. Uh, and revisit the debt levels to prevent long term, you know, refinancing risks. Uh, you know why is this the best path The you know the buyback does create value with the 3.24 EPS accretion. However, umm. It's not as. Almost not like worth it in a way just cause it's not that much of a difference there. But it does reward existing owners without the stable destabilizing Apple and it keeps them competitive in a capital return discipline. But by combining it with R&D and potential, you know, acquisitions maximizes long term shareholder value while balancing all stakeholders. But yeah, so overall. How about go over here? It does create value, just not enough on its own to justify priori prioritizing it over all the other alternatives. Umm, you know, mildly, mildly improves the share price. Umm. However, in the long term, it, it's not gonna, you know, affect the stakeholders, but it's also gonna raise, you know, shareholder value. Uh, so it is beneficial, but it's not sufficient as a standalone action. Uh, I think that's gonna be it. Uh, we went through everything here, uh, for these, uh, showed you the Python model that I built. Umm, we automated EPS share price leverage calculations. Uh, and we, uh, had the visualization of all the alternatives there on that chart here, umm, clearly showing that, uh, acquisition is the, the greatest to rise to increase EPS. Umm. So I think that's gonna be it. Uh, and thanks for, uh, thanks for watching."
}