{
  "student_name": "Anthony Kwon",
  "org_defined_id": "036288518",
  "username": "kwon273",
  "email": "",
  "transcript": "Hello everyone. In this presentation, I'll walk through my full cost of capital analysis for Netflix using the DRIVER framework. The goal of this analysis is to determine Netflix's current Weighted Average Cost of Capital, evaluate the impact of an additional three billion dollars of debt, assess project-specific discount rates, and compare Netflix's cost of capital to major industry peers. By the end, I'll also provide a strategic recommendation for Netflix's optimal capital structure. I'll begin with the first stage: Define and Discover. In this stage, I clarify the purpose of the analysis and outline the financial concepts required to calculate WACC. The cost of capital represents the blended return required by all investors—both equity holders and debt holders. For Netflix, equity investors require a return based on systematic risk, which we calculate through the Capital Asset Pricing Model. Debt investors require an interest rate that reflects the yield on Netflix's bonds, adjusted for the tax-deductibility of interest. A critical discovery here is why we rely on market values rather than book values. Market values reflect current investor expectations and the opportunity cost of capital. Book values reflect historical costs and often significantly misrepresent the true economic financing structure of a company. Because Netflix is a publicly traded company with actively traded debt and equity, market values allow us to estimate a forward-looking cost of capital. I also identified key questions that guide the analysis: How does Netflix's beta influence the cost of equity? What is Netflix's after-tax cost of debt? How does adding more leverage affect overall risk? And when should project-specific WACC be used instead of the firm-wide WACC? This leads into the second stage: Represent. In the Represent stage, I map out the structure of the WACC calculation step by step. The cost of equity is calculated using the CAPM formula, which is the risk-free rate plus beta multiplied by the market risk premium. For Netflix, I used a risk-free rate of four point five percent, a market risk premium of five point five percent, and a beta of one point three. This gives a cost of equity of approximately eleven point six five percent. Next, I calculate the after-tax cost of debt. Netflix's bonds currently yield around five point eight percent, and with a corporate tax rate of twenty-one percent, the after-tax cost of debt becomes roughly four point five eight percent. The next step is to determine capital structure weights. Netflix has a market capitalization of two hundred billion dollars and a market value of debt of thirteen billion dollars. The total firm value is therefore two hundred and thirteen billion dollars. This results in equity representing roughly ninety-four percent of the capital structure, and debt representing about six percent. Bringing these together, the WACC is the equity weight multiplied by the cost of equity plus the debt weight multiplied by the after-tax cost of debt. Structurally mapping the calculation like this provides clarity and ensures that the analytical logic is consistent with corporate finance standards. Now we move to the third stage: Implement. In this stage, I apply the structure I just described and compute the actual numbers. Using the inputs I discussed, Netflix's current WACC is approximately eleven point two percent. This is slightly above the eight to ten percent industry WACC range, which is reasonable because Netflix has higher operational leverage, less diversification than companies like Disney, and a content-heavy cash flow profile. Next, I model the impact of adding three billion dollars in new debt. This raises Netflix's debt value from thirteen to sixteen billion dollars and slightly increases the debt weight. More importantly, higher leverage increases equity risk. I assumed a new beta of one point four five, which increases the cost of equity to approximately twelve and a half percent. After recalculating the weights and component costs, the new WACC becomes roughly eleven point nine percent. In other words, more leverage actually increases the cost of capital. The tax shield from debt isn't strong enough to offset the higher equity risk caused by additional leverage. Next, I evaluate project-specific WACC. Netflix's U.S. content expansion aligns closely with the company's core business, so using the corporate WACC of around eleven percent is appropriate. However, international content investment involves additional political, regulatory, and currency risks. I apply a higher beta assumption of one point five five, resulting in a project-specific WACC of approximately twelve and a half percent. This demonstrates that international projects should be evaluated using a higher hurdle rate than domestic projects. This brings us to the fourth stage: Validate. In the Validate stage, I test whether the calculated WACCs are reasonable. First, I compare the results to peers. Disney's WACC is about eight point two percent, and Amazon's corporate WACC is around nine and a half percent. Netflix's higher WACC aligns with its higher risk profile, so the numbers are directionally consistent. I also examine the sensitivity of the results to key assumptions such as the risk-free rate, the market risk premium, and beta. Small increases in any of these factors push Netflix's WACC even higher, especially because equity makes up over ninety percent of its financing. This sensitivity confirms that Netflix's cost of capital is highly dependent on equity market conditions. The combination of peer comparison, input verification, and sensitivity testing provides confidence that the WACC estimates fall within a defensible range. Stage five is Evolve. The Evolve stage highlights how the insights from this analysis apply to broader corporate finance decisions. For capital budgeting, WACC serves as the discount rate in NPV calculations and determines whether long-term projects create value. For capital structure planning, companies seek to minimize WACC by balancing tax benefits of debt with the increased risk of financial distress. For valuation, enterprise value depends heavily on discounting free cash flows at WACC. For Netflix specifically, these insights indicate that the company is near the upper bound of reasonable leverage. Additional borrowing increases beta and raises the WACC, reducing financial flexibility. As Netflix expands internationally and invests in new content categories, the company should use differentiated hurdle rates rather than relying on a single corporate WACC. This allows management to allocate capital more efficiently and reflect differences in project risk. Finally, we reach the last stage: Reflect. What I found most challenging in this analysis was recognizing that WACC is not simply a plug-and-chug formula. Every component—beta, market risk premium, bond yield, and capital structure—contains uncertainty. Even small variations can shift WACC by several tenths of a percent, which can materially affect billion-dollar investment decisions. This assignment reinforced that calculating WACC requires not only technical skills but also professional judgment, especially in estimating risk and interpreting market signals. In conclusion, Netflix's current WACC is around eleven point two percent, rising to nearly twelve percent with additional leverage. U.S. content projects should use the corporate WACC, while international projects should use a higher risk-adjusted hurdle rate. Compared to Disney and Amazon, Netflix faces a higher cost of capital, which increases the importance of disciplined capital allocation. These findings provide a strong foundation for Netflix's strategic financing decisions moving forward. Thank you for listening.",
  "video_url": "https://youtu.be/zPJlDzZQiCs"
}