{
  "student_name": "Ronak Badam",
  "org_defined_id": "036108316",
  "username": "rbadam",
  "video_url": "https://youtu.be/mvDlEtaHoLY",
  "transcript": "Oh, that.\nHi, my name is Ronak and um today we're\ngoing to be doing our session uh 12\nassignment.\nSo,\none second.\nSo,\nfor session 12, we we want to focus on\nnot just calculating numbers, we're\nbuilding financial stories. So, imagine\nwe're a private equity associate. The\ndeal on your desk is Cloud Tech\nSolutions. The asking price is 500\nmillion and the seller tells a great\nstory. Revenue is growing 40%\nyear-over-year, but your managing\npartner points out the problem. They're\ncurrently losing money. Their margins\nare negative because they are spending\neverything on acquiring customers. Our\nchallenge today is to answer one\nquestion. Is this business worth 500\nmillion? To answer this, we cannot look\nat last year's tax returns. We have to\nlook forward. We need to integrate\neverything we've learned in in this in\nthis course time value of money risk\nassessment and cost of capital into a\ncomprehensive discounted cash flow DCF\nmodel. We're going to use the driver\nframework to implement this analysis in\nPython.\nSo first is the the J this SAS Jcurve\nmodel. So let's look at our first Python\nexample. So this implements the core DCF\nmodel. So in standard business cash flow\nmight be stable but cloud tech is a SAS\nSAS software as a service company. This\nrequires specific modeling dynamics. So\nfirst let's look at the code in example\none which is up here. So this is our\ntitle cloud tech SASDCF model growth to\nprofitability. So let's look at code in\nexample one. So in our years one to one\nto three we are we model high but\nnegative growth. So we can see that\nhere. So high to negative -3 growth in\nour 1 to 3 years. In four we model a\ntransition where growth slows. So we\ndon't have as much growth but margins\nexpand after so much after like the\nthere's less spent on marketing. See how\nlike our line is very slanted but\nthere's less margins here. We're\nspending so much but there's less\nmargins. We reach\nSorry,\nsorry about the the the pause. Um\nOh, my bad. Okay, there we go. Sorry\nabout that. And then in years 8 and 10,\nwe reach steady state profitability. So\nthis vis\ncreates what we call the J curve. Um\nyou'll see the red line cash flow start\nbelow zero down here then skyrocket as\nthe m business matures and then the ma\nthe mathematical transition. All right\nnow moving on we're going to go into our\nsegment two which is sensitivity\nanalysis the risk check. So however\nmodels are dangerous they are based on\nassumptions. What if we are wrong? This\nbrings us to example two sensitivity\nanalysis. In the first model, we assumed\na weighted average cost of uh 11.8% and\nterminal growth of 3%. But what if\ninterest rates rise? What if the economy\nslows down? This code generates a heat\nmap. On the xaxis,\nwe vary the WACC. On the Yaxis, we vary\nthe growth. This script colored cells\nautomatic uh colors the cells\nautomatically. Green means the value is\nabove 500 million asking.\nPrice red means it's below. As an\nanalysis analyst, if your heat map is\nmostly red, the deal is too risky. You\nhave a margin of safety. This visual\ntells your boss not just what the value\nis, but how confident you are in the\nvalue. So this is the the heat map that\nit printed for us on the enterprise\nvalue sensitivity in millions. So this\nis our discount rate and then so our\nterminal growth um and then if the deal\nis good or not. So this is the best deal\nand then this is the worst deal down\nhere. And then lastly we have um we have\ntriangulation. So this is the football\nfield chart. Uh it stacks three\ndifferent valuation methods\nhorizontally. DCF based on intrinsic\ncash flows creating pumps based on\nsimilar public companies and then pre\npresident transactions based on what\nother companies recently bought for. The\ndash Ryan represents the 500 million\nasking. And then if the line red line\nfalls within the overlapping bars of all\nthree, the price is fail. If the red\nline is way too to the right of your\nbars, the seller is dreaming and you\nshould walk away.\nSo we can see that if this is a really\nbad deal. Um, oh, never mind. This is a\nreally bad deal.\nActually, I have this super wrong. Okay,\nthis bar here, if this bar\nis a is a really bad deal because the\nred line is very far, this is a really\ngood deal. So this because the red line\nis really far behind. So it it shows\nthat the business is going to make much\nmore money than the asking price. Okay,\nso that's my wrap on session 12. Sorry\nabout the the odd pauses in the middle\nand sorry about the lack of video cam. I\ndon't have a camera now because of all\nof the final exam stuff happening. By\nusing this Python tool, Python tools for\nsession 12, we move beyond simple\nhomework problems and I hope to have\nmodeled a complex business transaction.\nThank you."
}