{
  "student_name": "Damian Lopez",
  "org_defined_id": "035724848",
  "username": "lopez613",
  "email": "",
  "transcript": "Hi, I'm Damian Lopez, and this is my session nine assignment. A little bit over about our assignment. We are to calculate the weighted average cost of capital for Netflix in connection with a hypothetical $5 billion content investment decision. The key questions are, what is Netflix's current weighted average cost of capital? how does a new debt compare or affect the way the average cost of capital what discount rate should apply to u .s. content versus the international content and finally how does Netflix's cost of capital compared to Disney's and Amazon and what capital structure should Netflix target here we have a couple net financial parameters market conditions strategic context some required analysis one to calculate Netflix's current waiter average cost of capital to to determine the way to average cost of capital after the three billion dollar debt issuance three evaluate project specific weight average cost of capital US content versus international content for compare Netflix with average cost of capital to Disney and explain the differences five to recommend optimal capital structure strategy okay that was the D step and the driver framework which is to define next on to next step which is our which is to research and discover first we begin with the input data which Netflix has 200 billion dollars in equity and they have 13 billion dollars in market value of debt this right here the new debt issuance would be the three billion the yield on its bond is 5.8 % corporate tax rate is 21% the risk-free rate is 4.5% and the market risk premium is 5.5% first we need to compute the cost of equity using the capital asset pricing model formula which is to use the the risk -free rate plus the beta times the market risk premium which would be the four point five percent plus the one point three times the five point five percent and that would roughly equal the eleven point six five percent next next we calculate the after-tax cost of debt using the capital asset pricing model which the after-tax cost of debt which is the five point eight percent bonnie of corporate tax rate five point eight percent you multiply that times one minus the debt when eight percent times the one minus the tax rate which which would equal out to the cost of debit after tax cost of debt to the 4.58% now now we would go to the current weighted average cost of capital, which Netflix's total market value is $213 billion. The equity represents a 93.9% and the debt represents a 6.1%. the equity weight the equity weight times the cost of equity plus the the debt weight after tax or times the after tax cost of debt is how we would get the current weight average cost of capital which would be roughly eleven point twenty two percent next on to the next stage in the driver framework which is I interpret this way the average cost of capital is significantly higher than media and dust industry averages it reflects Netflix's high beta of the 1.3 percent its independence on global subscriber growth and its and its relatively conservative use of debt which is roughly you using a way to average cost capital sensitivity to debt the total capital ratio chart you use the current way to average cost capital which is 11.22% should roughly be about right here go down roughly be her 11.0 it'd be roughly like over here it should be like seven seven eight percent which is little less than the industry norm which is roughly 10 to 20% next on to the next driver step which is V validate to validate this baseline we have to recompute the weighted average cost of capital assuming that Netflix issues the three billion dollars of debt right there using the same formula the debt increases to 16 billion dollars the total firm value becomes 216 billion dollars the debt weight rises to 7.4 percent and assuming that the credit rating remains stable the new age at weighted average cost of capital becomes eleven point one three percent using this formula and this is slightly lower due to the debt debt tax shield this confirms that the modest control leverage reduces reduces the weighted average cost of capital and it supports value creation onto the next step in the driver framework which is e to execute which the u.s. content risk carry lower systematic risk using a beta of 1.1% it'll yield a cost of equity of ten point five five percent using the same formulas as above as the new weight average cost of capital after the three billion dollars of debt issuance and the current using the same formulas we get the weighted average cost of capital for US content and international which the projected weighted average cost of capital for the US content is 10.9% and for international content it is at 20 twelve point two five percent it carries higher regulatory well international carries in an higher regulatory currency and political risk therefore the projected weight average cost of capital is higher and the project projected weighted average cost of capital must be tailored to the geography and the risk profile rather than applying a firm wide rate onto the next step are finally we will compare Netflix to its peers Disney's with weighted average cost of capital is eight point two percent which is supported by its diversified revenue base and stable cash flows and compared at Amazon Prime videos, which uses Amazon's corporate weighted average cost of capital of 9.5%. This benefits from a balance sheet and business mix, which dramatically is more stable than the pure play streaming of if they had to use the Amazon Prime videos. Netflix's weighted average cost of capital is above the 11%, which is higher because of its concentrated business model the higher beta and the under levered capital structure which like i said earlier is like seven eight percent roughly using this chart and the industry normal is 10 to 20 percent issuing the three to five billion dollars in additional debt is financially sound It lowers the weighted average cost of capital. It supports content investment, and it keeps Netflix investment grade. In summary, Netflix's current weighted average cost is about 11.22%. It falls slightly with the new debt. It will vary materially between the U.S. and international debt or content project projections, and it remains above the peer averages. Increasing the leverage modestly is the most optimal capital structure strategy to enhance shareholder value. Thank you.",
  "video_url": "https://youtu.be/yemvNSbbHf4"
}