{
  "student_name": "Anushka Wayse",
  "org_defined_id": "037494252",
  "username": "wayse",
  "video_url": "https://youtu.be/X4509Vd2ndk",
  "transcript": "00:01\n Hello, this is my session 12 assignment for Management 310. So just to begin, the\n00:07\n driver principle, we have to define and discover. So this stage focuses on\n00:13\n establishing the scope of the KKR acquisition analysis, validating the\n00:17\n operational data, and defining the valuation methodologies required to\n00:22\n produce a competitive yet disciplined bond. So our problem is that the KKR\n00:28\n is evaluating potential leverage, buyout, or acquisition of Panera Bread. The\n00:36\n target is mature, fast, casual chain with six billion dollars in revenue and 900\n00:42\n million in EBITDA, with significant digital infrastructure. So the core\n00:48\n challenge is valuation triangulation, so we must determine a bid price that\n00:52\n offers our KKR a significant internal rate of return while remaining\n00:58\n competitive against strategic buyers like Starbucks and McDonald's who can\n01:01\n pay a premium due to their operating synergies. We need to ascertain if a\n01:07\n financial discipline can win against strategic synergies. So our goal for this\n01:12\n is to utilize a Python automated valuation model to produce a\n01:17\n sensible football field valuation range, and this will combine the intrinsic\n01:22\n value DCF with relative value, the constant procedures to recommend a\n01:26\n specific bid price, and analysis must explicitly contrast the financial buyer\n01:31\n valuation, the KKR, against the strategic buyer valuation to determine the\n01:37\n walkaway price. So a very important first step is just some fact\n01:41\n verification. So a critical analytical risk is misapplying multiples or ignoring\n01:46\n the management rollover. We must anchor our analysis on the provided facts\n01:50\n rather than the general industry assumptions. So a scale, verify the base\n01:54\n EBTIDA is 900 million with a 15% margin and revenue is 6 billion. On multiples to\n02:03\n acknowledge the spread between the general president transactions 12 to 15\n02:07\n X EBITDA and high growth peers like Chipotle which has 53 X PE. We must\n02:15\n determine if Panera wants a Chipotle premium due to its 50% digital sales mix\n02:20\n or McDonald's discount due to saturation. And then our capital, so the\n02:24\n analysis must account for the 10% management rollover which reduces\n02:27\n upfront cash KKR needs to deploy but impacts the exit equity stack. Our\n02:33\n hypothesis is a strategic gap. So strategic buyers, example Starbucks,\n02:40\n will likely have a higher ceiling price than KKR because they realize immediate\n02:45\n cost synergies, supply chain overlap, and revenue synergies distribution. The KKR\n02:50\n opportunity, however, the KKR can justify a winning bid if the valuation model\n02:56\n proves that growth levers, so 500 new stores plus a 70% digital mix,\n03:02\n can expand the EBITDA margins beyond the current 15% if the operational\n03:07\n improvements, which is the upside case, drive enough cash flow. The KKR can leverage the\n03:12\n asset sufficiently to beat strategic bidders who might be more conservative\n03:17\n on growth. So action is to parametrize the Python model, so set up the Python\n03:24\n environment to handle dynamic variables for the WACC, and so 9% the terminal\n03:29\n growth and active toggles for the three key growth levers. Store count, digital\n03:35\n mix, and margin expansion. Market collaboration, so confirm the\n03:39\n current risk-free rate and equity risk premiums to build the cost of equity, but\n03:44\n specifically focus on the cost of debt for an LBO scenario, ensuring the WACC\n03:49\n reflects the leveraged capital structure. So communication plan for this, so the\n03:53\n final op-ed cannot simply be a single number, it must be a bid strategy matrix.\n03:57\n So floor is the lowest defensible value, the ceiling is the maximum price before\n04:01\n the IRR dips below the required return, and the strategic zone, which will likely\n04:06\n price range of Starbucks and McDonald's like the synergized valuation, and our\n04:11\n recommendation is that if the strategic zone is significantly higher than the\n04:15\n KKR ceiling, the recommendation may be to withdraw or seek partnership. So some\n04:22\n of the key questions we're going to answer throughout this entire problem is\n04:26\n the multi- so does Panera's 50% digital mix justify trading closer to Chipotle\n04:31\n or the broader industry? What is the quantitative value of the strategic\n04:34\n premium? How does the 10% management rollover affect the KKR's cash on cash\n04:39\n return and alignment incentives, the growth versus maintenance, if the plan is\n04:43\n open to 500 new stores, capital efficient, or will the CAPAX requirements drag down\n04:49\n the free cash flow in initial years, hurting the DEC valuation, and how does\n04:54\n moving the WACC from the industry average of 9% to a potentially higher\n04:59\n adjusted rate impact the terminal value? Now for the representation segment of\n05:05\n this plan, so this stage outlines the analytical and technical steps required\n05:08\n to build the automated valuation model in Python, ensuring all growth levers and\n05:13\n buyer perspectives are mathematically accounted for. The core formula and\n05:17\n methodology for this is a triangulated valuation approach, weighting the\n05:21\n intrinsic value, DCF, against the relative market pricing to establish a\n05:25\n bid range. So first we have the intrinsic value, discounted cash flow, we'll project\n05:30\n the unlevered free cash flow over a five-year forecast period. So here we can\n05:34\n see that that equals the EBIT times the 1 minus the tax rate, plus the\n05:39\n depreciation and amortization, minus capital expenditures, and minus the\n05:43\n change in working capital. So the Gordon growth method is this, the exit\n05:51\n multiple method, and the discount rate as well. The relative valuation, which is\n05:55\n the multiples analysis, so the trading comps, so apply the market multiples,\n05:59\n comp peers, like Chipotle and McDonald's, entrepreneurs metrics, and also the\n06:03\n president's transactions, so apply the 12 to 15x EBITDA, range from historical\n06:08\n deals to establish a control premium baseline. And the buyer's perspective\n06:13\n logic, so the financial buyer, which is the KKR value, so they have the same\n06:17\n amount of DCF, which is the base divided by the upside case, minus the net tab, and a\n06:23\n constraint, and must achieve an internal IRR target. And strategic buyer\n06:29\n synergized, so the value equals the CNO on DCF, plus the PV of synergized, which\n06:34\n is the cost times the cost savings, plus a revenue list. Now for this problems\n06:41\n analytical process, which is our stuff, so the Python model will execute these\n06:45\n steps sequentially. So step one, driver no-stabilization, and the driver data\n06:51\n integration, so the control panel, so define a dictionary of assumptions in\n06:56\n Python to allow rapid scenario logging. So the base case is the 8% revenue\n07:01\n growth, the 15% EBITDA margin, and 500 stores in five years. The upside case, so\n07:06\n the KKR target, so the 10 to 12% growth driven by 70% digital mix,\n07:12\n margin expansion to 18%. The downside case, which is a 4% growth and margin\n07:18\n compensation due to labor, so these are our different scenarios, we'll have three\n07:21\n of them. Step two is the WACC and rate of return build, so calculate the WACC\n07:26\n starting at the industry standard of 9%, create a sensitivity function to adjust\n07:30\n the WACC to 12% to model the higher cost of leverage in an LBO scenario, or down\n07:38\n to 7 to 8% for strategic buyers with cheaper capital, like McDonald's. Step\n07:43\n three is forecasting your free cash flow, the engine, so project revenue, it's\n07:46\n currently 6 billion times 1 plus the growth rate, and the project EBITDA, which\n07:52\n is a revenue times a margin assumption. Calculate our tax, CAPEX, and WC,\n07:58\n specifically drive the UFCF years for 1 through 5, and note that the CAPEX\n08:05\n logic must account for the cost of opening 100 stores a year, which is part\n08:11\n of the 500 store plan, so as you can see 100 stores per each year as is five\n08:15\n years. Step four, our terminal value and discounting, so compute the terminal\n08:19\n values in regard to growth rate, which is 2 to 3%, and also exit multiples.\n08:24\n Discount all flows to present value to determine enterprise value. Step five is\n08:30\n our football field synthesis, so construct a summary table comparing the\n08:33\n valuations and the DCF, trading constant precedent transactions, and output a\n08:38\n visual range chart showing where the valuation methodologies overlap. Step six\n08:42\n is our strategic adjustment, so calculate the implied share price for\n08:45\n the KKR, add synergies, adjust for net debt, and the 10% management rollover to\n08:50\n determine final equity, check required. And in order for us to create a Python\n08:56\n code that includes all of this, we need some technical requirements, those being\n09:00\n the tools that we're going to use. The first one is Python, which also\n09:04\n includes the library of pandas for data frames, NumPy for financial functions,\n09:08\n and PF and PV. Also structure, so use a functional approach, which is our growth\n09:15\n rate, margin, and WACC, so scenarios can run instantly without rewriting code. And\n09:20\n our deliverables, being a clean Python notebook outputting a formatted\n09:25\n data frame of cash flows, the sensitivity matrix, show WACC versus growth, and the\n09:30\n final bid recommendation text. So the next step is execution, so here we have\n09:36\n implementation. So we want to execute step one and two, initialize the Python\n09:42\n environment with Panera variables of $6 million revenue, $900 million\n09:46\n of EBITDA, and build the WACC function. This foundation allows us to\n09:52\n layer on the complex short count growth logic and the subsequent stops. So we\n09:56\n want to execute the valid valuation model to determine the precise enterprise\n10:01\n value range for Panera Bread and quantify the gap between the single\n10:05\n non-financial buyer, the KKR, and the synthesized strategic buyer. And this is\n10:09\n all in our implementation stage. So in order to implement, we utilize Python, the\n10:15\n Panera valuation model, which we'll see soon, to compute the weighted average\n10:19\n cost of the capital WACC, project for five year unlevered free\n10:25\n cash flows, enter these three distinct operating scenarios, and triangulate the\n10:29\n final value against my computers. So in order to actually calculate the, in order\n10:35\n to actually create the Python code, I went ahead and asked Gemini. I prompted\n10:42\n him with these things and told him exactly what we needed for this scenario,\n10:48\n and Gemini went ahead and gave me this, which I exported into Colab. So as we can\n10:56\n see here, here's a Python code. It begins with importing all of the necessary\n11:02\n libraries, initializing the model with the illustrative financial data for\n11:07\n Panera. So here we have all of our variables defined. We have our\n11:13\n general assumptions, our WACC assumptions, which includes our tax rate, our\n11:18\n CapEx percent revenue, our NWC percent revenue, and then for our WACC\n11:24\n assumptions, we have the risk-free rate, the market risk premium, the beta, the\n11:27\n cost of debt pre-tax, and debt to capital, as well as our different scenarios, which\n11:32\n where we have our base, our upside, and our downside as well, and also our\n11:37\n definitions of the different equations that we will be using throughout this. So\n11:42\n calculate the WACC, and also project cash flows, and then we have the project's\n11:48\n five-year financials and three cash flow based on a selected scenario. We also\n11:58\n have the DCF valuation, relative sensitivity analysis, analysis for a\n12:12\n strategic buyer versus a financial buyer, which includes the synergy trend\n12:16\n calculations, and also visualization of the valuation triangulation, which is a\n12:21\n football field chart. And then also, so here's our visualizations in the code, so\n12:28\n we all need to get the data, structure for the plotting, plot, our execution\n12:36\n block, and then when we run this, Python, when we run this, we go ahead and we\n12:41\n gain these results. So we have a financial valuation summary for Panera,\n12:45\n so we have the revenue of $508 million, and LTM EBI TDA of $1,150\n12:57\n million. So we have the base case WACC of 8.9%, our enterprise value of\n13:02\n $9.64 billion, and an implied share price of $36.4 billion. And then we also have our\n13:08\n strategic buyer perspective, which has a value of synergies of $2.25 billion, max\n13:13\n strategic bid of $11.89 billion, and implied control premium of 23.4%. And\n13:20\n here's our valuation triangulation, so our football field analysis. So the\n13:27\n Python code went ahead and visualized this for us, so we have our president\n13:30\n deals, our trading comps, our DCF upside, our DCF base, and our DCF downside. So here\n13:35\n we have the three different scenarios with enterprise value, and our base DCF\n13:41\n of $9.6 billion. And then we have also a sensitivity analysis in billions of\n13:46\n dollars as well. So we have the WACC, base of the terminal growth, so we have the\n13:50\n terminal growth rate here, WACC down here, and our enterprise value as well. And\n13:58\n then lastly, also our first five years, so we have our, we can visualize this, so we\n14:03\n have our revenue, our EBITDA, our EBIT, and our FC, our free cash flows. So now\n14:12\n looking at this, we see our hurdle rate, our WACC calculation. So before valuating\n14:19\n cash flows, we establish the discount rate required for the leverage buyer\n14:22\n profile. For our cost of equity calculation, we have a cost of debt\n14:26\n calculation, as well as our WACC. An interpretation of how this came out is\n14:31\n that 8.86 represents the baseline hurdle rate. In the sensitivity analysis, we\n14:36\n stress this up to 10% to account for the aggressive LBO leverage. Our DCF\n14:41\n valuation, which is our intrinsic value, so we model cash flows over a five-year\n14:45\n period using the base case assumption, 6% revenue growth, stable margins. So\n14:51\n cumulative PV of FCF, which is five years, of $4.2 billion. Our terminal value, total\n14:58\n enterprise value, our scenario variance as well. So we have our downside and our\n15:03\n upside, which our total enterprise value, which is our base case, has $18.1\n15:08\n billion. Our downside has $15.2 billion, and our upside has $21.5 billion. And our\n15:14\n relative visualization valuation, which is our market pricing, so we compare the\n15:19\n DCF output against the current market multiples to validate the pricing. So we\n15:23\n have our trading comps, so peers trade at an average of 20.5 EBITDA, with an implied\n15:30\n value. And our president transactions as well, president transactions. And then our\n15:36\n strategic synthesis, which is our football field. So analysis reveals a distinct\n15:40\n pricing hierarchy, so the floor of $15.2 billion. Establish a historical M&A\n15:46\n multiples, KKR faces minimal risk, buying at near this level. The fair value of\n15:50\n $18.1 billion. The DCF base case is the maximum net rational bill for the\n15:56\n financial buyer without relying on hope for execution per action. The strategic\n16:01\n ceiling of $22 billion. The trading comps strategic buyer analysis\n16:09\n suggests that the competitor, example Starbucks, could pay up to $22 billion by\n16:13\n factoring in $3 billion of the operational synergies that the KKR\n16:16\n cannot access. And our execution output. So from the Python model, we get our\n16:21\n current EBITDA of $1,050,000, our implied multiple base case of $17.2X, and our bid\n16:33\n recommendation. So this model supports an opening bid of $17.5 billion, which\n16:37\n aligns with intrinsic value while leaving room for a negotiable, up to the\n16:41\n $18.1 billion, which is our walk-away price. For our step four, which is our\n16:48\n validate, so our accuracy and sense check. So this stage interprets the output\n16:53\n generated by our Python Panera evaluation model class to ensure that they are\n16:58\n mathematically accurate and economically logical before finalizing the bid. So\n17:03\n economic logic check, which is our sanity check, so the strategic buyer\n17:08\n evaluation must be higher than the financial buyer evaluation. So we have\n17:11\n our card outputs, and as a result, it passed as the model explicitly calculates\n17:16\n a control premium driven by the synergies, confirming that a strategic\n17:19\n bidder like Starbucks has a higher ceiling price than KKR. Next one is our\n17:25\n WACC sensitivity. So we have our card output, and it needs to show that the WACC\n17:32\n increases and the enterprise value decreases. So as a result, it passed.\n17:41\n Intrinsic relationship holds true. A WACC shift from the 9% to 10% had\n17:46\n significantly compressed the valuation, highlighting the risk of rising interest\n17:52\n rates on a KKR leveraged bid. The external benchmarking, which is the\n17:57\n football field track, so the trading comps, the code uses an EVEBITDA of\n18:02\n peers approximately 20 to 22x present in transactions. The code uses historical\n18:08\n deals and DCF implied multiples. So check of the base case DCF results in the EV of\n18:13\n 18 billion on 1.05 billion EBITDA implied, and the implied multiple is 17.1x.\n18:22\n So validation, this falls squarely between a present in transaction\n18:28\n floor of 14x and the Chipotle high growth ceiling of 25x, and the valuation is\n18:33\n defensible. And a technological verification as well. So we have the\n18:37\n terminal value weights, so this model calculates the TV using the Gordon\n18:40\n growth method. So to check, ensure the terminal value does not exceed the 70 to\n18:44\n 80% of the total enterprise value. If it does, the valuation is too sensitive and\n18:48\n uses perpetual assumption. So our action is to review the PV terminal value versus\n18:53\n the sum PV CF output in the DCF dictionary. In step 5, I evolve and I'll\n19:01\n critique for the next step. So this stage is essentially indemnifies the\n19:05\n limitations of the current Python model and suggests how to make it more\n19:08\n dynamic for real-world investment committee. So critique 1 is a\n19:11\n static capital structure, the LBO flaw. So limitation is the current\n19:16\n calculate WACC uses a fixed debt-to-capital ratio of 30% and\n19:21\n set a cost of debt. So for our evolution, to try to make it more dynamic and\n19:26\n actually allowable for a real-world investment committee. So in a real\n19:33\n LBO, debt would spike from 260 to 70% and the capital at\n19:39\n the moment of the purchase then would pay down over time. The risk of equity, which\n19:43\n is beta, would also spike, which is our leveraged beta. So as a fix, we could\n19:49\n implement the circular reference loop to adjust the WACC and relate to that as\n19:54\n that was paid down or switch to an APV, adjusted present value, method to\n19:59\n evaluate the tax yields separately from operations. Our second critique is a\n20:03\n digital mix proxy. So limitation is the model currently aggregates growth into a\n20:08\n single revenue growth variable, 6 to 10%, and does not explicitly\n20:13\n model the unit economics of digital versus in-store. So evolution is a side\n20:20\n case which relies on digital sales reaching 70%. Digital orders typically\n20:25\n have a higher margins and lower labor. So fix is to split the revenue and\n20:33\n to split the revenue line into digital revenue and\n20:41\n in-store revenue with distinct margin profiles to validate the 18% EBITDA.\n20:47\n Merging target in the upside to narrow is actually achievable. And our last\n20:53\n critique is that exit multiple sensitivity. So the limitation is that\n20:57\n the model relies heavily on the golden growth for terminal volume. And as an\n21:00\n evolution, the financial buyers often exit via the sale to another firm. So as\n21:04\n a fix to add a toggle to calculate the terminal value based solely on the exit\n21:09\n multiple selling a 15x EBITDA in year 5 to see if the IRR holds up without\n21:15\n assuming perpetual growth. And lastly, our reflection, which is our key takeaways\n21:20\n and recommendations. So this final stage synthesizes the Python outputs for the\n21:26\n executive recommendation for the KKR. So our bid strategy matrix. So here we have\n21:34\n the metrics. So we have our floor price, our fair value, our\n21:38\n strategic ceiling as well, our value of range, and our insight. So for our floor\n21:42\n price we have $15.0 billion, which is 14 and has a 14.3x. So based on the\n21:49\n downside DCF and the lower end precedent transactions, KKR should not lose the\n21:54\n deal below this price. Our fair value of $18 billion, which has a 17.1x. So the\n22:01\n base case of DCF, this is the discipline price for the KKR, receives its\n22:06\n required return. And our strategic ceiling of the $22 billion with 21x. So\n22:13\n the price Starbucks and McDonald's can pay due to the $4 billion plus the\n22:17\n capitalized synergies identified in the strategic buyer analysis that we saw in\n22:20\n the code earlier. So key takeaway number one is discipline versus strategy. So the\n22:26\n analysis proves that the KKR cannot win a bidding war on price alone if the\n22:30\n strategic buyer, Starbucks, is aggressive, the synergy adjusted for valuation. $22\n22:35\n billion far exceeds the KKR's standard loan valuation of the $18 billion. So KKR\n22:40\n should only proceed if the strategic buyers are distracted or a regulatory\n22:43\n hurdle to prevent them from bidding. Our second key takeaway is the digital\n22:47\n upside is mandatory. So the difference between the base and the upside\n22:50\n scenarios in the Python model is massive. The 10% growth rate driven by\n22:54\n the digital mix creates nearly $3 billion in additional value. And our\n22:57\n recommendation is that the KKR investment thesis must be entirely\n23:03\n predicted on operational execution, especially forcing the digital mix up\n23:08\n to 70% and optimizing a new SOAR footprint. And a key takeaway number\n23:14\n three is that 10% of the 10% management rollover mentioned in the\n23:18\n prompt, but effectively an equity check in production, is critical. It reduces a\n23:22\n KKR upfront check size, slightly boosting the IRR, but importantly aligns with the\n23:27\n management to hit the aggressive upside growth targets required to make the deal\n23:30\n actually work. And lastly, our final recommendation is to submit an initial\n23:34\n build at $17.5 billion and this anchors the valuation near the base case DCF. Be\n23:40\n prepared to stretch to $19 billion, pricing in some of the upside, but walk\n23:44\n away if the price exceeds $20 billion. This enroaches on the strategic zone\n23:49\n where financial return for the KKR would deteriorate below acceptable risk\n23:54 adjusted levels. Thank you!"
}