{
  "student_name": "None None",
  "org_defined_id": "033313257",
  "username": "chuisman",
  "video_url": "",
  "transcript": "Hello everyone. I'm Chris Heisman and\nfor my mini project three, I created the\nWall Street truth detector. So my\nproblem is that we live in an age of\ninfinite financial noise. Headlines are\nsensational and corporate executives are\nexpert at making bad results sound good.\nAnd I realize that investors don't need\nmore news, they need the truth hidden\nbehind it. So my tool doesn't just\nsummarize headlines, it acts as a\ncynical analyst. It's going to pull\nreal-time data and compare the text\nagainst math and identify contradictions\nto give a clear bias-free verdict.\nSo, uh let's take a look here at my nan\nworkflow.\nSo, to build this, I follow the driver\nframework and uh here is the\nimplementation.\nSo, uh to begin, I have a uh a chat\nnode. So, it's going to begin with a\nchat. That's you and uh you're going to\nask it to do its analysis on a ticker\nthat you want to look at. And then I\nadded an HTTP request node.\nUm and this node is connected to Alpha\nVantage uh which is this website right\nhere. Um Alpha Vantage provides\nreal-time historical stock data um and\ncan also give you any recent news\narticles relating to those stocks. So as\nyou can see this node is not just\nbrowsing the web it retrieves raw data\nraw uh JSON data\num containing a list of the latest news.\nSo for each uh API it gives me two\npieces of data a text summary of the\narticle and a sentiment score which is a\nmathematical value from negative one to\none positive one.\nUm, so my reason for this is, uh, my\nreasoning is that it's going to take,\num, the latest 50 news articles\nand put it into my AI agent, which is\nusing chat GBT4 mini, and my system\nprompt um, instructs the AI to perform a\ndivergence analysis,\nand it's going to check uh, if the text\nmatches the the math, the sentiment\nscore.\nUm, so yeah, why don't we go ahead and\ndemo this? So, um, I want to take a look\nat Apple stock. I wanted to create a a\nreport on that\nand it's working here. It pulled the\ndata from uh, Alpha Advantage.\nOkay. Yeah. So, let's look what it said.\nSo provided an executive summary on\nApple. Um very in-depth. Um I wanted it\nto be a uh strategic analyzer\npersona and it gave me some data\ndivergence. So it gave it a sentiment\nscore of 42 out of 100. Um market\nreality\num neutral to bullish.\nAnd the key insight here, it talks about\num how there's a new AI chief\num that's going to strategically pivot\nApple.\nAnd it uh created a bull and bear thesis\nhere. So the bullish the upside strong\nservices revenue growth and the the\nbearish a execution setbacks and it\nprovides a strategic verdict uh for a\ngeneral investor. This one it says\nmaintain a moderate buy accumulate\nstance Apple's robust fundamentals blah\nblah blah blah and it gives a um very\nappropriate and um strategic reasoning\nfor it. I've also provided the\nguardrails as you can see there's a\ndisclaimer at the bottom here saying\nit's AI generated and um yeah so that's\nlike for safety.\nSo um now when I was going ahead and\nbuilding this Uh, I had to evolve it um\na couple of times. One of which I I was\nmessing with how many lines of um\nuh articles to feed it. I started with\n10, but I found that wasn't enough\ninformation for the reasoning model to\nuh create a really good analysis. So now\nit's fed 50 uh of the latest articles\nrelating to that ticker uh to create a\nuh a verdict that is um use is looking\nat some sort of trend and creates a good\nverdict, a good analysis.\nUm yeah, so I mean building this I think\nthis is great. I'm I certainly want to\nuse this. I certainly want to use this\nsort of like logic maybe in other\nprojects. Um, and it also built it also\ntaught me that like uh AI isn't just a\num a rapper for chat GBT, it's a\nreasoning engine. So by combining um a\nlive API data uh stream with a specific\npersona um I was able to turn raw\ninformation into actionable financial\nintelligence. Um so yeah, thank you for\nwatching and I hope you liked myproject."
}