{
  "student_name": "Isabella Corrales",
  "org_defined_id": "037007344",
  "username": "icorrale",
  "video_url": "https://youtu.be/ArfuUWh_cnw",
  "transcript": "Hello, my name is Isabella Corrales and today I'm going to show my finance tool that I made, my financial app. I chose to do something that would benefit me that I could use well beyond the class and you know, I mean can benefit really anyone but specifically a topic that I am interested in which is understanding stocks because And that's like exact ones to pick and, you know, getting more into that because I don't have any money in them. But I know obviously a lot of people do and they're a good thing to get into. So this is to, this is an app to help you understand stocks, not just the charts. I feel like I get intimidated by charts, but you know, every company has a story and we. It explains what they can actually do and how they make money and why people should invest in plain English. So very simple to understand for anyone who chooses to use it. So to kind of go over, we have recent stories that we've clicked on or looked up. We can look at, you know, Netflix, which is what does this company do? Which this one's kind of a basic, you know, a lot of people know what Netflix does, but why do people trade this stock? So kind of gives you an insight on why other people trade it to see if that aligns with something you might want to do. And then the bull and the bear case, which is like buying and selling. And so I know the good side and then the bad side of things. saying that, you know, optimists believe that Netflix's global reach and investment in original content will continue to attract new subscribers, which leads to sustained revenue growth and market dominance. But on the other side, pessimists worry that increasing competition from other streaming services and rising content costs could limit Netflix's growth, which could potentially affect its profitability and stock performance. Those are very helpful and very valid points to think about. And that was just one company, you know, we have Nvidia, which is something I don't know much about. So for companies that I don't know much about would be the most beneficial, but it's, you know, just to show you it does it on everyone and it's all you have to do is just type in one. So we'll do Starbucks. I think that was the right abbreviation. And it'll load, fetching its content and then boom, right here. So it tells us what they do, how they make money, you know, and then why do people trade it and the good and the bad. So and you can do that for any any stock um as you can see we have a lot out here so and it I mean you can just keep doing it so it's a very nice helpful way to understand stocks more just like the background and stories um content and insights from people rather than just looking at graphs um so you can kind of get a good base information before you look straight at the numbers. I think that's very helpful. It'll be very helpful to me. And yeah, so thank you."
}