{
  "student_name": "Julia Munkholm",
  "org_defined_id": "037076876",
  "username": "jmunkhol",
  "email": "",
  "transcript": "or the session nine assignment. Um, here is the kind of problem we're dealing with. So, calculate the weighted average cost of capital WACC is the term for that for Netflix in connection with the hypothetical 5 billion content investment decision. Your analysis must determine current WACC, evaluate the impact of additional debt financing, and assess project specific versus firm wide discount rates, and compare Netflix's cost of capital to industry peers. So, um here's just some of the parameters were given and then the market conditions as um kind of stated in just like the information given by this problem. And then strategic context Disney capture structure or capital structure is 70% equity 30% debt debt excuse me and then Amazon Prime Video uses Amazon and corporate so that is WAC of 9.5%. And then Netflix is considering 3 billion additional debt insure issuance for content investment. So the required analysis um is all listed above. So to get started with my actual analysis to find and discover the goal of this assignment is to determine the appropriate weighted average cost of capital for the $5 billion content investment and also look at how additional debt affects um the cost of capital and then also like how it relates to other peers in the market and all that. So key questions I plan to answer during this assignment include what is Netflix's current WACC? How does um adding $3 billion of debt change capital structure and the WACC? Should the project use firm wide WACC or project specific discount rates? How does Netflix compared to Disney and Amazon video? What is the optimal capital structure moving forward? And so now we're moving on to the represent which is kind of just showing the formulas that we will be using. The WCC formula um is E over V which E is market value of equity and then V um is the total firm value and then you multiply it by R um subscript E which um is just a component of the thing and then D over V and D stands for market value of debt and then oh sorry re stands stands for um cost of equity, excuse me. And then R D is the current yield on company bonds or comparable debts. And then T stands for corporate tax rate. So that is all of those and then so the cost of debt after tax cost of debt and tax shield benefit. So actual cost of borrowing for a company after accounting for tax savings and tax shield is the tax savings a company gets from deducing interest expenses. And then capital structure analysis understand the debt to equity mix and its effects. So then the capital structure analysis understanding the debt to equity mix and its effects. Um so company mix of debt and equity financing. So higher debt to equity ratio equals more financial leverage increases risk and returns also though and then higher equity to debt ratio provides stability but could also dilute ownership. So that's kind of how like the capital structure works. And then tax shield effect. How interest deductibility reduces effective cost of debt. Lowers amount of taxable income which lowers the total tax that is paid makes debt financing more attractive than equity financing in that way. And then WA or WACC as hurdle rate. So using WACC for investment decision- making. Um WACC is used to evaluate desiraability of investment projects or acquisitions. Lower WAC indicates um sorry indicates lower risk, cheaper capital and a higher company valuation. So now the implement phase where I put it all um the calculations I need into um Google Gemini. Oh, sorry that is the wrong thing. So now we're going to go here. So this is just me entering it and then this is the code it makes. So then I exported it to collab and I already ran all this but I want to go through the code um real quick. So this is just kind of all the formulas put together um or just the information and then um so yeah as you can see here function definitions it shows you all the functions. So the CAPM function um for to calculate cost of equity and then the WAC um given current capital structure and costs. So then you come down here um it's the calculation for cost of equity calculation for current WAC. Okay. So now for the results um of the code. So the Netflix current um WACC calculation based off this information um is going to be 11.22%. And then the WAC after the 3 billion debt issuance um ends up being 11.13%. So a negative.82% change in um the weighted average cost of capital. So um questions three and four um project evaluation and ind industry comparison so project specific discount rates um so the typical US content firmwide risk is 11.22% and then the international content higher risk equity only is 11.65%. And then Netflix versus industry peers so Netflix is current is 11.22% Disney's is 8.2% 2% and then Amazon Prime's is 9.5%. And then so here's kind of the explanation um of difference between Netflix and Disney. So the 11.2 is 3.02 higher than Disney's 8.2 primarily due to the higher cost of equity. Um Netflix's high beta at 1.3 reflects higher systematic risk and volatality compared to Disney. investors demand a higher um re and then lower debt weight. So Netflix is um uses a much lower percentage of cheaper debt than Disney um leading to a higher overall WACC. And then number five, optimal capital structure strategy recommendation initial WAC um and then WAC after debt too. So recommendation proceed with the 3 billion um debt issuance. The additional debt lowers WAC and moves the company toward an optimal um capital structure by increasing the debt proportion. Netflix benefits from the tax shield um making its capital cheaper. So this cheaper capital is favorable for financing the 5 billion content investment improving the project's net present value. So now we can go back to the document we were working on and go to the next step. So the validate this is kind of saying that the average for the media industry um for weighted average cost of capital is 8 to 10%. Netflix has um higher risk and higher equity rate compared to the industry. So that makes sense that they would be at 11.2% um for this. So Disney's 8.2 um the differences is driven by they have a lower beta, higher credit rating and more stable diversified cash flows. And then Amazon's 9.5%. The differences stem from a massive diversified business, so lower perceived risk and then um aa like borrowing environment. This um WACC makes sense for this market because Netflix is purely streaming company with volatile cash flows and heavy reinvestment um strategy. So um next for the evolve optimal capital structure strategy recommend gradually increase um leverage towards the 10 to 12% debt share still below competitors. Um the rationale subscription revenues are increasively stable. Additional debt slightly reduces WACC and Netflix's current level leverage 6% is far below Disney's 30%. financing strategy. Issue the three billion debt now as I said and then um the risk of downgrade is low. Use fixed rate debt to hedge interest rate volatility and then maintain flexibility to finance major content deals. So then um my reflection was strategic implications for the investment decision include using a firm wide 11.2% 2% WAC would over um penalize safer US content and under penalize risky international products projects. A project specific WAC allows more accurate decision-making US content hurdle at 10.3% and inter international content hurdle at 12.1. So future W um WACCC could fail if Netflix um stabilizes FCF improves credit rating diversifies or sorry it could fall not fail diversifies revenue and like in ads games and licensing liceansings. So the conclusion, Netflix should adopt a targeted risk adjusted WACCC framework and moderately increase leverage to lower cost of capital and finance growth without compromising its credit profile. So yeah, that's my session nine project. Thank you.",
  "video_url": "https://youtu.be/WMdP0124fNk"
}