{
  "student_name": "None None",
  "org_defined_id": "037163659",
  "username": "evans596",
  "video_url": "",
  "transcript": "0:01 Picture this. You're a s- Stales rep closing a $100,000 deal. Uh, the client asked for a 10% discount to seal it.\n0:11 You agree thinking that you're being helpful. But here's what you don't really realize in the moment. You just cut your personal- commission in half due to a penalty rate that kicks in at 5%.\n0:24 That small discount just cost you thousands of dollars. So this is why today I built an AI-powered sales commission optimizer.\n0:35 It's It's. The conversational work flow that kind of helps sales professionals understand the real financial impact of their discounting decisions in real time before they hit send on that, that proposal.\n0:50 So here's how it works. So. So, A sales person typically, or they, they'll type in their, their deal, uhm, in English.\n0:59 I have, you know, for example, $100,000 deal with 10% discount and $500 in expenses from GBP. The a- A.I. instantly will extract the data, fetch the currency rates, and kind of run the commission math.\n1:16 So here's where it kind of leveled up and gets very powerful though. The system doesn't just calculate, it kind of advise.\n1:23 So it identifies when you kind of crossed the commission cliff, if you would, kind of shows you exactly how much money you're leaving on the table, and provide specific optimization strategies for you going forward.\n1:37 Um, so if you're in, in penalty territory, it generates a professional to email template you can send to your client.\n1:44 Repositioning the discount as premium value adds, like, priority support, or premier onboarding. Uh, you're not taking anything away. You're re- framing the conversation to protect both the deal and your paycheck.\n2:00 So the work flow processes everything in seconds, um, natural language input, multi-currentcy expense conversion, um, commission calculations. With discount penalties and personalized coaching and all through kind of that simple interface.\n2:18 So it's not just about math, it's kind of about empowering sales people on, you know, with financial intelligence at the moment of decision.\n2:27 You know, it turns kind of off or 10% off into here's how to structure this deal. So we both win.\n2:34 So I'll kind of, of, of run this real quick. I can move that. Um, and, and just kind of hit execute.\n2:46 And let's let that run. And it'll just take a little bit for it, uh, to get through all the processes.\n2:57 And then we'll go to the out. And we will get rid of input so that we see output. Um, so it'll go and it'll show us the email.\n3:11 So it just kind of describes it looks like your current deal. Analysis shows a deal size of zero dot. And it just kind of depends on what you enter on the deal.\n3:20 Um, and it kind of just has different areas of, like, engage the client. Um, identify opportunities for value. And it kind of just tells you and works you through, um, how you need to talk.\n3:31 In the email. Um, and you know, the, so the overall result is just smart negotiation and protected margins and sales reps who understand that every percentage point of discount has a real actual dollar impact.\n3:48 On their, their take home pay. So that's the kind of the power of this AI driven, uh, sales optimizer. So thank you for joining me today.3:56 And that is all."
}