{
  "student_name": "Krish Aggarwal",
  "org_defined_id": "036289409",
  "username": "aggar117",
  "video_url": "https://youtu.be/G8G0IHOOXWw",
  "transcript": "(0:03) Hello, so today I'm presenting a comprehensive evaluation of Panera Bills for Prospective (0:08) Revenue by KKR. (0:10) So first, our goal is to determine a defensible bid range that balances financial discipline (0:14) with competitive aggression. (0:15) We are operating under a specific conflict, as a financial buyer, KKR requires a 20% (0:20) plus IRR based on standard loan cash flows.\n(0:23) However, we are competing against strategic bidders like Starbucks or Medard, who can (0:27) justify paying a premium due to operational synergies. (0:31) Panera is a strong asset, $6 billion in revenue, $900 million in EBITDA, and 15% margins. (0:38) The growth story is solid at 8%, driven by a digital mix that has already hit 50%.\n(0:44) However, this market is expensive. (0:46) Bidders like Chipotle trade at 35x their PE, and our goal is to find an entry point with (0:51) enough works to flow an LBO without getting into a bidding world that we cannot win. (0:55) In this analysis, I've used the driver flow to map, execute, and validate our build strategy.\n(1:17) I've mapped the valuation drivers into a Python class structure called Panera Value Engines. (1:35) If you look at the quote here, you'll see that I haven't hard-coded the values deep (1:38) in the formulas, instead I've categorized our key assumptions at the top. (1:43) So, we're looking at EBITDA, $6.9 billion in EBITDA, capital assumptions, we're using (1:47) the walk and hop percent, which is standard to this sector.\n(1:49) A crucial element, which, note that the self-management on which we're rolling rate equals 0.1. (1:54) I'm assuming management rules over temporal equity. (1:56) This is a critical part of our model because it reduces the cash that KKR needs to write, (2:00) significantly boosting our IRR. (2:01) I've also represented three distinct scenarios.\n(2:03) Downside, where growth is close to 4%. (2:05) Base case, the management plan of 8% growth. (2:08) And just a strategic case, a synergy scenario where 11% growth and 17% (2:12) margin, representing what Starbucks could achieve.\n(2:15) Next, moving on to implement. (2:21) So, I built two core engines. (2:22) First, the DCF engine.\n(2:23) This automates a five-year project and it calculates free cash flow by stripping out (2:26) taxes, capex, and working capital changes. (2:29) These are the broad and growth terminal values. (2:31) By automating this in Python, I can instantly toggle between our three scenarios without (2:35) rebuilding a spreadsheet.\n(2:36) Second, and most importantly, for us as financial advisors, the LBO engine. (2:43) This engine calculates our return. (2:44) It's also sources and uses as a part of 5.0X leverage, which approximately $4.5 billion (2:49) in debt paydown.\n(2:51) It estimates how much debt we can pay off over five years using calculated cash flows. (2:55) And it calculates our multiple uninvested capital, or MOIC, and IRR. (3:00) And so, after running the code and some of the visualizations that I'll show, we came (3:08) down to right back here.\n(3:10) And as you can see in the class alpha, our base case DCF arrives at an evaluation right (3:20) about there, cycle for seven. (3:23) And if you look at the LBO logic, yeah, if you look at the LBO logic, the model predicts (3:32) about 8.0% projected IRR over a five-year phase. (3:40) And these are some of the strategic recommendations.\n(3:42) This is with an opening bid. (3:45) Strategic one, we'll look at about $10.8 billion. (3:47) Our target should be about $7.5 billion, though, so we can work it down.\n(3:52) And this is about a good middle point between the target bid and opening bid. (3:56) And here's some of the rationale behind this bid. (3:59) Now, moving on to some of the visualizations.\n(4:04) Looking at the football field chart, we can clearly see the market context. (4:08) The gray bars, which the market cap suggests a range of $12 billion to $16 billion. (4:14) The global share, this bar over here, the KKR base DCF range, and roughly right there (4:23) at 7.5. (4:24) And then the green bars, the strategic one, the strategic bars to push the valuation up (4:32) to nearly, what's this at? (4:34) $11.2 billion now.\n(4:36) This issue validates that while our bid is competitive with market price range, we are (4:39) at a significant disadvantage against a strategic bidder like Starbucks. (4:44) So I'm running a sensitivity analysis here between walk and terminal growth. (4:49) As the key map shows, our valuation is highly sensitive to the cost of capital.\n(4:52) If market volatility pushes bulk from 9% to 10%, our valuation drops, our valuation (4:58) drops from nearly to $2 billion, which is a key risk factor that we must underwrite. (5:04) And this last valuation bridge, this is a cross-core conflict. (5:08) I involved this analysis alongside the strategic premium.\n(5:10) This waterfall chart explicitly bridges the gap. (5:14) This is our standalone value bid right here. (5:19) The green bars over here represent the (5:22) supply chain efficiencies and digital scales, as well as HQ caps.\n(5:27) And then these are values that we cannot capture. (5:30) This chart visually explains why we must be disciplined. (5:32) If bidding exceeds $16 billion, we are paying for technologies that we will never realize.\n(5:38) We're sorry, over $11.2 billion. (5:45) So in the final analysis, we translate these numbers into a bid strategy. (5:48) So our opening bid, suggesting about a 10.8, which is approximately 12% of the percent of that.\n(5:59) This anchors negotiation at the lower end of the personal transactions. (6:03) And we're comfortable stretching to roughly about 7.5 at this price. (6:09) That's right, rollover, logs, incentives, and we secure 24%.\n(6:13) We secure our 8% IRR. (6:16) And our walkway price, our hard ceiling is $9.3 billion. (6:22) We on the spot returns composed between 18%.(6:24) We enter strategic pricing territory where the MET no longer supports a financial value. (6:29) Next step, we need to validate the debt capacity with our lenders to confirm the 5.0 leverage (6:33) assumption. (6:33) If confirmed, we can proceed with the initial indication of interest at $11.2, (6:40) sorry, $10.8 billion."
}