{
  "student_name": "Matthew Sant'Anna",
  "org_defined_id": "037006517",
  "username": "mwsantan",
  "video_url": "https://youtu.be/i-h0iXh3taQ",
  "transcript": "All right. So for my session 13\nassignment, final session,\num I wanted to create a very easy to\nunderstand and very useful uh tool to\nhelp people like me who\nare in college and are wanting to save\nmoney. Um so I kind of have a problem. I\nhave three credit cards. Um, I I earned\ncash back, but I couldn't answer the\nquestion, am I actually spending money\nor saving money or spending more because\nof swiping? Swiping feels free.\nUm, I know a lot of other college\nstudents have this problem cuz they want\nto get credit cards to save money to and\ngrow their credit score. Um,\nso anyone with anyone with rewards on\nthese credit cards feel like they're\nwinning, but they might actually be\nlosing. So, I created this credit card\nreality check to help answer that uh\nquestion. So,\nI prior recording, I did the math in my\nhead of what my monthly spending was,\nand I roughly spend around, I believe,\n$900.\nAnd I organized it to have my three\ncredit cards. So any person who has this\ntool can change whatever credit card\nthey have um or whatnot and to put the\ninputs. It created categories to\norganize your spending habits. So for my\nbills, I spend roughly around 500 bills\nand I use my uh Capital One card for\nthat. It logs it in the bottom.\nFor dining, I use my Discover card for\nthat one. And I spend roughly around $90\na month on dining. Gas, I'm spending\naround\n$180 and I use my Capital Capital One\ncard.\nFor entertainment, I use my Chase card\nand I spend roughly about $100 a month.\nUm,\nand another category.\nPut gas.\nUm,\nI believe that's the primary stuff I'm\nspending money on.\nYes. So, after you have all your\ntransactions, a rough estimate of what\nyou spend, you can analyze your\nspending.\nAnd uh to validate or testing my work,\nyou can see right here it it calculates\nthe total rewards earned. So I earned a\ntotal of $12.60\nversus baseline spending minus $30. Net\nresult $12.60.\nSo, the AI analysis is that I'm actually\ndoing well this month. Spending $30 less\nthan usual while earning $1260 in\nrewards gives you a net positive of\n$4260.\nHowever, my card optimization could work\nsince I'm leaving money on table with\nthat $90 dining purchase on Discover.\nUm, it gives you your analysis. It gives\nyou a recommendation. I can get a it\ntells me to get a dining focus card or\ncheck if any of my exist existing cards\nhave rotary rotating quarterly\ncategories. It gives me a breakdown and\na bottom line. So what I learned about\nbuilding AI is that prompting\neverything. You know my first version uh\ngave a genetic\nuh generic advice. So I explicit I had\nto explicit explicitly tell Gemini and\nClaude to be brutally honest by\noverspending. But the hardest part I\nthink was making I AI call uh call work\nreliably. Fixed it by adding error\nhandling. My biggest lesson is simple\nand working beats complex and broken. I\nI am I I'm going to keep this credit\ncard reality check uh saved on my tabs.\nUm because the m the money that I put\ninto it, it's not going to be accurate\nevery month. But if I tr truly decide to\nlog my spending every month, just like\nany if anyone wants to answer the\nquestion if they're truly saving money\nor not, they can diligently track their\nmoney in a log, place it in here towards\nthe end of end of the month and plug it\nin and will that you will receive a\nreality check which I think is something\nvery useful and super important for\nyoung college students like me who are\nlike their wallet is small. They don't\nhave a lot of money to spend. So I I I\nbelieve this this is extremely extremely\nuseful and important.\nUm you can start a new analysis like\nthat and boom. So yeah uh that's myassignment and thank you."
}