{
  "student_name": "Aren Dominic Damayo",
  "org_defined_id": "037061012",
  "username": "adamayo",
  "email": "",
  "transcript": "Hello, my name is Aaron Dominic Deio and this is my session 9 assignment submission for Professor Zayn's class management 31000. And today we are going to be doing um uh solving this problem here where effectively we are given the objective to calculate the whack for Netflix and utilize that whack to compare it to its um industry peers and see uh whether or not uh we should do anything about it. So um we're given all of this data here, market conditions, the Netflix financial parameters and also some context uh that's occurring with um our competitors that we can use to compare later on. And so in order to begin um I first started out with the driver framework and I started off with defining so I said we want to calculate Netflix's whack and utilize the whack to conduct conduct internal analysis and in and industry comparisons. Uh pretty simple objective and so that moves us on to discover. So I just put up our known information here. So we already know all these things, right? We know it's market cap, the total debt being 14 billion, the debt's market value, etc. And then um I also did some research uh using Gemini in order to figure out some additional info. Right? I wanted to look at well what's the difference between using project specific whack and also full discount whack. And the where this gets a little dicey is that international content can be riskier due to issues such as political instability, currency, foreign exchange risk and market maturity with some other markets aside from the US being a little less mature than the US market and so much more volatile. So that leads to high risk which also means higher cost of equity and therefore higher whack. So uh when we're looking between project specific whack and full from discount whack, it might be more useful to focus on project specific whack especially when we're considering projects in the US versus internationally because international content has a lot more variables that uh don't have to be considered if we're doing a project that's within the US or primarily targeted towards the US. And so it might be more beneficial in order to do that um since it uh since that also will have a huge impact on our final calculation of whack. uh because if we do a full firm discount whack then that whack might be inflated in comparison to what a whack rep a full a properly representative whack would actually be in the US. Um aside from that too just did some additional research on general whack. So generally a higher whack is better than a lower whack right because a higher whack comes with higher perceived risk more expensive capital lower valuation and fewer viable projects. Um I think I might have said that wrong. I I can't remember exactly but I meant to say lower whack is better than higher whack. Um because a lower whack uh that means less risk uh less less expensive capital, higher valuations and so that allows more products to actually be viable. I might have minced my words a bit there but I meant lower whack is better. Higher whack is not as good and I was just confirming that uh through my research but that finishes off discover uh because we already know how to calculate whack and everything like that and also calculate CAPM which will give us our cost of equity. And so that moves us on to represent. And so we have a pretty simple represent here. Um it starts off with uh I want it to input the known data and clean it so it's readable in Python. Then I wanted to calculate CAPM using the CAPM equation. Then calculate the whack using CAPM and then calculate whack using CAPM again but assuming that the $3 billion additional debt issuance occurs. And so that moves on to our implement phase. So, oh, uh, if we go here, so you can see here's our code right here, um, after we fed it into Gemini and we can run through this very quickly. So, here it's just inputting, um, and allowing the information to be easily read and assigning to variables. The financial parameters, as we know, the market cap's 200, the debt and market value is 13 billion and the beta, etc., cost parameters, stuff like that. Um and then finally and then second number two it calculates CAPM which will also be used for our cost of equity when calculating whack. Um and we can see that's using the equation right uh risk-free uh the return on equity or the cost of equity I should say or in other words CAPM is equal to the risk-free rate plus the beta times the MRP. Why does I say MRP? That's the market risk premium which we know is also effectively just going to be the um market rate minus the risk-free rate because in this case they just gave us the premium so we don't actually have to calculate it and then using that capm we can finally calculate the whack. So it figures out the how much the firm is worth as a whole by combining them together and then it figures out the weights of equity versus debt. Um you know that would be like you know 200 billion dollars or was a million dollars um billions of dollars. Yep. So $200 billion dollars in equity against the full firm weight of I think around 213 billion and then takes the 13 billion of debt and divides that by 213 to figure out how much of each do we have or how much generally percentage- wise do we have in equity and debt and then it calculates the after tax cost of debt because as we know there is the tax shield and why debt and this is why debt is generally cheaper than equity because um interest expense uh allow interest expense is taxdeductible and Because of that, um there is added benefit that comes with engaging in debt as opposed to engaging with um equity. And that's why it's generally cheaper and as a whole will generally lower the whack if you have more debt as opposed to equity or just in general more debt in general. Um and then finally, we can calculate the whack, which is pretty simple, right? We take those weights and then we multiply them by the respective costs of those weights. Um and that tax shield has already been put into place. And now we have uh this number four, which basically does the same thing, just adding the $3 billion in debt um $3 billion in debt to everything that is currently around. Um and then that allows us to calculate a new whack based on that. And then finally, um prints the comparisons and then if we click play, we can go ahead and see the differences here. Uh so it has a it puts out our information again. It calculates the cost of equity for us which calculate to be 11.65%. Uh and we can go ahead and do some validating here too. Um so if we take a look uh we already know uh which calls the calculation for cost of equity is correct based on the code but we can go ahead and check the number at the cottage result as well. So uh we know that uh this should be 045 and then we are adding the beta. Nope. Oh, kind of lagging out. Okay, we're going to add the beta and then we have to multiply the beta by the market premium. So, that's the risk-free rate plus the market premium times the beta. So, that looks like it's correct there, 11.65. We're going to go ahead and move this to the side here so this will be easier to use. Good. So, we know that this value is correct. And then our whack calculation. So, we're just going to go ahead and check this whack. Um, so we can see it calculated finally 213. That that's correct. We don't have to check that. uh it calculated equity weights to be 93.9% and 6.1% towards debt uh equity and debt respectively. So we can go ahead and check that. So if we take 200 divid by 213 93.9 which seems to be correct it's just rounding and then if we take the debt which is 13id 213 um we get 061 so or 6.1%. So both of these values are correct. Um and then it takes the after tax cost of debt. It finds that by taking uh which calls the bond uh that was in the known data. So we knew before that um the known bond rating was had a yield of 5.8%. So that's our cost of our debt because that's primarily the um avenue that we are um financing our debt from. And then we can figure out the tax shield from that because there's going to be interest expense that we pay on that. But we get to deduct that and so that's why our cost of debt isn't five uh 5.8% but it's actually 4.58 uh 4.582%. We can go ahead and check that value as well. So we take the market uh sorry the bond and then we times it by the tax shield and that gives us the same value and then finally the whack. So if we take all of these values, right, we know our cap m from before was 0 uh 1165. So we know that this was our cap m. We're going to go ahead and copy that there. So this is our these are this is our equity. This is our debt, right? And then so and then these are the weights and this is the cost of each, right? And then so if we go ahead and multiply these two together and then we sum them together just as the equation calls for we should get the same whack that they calculated which is absolutely correct. So it looks like the code is doing correctly absolutely correctly here. And then uh we can go ahead and see here when we add that $3 billion of additional debt I mentioned you before how debt is cheaper than equity. So theoretically, this should lower our um whack and we can see it does finally in the end, right? It lowers it by not a ton because there's still a huge amount of equity, but it does lower it by by a bit. So that.1% goes down, which is good. A lower whack is good as we as we um talked about before. And then finally, it gives us a summary for comparison. So we can see Disney Wax, Amazon WAX, and also the industry range. Um so we see our code works. That's good. Um and that moves it and we've kind of already started doing it but uh we can go ahead and validate it. So it does make sense. It seems to absolutely 11% isn't crazy although it is a bit high. Uh but we did check the values as well. So we did manage to hand check our calculations. So that's good. Um and also the code definitely makes sense. All the equations seem to check out and also the um the whack lowered when we added a de additional debt. So that's good because that's what it should do. Um now we can also perform a sensitivity analysis. So if we go ahead and change some values around here, let's go ahead and corporate tax rate should always be that. But let's say we change the risk-free rate to like uh yeah, let's say 048. Okay. Um and let's have the initial debt uh increase by a bit. So if we run this again, it shouldn't change the values by too much. Yep. You can see that uh the whack increased, but not by a ton. Uh 2% here roughly or so. Yeah, 0.25%. And here another 0.25% as well. Does that make sense? I'd say so. Why? Because the risk-free rate increased. And yes, even though we increase debt by a billion, it's only a billion, which in comparison to 213 billion is very very small. And also the risk-free rate going from 045 to 048 has a huge impact because that is a key component in a lot of things. Cost of equity will increase because it goes up by at least 03. Um, and then also debt will increase as well. Um, and so generally the cost of equity increases by a ton and that's why the whack would increase. So that makes sense too. And it seems like you know the numbers aren't getting crazy. So our model is generally pretty robust considering the fact that if we change a few values it won't completely break it. Um and now we can talk about evolving a little bit here. So um I think some things to take this further in the future could be some visual representations whether we use some visual representations to compare it to like other people other companies or maybe potential uh possible other like wax that could be if we attempt to work with that. Um, also a clearer ending output could be nicer, right? This can kind of be jumbled. So maybe some easier separation or some clearer divisions between these things to help us understand, but I do think it's pretty clear already with how it is. And then also focusing on project specific whack, right? We talked about before how there's project specific whack and we can use a firmwide discount whack. Uh, because in this case, we're calculating the whack and it seems to be generally just for the whole firm as a whole. But we know there's differences between international markets and things issues with like foreign exchange rates that can potentially bring down the value or make it more expensive and also like instability in other countries. And so if we focused on project specific whack which could be focused on things like in the US, we might be able to lower our whack at least for certain projects and the whack can be more representative. So, and that would make sense with how our whack is a bit higher, too. And it might be more beneficial to focus on project specific whacks because of the fact that our whack is seeming to seeming to be really high. And that makes a lot of projects seem way less viable than they could be. And so, now that we can go ahead and reflect on what we've done so far. So, we've calculated and confirmed Netflix's whack, right? We got that um 11.22% and I'm going to go ahead and change the values back to what they were. So, then we can go ahead and see them again. So, we got the racks of the wax of 11.22% and 11.13% with the $3 billion uh issuance, right? So, that's good. We found the whack for both case scenarios. Uh that being said though, if we compare it to um the market competitors, you can see that Netflix's whack is actually pretty high. It's above industry range already. And um Disney and Amazon, which are two of its biggest competitors, uh have a significantly lower whack. Amazon isn't as low as Disney is. It's 9.5%, but it's still within that industry range. So, it's still in a respectable range. And then Disney's is pretty low, 8.2%. And why why would this be the case? Well, if we take a look here, we can see Disney uses a capital structure of 70% equity and 30% debt. So, they have a ton of debt in their company. And that's what's lowering their whack by a ton in comparison to Netflix. And that means uh as we mentioned before, a lower whack is better than a higher whack. So um what I'm going to call this they are able to engage in more projects which will generally bring them more profitability because their cost of equity and their whack isn't as high because they have so much more money in debt as opposed to equity which as we know debt is cheaper uh than cost of equity uh due to um that tax shield. So um our final suggestion what would be our final suggestion for Netflix? the whack is too high and we need to do things like increasing our debt or maybe engaging even stock buybacks to reduce that equity so that we can lower that whack and we want to lower it to around at least 9% to at least be competing with the industry if not lower um of course right introducing too much debts or maybe taking away too much equity of course can be instable uh make the company more unstable so that's why I suggest bringing things to at least targeted around 9% uh because then we'll be in a much more respectable range where we'll still be able to engage in projects and not be burning too much um uh which I'm going call this not be burning too much equity and too much um shareholder value but at the same time we're also have enough financing that we can actually still stay afloat and engage in projects in the first place. Um but yeah so generally increasing debt engaging in stock buybacks and changing our capital structure in general cuz right now our capital structure is as we can see here 93.99 9% to 6.1% and Disney has a 70 to 30% uh ratio which is significantly different from ours. They have a much better uh division between the two. So we definitely should increase our debt and that should help us lower our whack by quite a significant margin. But we've gone ahead and calculated the whack uh both currently and after the $3 billion debt issuance. We've also evaluated the project specific whack and how the benefits that that can present and also compared it to its industry competitors and what Netflix needs to do um in order to bring it down uh bring down our whack, right? Increasing that debt to maybe at least around 8020 in comparison, maybe not quite as far as 7030, but at least 80% 20% so that we can get that whack to a respectable range. Uh but that's it. Thank you.",
  "video_url": "https://youtu.be/PJ6_3N98n_0"
}