{
  "student_name": "Silas Bowman",
  "org_defined_id": "036111483",
  "username": "bowma177",
  "email": "",
  "transcript": "So my this assignment is to determine the weighted average cost of capital or WACC for Netflix specifically to evaluate a hypothetical 5 billion content investment decision. WACC is the most critical benchmark in corporate finance. Silas Cameron Bowman 0 minutes 19 seconds Finance It is the minimum return the company must earn to satisfy all its investors, serving as a hurdle rate for capital allocation. So for my define and discover stage, I began by defining our required inputs, prioritizing market value. Silas Cameron Bowman 0 minutes 39 seconds Over book values to capture current investor expectations, equity value as market capital of 20 billion, debit value market value of the debt is 13 billion cost metrics. We use the bond yield of 5.8% for our pre-tax debt costs and our CAPM inputs are a beta of 1.3. Silas Cameron Bowman 0 minutes 58 seconds Risk free rate of 4.5% and market risk premium 5.5%. Tax shield is a corporate is 21%. Now in the represent stage our analysis is governed by the WAC formula. So this structure clearly shows the WAC is. Silas Cameron Bowman 1 minute 15 seconds A blended cost weighted by the proportion of debt to equity. I'm using the WAC formula and we calculate the cost of equity using CAPM and utilize the 1 -, T term to capture the tax shield effect, which is essential for determining the true after-tax cost of debt. Silas Cameron Bowman 1 minute 32 seconds Now for implementing the code, so we or I implemented a model into Python for the accuracy and here are the core calculations. So to start we put in all the input all the parameters. Silas Cameron Bowman 1 minute 49 seconds Everything needed and required by the assignment with the content investment and now we're using the analysis. So what we did here was use the R. Silas Cameron Bowman 2 minutes 4 seconds REF or RE equals RF plus beta times MRP. So this is the cost of equity CAPM calculation. We found the return required by Netflix shareholders is 11%. Silas Cameron Bowman 2 minutes 17 seconds And this reflects the systematic risk inherited in the streaming business, so showcasing that it is 11.65% in the output here. Silas Cameron Bowman 2 minutes 29 seconds So next the Rd. after tax equals Rd. pre-tax. So this is after tax cost of debt. The 5.8% tax yield is reduced by the 21% tax shield yielding 4.58%. This is significantly cheaper than the equity. Silas Cameron Bowman 2 minutes 47 seconds So that's shown here, 4.58%. Silas Cameron Bowman 2 minutes 55 seconds And then back up to here, so. Silas Cameron Bowman 3 minutes 1 second In the current WAC calculation, so here the weight these costs by the current structure is 93.9% equity and 6.1% debt. This results in our first required output, the Netflix current WAC, which is 11.16%. It's our initial hurdle rate. Silas Cameron Bowman 3 minutes 20 seconds So. Silas Cameron Bowman 3 minutes 25 seconds Or the current hurdle rate is sorry, 11.22%. Silas Cameron Bowman 3 minutes 33 seconds 93.9 and 6.1 um. Silas Cameron Bowman 3 minutes 38 seconds O then next. Silas Cameron Bowman 3 minutes 41 seconds Um. Silas Cameron Bowman 3 minutes 43 seconds The model which the new debt WACC calculation. So we modeled the impact of the three-point billion debt in issuance and increasing debt to 1 or 16 billion. The debt raises or rises to 7.4% and the whack after insurance drops to 11.. Silas Cameron Bowman 4 minutes 3 seconds 07 This confirms the new cheat debt is incrementally beneficial. Silas Cameron Bowman 4 minutes 10 seconds So as you can see here 169.2 and 7.4 I'm sorry at 7.4. The new debt is 11.13 now. Silas Cameron Bowman 4 minutes 21 seconds So we now validate the 11.22. So in the product specification our firm wide WACC is the average and we must use a projected specific discount rate for the content investment. So the US content lower risk requires a WACC better. Silas Cameron Bowman 4 minutes 41 seconds 10 or below 11.16 and international content high risk requires a WACC above 11.16, so valid the validation insight 11.22. So using the wrong hurdle rate will lead to the incorrect investment decisions. So making sure we're using the. Silas Cameron Bowman 5 minutes 1 second 11.22. Silas Cameron Bowman 5 minutes 3 seconds So Netflix 11.22 WACC is high, sitting above the media industry range of 8 to 10% and significantly higher than Disney's at 8.2 WACCC whack and. Silas Cameron Bowman 5 minutes 18 seconds Using the the Uh difference is probably due to the capital structure. So Disney uses a 30% debt. Um. Silas Cameron Bowman 5 minutes 27 seconds Maximize his attack shield while Netflix low leverage inflates his blended cost of capital. Silas Cameron Bowman 5 minutes 34 seconds So. Silas Cameron Bowman 5 minutes 36 seconds Our analysis reveals A strategic opportunity, so Netflix is under leveraged so. Silas Cameron Bowman 5 minutes 44 seconds The recommendation is never should increase its debt to equity ratio beyond the proposed 3 billion. This will further reduce WACC by maximizing the tax shield, which currently outweighs incremental cost financial risks. So integration of finance and technology are WACC sensitivity analysis shows that the moving debt closer to the target of 20 to 30%. Silas Cameron Bowman 6 minutes 4 seconds Will minimize the firm's required rate of return and maximize shareholder value, and that's shown it here. So this should be a computer sensitive analysis. Silas Cameron Bowman 6 minutes 13 seconds And in the conclusion, our technical implementation provides clear answers. The current WAC is 11.22, so for the hurdle rate and the WAC after debt as shown online is the. Silas Cameron Bowman 6 minutes 28 seconds 11.13 and strategic insight. So we recommend the 3 point or 3 billion debt issuance. As it lowers the WACC, it is financially or fiscally responsible step towards optimizing the company's critical or capital structure. Mastering WACC is how we translate financial theory into strategic value creating corporate decisions. Thank you.",
  "video_url": "https://youtu.be/ML454c__6s8"
}