{
  "student_name": "None None",
  "org_defined_id": "037007344",
  "username": "icorrale",
  "video_url": "",
  "transcript": "Hello, my name is Isabella Corrales and today we are going to look at an app that I've made that can help you if you ever feel confused in a finance class or over a certain topic that maybe someone you hear is talking about, whether it's investments, budgeting, any sort of financial topic, whatever it may be, this app acts as a finance concept tutor that really breaks down the information in a way that can make sense to you. You can ask it a series of questions, quiz yourself and look at the lessons and sort of a flashcard like quizlet setup is what I was aiming for. So, you know, of course that took me quite a few driver loops to actually get to where I wanted to, like where the AI was performing how I wanted it to. So for our first like first, second, third driver loop because this AI was just not picking up on the things that I wanted it to, and I just wasn't able to program it in a way that was like working for me. And it, you know, so I went through multiple loops and still just was not working. So I decided to switch sites, but it's still, as you can see, has a setup of lessons, quizzes, flashcard, progress checker, and then asking a question. So it still has like what I had just very, very vague information. Yeah, like just very vague and it was hard to add more. And so anyway, to Once I moved on from that, I went to Financify AI, which the AI was picking up like exactly what I needed it to do. Yeah, it was, I was able to program it in a really good way that just presented the information in a way that I liked and you are able, I'll just kind of walk you through. So, right, we have these study buttons. Here's our decks. So this is all sorts of concepts that I've taken over here. You know, we have the stock and the bonds, the time value of money, risk and return, capital asset pricing, market efficiency, so on. I took majority from there and compared all of the information that it spit out to ensure that it was all accurate and it all was or is. But just to kind of look at one, you know, study. And it's like a flashcard, kind of like a Quizlet thing, which is what I was aiming for. And then, you know, you can say if you got it right, or not, and that helps kind of track your progress and where you are and what you still need to look over. So that's super cool. You know, and then it goes on to just different topics, specifically this one. You know, it says that a beta. Less than one means it's less volatile, and then greater than one indicates a higher validity. And I remember when I first learned about this, I wondered why that was. And so I had the question myself. So even here, as you can see, don't understand Ask AI. So you can go over to this AI tutor and type in a question and say, what makes 1 beta good? Because I legit asked the exact question whenever I was learning it for the first time. So it's, you know, just any sort of minuscule thing like that, that you just need to understand a little bit better in your head. This is great for it. You know, it also has good in parentheses, because really that is an interpretational sort of word. So it's not biased in that sort of sense. But, you know, it talks about its benchmark and kind of what it means when they say it's of one. So just that the market, if it goes up by 10, that the stock is also expected to go up by 10. And, you know, conversely, if it drops and it'll drop, which, you know, just that evening out of the action and reaction, like the sort of even field that is there. And then how it's, you know, predictability or it's predictable behavior, the balanced risk, diversification and then Here's some examples. So if, you know, you're like, okay, well, this is what happens when it is equal. So what would happen, you know, if it wasn't equal and so on. And it does not give you the same response, like if you were to ask it, because I practiced asking it this question. And so this actually is not the exact same response that I got. Yeah, so that's super cool. And then after, you know, you've been studying your flashcards, asking it questions to break it down even further, you can go back to your home and quiz over it. So for that, you know, just to rapidly go through it, I'm going to just, oops, I actually clicked on it twice. I'm just going to, you know, click random ones so that you can just see the idea. But yeah, so like just doing this really fast just to show you just the kind of setup that we have here. So and it's not also in this it's not also like the same wording it was um in the flashcards so it's not like you're just memorizing things too which is great but right here it tells you what I need to review which is great with the whole tracking your progress and everything like up here it says you know we've got Some cards that we need to review and everything areas to improve will start to show up once. Like in the flashcards, whenever you say if you understood or not or like got it right or not, then it will pop up here after you know more data is collected. But yeah, so. This makes it easy for people. to learn at your own pace in your own way you know oh I forgot to show you actually how well learn your own pace your own way goes perfectly with that reminded me because you can create your own deck and for this we can do a capital budgeting wait when that thing pops up okay and then a little description And then you can create a deck and then you can use this handy AI generating flashcard tool and copy in a little description of what you, you know, want. And then you can choose however many cards you think would fit. It doesn't take long, but you know, just keep it short. We'll do like just a little bit of amount. And then it kind of tells you the right, medium, hard, easy. They just don't have any easy, but they have the form. And yeah, so then you can just get that in that easy. I mean, yeah, and like I said, it has accurate information all throughout. I've double checked, whoops, I've double checked. oh my God oh my God oh my God okay I have no idea what's going on but I have double checked so yeah um that was my app but it's gone wonk at the end here but thank you."
}