{
  "student_name": "Shree Bavana",
  "org_defined_id": "034904788",
  "username": "sbavana",
  "email": "",
  "transcript": "Hello everyone, I'm Shri and welcome to this capital budgeting analysis. Today we are evaluating a major investment decision for Starbucks. Uh the proposed 12 million flagship roaster project which has a 10-year lifespan as required by the driver framework. We began by defining and discovering the core problem. Our goal is simple. uh it's to determine if this project creates financial value for Starbucks uh shareholders. We will use the firm's cost of the capital A WC of 8.5% as our hurdle rate. Our decision is clear except the project if its net present value is greater than zero and its internal rate of return exceeds the 8.5% of uh WCC. Our primary financial inputs include the 12 million initial outlay and a 500,000 working capital deployment along with a 25% tax rate. Before coding, we represent the problem by sketching the cash flow timeline. Unlike a simple P&L, this analysis uses incremental cash flow, tracking cash, not accounting profit. Our model structure isolates the initial investments, tracks operating cash flow every year and accounts for the working capital recovery and a terminal value in year 10. Moving to the implementation phase, I built a parameterized Python model. All revenues, cost and WACC are defined by variables which is key for our later sensitivity test. We calculate our 1.2 million annual straight line depreciation up front. Uh first the model constructs the full 10-year cash flow schedule. We must carefully distinguish between acral profit and cash flow. For instance, the OCF is calculated by adding back the non-cash depreciation expense to our net operating profit after tax. This Python code transforms a comprehensive financial analysis of a project including a base case scenario, sensitivity analysis and visualization of the results. And here's a breakdown. So first up we have section one which is a setup and parameterization which has been the same for almost every um all of the earlier uh Python setups we've done so far. Um it imports all the necessary libraries like pandas, numpy, uh mattplot lib which is for plotting. Um and numpy financial is for inst like if it's not present it kind of defines all of the key financial parameters and assumptions for the project uh such as project life uh weighted average cap cost of capital tax rate initial investment. This is really helpful. Uh these parameters are crucial for building the financial model. Next up we have our assumptions right here that I have mentioned earlier. Uh well going uh moving on again these are param par parameters moving on to core cash flow and metric functions. So here's one function that's called create cash flow which takes the project's financial parameters and constructs a detailed incremental cash flow statement. It calculates revenue and variable cost, fixed operating costs, um uh COGS operating expenses, uh earnings before tax, net operating profit after tax, operating cash flow, and finally the total incremental cash flow over the project's life. Um here we go. This is the end. This is the end of our first function. Uh next up we have the calculate metrics which computes the key financial metrics based on generated cash flows. It calculates the NPV, IRR, the profitability index, uh simple payback period and discounted payback period. This these metrics are fundamental for evaluating the project's financial viability. Uh next we have the base case execution starting from here uh which defines the revenue base schedule using the parameters set in section one. It then uses the first uh function that we created which is the create cash flow uh to build the base case financial model and calculate metrics function to compute the base case financial metrics. Uh finally it prints the base case cash flow schedule and calculated financial metrics in a readable format. I can just show you the results here. Uh this is what we have using all those functions and this is our plot and coming to the NPV sensitivity. Let's get back to this. Uh so for this part it's a sensitivity analysis uh to understand how changes in key variables affect the project's MPV and IRR. It defines several scenarios. A revenue that is reduced by 20%. Uh it calculates the NPV and error and it if the revenues are 20% lower than the base case. Uh the second one is an increase in the WACC by 2%. uh it calculates the NPV and IR using a higher uh WACC. Uh well, inversely we also have a decrease uh which is scenario three. The results of these scenarios are stored and then compiled into a pandas data frame and printed showing the NPV and IR search. Next for our visualization we used Matt plot lip to create two plots base case incremental cash flows uh which is a bar chart showing the annual incremental cash flows for the base case from year 1 to year 10. Next up we have the NPV sensitivity. It illustrates how the how the NPV changes from different sensitivity scenarios which is the base case which is here in blue. end of the revenue is decreased by 20% and the whack uh with a 2% increase uh and and then a negative 2%. Uh finally the executive recommendation this part here it uh provides an executive summary based on the analysis. It states whether the project should be acceptable or rejected based on the base case MPV. It also highlights the key financial insights from NPV, IRR, payback periods, and the profitability index. Furthermore, it summarizes the findings from the sensitivity analysis, emphasizing which variables the project is most sensitive to and concluding on the project's overall robustness and risks. So, I'm just going to read out the recommendation here. It's the NPV of our base case is positive which indicates it that it creates value for the Starbucks shareholders. Uh key financial insights include value creation, liquidity payback and capital efficiency. Uh the project recovers its initial investment quickly with a simple payback of 6 years and a discounted payback of 9 years. Uh the profitability index of 1.24 24 suggests that for every dollar invested, the project is expected to return 1.24 in present value terms. Uh the project is more sensitive to changes in revenue. If it falls by 20%, the NPV turns significantly negative demonstrating that the project success is highly um uh dependent on achieving a high revenue forecast in the initial years. It also shows that the project is financially robust against any WACC fluctuation. fragile if the sales targets are missed. Uh the most critical finding is the revenue shock scenario. If our anticipated revenues just fall by 20%, the NPV drops and the IR falls below our hurdle rate which does show that it's highly sensitive. Uh for the reflection part, I found that the project's high sensitivities were surprising despite its positive base case. This moves our analysis beyond simple financial metrics into a strategic recommendation. Uh the project is financially compelling with a high IRR and NPB. However, the high sensitivity to revenue means acceptance must be paired with aggressive investment in the marketing and the site selection necessary to ensure the high year high uh two to five revenue targets are met. The strategic fit enhancing the exclusive Starbucks roaster brand justifies taking on the calculated risk and providing the execution is flawless. And that's it for this financial analysis. Thank you.",
  "video_url": "https://youtu.be/GKNszU5dogw"
}