{
  "student_name": "Ella Brummet",
  "org_defined_id": "037237297",
  "username": "ebrumme",
  "email": "",
  "transcript": "Hello, my name is Ella Brummet and today I'm going to be walking you through my session um nine assignment. So let's get started here. So this one was based on the cost of capital analysis. Um so using the driver framework, I'm going to be walking you through each step and um uh come to a conclusion. So let's go and get started here. So first step is the Dstage which is define and discover. So essentially what I have included here is just like our Netflix financial parameters. Those were already given to us in the assignment. So it gives us just an overview of like our capitalization, our total debt, our debt, our market value, our equity, our bond rating, which right now we're at a BBV plus, which isn't terrible, but we obviously would like to be at an A. um corporate tax rate and then the current stock price and it gives us a little bit of um information about the market condition. So for example the risk-f free rate which we know is a 10-year treasury and that's at 4.5%. The market risk premium at 5.5%. And then the market industry WACCC range is between 8 to 10%. Um and then it kind of goes into the strategic context. So it gives us some about Disney, Amazon Prime and Netflix. So basically the whole um assignment is based on the fact that Netflix is considering a um 3 billion additional is considering 3 billion um additional debt issuance for content investment. So the goal here is to calculate the WACC for 5 billion um content investment decisioning current future and project specific rates. So basically how are we going to do this? So we're going to use WAC WACC the minimum return required to satisfy all investors. So we're going to figure out which um what as essentially what um investment we need to make to make sure that um every investor is happy with the profits that we are making. So the first step we're going to do is we're going to gather all the provided hypothetical information parameters and market conditions. So as stated above. So this is going to be V equals E plus D which is a total firm value equals the market e market value of equity and then plus the market value of debt which we're given. Um and then next we're going to do the universe or the identity core calculations. This is WACC. So this is our formula right here for that. Um and then next we have our assumption. So this is the market value of debt. Um and we're going to use the provided 13 billion for that. And then we have the current stock price and the market cap. Market cap which are consistently with a 200 billion divided by our 450 um is approximately 444.44 million shares outstanding. And then also we have our risk-free rate which is 4.5% our market risk premium which is 5.5% and our tax rate which is 21%. because 21 base is just um an industry standard for corporations. So now we're into our represent stage. So basically how are we going to be able to find all of this? Um we're going to be using all these formulas which I'm going to break down. So the first is a cost of equity. We're going to use the kappam formula and this represents the required return of equity holders for the risk that they take. So specifically in the systematic risk. So this is the formula um that we used here and then we have cost of debt. So the interest rate Netflix pays on its new and exist and existing debt which is going to be adjusted though for the tax shield which is represented by t which is also going to equal 21%. That is the base here and here is the after tax cost of debt formula. Next we have capital structure which is the mix of debt and equity used to finance the firm's assets. So weights must be based on market values to reflect investor opportunity cost accurac accurately. So we have the market value rationale. So book values are historical market values reflect the current cost of capital and the investor expectations. And then finally we have the project specific WACC which is a single firmwide WACCC for all projects and they can lead over lead to overinvesting in high-risisk projects um projects with material different risk profiles. So it's not necessarily fair to use just a one singular WACC for every single project because there are going to be different which can lead to overinvesting or even sometimes underinvesting. um which is what not what we are wanting to do. So give us an analogy here. So you wouldn't use the same rate to borrow for a mortgage like a low risk um low to high risk I mean and a startup business high risk. So you adjusted beta for the risk premium for different project types. So next we're doing our implement stage which this was just the um outcome of ours which I will show you in collab. So we have Netflix current WACC calculation. And so it walked me through each step using the Python code here. Um, and here it is. And if you hit run, it will come about just what I showed you. Um, and we really, which I'll walk through the formulas here in a second. Um but essentially we found the cost of equity, the after tax cost of debt, the current weight of the equity, the current weight of the debt, and the current WACC which was 11.2% if you round it. And then but this is after the $3 million uh debt issuance. So this is the calculation that we were trying to find. So, we found the new weight of equity, the new weight of debt, and the post issuance, which our WACCC ended up being 1.2 or 1.13%. So, basically, our impact is that our WACC um increases or decreases, sorry, from 11.22% to 11.13%. So, let's go ahead and get back into this. So it talks a little bit more about the formulas that were used in this. So we have the r_e which is the cost of equity that we used in the code. The rd um a which is the after tax cost of debt which um is effective borrowing cost accounting for the tax deductibility of interest. Um the w and wc_d that is the capital structure weights. um which found the proportion of equity and debt used for financing and then the WACC uh current was the weighted average cost of capital the minimum return required on the total asset base and the WACC post issuance is the effect of the increased leverage or the more debt on the overall WACC. So to validate this the calculated um WACC of 11.21 21 or 2.22% is is higher than the industry range of the 8 to 10%. So, and since the WACC it's more leverage, it's a diversified competitor. So, Disney is at an 8.2%. Um, this result is financially logical given that Netflix high equity concentration and high beta. So to evolve here we had that Netflix should pursue a strategy of moderate leverage optimization to enhance shareholder value by reducing our hurdle rate. So basically they're saying to incrementally increase the debt to capital ratio from the current 6.1% to the target range of 15% to 20%. The rationale about this would be that the move utilizes the full benefit of the tax shield. Um so essentially lowering the WACC significantly um without introducing excess excessive financial distress risk to cause loss of debt to spike and then adopting this target structure will make Netflix more financially competitive aligning its cost of capital with industry benchmark and making a wider range of profitable content investments viable. So to reflect or in the last stage of our driver framework here um basically throughout this assignment I learned a lot more about the WACC and the many different elements that are required to calculate it. Uh for example the WACCC isn't just a number. Um in this scenario it's the minimum return Netflix must earn on its total asset base to avoid destroying the shareholder value. So the higher the WACCC the fewer projects Netflix can accept. Thank you so much for listening to my chapter or my session nine assignment. Um, have a great day.",
  "video_url": "https://youtu.be/Q_tXZ2FEvVY"
}