{
  "student_name": "Lucas Velasquez",
  "org_defined_id": "037165853",
  "username": "velasqul",
  "email": "",
  "transcript": "Transcript Speaker 1 Hello everyone. Speaker 1 Today will be, for session 10, we'll be talking about cash flows, net present value, and a capital budgeting decision to determine whether we should accept this project proposal. Speaker 1 So for the prompt today, we're going to be evaluating their flagship, Starbucks's flagship roastery that requires A 12 million upfront investment. Speaker 1 It's expected to operate 10 years. Speaker 1 It has an 8.5% whack as the hurdle rate to determine whether the product creates value. Speaker 1 And we're going to either accept or reject this. Speaker 1 And our parameters, 12 million upfront costs, depreciated over a straight line over 10 years. Speaker 1 $500,000 of deployed working capital, which is recovered in year 10. Speaker 1 8 million of revenue in year 1, 11 million in years 2 to 5, and 9 million in years 6 to 10. Speaker 1 operating costs, cost of goods sold, 40% of revenue, labor 2.5 million, rent utilities 0.8 million, marketing 0.3 million, and 0.1 million thereafter, 25% taxes with a terminal value of 3 million at the end of year 10. Speaker 1 So we're going to be focusing on the cash flow model, the core capital budgeting metrics, sensitivity tests, and then I'll give my recommendation. Speaker 1 So first, we're going to discover and we're going to evaluate what really matters with this problem. Speaker 1 So it has a WACC of 8.5%. Speaker 1 That's just the weighted average cost of capital of Starbucks and the proportion of debt and equity used to finance the business. Speaker 1 And there's this 8.5% tax rate, 25%. Speaker 1 That will affect our EBITDA and our gain on asset depreciation. Speaker 1 1.2 million, that'll be added back in the income statement and will affect our operating net income. Speaker 1 Working capital, $500,000. Speaker 1 This is cash that is tied up and it is an outflow at the beginning. Speaker 1 We are losing that money and then it will later become an inflow for the cash flow statement. Speaker 1 Terminal value of 3 million. Speaker 1 So this is what we expect we can sell the store for. Speaker 1 And after taxes, this is 2.25 million due to the 25% tax rate. Speaker 1 So the first thing we're going to do is kind of represent some of these values and create a cash flow model. Speaker 1 So we have our revenues on the top. Speaker 1 subtracted our cost of goods sold for our year one, year two to five, and year six to 10. Speaker 1 We have all of our expenses here. Speaker 1 To get our EBITDA, we subtract our taxes, and then we add back the depreciation. Speaker 1 And that gives us an operating cash flow of 1.2 million for the first year, then 2.7 million, and 1.8 million for the following years. Speaker 1 You can also see this Speaker 1 in this Python code cash flow model that I created in Google Gemini. Speaker 1 So we have our inputs at the top here with our values of 12 million, the working capital, the tax rate, the WAC, the life of the project, the terminal value that we talked about earlier. Speaker 1 And then now we're going to use our assumptions and build the cash flow model. Speaker 1 So we create the list for the years, do some if statements, and then calculate our operating expenses. Speaker 1 And then as we move down, it will calculate the formulas. Speaker 1 You have our free cash flow. Speaker 1 Free cash flow, we have our present value for each year. Speaker 1 That's just the discount rate, because money is always worth more now than in the future. Speaker 1 So we're going to have to calculate the present value of the cash flows before. Speaker 1 So as we go back to this a little bit, after we calculate the operating cash flows, I went a little ahead of myself. Speaker 1 You have to discount that back to the present day. Speaker 1 And since money's worth more now, you have to discount Speaker 1 You have to discount it, so after discounting all those values. Speaker 1 You get 1.1 million for year one, 2 million for year two to five, and 1,000,000 to year six to 10, which you'll be able to see in our detailed cash flow model that the Python code created. Speaker 1 So as you can see, you have our revenues, our cash flows, our total free cash flow, and then the present values of these amounts. Speaker 1 And so we have our Speaker 1 outflows at year zero for investment, which was 12.5 million. Speaker 1 And then our inflows from years 1 to 10 adds up to 15.1 million. Speaker 1 This is higher than obviously what I just showed previously because you have to account for the sale of the business and that stuff. Speaker 1 And so to get our NPV, which is probably one of the most important calculations here, Speaker 1 You subtract the inflows by the outflows. Speaker 1 So that gives you a positive net present value of 2.6 million, essentially saying that the money you make discounted to present day, that's you a profit of 2.6 million in shareholder value. Speaker 1 So as we go to that, this is kind of what we did. Speaker 1 So you get that 2.6 million Speaker 1 MPV, and when you put the MPV into the formula in Excel, it's the IRR formula for Excel, you get an IRR of 12.3%, and that is noticeably higher than our whack hurdle rate of, I think it was about 8%, kind of signaling that this is a project that we should take. Speaker 1 So now to run a sensitivity test, Speaker 1 If we go back, if we go back up here, you can see some of our operating costs are very high. Speaker 1 Labor, rent, utilities, marketing, and our depreciation. Speaker 1 And that could hurt our profitability, especially if there's a temporary slowing of revenue that's created by the business. Speaker 1 If he hits a rough time, Speaker 1 it still has very high operating costs that aren't related to the cost of goods sold. Speaker 1 So that could create some issues later on. Speaker 1 And then another issue could be the terminal value. Speaker 1 A large amount of the value created is due to the reselling of the business at the end. Speaker 1 So if they cannot later sell the business, Speaker 1 for that 3 million, you would have a negative net present value and you wouldn't want to take on the project. Speaker 1 So they have to be pretty sure that they can resell their business at the end of the time period, or else not. Speaker 1 It could create issues down the road and lead to a negative return. Speaker 1 And then, so to conclude, Speaker 1 When we evaluate the expansion of the project based on our 10-year analysis, my recommendation would be to accept this project. Speaker 1 It clears the financial hurdles of the 8.5% WAC. Speaker 1 It creates a net present value of 2.69 million, which means that positive share value creation for shareholders. Speaker 1 The IRR is 12.3%. Speaker 1 which is, again, higher than our weighted cost of capital. Speaker 1 The project has a slow start in year one with EBITDA. Speaker 1 However, used two through five are the cash cow years, which generate 2.7 million annually in cash flow. Speaker 1 And then as revenues stabilize, the project remains cash flow positive. Speaker 1 Some risks, Speaker 1 We must be aware that this is a high fixed cost operation. Speaker 1 We need to strictly manage labor costs to ensure that they stay at 2.5 million as there's not that much wiggle room with costs. Speaker 1 And so given the strong positive net present value and the value of getting a flagship location, the investment is financially sound and they should proceed with the Speaker 1 $12.5 million investment. Speaker 1 Thank you for watching. Speaker 1",
  "video_url": "https://youtu.be/kEF3FPur6vY"
}