{
  "student_name": "Alex Lenig",
  "org_defined_id": "035836182",
  "username": "alenig",
  "video_url": "https://youtu.be/Asxv4S0SSnU?si=bV5qLuHZ5Aopz_Ws",
  "transcript": "Hi, so today we are looking at Apple in\na hypothetical 90 billion uh share\nrepurchase. So their goal here is to try\nto create value within the company uh by\ndoing this buyback. So what are we\nlooking at? Uh we've got all this\ninformation here. Uh giving us our\nliquidity, um some different market\ncontext, balance sheet, uh proposal, the\nproposal, and then some alternative\nalternatives.\nSo uh let's start with D. What are we\nactually trying to annual an analyze\nhere? Man, I cannot speak. Uh what\nsituations are we analyzing? So like I\nsaid, been given all this information,\nbut what are we actually looking at? Um\nlike I said, the main goal here is we're\nlooking for something that about an\noption that creates value. So um there's\ndifferent ways where sometimes uh with a\ninvestment uh you don't actually end up\ncreating value. You just end up\ntransferring that or moving that value\naround your shareholders. So we're\nlooking for something that actually\ncreates value. So getting more into what\nwe're actually looking at. Um the first\nthing is what are our choices for\ncapital allocation. So the main thing\nwe're looking at is that buyback. So\nactually buying back our stocks um with\nusing that 90 million. Uh we've also got\nspecial dividends. So that means that\nwe're paying dividends to our\nshareholders. Uh we've got acquisition\nwhich is just investing in uh or buying\nup other companies possibly. Uh debt\nreduction which is paying back money on\nour debt. And then R&D research and\ndevelopment. So doing things for\nspending money to try to build the\nfuture. Um and like I said, what we're\nlooking at is whether these options\ncreate value or transfer it. Um so we'll\nget a little more into that once we do\nthe actual calculations.\nUm and then the other part we're looking\nat is who we're who we're considering.\nSo each of these options will affect uh\nthe pe different shareholders\ndifferently or different people. Uh so\nthe main ones are retail shareholders\nand institutional holders. Um these are\nbasically just people that own the\nstock. Um retail is more like like you\nand me if we were investing in Apple.\nInstitutional is uh within Apple. Uh\nmanagement, so the people who decide or\nmake decisions for Apple. Employees,\npeople who work for Apple. And then bond\nholders. Um these are the ones who deal\nwith Apple's debt in this case. So they\nwant to be able to make sure Apple can\nrepay their debt back to them. So\nthat covers the\nuh define part. Where am I at? There we\ngo. So uh we know what we're trying to\nlook for. So we'll get to the represent\nuh which is actually calculating EPS and\nleverage change. Uh so we got to discuss\nwhat those are. Um EPS is earnings per\nshare and this is basically just um what\nyou make back or um\nthe portion of the company's profit\nallocated to each individual share of\nits outstanding common stock. So\nbasically profit they get from the\nstock.\nSo this is calculated using uh this\nformula net income minus preferred\ndividends and then divide by weighted uh\ncommon stocks outstanding. So\nuh so use this uh your goal is typically\nto look for a positive EPS um because\nthis is creating more value on your\nstock then and then financial leverage\num is a little bit different. it is\num\nyeah basically uh magnifying changes on\na company's profit if they have um fixed\ncosts. So basically their ability to be\nable to start paying stuff back um and\nyeah so that formula uses um pull it up\nhere.\nI don't know where it's at. uh but\nyou're earn basically uh everything\nearned after taxes and then minus the\ninterest on those taxes uh and that gets\nyou your financial leverage. So and this\nis degree of financial leverage DFL. All\nright\nso we can get into the code part. So for\nthe implementation we got our code. So\nhere we import our files we need. Uh we\nhave a spot for all our inputs which\nlike I showed here are given all here.\nUm so we have our inputs we get our\ndelivered metrics.\nOkay. Um and then we start going through\neach scenario. Um so based on you know\nthe different uh decision decisions we\nwere talking about whether we're paying\nback debt uh things like that. Uh so we\ngo through all these scenarios and get\nthe calculations for uh some different\nthings. The main two are going to be EPS\nand financial leverage. Um\nvisualizations\nokay uh so we'll come back to this\ngraph. Um but here we get a good graph\nor good table of uh all these different\nvalues. So these are broken down by the\ndifferent uh options we have for that\ninvestment of the n uh 90 billion. So\nfor the first one we'll look at our\nbuyback. Um so we use 90 billion cash uh\n15.014\nbillion out shares out. Uh and then we\nget a new EPS from our six of 6.366.\nSo this is a 3.24% change in our EPS\nincrease I should say in our EPS. Uh and\nthen new debt of 110 billion. Um so a\nlittle more debt in there and then new\nleverage of 004 which is a 3.24% in\nincrease and then 75 billion in cash\nremaining to pay off our debts or any\nother future investments. So\num like I said we have all these\ndifferent values. So um we'll get into\nwith our validate uh what do these\nresults mean for each scenario. So we're\nlooking at uh basically how this affects\nthe company in general and then how it\naffects all those different people that\nwe were talking about earlier the uh\nnormal people or normal people with the\nstock management employees uh all that\nstuff. So first we'll look at buyback.\nSo they have a positive EPS of 3.24 24\nand an leverage change of 3.24. So, same\nthere. Um, so what does this mean? This\nmeans that getting the payback, they're\nactually uh kind of starting to increase\ntheir uh share, the value of their\nshare. Um, but realistically,\nuh, this is one of those that benefits\nmostly management. So, management's\nlooking to get out of this um that that\nlittle bit of higher uh stock. So\nwhen uh when we do this management uh\ntypically ends up getting bonuses if\nthey're able to quickly raise their\nstock or things like that. So a quick\nchange in EPS is very good for them. Uh\nthat helps them get more bonuses, helps\nthe stock grow. Uh so it's not a\nterrible option for them. Um for normal\nstockholders, it is also not too bad.\nAgain, they're getting a little little\nbit of a decrease or increase, sorry, uh\nin their stock value. And then\num a little bit of a leverage change\nmeans uh it's not quite as beneficial in\nuh repaying its debt. So the creditors\nin this case um might not enjoy it as\nmuch. Uh they don't really care the same\nabout the stock increasing. Uh it\ndoesn't really uh change much for that.\nUh employees uh kind of the same thing.\nThey're getting more their stock, but\ndoesn't really help their future outlook\nas much. So, this is one of the\nscenarios we're looking at where um our\nhow our goal here was to create value\nfor the company. If we're doing this uh\njust buying it back, this is more of\njust transferring value back to the\ncompany. So, we're not really creating\nanything new. We're just kind of\ntransferring that value around to\ndifferent people. So as uh it's a not a\nbad option for, you know, some of the\nindividuals involved, but realistically\nfor the company, it's not creating any\nvalue. So it's probably not going to be\na great option. Um the next one we're\nlooking at is dividends. Uh so again,\npaying dividends to our uh uh\nshareholders.\nSo here we get no change in EPS. So\nthere's no change in our stock. Uh about\nno change in our stock. and then a\nleverage change of 3.35. So here uh let\nme pull up my notes for this but\nyeah. Okay. So here we're getting um\nmore of a immediate return of capital to\nour shareholders. Um so again this\ndoesn't end up actually changing our\nstock price or making too many changes\nfor that. Um it just takes that money\nthat if they were increasing it uh that\nprice was increasing and just gives it\nstraight back to the shareholders. So,\num,\npull up here.\nHave a few notes just because\nwe have a lot of scenarios here to deal\nwith, but there we go. Um,\nso yeah, so number of shares here since\nwe're just paying back dividends, uh,\nthat doesn't change. And then our net\nincome also remains unchanged uh for the\nsame reasons. Um\nmanagement in this case wouldn't really\ncare too much about uh paying out these\ndividends. Um again, like I said,\nthey're uh what they get typically is\nbonuses and increasing EPS. Um so in\nthis case, it's not actually increasing\nthat. So it's not really going to hurt\nthem. uh it's not affecting them that\nbadly, but there's better options for\nthem out there than uh just sending out\ndividends. Um shareholders\nagain, they also don't really care too\nmuch for this. It's not really it\ndoesn't change much for them. Um there's\nstill uh\ncash available for them to pay back\ntheir debt on, but uh it doesn't really\nchange much for them. um average stock\nstockholders um they wouldn't mind this\noption typically. It depends on what\ntheir outlook is whether they want to\nget quick money from it like a dividend\nor they're holding on to that stock uh\nhoping for it to grow. So kind of\ndepends on the case they want there. Um\nand yeah, so paying back the dividends\nisn't a terrible option, but\nrealistically it's probably not going to\nbe one of the best. Um so next we'll get\ninto acquisitions. So again, this is\nbuying up different companies. Um,\nwe can see here we get a pretty very\nhigh, actually the highest out of all of\nthem, the highest EPS change of 5.23%.\nSo, uh, we're actually getting a lot\nmore money from this or raising our\nstock a lot more than we are with any of\nthe other options. Uh, we also get a\n3.24% leverage change. Um, so again, it\nallows us to still be able to pay pay\nback on our debts. Um,\nso for the company wise, it's not too\nbad. I guess I should go back to\ndividends. Um, this also kind of just\ndoesn't really uh create value. It just\ndistributes it more. So it might not be\na good option for creating value. Um, in\nterms of acquisition uh for value, this\ndoes actually end up creating new value.\nSo because we're investing in different\nthings um and trying to grow the\ncompany, we're able to create more value\ninstead of just transferring it around.\nSo in terms of creating value, this is a\npretty good choice. Um for the\nindividuals involved, uh management\num they are typically going to like this\noption. Um, it allows them to build up\ntheir company like I said earlier and\nthat allows for more profits uh in the\nfuture along with hopefully some profit\nin the meantime too. Um, but yeah, it\nhelps yeah build build their power\nprestige uh and again it's increasing\nthat EPS which it gets them bonuses and\nthings like that. So they'll be heavily\ninclined to uh like this scenario. Um\nshareholders um again they're kind of in\nthe same spot. Um\nit's not bad should be increasing uh\nhopefully increasing stock stock value.\nUm for them they might be a little more\nrisky because if with an acu accusation\nacquisition sorry um you never know if\nit's going to work out good or bad. So\nthere's the chance for profits there,\nbut you never know. Something could go\nwrong and it could could hurt. Uh\nleverage is pretty similar. So the\ncreditors don't mind it too much. Um\nthey're not too averse for it. It's not\nreally\nshoot.\nOkay. Yeah. Uh it doesn't really change\ntoo much for them. Um yeah, so\nacquisition so far is creating value and\nuh it's not a bad option. uh debt\nreduction. This gets us a EPS of 2.98.\nUm so again, positive EPS, which is not\nbad. Um and then but we have a huge\nleverage change of negative 881.82.\nUh so we haven't even seen a negative\none, let alone a negative value this\nhigh. Uh so what does that actually\nmean? Well,\num\nit\nYeah. So basically what this means is\nthat we're uh making our company a lot\nless risky. Um we're I mean paying off\nour debts uh because we had what how\nmuch was it?\nUh yeah $110 billion in debt. So being\nable to pay off that debt means that uh\nwith changes and things like the um if\nthe market decreases or um basically if\nour creditors in this case are wanting\ntheir money back then we have a lot less\nwe actually have to give back. Um makes\nus a lot more sound of a company. But as\nyou can see with the EPS change it's\nslightly lower than the rest. So it's\nreally not I mean it's not raising our\nstock as much. It just really makes us a\nsafer company. So, this is one of those\nscenarios where you're looking at um\nlike less risk but less re uh a lot yeah\nlow lower risk lower reward. Um so it's\nagain not too bad of a company or too\nbad of an option. Um it does end up\npossibly creating value. um it doesn't\njust distribute it out, but again, it\ncreates a little less value than some of\nthe other options might um just because\nwe're just paying back into our debt. Um\nand then finally, uh research and\ndevelopment expense. Uh we can see we\nhave a massive decline in our EPS and\nthen uh relative relatively normal\nchange in our leverage. Um so what does\nthis change in EPS mean? This is a huge\ndifference. Um\nI guess I didn't here. Let me go back.\nUh debt redu reduction. I didn't really\ntalk about the specific people. Um\nmanagement probably will not uh care for\ndebt reduction as much. Um it doesn't\nreally change much for them and kind of\nuh brings the company down. But uh if\nthey're riskaverse and they want to kind\nof balance out that balance sheet, then\nit's a definitely a good option. Uh and\nthen for stockholders, it's kind of the\nsame thing. Uh you're probably going to\nbe lessening the uh risk like the\npossible returns for profit, but you're\nmaking it a lot more secure that you\nprobably will get profit. So again, kind\nof that risk versus reward uh scenario\nwhere um profit's more likely, but it's\nprobably going to be smaller. Um and\nthen same for employees in this case.\nAnd then credit in this case creditors\nreally love that because they're paying\nback the money the creditors owed. So\nthey're getting a lot of money of that\nmoney they needed. So creditors love\nthis scenario. Um so then yeah finally\nresearch and development uh we're\nlooking at that EPS change of 94.16%.\nUh so this means basically with research\nand development we're just pouring a\nbunch of money uh straight into research\ndevelopment for the future. So in the\nimmediate uh immediate impact it looks\nugly like this 94. Uh we might see a dip\nin our stock price and uh just have less\nmoney in general to spend on uh you know\nthings like debt or uh new endeavors and\nthings like that. But in the long term\nuh there's those potentials for gains\nbecause we're doing research and\ndevelopment. That means we're uh trying\nto build for the future. So in the\nimmediate time, uh it's not it's going\nto hurt, but uh you're taking that risk\nin hopes that uh doing that research\nwill make in the uh future make your\ncompany way more profitable. Uh so for\nmanagers, they hate this. Um again, they\nget those bonuses for EPS change. Um\nand\nuh they prefer that short uh short-term\nperformance.\nuh and like I said in this case it's\nshort term it's very hurtful in the\nshort term um but then shareholders uh\nthey might they might not like it uh in\nthe meantime because like I said it's\ngoing to be decreasing their uh probably\ntheir stock price but longterm the value\nis there it could again takes on a lot\nmore risk but it explodes in value um\nand this does actually end up creating\nvalue for the company because they're\nputting val or putting money into\ncreating value. So, it's not going to\ntransfer it, but there's just a lot of\nrisks associated with it. So, uh we'll\nalso go over this graph real quick. Uh I\nmean it's basically what we've already\ntalked about. Uh goes over the EPS\nchange for each company and then in each\nscenario. So, we can see buyback, we're\ngetting a slightly positive dividend\ndividends, we're not getting any EPS\nchange. acquisition a little higher, our\nhighest in of all these scenarios, uh\ndebt reduction of only a little bit of a\nhigh change in EPS and then a dur dur a\nbad one in R&D.\nUm so yeah, so a little more simple of a\ngraph, but it does give you that visual\nrepresentation of what happens to our\nEPS in each scenario. So now that we've\ncovered that, we can get into our E. Uh\nso what is our our decision based on\nApple's strategy? So like I said earlier\nwe were looking at uh they wanted to be\nable to create value um as an alternate\noh yeah uh they wanted to create value\nwhile still balancing uh stockholder\nincentives. So we went over each one of\nthose kind of scenarios and talked about\nif it creates value it just kind of\ntransfers it around. Um and then uh also\nhow those uh stakeholders kind of have a\nwhat their\nwhat their goals for each uh scenario\nare. So what's probably going to be our\nbest uh\nuh best scenario? Uh realistically when\nwe look at this uh acquisition is\nprobably going to be the best case. Like\nI said it a creates value. um we're\ninvesting into new things and that\nshould be able to build our value up for\nthe company while also giving us uh good\nreturns for our stockholders.\nSo, um that's not a bad option. Uh\nthat's probably our best option we have\nhere. Uh again, buybacks and dividends\ndon't really change that value. Uh this\nor add out ad value. It just kind of\nshifts it around. Um, in terms of\nstockholder or stockholder profit, uh,\nbuyback wouldn't be a bad idea. Um,\nespecially management likes that, but\nalso our shareholders wouldn't mind it\ntoo, but doesn't really do much for our\ncompany in the long term. Uh, and then\ndividends probably is not going to be\nour best bet. Uh, it looks good. It\nmakes our company look like we have\nenough profits to pay back dividends,\nwhich shareholders like, but um\nrealistically, it's not going to do as\nmuch for us uh in terms of building up\nour company. Um our next option, if we\ncouldn't go with acquisition, would\nprobably be debt reduction. Again, this\nuh still does edge add value to our\ncompany. Um and being able to pay off\nour debts makes us a lot more\nstructurally sound for the future. So if\nthere's a downturn in the market or um\nyou know we want to if yeah if there's a\ndownturn in the market we're a lot more\nstable than a bunch of other companies\nwould be with uh way more debt than us.\nSo those are probably our two best\noptions. Uh if we had to just invest all\nof that 90 million into one, we'd\nprobably want to go with acquisition\nagain just because that's the best\noption we have here. But, uh, if we're\nable to split it up, it'd probably be,\num, we'd want to do most of it into\nacquisition, uh, a little bit into debt\nreduction, and then depending on how,\nuh, Apple wanted to go, we could either\ngo with buybacks, uh, try to increase\nthat short-term value, or R&D, which\nwould hurt our short-term value, but add\nvalue. So, in terms of adding value, we\nreally only want to look at these last\nthree. But for shareholders um or\nstockholders probably buybacks,\nacquisition and debt reduction are some\nof our best options. So\nthat gets to that uh what is the\nusefulness of this? Um again doing this\nbasically allows us to see when we're\nmaking an investment what are what's our\nbest scenario. Um there's obviously\ngoing to be way more scenarios than even\njust these, but these are some of our\nbig ones. Um but doing this allows us to\nsee what our projections are going to\nlook like um and help us decide whether\nwe're looking more short-term for more\nshort short-term value or long-term\nvalue. So again, not all options are\ngoing to be the same for each company.\nSome companies might just want immediate\nvalue. They don't care about the future.\nUm and in that case, maybe they'd want\nto go for buybacks or send out\ndividends. Um but yeah, it allows us to\nsee ba see based on what our company\nvalues um how we want to move forward\nwith an investment. So\nI think that covers most everything. Let\nme look.\nOh yeah, uh I did forget uh to discuss\nsignaling effects, market perception and\nlong-term capital allocation discipline.\nUm\nso signaling effects are basically um\nlike how each decision decision looks.\nUm so\nyeah so for buybacks um it looks pretty\ngood. It le means we're buying more of\nour stock back which means we're more\nless uh less involved with our investors\nuh which seems for the public makes it\nseem like the company can actually fund\ntheir moves forward. Uh dividends also\nlooks good. I kind of talked about that\nthey if they're able to pay back\ndividends, um it looks like they have\nmoney enough profit to be able to pay uh\ntheir shareholders back. Uh acquisition\nmight uh kind of hurt in the short term,\nbut it allows us to be able to grow our\ncompany um and tells people tells people\nthat we want to grow um and our company\nis moving forward. uh debt reduction uh\nkind of gives a perception that we are a\nstable company. Um we are able to pay\noff our debts and um yeah we're a pretty\nsafe company. Maybe not as inclined to\njust go for the profits but uh we are a\nsafe investment. And then R&D inspect\nexpense um tells us that we are\ninvesting in the future um or tells\npeople we're investing in the future but\num it's a lot more we're taking a lot\nmore risk. We don't know whether it's\ngoing to work out or not. So that's one\nof those scenarios where we have a high\nrisk high reward.\nUm\nmarket perception is uh kind of similar\nuh just seeing how people view us um\nwithin the market. Um then long-term\ncapital allocation kind of goes along\nwith that um safety net we have. So um\nor not safety net but like in investing\nin the future. So things like buybacks\nand dividends kind of show that again\nimmediate uh profit but doing equid\nacquisitions or R&D help show that uh\nwe're putting our capital into the\nfuture and trying to grow. So\nthat covers our all that.\nUm\nyeah, so that should be that covers uh\nmost of the scenario. And again our\nfinal decision here is that uh our best\nif we were just to invest in one 90\nbillion uh uh hypothetical 90 billion uh\ninvestment uh which best creates value\nfor us um while also helping share uh\nstakeholder incentives we would want to\ngo with that acquisition. So yeah,thanks for listening."
}