{
  "student_name": "Nick Sikorski",
  "org_defined_id": "037205859",
  "username": "nsikorsk",
  "email": "",
  "transcript": "Alright, so in today's video we're going to do our driver framework to go over session 10's, what it's asking, what we're looking for. So let's go to the D section of driver define. So the objective is to determine whether the proposed flagship roastery project creates value for Starbucks' shareholders. And we use the 8.5% weighted average current cost hurdle rate. And we provide an accept-reject recommendation. So our goal is to calculate the net present value, the MPV, the internal rate of return, the IRR, and the payback period, which is PVP, for the roastery project. Our hurdle rate is 8.5%, like we said. Project life, 10 years. Our initial outlay is $12 million plus the $0.5 million of working capital, so $12.5 million is our initial outlay. We have an initial investment of $12 million, working capital of half a million, that makes up what we, our initial outlay up there. Our depreciation is straight line depreciation, which is over 10 years. So $12 million divided by 10 is just $1.2 million. That also means we have, I guess, has no salvage value. So that's part of the straight line formula. Our tax rate, T, is 25%. And our terminal value is $3 million, which is at the point T equals 10. So now we go to the R part. We've laid out kind of our baseline. Represent. So a pro forma cash flow model will be constructed over 10 years to determine the annual free cash flow of the project. So the calculation sequence is calculate the revenue and operating cost, or determine annual revenue, COGS, labor, rent, other costs of that nature. Then we do the EBIT calculation, or earnings before interest and taxes, which is revenue minus operating costs minus appreciation. Then we solve for our taxable income and net income, and we use the formula of taxes for the use of our EBIT from before. Multiply that by, actually the easier formula would just be EBIT minus taxes to get our taxable income. And that's our net income. And then, oh, taxes, my fault. Taxes is EBIT times our 10, which is our number of years, T. And then our net income is EBIT minus taxes, which makes sense. So our calculation for a free cash flow is net income plus depreciation minus our change in our weighted cost minus our capital expansions. We already have that number listed above. So CAPX is only at T equals zero. And the change in weighted cost is only at T equals zero. And then T equals 10. We have this formula as well. We have free cash flow equals our revenue minus our operating expenses minus depreciation times 1 plus, or 1 minus T, which is our time again, plus depreciation minus our change in weighted cost. And then we have our NPV. This is a very complicated equation. If we look at it right now, that's our NPV equation. If we go down, you can see our revenue on T equals 1. It made it short for us. T equals 1, our revenue is 8 million. T equals 2, our revenue is 11 million. So on to T equals 10, which is 9 million. We have for all of them, COGS, we have 3.2 million for T equals 1, 4.4 million for T equals 2. Here for T equals 2, 2, T equals 5. We actually have ranges. And I'm guessing we're taking an average from these to make it a little simpler. We have everything from rent, marketing, EBIT, taxes, net income, depreciation, everything. And some trends we noticed. We noticed that our EBIT is going down after the first couple, next few years. So our earnings seem to be going down a little bit. That's reflected in our revenue. Our depreciation is pretty constant. Net income goes down after those first five years, which is not what you like to see. And our total free cash flow, that's the only positive. Our total free cash flow is increasing heavily as the years go on, which is a good thing. Ended at 5.3 million. We started with, I guess, well I mean that's taking into account. We essentially started with 1.2. So we go down and we note that in year one, our EBIT is zero, so our tax is zero. Just a little note. Just a note that T is the number of years. So our net present value calculation comes out to 2.77 million and our IRR comes out to 14.28 percent using the values from above. And our payback period is equivalent to about 5.5 years, essentially. So here's our equation for MPV. We have listed here. So we get our 2.77 million dollars listed above. Same as our payback. Five years plus half a million, which was our working capital I believe. Yep. Divided by 1.8 million, which is our year six free cash flow, to give us the payback period of about 5.5. 5.25 to 5.5. We're going to perform some sensitivity tests to see the change. The revenue we see high changes of base MPV and we also see a moderate change for WACC levels as well. So now we're going to validate our cash flow logic. So we see that the model correctly accounts for the initial capital expenses and weighted cost outlay. And our annual depreciation tax yield, weighted cost recovery, and terminal value is at T equals 10. So the calculation free cash flow using our equation before, EBIT 1 minus T plus depreciation minus change of weighted cost minus capital expenses holds true for each period. And then MPV and IRR check. We know that since MPV is equal to 2.77 million, the IRR must be greater than the 8.5% WACC. So if, basically saying, if the MPV is greater than 0, then the IRR must be greater than the percentage of the weighted average WACC. And the calculated IRR is 14.28%, which confirms this, so we know that we probably have the right value for Starbucks. So we go down to E. Evolve and Reflect and Execute. So based on the core financial metrics and the 8.5% hurdle rate, the project is acceptable under the base case scenario. We have a positive MPV, so the project is expected to generate money for Starbucks, 2.77 million about. And the high IRR, the project return of 14.28%, significantly exceeds the required rate of return, which is 8.5%. So we do see this project being hopefully very beneficial to Starbucks. However, the project's positive MPV is highly sensitive to revenue forecasts, which we see over 100%. A slight 10% decline in projected revenue across all years results in a negative MPV, meaning the project would destroy value. So the project is robust to changes in the WACC, but highly fragile to revenue performance. So revenue performance is where this project is making money, but with the recommended numbers, we say we should go forward with it, but be cautious of the revenue numbers moving forward. So then our recommendation summary, our value. So we accept this contingency planning. The project acceptance must be contingent upon kind of a detailed conservative review of this revenue forecast we talked about, especially given the flagship nature of the grocery, which means it's very highly volatile and kind of unique market. Especially when you're talking about revenue issues, you're talking about a niche market, revenues could fluctuate heavily, and that's not what you want with a new project. So management must develop a clear strategy to ensure year one revenue of around 8 million, and year two to five revenue of 11 million. So slight increase, but very, very achievable. And yeah, that is our recommendation to Starbucks. I hope that this was educational and beneficial. Thank you.",
  "video_url": "https://www.youtube.com/watch?v=uXkVA8VfFWk"
}