{
  "student_name": "Bella Hess",
  "org_defined_id": "037228782",
  "username": "hessi",
  "email": "",
  "transcript": "All right. So this is the excuse me session six assignments. Um essentially we are calculating the cost of capital or the weighted average cost of capital for Netflix. Um with a hypothetical $5 billion content investment decision. We are first of all determining the cost of capital. the weighted cost of capital and then evaluating the impact this has on the additional debt financing assessing this project versus um project specific versus firmwide um discount rates and then overall comparing them to the cost of capital to the industry peers. So to build this framework we are given some financial parameters or hypothetical financial parameters. Market cap market capitalization at $200 billion. Total debt or the book value at 14 billion. Debt as a whole at 13 billion. Equity beta is 1.3. The bond rating is the tripleB plus or a yield of 5.8%. 8%. We have the corporate tax weight rate of 21%, the current stock price of $450. These build a framework for more of the financial side and assessing Netflix's um decisions and the calculations for the weighted average cost of capital, but overall to just really paint a picture of what the company looks like and how that is affected by it. We also have some market conditions. So having the risk-free rate of a 10-year Treasury um at 4.5%. We have a market risk premium of 5.5%. And immediate industry um weighted average capital cost range of 8 to 10%. These again just really illuminate the type of market that the company is um experiencing and just again to paint that bigger picture in regards to the weighted average capital cost strategic content context. So we're comparing this with competitors or other firms in the market. So Disney has a 70% equity and 30% depth depth and the weight of average um capital cost of 8.2% with um Amazon Prime with the weighted average cost 9.5%. And then additionally, additionally, Netflix is considering this $3 billion additional debt insurance or issuance for content investment. So, in today's assignments, we have a couple things we need to address to ultimately determine Netflix's stability. And um again, really illuminating the weighted average cost of capital. So for a required analysis, we need to calculate calculate the current um rate of average cost capital, determine this after the $3 billion debt and issuance. Um evaluate this project specific um compare it to Disney and explain those differences and overall just recommend um the optimal capital structure strategy for the company. So, diving right in using the driver framework, our scenario, we really need to just highlight what exactly is going on in the scenario. So understanding those core principles um ultimately our objective is to calculate this weighted average cost um under these hypothetical structures and then use this to evaluate the investment decision of $5 billion within the context of the industry. Um so ultimately we're asking ourselves what the appropriate discount rate for Netflix is to use and how it compares to the competitors. So really highlighting Disney Plus and Prime, but also other markets in the industry or just kind of what that average looks like. And then our goal would be to determine this, assess this impact, consider the project risk, and ultimately recommend a capital structure based off of this. So ultimately the first thing we need to address is what's this um calculation looks like. So, so again to do this the first thing we need to address would be this equity of $200 billion, the current depth of 13 billion, the beta of 1.3, the bond yield of 5.8 and the tax rate of 21%. Then the calculation for the CAPM for cost of equity and the after tax cost of debt the market value weighing to compute this way average cost of capital and um ultimately our inputs will be translate to the CAPM and we're just kind of weighing all of these other factors such as the cost of debt at the capital weights and this calculation with the output resulting in this weighted average capital cost and then using this as a discount rate for the investment decision and just again comparing it to the peers and what that really says about the company. So here through Google Gemini we have our calculation of output of 11.65 cost of equity and that's after tax cost of debt at 4.58%. So there definitely is a difference there and it is important to note this when we're keeping this in mind. Um, our current weighted average cost of capital, the current value would be two $213 billion, the equity weight of 93.9%, the debt weight of 6% and the calculated um current weighted average cost of capital of 11.22%. So having again illuminating this difference between that debt that equity and how this translate into the current um average rated average cost. So to find this current um weighted average cost just again highlighting this breaking it down to build that deeper connection. To find this the first step will be to calculate the current cost of equity using the CAPM formula which is the cost of equity equals the this guy here. So that 4.5% plus that beta times the um MRP. So that 4.5% stemming from the risk-free rate and that 5.5% stemming from the market risk premium. We're multiplying that by the beta and that gives us 11.65%. And secondly to calculate the after tax cost of debt. So we are taking 1 minus t and then again that 5.8% stemming from from the pre-tax cost of debt. And that 0.21 21 coming from the corporate um tax rate there ultimately equals 4.582%. Third step here would be to determine the market value weights. Um total market value of capital or V equals that market cap plus the debt or the market value. So that $200 billion in market cap, market capitalization plus the $13 billion in debt or that market value. And um to find that debt equity, we would divide the $13. So the debt over the market capitalization and then the equity weight would be that market capitalization over um the total market value. So 0.9 through9 for that equity weight and 0.061 for that debt weight. So we take all these together to find the weighted average cost of capital. Um, taking that equity weight times the excuse me, the cost of equity, multiply those together, add that to the debt weight multiplied by the after tax cost of debt. And ultimately, this gives us roughly 11.21%. So moving forward, this number is specifically important as it tells us more about the strategic decision- making and um how much volatility essentially the company has. in regards to these just again helping them make these more invested um investment decisions, more strategic decisions and ultimately have a better insight as to how this would play out. So ultimately kind of measuring risk and essentially what that would look like. So, excuse me. Let's go back to the assignment if I can find it. So, we've calculated the current um cost, weighted average cost of capital. Then we're going to go ahead and determine what this would look like after the $3 billion debt issuance. So we're assuming that the tax yield and the tax rate are the same and ultimately this new debt weight increases increases by a lot. So comparing originally 0.0 061 to 0.07. Um there was a large increase there and our equity rate did go down as it would be inferred because you're putting more into that debt and not into that equity. And ultimately we increasing this debt increases the financial risk that comes handinhand with it which ultimately increases the equity beta and thus um the cost of equity. So calculating the new cost of or weighted average cost of equity, we're going to use the same equation and 11.12% is the output from the equation. So we'll see that the weighted average current cost of capital uh decreased from 11.21 to 11.12. So again this stage here this fourth stage we're just verifying these calculations. So this cost of equity is appropriate given the high beta of 1.3 for the growth stock like Netflix and the use of the market values for the weights is correct. This decrease from 11.21 21 to 11.12 because we added more debts um which effectually affects the after tax cost of debt um demonstrating that is it is significantly lower than the cost of equity as a whole. So that 4.58 compared to the 11.65. So we're going to dive into evaluating these um analysis and interpretation. So calculating what we had just calculated the weighted average cost capital of 11.21 one should ideally not be used as the discount rate for all projects just because this is ultimately a high number compared to the um you know what is expected so comparing this to the industry peers the ultimate range is 8% to 10% and given that Netflix is 11.21 21 that is quite high and Netflix is ultimately above this range. So reflecting high equity risk and very low debt utilization. So we're going to compare this to Disney. Disney is standing at 8.2% 2% with 60% equity, 30% depth debt and having this lower um cost of equity due likely to that lower beta and just to that lower equity risk. So a more diversified structure compared to Netflix. It also has a higher tax shield for more debt. Prime is sitting at 9.5% with a lower weighted average cost due to the large scale and the diversification and again lower cost of equity. So ultimately comparing this range the average range in Disney and Prime with Netflix we can see that Netflix has a very high equity risk um very volatile and 93.9% of the cap capital structure is equity and 6.1% is debt having a very high cost of equity at 11.65%. 65%. So again just kind of illuminating this the difference is driven by two factors. So that high equity risk um with a very high beta of 1.3 comparing this to the more diversified peers which leads to a high cost of equity and secondly a low debt utilization. So having very low debt at 6.1% utilizes the benefits um are very little from the tax shield provided by the debt interest payments. So again, more debt like Disney's 30% lowers the overall weighted average cost. And again, adding this $3 billion in debt would slightly differ, but there is not huge of a difference. Um, just because it is already very equityheavy, there is not much that that necessarily would do. So this increase in debt would increase the financial leverage and likely cause the beta to rise and might slightly increase the bond yield. Then again the debt issuance is likely beneficial regarding this. um as we can see with that decrease right here. So to illuminate this, Google Collab has created a bar chart bar chart analyzing these companies with the amount of cost. So as we can see here, Netflix's current cost is the highest is 11.22% 22% and the new debt. So adding this $3 billion in debt would slightly lower this. The optimal range here is 10.24%. So not having it be completely low for being unrealistic, but kind of falls in the range between the two. And then Disney and Amazon are seen below here with Disney at 8.2%, Amazon at 9.5%. So again, this really just helps visualize what exactly the amount of costs we are working with and how those play into other people in the market. So again, it also just highlights the fact that Netflix's high range is due to these high equity and the very low utilization of um debt. So going forward, what is our recommendation for Netflix? So our goal would be to minimize the weighted average capital cost to maximize the value. So getting as low as possible um to just kind of decrease this risk. And as far as structure goes, our recommendation would be to increase the debt and especially comparing it to its peers. So Disney specifically was 70 to 30. Um but again the weighted average cash capital is penalized by this low leverage. Um, so tangible action, Netflix really should execute the $3 billion debt issuance and explore further debt financing instead of fully equity just because it will be proven to be less volatile and more sound for moving forward. A more optimal structure would likely be 80% equity and 20% debt debt, which would close be to $40 billion in debt. And this would increase the tax shield and reduce the weighted average cost of capital without jeopardizing the investment. And the content investment recommendation would be to to ultimately look at what we're sitting at now. So the current cost of the weighted average cost is 11.21 and a content project like must generate a greater return than 11.21 to be accepted unless it's significantly lower. And if the project is for high-risk international content, their hurdle rate should be higher than this 11.21. So again simplifying this in Google collab number one for the strategy aggressively increase debt financing to benefit from the tax shield. So ultimately Netflix needs to be better at benefiting from this tax shield just because it relies so heavily on equity. It's not getting the maximization out of this. And then again moving more towards a 20% debt structure which would drop this um to 10.247% and increasing the value of the firm as a whole content investment. So again, the project must yield a greater return than the relevant um hurdle rate at a minimum 11.21%. To be accepted because we don't want that to be equal or less than what we're currently working with. We want that to maximize the firm and to maximize potential output. So to sum everything up, um Netflix has a very high reliance on equity and not enough debt financing. And it is increasing the um weighted average capital cost by a lot, especially compared to competitors and compared to the industry as a whole. Moving forward again Netflix should really utilize and take advantage of the tax shield. So increasing um debt financing a lot to take advantage of this and then again moving to a more debt focused um structure which could increase the firm's value and also too accepting that $3 billion investments um the debt financing will be very beneficial to the firm itself. So, thank you so much and have a great rest of your day",
  "video_url": "https://youtu.be/AcfV8aU_RXA"
}