{
  "student_name": "Anthony Kwon",
  "org_defined_id": "036288518",
  "username": "kwon273",
  "email": "",
  "transcript": "Hi everyone, my name is Anthony Kwon, and in this video I'll be walking through my Market Efficiency Investigation using the DRIVER framework. My project focuses on the GameStop short squeeze of 2020–2021 and evaluates whether this event was consistent with different forms of market efficiency or whether behavioral factors explain the pricing dynamics. I'll go through each DRIVER stage in order, starting with Define and Discover. In the Define and Discover stage, the core research question I'm addressing is whether the GameStop short squeeze reflected semi-strong market efficiency or whether the price behavior showed clear signs of inefficiency. Before beginning any analysis, I had to validate a key factual claim included in the assignment prompt, which stated that GameStop traded at four cents in August 2020. This matters because if the starting valuation is wrong, any efficiency argument built on it would be incorrect. So my first objective was to gather reliable data and verify that claim. To set up the investigation, I identified all required information: daily price and volume data for GameStop, a broad market benchmark such as SPY for CAPM estimation, a timeline of relevant events including Ryan Cohen's 13% stake in September 2020 and the Reddit-driven surge in January 2021, and a framework for conducting event studies to measure how quickly prices reflected information. My initial hypothesis was that if the market were semi-strong efficient, GameStop's price should adjust immediately following new information. Any predictable drift or persistent abnormal return after information becomes public would contradict market efficiency. Next is Represent. In this stage, I mapped out the structure of my analysis. I chose an event study methodology because it allows me to measure how prices behave before, during, and after major information releases. I built the approach in three parts. First, I used an estimation window of 120 trading days before the event to estimate a CAPM model and calculate GameStop's normal expected return. Second, I defined an event window of plus and minus ten days around the short squeeze peak on January 27, 2021. Within this window, I calculated daily abnormal returns by subtracting the CAPM expected return from the actual return. Finally, I computed cumulative abnormal returns to see whether abnormal performance faded immediately, as predicted by efficient markets, or persisted over several days, which would indicate inefficiency or behavioral bias. With the structure set, I moved into Implementation. Using Python and yfinance, I downloaded the GameStop and SPY datasets and cleaned the price columns. I merged the datasets, calculated daily log returns, and verified the August 2020 price claim. The data showed that GameStop traded between roughly four and seven dollars during August 2020, which clearly disproves the claim that it traded at four cents. I documented this correction at the beginning of my analysis. Next, using the 120-day pre-event window, I estimated the CAPM parameters and then calculated abnormal returns around January 27th. The abnormal return graph showed extremely large returns during the squeeze, which is inconsistent with any rational fundamental change. The cumulative abnormal return graph showed persistence even after the main event day. Under semi-strong efficiency, abnormal returns should drop back to zero immediately after the event. Instead, the CAR curve continued to rise or drift, indicating that prices were not adjusting efficiently. Finally, I performed a statistical test on the post-event period from day plus one to day plus five. The average abnormal return during these days was still significantly positive, and the p-value confirmed that this drift was statistically significant. This is direct evidence against semi-strong efficiency because predictable excess returns remained after information was already public. Next is Validate. Here, I checked whether my results were robust. I adjusted the size of the estimation window and modified the event window, and abnormal returns still remained unusually large. The statistical significance of post-event abnormal returns persisted across tests. From a market microstructure standpoint, high short interest, retail-driven trading flows, and temporary restrictions from brokers like Robinhood limited arbitrage, allowing mispricing to survive longer than usual. These combined factors support the conclusion that the inefficiencies were real rather than random fluctuations. In the Evolve stage, I connected my findings to broader implications. The GameStop event shows that markets can behave efficiently most of the time but can become highly inefficient when specific conditions align—such as intense retail speculation, strong social media influence, extreme short interest, and limits to arbitrage. This means the Efficient Market Hypothesis may describe normal market conditions but does not fully capture behavior during chaotic or sentiment-driven periods. These lessons also apply to meme stocks, crypto rallies, and other situations where investor psychology overwhelms fundamentals. Finally, in the Reflect stage, I considered how this project changed my understanding of market efficiency. Before doing this analysis, I generally believed that markets were mostly efficient and that prices incorporated information relatively quickly. After seeing the extreme disconnect between GameStop's price behavior and any fundamental value, I realized how powerful behavioral forces can be. I also learned that markets can show persistent patterns when arbitrage is limited or costly. Overall, I now view financial markets as adaptively efficient—efficient under normal conditions but vulnerable to inefficiency during periods of stress or speculative mania. Thank you for watching my DRIVER analysis on GameStop and market efficiency.\"",
  "video_url": "https://youtu.be/hCEH4vPMG5Q"
}