{
  "student_name": "Matthew Baratian",
  "org_defined_id": "034214748",
  "username": "mbaratia",
  "email": "",
  "transcript": "Hello, my name is Matthew Bian and this is my session 10 assignment. So, um, so for our mission overview for our assignment, we must evaluate Starbucks proposed flagship grocery ro acquired a $12 million upfront outlay and expected to operate for 10 years. We must use our fir that firm's 8.5 whack as a hurdle rate to determine whether the project creates value and to recommend an act and accept or reject decision supported by this driver of documentation. So before we do anything we got to list out our project parameters which they were given to us which is our initial investment, working capital, revenues, operating costs and taxes. Once we have those listed out we can move into our define discover first step of the driver framework. And here we define and list our parameters in which our initial investment is sitting at $12 billion. The appreciation period is is at 10 10 years. Our working capital uh initial is at $500,000 with our working capital cover year sitting at 10. Um you know our WACC is at 0.085 with our tax rate being at 0.25. So 25%. Um our terminal value is sitting at I I I can't really see the zeros that well. my eyes kind of bad. I I think it says 3 million and our project life is sitting at 10. So here we've listed out our revenues for year 1, you know, two, the five and six along with our COGS rate, our labor cost, our potential rent, utilities, and as well as our marketing year one, the marketing thereafter being the following year. And here we create a list where we want to list out the metrics that we need to calculate and our sensitivity scenarios. So now we have all these defined and listed we can move on to represent which is actually outlining this model structure and defining these variables defining them but creating a definition function form. So here first we created you know the uh the function for uh the calculating the cash flow schedule which we included all these different variables within here. This our goal here is to calculate this interal cash flow for the project in which we initialize the data frame for the cash flow schedule. Uh so after we've done that we move on and then we can define the calculation of the NPV net present value using our WHC and our cash flows. And after that's been done we move on to calculating the IR which is you know we use our cash flows for. So after we've outlined the model and got it set up now we can begin implementing and actually calculating the cash flow schedule using the model that we you know outlined. Um so yeah so we move on and look at the code uh you know we import you know pandas again same thing calculate cash flow schedule move on here we do our annual depreciation which we calculate throughout the years from you know zero all the way up to the year we need to um here we have listed out you know our in our for loop where we have our revenue cog gross profit operating cost depreciation uh EBIT our taxes you So operating profit after our taxes and also working capital change and net cap X for imminent years as well as a free cash flow before those adjustments. After we got all those listed we have our year project life which are working capital recovery and terminal value. And after that we can set our nonable cash value cash flow components to zero uh within that year zero. We want to round it keep it to two decimal places and call the functions and have it spit out our base cash flow schedule generation which can be seen here. So next in this is our implementation stage where we calculate the the financial metrics of this model in which we calculate MPV net present value IR discounted payback period our simple payback period and a profitability index using those generated cash flows that we had done. Um so in this we want to install numpy financial first just to make it easier. Um again we call the same function of the calculation of the NPV using the WACC our cash flows as well as the IR and the only difference here now is now we're defining that calculation of the simple payback period using the cash flows and our initial investments um in addition you know like I said earlier calculation of discounted payback period within WACCC and cash flows you know initial investment is included here um with a cumulative discounted cash flow playing a factor as All moving on to the next thing would be our calculated uh profitability index using again WACC and cash flows. Um so at the end of all this after we actually calculated uh these metrics we s with a base case and net present value of a little bit over 3 million a base case IRRa of 13.25% and a simple payback period of 5.28 years and a discounted payback period of 8.21 years uh and a profitable index of 1.2 24. So after this we conduct our sensitivity analysis that was required of us from the uh driver uh textbook and through this we just want to run our analysis using our parameters that we had previously defined and listed. uh and first we want to run the cash flows uh schedule and calculate that MPV and IR for a given scenario which we call all the you know the calculate cash flow schedule extract that free cash flow call our MPV our calculated uh MPV and calculated IR return you know our newly calculated MPV and IR and initialize the engine dictionary for our results and this is where we have our sensitivity analysis where we actually have the revenue reduced by 20% and we'll see what happens Another thing would be the point minus2 or 2% of the WACCC. Another uh scenario we had was uh increasing the WACCC by 2%. And in here with our different scenarios for that first scenario of revenue being reduced by 20%. Our NPV is sitting at negative 3 you know 1516 you know million give or take. Uh our IR is sitting at 3.19%. Uh with our second scenario of uh the WACCC being reduced by 2% sitting at 6.5%. Our MPV goes up to 4.6% or 4.6 million with our uh IR also going up to 13.25% pretty big jump. Uh with that third scenario of our WACCC being uh uh plus 2%. So sitting at 10 point uh 10.5%. our NPV actually goes down to 1.6 uh million give or take with our IR sitting again at 13.25%. So after we've done all that we can begin validating uh our procedure in which we calculate the annual depreciation for verification and we want to verify the revenue and uh COGS for uh the cost of goods sold uh for year five uh as well as our appreciation for year five uh needs to be verified. Um so after that we can print out a summary and take a look at it. So uh you see with the verification for the year five revenue our expected was 11 million and our actual was 11 million. Uh for year five cost of goods sold expected was 4.4 million and the actual was 4.4 million and again with the year five depreciation our expected was 1.2 million and then our actual was 1.2 million. So because these validations are passed we can uh assume that these cash flows and the flash flow schedule is consistent with our expectations. So now after that we can move on uh to our evolve um to our evolve uh stage. In this we have our current financial uh model you know operating with fixed parameters. However there are a few different op uh options that we can use to explore uh to create a more sound and better overall model. Um so with this one of them will be a dynamic marketing cost adjustments. So for example instead of fixed marketing costs after year one we can implement a more dynamic approach uh for example being in a K rate or uh tiering spending based on revenue growth to create a more uh real world scenario uh model. Uh the next thing would be incorporating inflation into this to make it again a more real world applicable scenario model. Um the next would be a probabilistic outcome. So something like a Maro uh Monte Carlo simulation where uh we move beyond you know point estimates by implementing that simulation and finding and this would include things like the finding of probability distributions for our key variables and running a bunch of simulations to generate possible random values of NPVs and IRS to get a more whole look at it with multiple simulations then go on the uh the average of those simulations. Uh next thing would uh to increase the expansion of our sensitivity analysis and include or combine you know more variables within there. Uh the more parameters usually the better the model will be not always but it's can be something that be look worth exploring if that was our goal was to create more sound model. Um finally we move on to our sixth step in the driver framework which is just a reflection period. Um in this I include a little summary. So based on our financials uh the flag Starbucks flash roaster project is actually recommended under you know our assumptions after going through this model because it yields a net present value that is positive an internal rate of return which is you know above the WACC and a good profitability index. Um however it is sensitive to revenue fluctuations becoming unprofitable if revenue decreases by 20%. So in this we can go down to our insights and next steps. I just wanted to list out here the key data analysis findings uh just to have them listed and reiterated. Uh the next thing the last thing actually would be insights or potential next steps uh with this reflection. U so these metrics are actually favorable. The project's high sensitivity to revenue suggests a need for more more robust market search and should plan to reduce revenue related risks. So again, things such as I I honestly would suggest doing a Monte Carlo simulation to get a better understanding of how you know uh these simulations work to get a more I guess just sound more fitting better fitting model then instead of going off of one simulation with prediction it' be better to have a bunch of simulations and then use that as our base. Um yeah, that that's my assignment.",
  "video_url": "https://youtu.be/DFy46QXuqB0"
}