{
  "student_name": "Jake Patterson",
  "org_defined_id": "037362505",
  "username": "patte269",
  "email": "",
  "transcript": "Hello everyone, my name is Jake Patterson, and this presentation covers my Market Efficiency Investigation of the GameStop short squeeze using the DRIVER analytical framework. In this project, I investigate whether the behavior of GME during 2020–2021 aligned with the predictions of the Efficient Market Hypothesis, or whether the extreme movements we saw represent true inefficiencies that EMH cannot explain. I also verify the accuracy of historical claims, perform a simplified CAPM-based event study, evaluate abnormal returns, and connect the empirical results to behavioral finance and market microstructure. My analysis follows the DRIVER framework strictly in order, beginning with Define and Discover before any modeling or coding takes place. To begin the Define stage, the core objective of this project is to test market efficiency using the GME short squeeze as a real-world case study. The research question is whether GME's price behavior was consistent with weak, semi-strong, or strong form EMH, and whether any rational investor could have systematically profited from the patterns that occurred. This includes verifying important factual claims—such as the statement that GME traded at four cents in August 2020, which turns out to be inaccurate—and making sure the analysis is grounded in correct data. The Define stage also sets the expectation that the analysis must integrate both EMH theory and behavioral finance explanations for anomalies. During the Discover stage, I collected and verified all required data before conducting any analysis. After pulling GME historical prices from reliable financial data sources, I found that GME did not trade at $0.04 in August 2020; instead, it traded between about $1.20 and $1.70 during that month, with August 31 closing around $1.67. Correcting this claim is important because inaccurate inputs would invalidate any conclusions about efficiency. I then constructed the official GME event timeline: the distressed pricing in August, the Ryan Cohen stake announcement in September, the rapid retail-driven expansion in January, the peak near $483, and the trading restrictions issued by Robinhood. Establishing this timeline is essential for conducting an event study. In the Represent stage, I mapped the problem to the three forms of the Efficient Market Hypothesis. Weak form efficiency tests whether past prices contain any predictable patterns. Semi-strong efficiency looks at whether markets react quickly and correctly to public information. Strong form efficiency evaluates whether any group—whether hedge funds or early Reddit traders—can consistently earn abnormal returns. From these hypotheses, I created the event-study structure. The estimation window covers roughly 250 to 30 trading days before the first major event, and the event windows center around the Cohen announcement, the board appointment, the peak squeeze, and the Robinhood trading limitations. These windows define how abnormal returns will be measured. In the Implementation stage, I wrote a simplified Python script to conduct the event study. Because online compilers often cannot download market data, I used manually embedded price lists for GME and SPY. The code computes daily log returns, estimates CAPM alpha and beta using a simple covariance and variance formula, and then calculates abnormal returns by subtracting the predicted return from the actual return. The code also computes cumulative abnormal returns over the event windows. This produces quantitative evidence that can be evaluated in the next stage. From the code output, the CAPM beta is extremely high, reflecting GME's enormous volatility and weak connection to the broader market. The abnormal returns are highly irregular, with massive positive abnormal returns during the squeeze—some exceeding 100% per day—and large negative abnormal returns following the trading restrictions. The cumulative abnormal return curves spike violently and collapse just as quickly. These patterns are inconsistent with semi-strong market efficiency, because prices do not reflect public information smoothly or rationally. In the Validate stage, I interpret these abnormal return patterns in the context of EMH. Weak form efficiency fails because momentum and reversal patterns during the squeeze were predictable over short horizons. Semi-strong efficiency fails because public news produced exaggerated and chaotic price reactions rather than smooth adjustments. Strong form efficiency appears violated because certain early investors—such as early Reddit traders or funds that repositioned early—earned enormous abnormal returns that others could not replicate. However, it is important to emphasize that these profits were not systematically achievable due to extreme volatility, margin constraints, and broker-imposed trading restrictions. To evolve the analysis, I integrate behavioral finance explanations. Herding behavior on Reddit massively amplified coordinated buying. Overconfidence, confirmation bias, and fear of missing out caused many traders to ignore fundamentals. The disposition effect created irrational holding behavior even during extreme volatility. On the institutional side, short interest exceeding the float created a structural squeeze, clearinghouse collateral demands forced trading restrictions, and liquidity constraints distorted price discovery. These behavioral and structural factors explain why inefficiencies persisted despite being theoretically exploitable. In the Reflect stage, I tie the results back to theory. The GME event does not prove that EMH is useless; rather, it shows that markets can become temporarily inefficient under intense psychological and structural pressure. For long-term investors, markets remain efficient enough that passive strategies still dominate. For short-term traders, behavioral forces and market frictions can overpower rational pricing for extended periods. The DRIVER framework helped structure the analysis from initial fact-checking all the way to theoretical interpretation, preventing the common mistake of jumping to coding before defining the problem. Overall, this project demonstrates how EMH and behavioral finance complement each other. EMH explains why systematic arbitrage was nearly impossible, while behavioral finance explains why the mispricing happened in the first place. The combination of both frameworks provides a complete picture of the GME short squeeze and highlights the importance of data verification, disciplined research design, and thoughtful interpretation of market anomalies. The first part of the code computes log returns from raw price data, which converts differences in stock prices into standardized daily return values. The next section calculates CAPM alpha and beta using a simple covariance-to-variance ratio, which estimates how much of GME's return is explained by market movements. The script then calculates abnormal returns by subtracting the CAPM-predicted return from the actual GME return on each day. After that, the cumulative abnormal returns loop adds these abnormal returns sequentially to measure the total event impact over the window. Finally, the script prints out the AR and CAR results, which are used in the Validate stage to determine whether the market behaved efficiently around major event dates.",
  "video_url": "https://youtu.be/AhKrTQFQ_Qw"
}