{
  "student_name": "Van Uk",
  "org_defined_id": "035723111",
  "username": "vcuk",
  "email": "",
  "transcript": "No, I'll be doing the session eight. Simon and says, \"Investigate market efficiency using the GameStop short squeeze event of 2020 2021 as a case study. Verify the accuracy of state facts. Analyze price behavior relative to efficient market hypothesis predictions and evaluate whether market anomalies constitute evidence against market efficiency or can be explained within existing frame works. And the critical first step is to verify the game the statement GameStop traded at 0 uh 4 cents in August 2020 against actual historic data historical data. If incorrect, document the accurate figures and determine appropriate communication post for correcting the professor. Okay, before we get into the collab, we're going to get into this. So, give me a second. All right. So, the provided analysis of GameStop short squeeze identify several behavior concepts that help explain the event. these concepts just that the market during that period was driven by rational rationality and emotional trading rather than purely rational decision making based on fundamentals. So the here are some behavior uh biases and impacts according to the event that happened and I'm just going to read off all of them. So the bias was about hurting and and basically was when traders copied each other's actions uh primarily coordinated on social media platforms like Reddit and what that led to was massive retail buying and it created initial price spike in momentum. So uh overconfidence was one and it was when retail traders believed they could beat the be wall street by collectively driving up the price and this caused traders to ignore fundamental valuation signals. Um and it pushed the price far beyond what was warranted. And there was FOMO uh which was late buyers that felt pressure to enter the trade to participate in the perceived massive gains. And uh this drove bubble behavior with buyers buyers entering at peak prices and it contributed to the rapid runup and anchoring which was when traders focused on past low prices of the stock and that caused traders to misjudge future value and the actual risk of the trade as the price rose dramatically and there was limits to arbitrage and it was a structural factors like trading halts and the extreme short interest which made it difficult for rational traders to execute trades to correct mispricing quickly and it and this prevented an immediate market correction allowing the price bubble to inflate further and prolonging the short-term inefficiency. So the challenging market efficiency um for short-term and long-term was that for short-term the price did not simply reflect on only new fundamental information. Instead they reflected hype, coordination and emotional buying. The huge positive abnormal returns confirm this short-term violation and to yeah and then so that's for one of them and then for the for the event study market model estimation equation was this right here then I submitted the parameters of alpha and beta by using daily log returns during the pre-event window which was from June 1st, 2020 to December 31st um 2020 and the stat model output provided the specific values for these parameters and for the alpha this the intercept of the regression representing the expected daily return of GME when the S&P 500 return is zero the beta it's the slope of the regression it represent the GME systematic risk or sensitivity to the market typical pre-squeeze beta for Jimmy was likely close to or slightly above 1.0 indicated that it moved roughly with the market. And for the abnormal return, I used the estimated uh alpha and beta to calculate the expected return for each day in the event window from January 11 to 28 some 21. I did all this sample. So to interpret the results, there was a huge positive abnormal returns. The sharp spike in car between January 13 and January 28, 2021 confirms that Jeremy's returns was were uh vastly greater than what systematic risk mod could explain. This is the quantitative evidence of the short-term market efficiency semi strong efficiency breakdown. Just the price surge was not justified by any equivalent release of positive fundamental public information. The semi- strong form of EMA was clearly violated and prices reflected high coordination and short covering pressure and efficiency restoration rapid drop in CR in early February suggest that N that rational forces and fundamental valuations $10 to $40 begin to restore efficiency after the immediate bubble burst. Okay. And basically I talked about the behavioral rational and such. So it included the EMAs forms. So if we looking for the code that I did, it's the import finance. Um downloading the data, the GME, the SPF, SPX, excuse me. It's the daily log returns. you can find and the estimate the alpha and the beta for here and then the abnormal returns this the plot cumulative normal returns see our and the study strongly suggest the conclusion that Jimmy short squeeze was a temporary but severe breakdown of market efficiency and it was driven by behavioral biases and structural factors detailed in your in my uh evolve Evolve section. Technically the whole thing was just behavioral thing and it wasn't really rational. It was like it says here, it was temporary and it was it was very severe for the market. Uh look for it to be efficient and yeah.",
  "video_url": "https://www.youtube.com/watch?v=m4BdZbOmjEg"
}