{
  "student_name": "None None",
  "org_defined_id": "037165853",
  "username": "velasqul",
  "video_url": "",
  "transcript": "01\nHello everyone. For my third project, uh\n0:04\nI made an app that uh will analyze your\n0:07\ninvestments or your business decisions\n0:10\nlike Warren Buffett uh using termin uses\n0:13\nterminologies like modes and uh other\n0:17\nwords that uh and other descriptions\n0:19\nthat Warren Buffett likes to use um when\n0:22\nhe analyzes companies. Um he's one of my\n0:25\nfavorite investors of all time. So uh\n0:28\nthere's no one uh better to get advice\n0:30\nfrom than the Oracle himself. So if you\n0:34\nlook at the screen here um you can ask\n0:38\nWarren Buffett a question about\n0:39\ninvesting.\n0:41\nUm so I did uh should I invest in\n0:45\nconstellation Brands which is one he\n0:47\nactually invests in as well. And uh he\n0:50\ngives a response\n0:52\num\n0:54\nand let's see what he says. He says, uh,\n0:57\nthink about it as a piece of business,\n0:59\nnot just a stock quote. It's a very\n1:01\nBuffet-esque thing to say. Um, it goes\n1:05\ninto its market fit with its strong\n1:08\nbrands like Corona, Modello right here.\n1:11\nUm,\n1:13\nand then it talks about its moat.\n1:16\nUm, and they have a core beer business\n1:19\nthat are very popular and have a strong\n1:21\nfollowing. It talks about its foray into\n1:24\nthe cannabis industry over here and it's\n1:27\na little risky.\n1:29\nUm he talks about a margin of safety.\n1:33\nUm you know the price the value of the\n1:35\ncompany. Um just because it's a good\n1:38\nbusiness doesn't mean you want to buy\n1:40\nit. Um so yeah it gives you a final\n1:43\nlittle thing here to help you think like\n1:46\nan owner not to tell you what to do. and\n1:48\nit gives you a little rating of the the\n1:51\nmo and the safety level. Um, I don't\n1:55\nknow if you can see that because my\n1:57\npicture's blocking it, but it says eight\n1:58\nout of 10. Um, and then something I did\n2:02\nwas I iterated and I made a jargon\n2:05\ntranslator and a due diligence\n2:08\nuh section. So, if you go to due\n2:11\ndiligence, you can put in a a sector.\n2:13\nSo, we'll put in the beer industry kind\n2:15\nof following the trend.\n2:17\nUm\n2:19\nso I'll generate\n2:23\nthe previous one was for airline.\n2:27\nUm\n2:29\nso for the checklist it says uh the\n2:32\nbrand equity and pricing power which is\n2:34\nkind of like the main thing that you\n2:35\nshould be looking at and obviously Medel\n2:37\nand Corona are some of the most uh\n2:39\npopular ones out there so they kind of\n2:40\nsatisfy this. Um so that's that part of\n2:43\nthe app and then you can go to the\n2:44\njargon translator. Um, you could put a\n2:47\nconfusing headline or federal report to\n2:49\nhelp you understand something and uh\n2:52\nmore simple\n2:54\nuh more simple terms.\n2:56\nAnd so translate I to I got this\n2:59\nheadline from Barren.\n3:02\nAnd then it says uh when the burger\n3:06\njoint isn't hiring many new cooks, it is\n3:08\nthe signals that the business is cooling\n3:10\noff. Uh so the owner might want to cut\n3:12\nthe price of burgers to get more folks\n3:14\nbuying. Um so it's just pretty simple\n3:17\ntool that kind of helps you uh\n3:18\nunderstand your decisions and uh in the\n3:21\ncontext of Warren Buffett. So it's a\n3:25\nsomewhat useful tool and uh more\n3:28\ntechnically on the technical side\n3:31\nuh I made this uh with\n3:35\nwhat I with react and then\n3:40\nin the code\n3:44\nit uh\n3:47\nit uses a rest API call to fetch uh the\n3:51\nsystem prompt.\n3:53\nAnd then uh it uses a technique called\n3:57\npersona adaptation or adoption. And uh\n4:01\nit includes like negative constraints\n4:03\nlike one thing in this uh it never gives\n4:06\nspecific buy or sell recommendations to\n4:09\nensure safety and make sure the AI is\n4:11\nnot uh going to get sued or be liable\n4:14\nfor somebody making wrong investment\n4:16\ndecisions and uh also reduces the risk\n4:20\nof hallucinations.\n4:22\nUm, there's also a section of the parse\n4:25\ndata that forces the AI to output JSON\n4:29\nstructured data alongside text. So if\n4:32\nit's the form, the AI can uh detect that\n4:36\nit's wrong and not not continue. It also\n4:40\nhas external data integration.\n4:43\nUm, it has a pattern called rag which is\n4:46\nretrieval augmented\n4:48\ngeneration. So before sending the user's\n4:51\nquestion to the AI, the code checks if\n4:53\nthe known ticker is mentioned and then\n4:55\nit uh inserts the correct financial data\n4:58\nand is analyzing real numbers. ThankProject 3"
}