{
  "student_name": "Jon Parrett",
  "org_defined_id": "037141383",
  "username": "parrettj",
  "video_url": "https://youtu.be/kT1h68EUjbs",
  "transcript": "So I built a workflow that um has two functions. One, it gives you a daily stock. Um so it it looks daily and tells you what like some hot stocks are. So if you ask it what are some stocks I could look at for today, it would give you a stock just to look at for today. And that's why it has a daily SC stock schedule because it changes every day. Um, but the main thing I'm excited about is I built a um a monthly budgeter. So, it gives you all of your budgets for these categories. And it comes with a chart, too. You'll see this filled out in a second. And so, I built it for over a 6 months period. So, January, February, March, April, May, June. Okay. So, um, if I So, I have one already typed out. I'll read it for you. So, I make $3,000 a month. My rent is 1,000 a month. My groceries are 300 a month. Utilities is 150 a month. Transportation is 60. Insurance is 250. Entertainment 200. Miscellaneous 200. I want to save 10% and I want to pay my student debts which is 20,000. So let's say this is for the month of February. Send it to my sheets. Okay. So simple as that.\n\nOkay. So now we look at February and it has all my expenses laid out. So my monthly income, utilities, all the good stuff, everything I want to pay and save. And it even fills out the chart for me, too. So to really visualize where my spending is going. Um, if you want to do another one, we could give it the same prompt. Change my income to what? 4,000 a month. And I now pay what, like 900 a month somehow on um gross or on rent. This is for the month of January.\n\nSend it to my sheets. Okay.\n\nSo, that's this workflow. Beautiful. Looking we're looking January. Everything's updated. Charts updated. Beautiful. And the only thing it doesn't include on this is your income because um I don't think it really matter on like your expenses chart. Okay. Then last thing I want to show is that you can also ask it for um help on your budget. So let's say I want to or just simple as give me suggestions give me suggestions on how to save this month.\n\nAnd it's going to give you some tools to optimize your rent and your groceries. Um buy things in bulk. Just use coupons. utilities. It lays out every single one on how to save. Okay, last thing I want to show is the implementation. So, um, my roommate had a big problem with overspending last this semester and so I sent him this link to use it for himself and he's going to tell you about it. This is my roommate Oliver.\nUh this semester I had an issue with overspending and uh this tool John created. I'm hoping can help me uh spend more wisely and visualize my expenses so I can stretch my budget a little further. And uh yeah, I think that the the graph this creates and the the breakout will really help me with that. Thank you. Perfect. All right. To summarize everything, I built a nan workflow that track tracks your budgets, gives you a daily suggestion on um stocks, and um gives you suggestions on how to cut back, and it really visualizes your results. All right."
}