{
  "student_name": "Mauricio Echeverria",
  "org_defined_id": "036820322",
  "username": "echevem",
  "video_url": "https://youtu.be/70u3F9Sq1ow",
  "transcript": "Intro\nIn this analysis, I value Atlas Athletic Co. using a discounted cash flow framework integrated with core financial modeling concepts. The objective is not only to calculate enterprise and equity value, but to show how free cash flow, reinvestment needs, and the cost of capital work together to tell a coherent business story. I use the DRIVER method to structure the analysis from problem definition through evaluation, ensuring both mathematical rigor and strategic clarity.\n\nD — Define / Discover\nThe problem is to estimate the intrinsic value of Atlas Athletic Co. by discounting the future free cash flows generated by its operations. Atlas currently generates $500 million in revenue and is expected to grow at a moderate, sustainable rate. The key questions driving this valuation are whether the firm's growth creates value above its cost of capital, whether its reinvestment assumptions are realistic, and whether the long-term terminal assumptions reflect a stable steady-state business. This stage defines the valuation objective and clarifies what assumptions truly matter.\n\nR — Represent\nTo represent the economics of the business, I translate operating assumptions into financial drivers. Revenue is projected to grow at 6 percent in Year 1, reaching $530 million. Operating margins are assumed to remain stable at 15 percent, reflecting steady competitive positioning and operating leverage. Taxes are applied at a 25 percent rate to derive after-tax operating income, or NOPAT. Reinvestment needs are modeled through depreciation, capital expenditures, and working capital requirements, all expressed as percentages of revenue to maintain internal consistency.\n\nI — Implement\nUsing these assumptions, I calculate free cash flow. NOPAT for Year 1 is approximately $59.6 million. Depreciation adds back $21.2 million, while capital expenditures of $26.5 million and working capital increases of $5.3 million are subtracted. This results in Year 1 free cash flow of roughly $49 million. This step converts accounting performance into cash generation, which is the true driver of enterprise value in a DCF framework.\n\nV — Validate\nNext, I validate the model through terminal value and economic reality checks. I apply a perpetuity growth model using a terminal growth rate of 2.5 percent and a WACC of 9 percent. This produces a terminal value of approximately $772 million. The assumptions pass key validation tests: the growth rate is well below the discount rate, reinvestment levels are reasonable for a mature firm, and the implied returns remain consistent with long-term value creation rather than aggressive expansion.\n\nE — Evaluate\nFinally, I evaluate the valuation results and their implications. The enterprise value is approximately $772 million. After subtracting net debt of $200 million, the equity value is $572 million. Dividing by 50 million shares outstanding yields a per-share value of about $11.45. Strategically, this valuation suggests Atlas Athletic creates value through steady growth and disciplined reinvestment. However, it also highlights sensitivity to terminal assumptions, reinforcing the importance of careful scenario and risk analysis.\n\nR-Resolves\n this valuation demonstrates how discounted cash flow analysis combines financial mechanics with business judgment. By using the DRIVER framework, the analysis moves beyond simply calculating numbers and instead builds a structured, defensible investment narrative. The model shows how growth, profitability, reinvestment, and risk interact to determine value, which is ultimately how investment professionals evaluate real companies and make informed capital allocation decisions."
}