{
  "student_name": "Connor Kubly",
  "org_defined_id": "035977730",
  "username": "ckubly",
  "email": "",
  "transcript": "So, the first thing I did on this assignment was um insert my prompt uh into Gemini. So, I let it know that I'm an accounting student doing a cost of capital analysis homework assignment. Told it to please act as a finance professional with a good understanding of Python and to apply the KISS principle to the code. I then copy and pasted all the assignment details, overview and um required like analysis to let it know where I wanted to go with assign this assignment. So for the first question was to just simply calculate Netflix's uh weighted average uh cost of capital. So doing this uh I using I use the CAPM model uh which is clear clearly set right here using the cost of equity, cost of debt, corporate tax rate, market value of equity uh market value of debt and the total firm value. Um using this model I first calculated the cost of equity which came out to be about 11.65% and the cost of debt after tax is about 4.58%. So plugging all that into the uh weighted average uh cost of capital formula uh Netflix's WACCC is about 11.21%. And in the addition of a in of $3 billion uh in cheaper tax tax deductible debt causes the uh weighted average cost of capital capital to decrease from 11.21% to around 11.12%. And I believe this demonstrates the benefit of the tax shield and utilizing a less expensive source of capital. Um overall cost of capital or the weighted average cost of capital uh decreases when a company increases its uh use of debt. And then to scroll down here right here is you can see all the code um of it trying to figure out uh its original CAP uh CAP or WACCC, excuse me. Uh right here you can see it's uh all the financial parameters, all the market parameters, um all the WACCC calculation functions, the weights, um its return, and then finally the results. And then right here, um is basically the same thing. Uh it's recognizing that there's a $3 billion new debt issuance. Um it's figuring out the uh the new debt, the new equity um and all the posting its results down here. And so for a project specific uh weighted average cost of capital, so U uh United States versus international content. So a firmwide weighted average capital cost like the 11.21 this number is wrong. I calculated it myself and got 11.21% as Netflix's current W uh ACC. So, a firmwide capital or a firmwide WACC like the 11.21% we calculated assumes that the project's risk is about the same as the company's average risk and a firmwide discount rate of 11.21% should be used as a baseline for the hypothetical $5 billion investment. A projectwide uh a project specific WACC is generally better because it adjusts the discount rate to the unique risk of the project. Um so for the US uh for US content it's a more of a mature market and it might have a lower risk and thus a lower uh weighted average cost of capital due to a familiar audience, stable market and reliable revenue streams. On the contrary, international content or emerging markets uh they likely have a higher risk and thus a higher WACC due to uh currency fluctuations, political instability um and less predictable audience tastes. We can see the political instability all over Europe. I mean, the wars in the Middle East, uh, Ukraine right now. Um, so you can see how the markets over there aren't going to be as stable as a country like the United States. And so using the firmwide WACCC of 11.21% would lead to the underdisounting risky international projects and overdisounting safer safer US projects. Therefore, project specific WACCC is the theoretically superior method for this investment decision. And then now we're comparing to um industry peers. So Disney um and we have Amazon Prime. And in this Google sheet, I kind of compared the uh weight they're both of both companies weighted average cap uh cost of capital and their debt to value ratio. And I think the key difference and we I mean we can see that Netflix is Netflix's is almost well 3.01% higher um than Disney's. So and I think uh Netflix has a higher uh weighted average cost of capital due to higher equity risk. They have a beta and um yeah so they have a beta which basically just kind of tells you how risky a company is of 1.3 and a lower debt weight. Um the high equity waiting exposes the firm more to the expensive cost of equity and you can see how much higher uh Disney's debt to value uh percentages than Netflixes and this is I think this is because of a lower so a lower uh weighted average cost of capital primarily due to a much higher debt weight 30% and a lower uh beta debt is cheaper than equity because it's t because it's t tax deductible lowering the overall weighted average cost of capital for Disney. Um and right here is just kind of so um kind of giving those explanations again as well. Um so my recommendation is optim is the optimal capital structure strategy. So based on the analysis, Netflix's weighted average cost of capital was high relative to its peers, largely due to its equity heavy capital structure and relatively high beta or how risky uh Netflix is. So issuing the $3 billion in debt reduces the uh WACC from about 11.21% to 11.12%. Uh demonstrating the benefit of cheaper debt. So the recommendation that I have is Netflix should increase its debt waiting towards the industry average or even Disney's level 30 30% uh debt to value to significantly lower its weighted average capital cost of capital and increase shareholder value. And how would we do this is we would move towards a theoretical optimal capital structure which minimizes WACC and maximizes firm value. Um, so the the strategy basically is Netflix should aggressively increase its debt issuance beyond $3 billion to reduce its reliance on its highly expensive cost of equity um 11.65. Um, and this higher leverage would move its capital structure closer to the peer average resulting in a more competitive cost of capital.",
  "video_url": "https://www.youtube.com/watch?v=yI19LVs9dD4"
}