{
  "student_name": "Gavin Hannon",
  "org_defined_id": "035642219",
  "username": "ghannon",
  "video_url": "https://youtu.be/_DfQvB_SMiY",
  "transcript": "Hello, I'm Gavin Hannon and I'm doing session 12 uh assignment. So, we need to deliver a full valuation of Panera bread for prospective KKR takeover using driver. We need to combine DCF trading comps and president transaction to produce an informed bid range while also contrasting financial buyer discipline with strategic buyer synergies. So we have the steel snapshot with all the information and we're use this information to create an executive ready recommendation that states our valuation range, winning bid strategy and rationale for choosing financial versus strategic position. So in our define and discover stage, we need to inform KKR's final non-bidding bid uh price for the acquisition of Panera Bread and we need to ensure the office price aligns with the firm's required IR of 20 to 25%. And competitive marketing price. So our scope and horizon we have Panera Bread uh timeline is a 5-year LBO hold period and this is for KKR investment committee and deal team. Our constraints are constrained by KKR strict 20 20 to 25% internal rate of return hurdle. This is the primary constraint that limits the maximum uh acceptable entry multiple of 14.5 times. So now our success metric is we need to achieve an entry multiple that results in a projected 20% IRRa or greater for KKR. Well, this is appropriate for a financial sponsor and the IRRa is the fundamental metric of success and it defines the return on equity investment. The successful bid will be the one that is competent enough to win but financially disciplined enough to meet the IR target. So next we move on to the represent stage and then this analysis will follow is this is a structured plan and so we have first we need to do the discounted cash flow analysis of the 5-year forecast model. We need to do the revenue growth. This models the impact of new store openings 500 in 5 years and the digital expansion. We need to do EBIT TDA/FCF projections to extend the 15% margin and estimate capex and networking capital changes. We also need to calculate the three scenarios. The base upside downside using the perpetrator growth method and a base uh WACC of 9%. Then we need to compare the company analysis um Chipotle and McDonald's as the high growth and estimated established peers plus the industry average. Uh we need to apply selected multiples to Preer's current net income and EBITDA. Uh next we need to do president transaction analysis. This is apply the provided range that we were given and calculate the enterprise value using this range. And for our synthesis and bid strategy, we're going to create a football field chart, quantify potential strategic synergies, and then develop a final bid recommendation for KKR. So next, we're going to go into the implement stage.\n\nAnd here is where we have a code that takes us through the driver stages. First stage is to find and discover where it's going to state the objective. Uh then we're going to move on to stage two represent and get make a map out a plan that gives us before analyzing and then we move on to the driver stage three implement stage where that's where all the calculations are. So it's going to assume the FCF drivers using the simple simply cross the scenarios of these rates and then create a five-year forecast for five years. That gives the revenue projection with this calculation and the EBITDA projection with this calculation.\n\nAnd it's also going to give us the FCF calculation and the discount factor and terminal value calculation all that are all present here. The calculations are all present here in the code.\n\nAnd then when we run this code, we get the this output. We get the define and discover objective. Then they represent the plan that I made earlier and implement stage. So this is our base case 5-year forecast. And in the revenue, this is our projected topline sales showing the growth from the initial $6 billion scale. due to the store expansion of digital uh penetration. Then we got the earnings before interest tax depreciation and motoriization and this shows the operational profitability growing in line with revenue. We got the free cash flow to firm. This is critical output that um shows the cash available to all investors after taxes and necessary capital reinvestment. And the present value of the FCF is calculated by discounting the cash flows back today using the WACC which is 9%. And here we get the terminal value of 6.11 billion. DCF enterprise value ranges from 7.14 billion which is the downside case and the upside case is 9.64 billion. So the terminal value this represents the value of Panera's operations after the 5-year explicit forecast period and is calculated using the peruitity growth method. This value is the present value of all cash flows from year 6 to infinity and when combined with the present value of the 5-year forecast that yields the final enterprise value. The DCF enterprise value ranges uh this is the final output of the entire DCF modeling phase. It defines the intrinsic enterprise value range for Panera. It's the downside value that represents the lower bound uh valuation and then the upside value represents the high-end valuation is achievable if Panera success successfully executes its growth strategy of 500 stores or 70% digital mix.\n\nSo next we're going to move into the uh val validate stage and this is that the base case TV contribution is 77.1%. These are consistency checks. The validation pass is uh is the TV contribution is within the expected range indicating a model stability and the WCC assumption 9%. This is reasonable for mature yet growing quicks restaurant industries. So the implement stage uh is validated because of this. Next we move on to the evolve stage. This is comparing the similar industries and companies. So what we have was the DCF EV range that we got got was 7.14 billion to 9.64.\n\nSo this shows the intrinsic value that we calculate earlier and then you get the president trans EV range from 10.8 to 13.5. This is the acquisition premium derived from the industry uh M&A deals using the EBIT TDA and this is multiples of 12 * 15. And now we have the company EV range which is 9.3 to 14.50. This is the market multiples and derived from publicly traded peers such as Chipotle and McDonald's. And it uses the P/E multiples converted to an EV range. And this represents the current market perception of similar assets.\n\nNext, then to help show this, we have a\nso now we have the widespread in the evolve stage reveals the core dilemma of the KKR takeover. The financial buyers limit the DCF range is notably lower than the marketbased methods and KKR is a financial buyer focused on a high internal rate of return and this will be disciplined and anchor. It's bid near its DCF top end. Then you have the strategic buyers premium such as Starbucks and McDonald's. And this the higher ranges reflect the premium strategic biders can afford. If Starbucks and McDonald's step in, they can justify paying the the 10.8 billion to 14.5 because of the synergy such as cost savings, supply chain integration and crossation. And those are not included in KKR's discipline DCF. So now we have a chart to help show uh KKR's target bid. The bottom three um are navy blue represent the valuation ranges derived from the market data in the DCF model that we calculated earlier. And then the top thick green bar is recommended bid strategy for KKR the financial buyer. So the chart clearly shows that while paneer's interested value is relatively low the market and previous deals indicate much higher price forcing KKR to raise its offer to stay competitive. So now I'm going to move to my recommendation in the reflect stage. So I re the recommended EV range is 8.97 billion to 11.57 billion. This is the defensible window for a financial buyer. It is higher than KKR's low DCF value, but it still remains disciplined and it limits KKR's exposure to relative to synergetic buyers. Uh I would say our opening bid would be 8.97 billion because by starting at the bottom of the recommended recommended range KKR ensures maximum IRRa while leaving room for negotiation but to the high end of 11.57 billion. The implied multiples are 12.2 * 13.6 and these multiples are crucial as they validate the bid by showing it aligns closely with the middle of the president transaction ranges. So the recommendation is structured around the two types of potential biders. The financial buyer uh discipline KKR is buying the company purely based on its operational cash flow and growth potential and their growth is to maximize the $400 million net income and achieve the growth levers of the 500 new stores and the 70% digital mix. The target bid range is positioned to achieve a high return based on the standalone operational improvements. And then next is the strategic buyer synergies. The these strategic biders can afford to pay a significant higher premium. And this premium is justified by synergies cost savings and revenue enhancements unique to them such as integrating Panera supply chain into their own massive network cross-selling their loyalty programs or immediately leveraging McDonald's or Starbucks existing international platforms for Panera's early stage roll out. So my recommendation tells KKR to be aggressive but disciplined and it aims for the deal while respecting their financial limitations against the higher synergy driven valuations of their strategic competitors."
}