{
  "student_name": "Trevor Squire",
  "org_defined_id": "035907999",
  "username": "tsquire",
  "video_url": "https://www.youtube.com/watch?v=YFoPAecyXgo\nPart 1\nhttps://www.youtube.com/watch?v=Le4mjM5RXVU\nPart 2\nhttps://www.youtube.com/watch?v=RONo732QEBoPart 3",
  "transcript": "Okay. Now, okay. Uh, hello. My name is Trevor Squire and this is my session 11 assignment. Um, I'm submitting a little bit early because I have a lot to do tomorrow. So, I kind of just wanted to um finish this up tonight so I don't so I have less to do tomorrow. But yeah, I'm going to quickly get started. So, for section 11 assignment, a little overview. Um, I'm supposed to evaluate Apple's hypothetical $90 billion share repurchase um using the driver framework. Um, I'm supposed to act as an independent an analyst who must determine whether the buyback creates a value relative to alternative uses of cash u while balancing stakeholder incentives. Um, I'm given all all this different information like the liquidity, the market context, balance sheet, proposal and alternatives. Um, I also deliver a recommendation that explains stakeholder impacts, agency considerations of value creation versus value transfer outcomes. Um, so I was a little confused what I was doing, so I plugged into cash apt to help explain it better. Basically, I'm supposed to see if the $90 billion um, stock buyback is the best use of the cash for the company. um comparing buyback to other options uh to see which choice creates the most real value and also analyzing benefits or who might be harmed whether it be large investors, CEO, regular shareholders, employees, creditors and whether management's incentives are aligned with what's best for the company. That is a quick description of what this assignment is about. Um, obviously I have um all the groups tabbed up here, the actual assignment, the collab, which it's going to be a lot, and then chatbt. Um, I originally used Gemini, but it was kind of finding me today, so I kind of switched to a different AI to help me out. Um, basically what I did was, let's scroll to Here we go. Um, I know this is okay. So, I pretty much asked it to make a prompt that I can plug into Collab. Um, and I specifically said like make it so um like when when I'm reading the collab, there's code in between all the descriptions, material descriptions. Um, every every time I do this collab fights me, but I just keep working through it, figure out the best way. Um, so I asked Jackbt to give me the prompt plus the code that I could use and plug it in. So this is the code that I plugged into collab which started to run the define and discover and represent and then it continued off from there through collab. So this was pretty much my define discover and represent and then collab took that and continued um from there. But yeah, so this is kind of like the starting of the code. Um, and I asked it to also make short descriptions that I could plug into in between um, collab between the codes so I can um, read it off and understand what I'm saying more. Um, and then also like relate it to the problem, not just defining what it is a little more in depth. But yeah, I'm going to get started. Um, so this is the same thing I just showed um on chatbt. um just close things so it's a little easier for me to read. So here we go. First is the define and discover. Um this pretty much was used twice. Um this um this is the first time I'll explain it. Um so basically first is define and discover. It sets up all the information it's given the cash um FCF the price um everything dividend yield and then um this is kind of like a skeleton um of the driver framework. Again this is just define and discover. Um so first it frames concrete questions and um computes like a baseline arithmetic. So some questions to ask what is the market capitalization of the firm? What is the implied earnings? um implied growth discount from PE. What does $90 billion buyback or how does the $90 billion affect um EPS shares outstanding leverage and what is the net present value of the buyback versus alternatives. So those are just some questions that I need to answer throughout the entire thing. Um it gives the baseline arithmetic calculations. Your market capital is your price times your shares. gives you implied earnings, implied EPS, and implied FCFF per share. Um, it it tells you how to solve this is like the calculations. Um, and it saves the baseline results for later use. Um, and then prints the baseline, which I will show later cuz I also wanted this to include some tables and charts to try something new and also kind of give like a better description of everything. Next is the represent part. So the objective for collabs to define functions, mods to compute DCF, EPS, uh creation, share account, uh, math and okay, so I'm like I was like I'm like I'm like that's not a crack on my computer and if I have a scenario runner. So it gives the functions and then solves them out. Um, your FCFS, the use, the PV terminal, all that kind of stuff. And then it calculates and gives you all the baseline numbers. So the metric market capital you get 2.86 implied earnings 9.55 um implied EPS is 6.16 FC FCF is 6.45 and the debt is 1.1. Um all this is also most of these are also in billions. So let's define indiscover and the represent which I'm going to skip over the second one because it's the exact same thing. um define discover discovered clarifies whether Apple's hypothetical $90 billion share repurchase creates more shareholder value than alternative uses of cash um and establishes a baseline metric such as market capitalization, earnings, EPS, free cash flow, and current leverage. Um so Collab's task was to complete um the function and add new leverages um with a function to create like the represent part. Um the represent part builds a structure financial model for the Apple case by mapping how the $90 billion buyback changes share account EPS cash levels and leverage and by defining um how alternative capital allocation choices will be compared. So and then collab understands it's supposed to complete the function add new helper functions as um part of the instructions. So I'm not going to get into this is the exact same thing I showed earlier. Um, it just kind of did it twice. This is what the first one was when I plugged in from CABBT and then continued from there. So, it kind of just started over. This is the exact same thing as before. Um, actually wait. Okay. So, this one is not exactly the same thing, but it goes more in depth on the calculations. So, for this is under the represent part. So, this was shown before. This time it shows calculate number of shares per repurchase. It kind of gives a better description of what it's doing. Um calculate the shares outstanding EPS EPS accretion and then the net debt the debt to equity and net debt to equity ratio. Um so those are kind of like the totals at the end. Um so it's the exact same thing again but it just gives a couple more calculations I was able to solve and figure out. So next we have the implement part. So um the subtask is always going to pretty much be the same. Um it un the collab understands what it's supposed to be doing and what task it's assigned. So in this case add code to perform the buyback scenario analysis. This includes calculating the number of shares we purchased the new total shares outstanding the new EPS um change in leverage um results be stored and printed. to implement this will run the actual calculations for the Apple scenario. Um executing the $90 billion buyback simulation and alternative strategies to quantify um changes in EPS firm value, shareholder returns and balance sheet risk. Um so the reasoning um this is required performing a buyback scenario analysis which involves um several calculations using the functions and variables already defined. This step will um execute these calculations as per the instructions and the storing printing the results. So represent pretty much gave the calculations implement is implementing those calculations and figuring/solving it. So first um retrieve the implied earnings um call the EPS accretion function. Um basically it is defining what the functions is going to use and then how it will solve it. So first calculate EPS before buyback for comparison. Um it is your implied earn ear earnings which is the 955. I'm not going to say all those numbers divide by your shares which was the um I'm going to say 1.55 to make my life easier. Um your buyback is the same thing divide by the shares post buyback which is 1.50. 50. Um then new market capitalization is your price 185 billion times your share post buyback which was 1.5 we had before. Um calculate the leverage for the baseline. This is your 0.03 from the baseline debt to equity. Um this is the net debt to equity which is negative 0.19. Amen. Okay, part two. So, this will give you your um the leverage for baseline. Um and then your post buyback debt to equity which was 0.03 um your post buyback debt to equity and then um this equals your calculate sorry this if you gives you your leverage which is the debt the cash and market capital post buyback. So it stores all the calculated um scenario results and then prints a clear summary of the ana an analysis. So it looks like a lot but this is pretty much just a print out of everything it just solved. Um first it stores it and then it prints it out. So then here we go. This is everything printed out. So your buyback scenario analysis summary the initial shares outstanding was 15.5 billion which we were given. The shares um repurchase is 0.49 billion. Your new shares outstanding is 15.01 billion which is your 1550 subtracted from 0.49. Your earnings per share um the buyback was 6.17 that was before after is um 6.37 which is added to 20. Um the accretion change the accretion percentage in the end is 3.24%. U market capitalization impact. So before it was 2.87 87 trillion and after is 2.78 trillion which is subtract 9. Um your leverage impact the debt to equity ratio um 0.03. Um then post buyback debt to equity is 0.0396. Baseline net debt to equity is0.0192\n\nand then post buyback debt to equity ratio is0.0198.\n\nSo this was the implementation and pretty much figuring out um the buyback scenario analysis, the earnings per share, the market capitalization and leverage impact. Um so again, these are all the different functions that it used to solve these problems. And when I hover over it, it gives me the numbers and how it solved it.\n\nSo that wait I thought that was the Did it do it again? It might have done it again. Oh no, this is the alternative. Okay, sorry. So that was the first implementation. This is the alternative analysis. So this is an alternative that uses cash cash such as special dividend debt payown. So for the special dividend calculates cost and impact on cash. for debt payown. It calculates the interest savings and its potential impact on the FCF. So this then compared the alternatives with the buybacks. So again it gives me all the different um uh functions that used to solve. So first is the um total cost special dividend which is 6 times your shares which is 1.55. calculate the share cash remaining after the special dividend which is your cash minus total dividend cost. Um the debt payown scenario. So it assumes an interest of 5% for the debt payown it calculates the annual interest savings if the buyback amount were used to pay down the debt. So for simplicity assuming the buyback amount is used to pay down debt as per the instructions in the context. So interest rate on debt is your 5% which is the annual interest rate and then it is the buyback times the um interest rate which is 5%. So then I calculate the new free cash flow which is the um FCF after debt payown is equal to your FCF plus your interest savings and then it'll store all the results from both scenarios and then create a pretty clear printed out summary. So here we are the special dividend summary. So the proposed special dividend per share is $6 okay is six um total special dividend cost is 93 billion. The cash before dividend is 165 billion and the cash after dividend is 72 billion. So the debt payown scenario summary. So we're given that the interest rate is 5% and the annual interest savings is 5 $4.5 billion. So original FCF was 100 billion after it um goes up to 4.5 billion you just add the um 100 and the 4.5 together also your amount used for the pay down was the 90 billion which was were already given in the beginning so validation so um the task was to perform sensitivity analysis on key variables for the buyback um an analyze sensitivity to the share price for DCF related calculations analyze sensitivity WACCC. So this will demonstrate robustness of the model. Um basically stress test the Apple buyback analysis by varying assumptions such as share price WACC free cash flow growth and acquisition um returns to see the buyback creates or destroys values relative to the alternatives. So now it is the validation. So defines a range of share prices around the current price. So your price um range percent is equal to your um the 0 negative 0.20 21 and 5%. Um these are the different increments and then your sensitivity prices is your price times 1 plus the price range per percent which is um what we will solve. So then ensure baseline EPS before buyback is available. That is your implied earnings divide by the shares. Creates an empty list to sort EPS. Um which it will do here. Um loop through each share price in the defined range. Um it calculates the shares repurchase for the given share price and the buyback amount. Calculates the share post buyback. Um EPS post buyback, EPS accretion value, and then the EPS accretion value to the list created in step two. Um these are all the different functions that it is using and then it creates a data frame to store the share price and their um corresponding and the increasion values. So your share price your price um change and then EPS accretion um prints the summary and then add it adds a plot for better visualization. So as you can see here's the sensitivity analysis um BPS accretion so share price 148 price change is down -2 and then EPS accretion is 0.25 so this so this is an analysis of sensitivity in different scenarios and then it gives a chart to describe or give a better visualization of what it is. So this is the buyback share price. So as you can see as the uh EPS accretion goes down your okay so when your EPS accretion goes down your share price slowly starts to increase. So as your share price increases your EPS accretion goes down. So for example at that's around let's see like 0.255 255 that's at so the EPS secretion is at let's say around 0.255 um and then it is at let's say 156 or sorry 146 and then again it slowly starts to go down as your share price increases. Um and then also this is the current price. So this is um so again this is the current price. If you had a um lower share price your EPS accretion is going to be higher. Higher share price EPS accretion is going to be lower. So that's pretty much what this chart is explaining. So next we have the sorry let me check my time probably. Yeah it's going to be a little bit over um three videos. So next we have the evolve um the subtask calculate and analyze the impact of the buyback on specific shareholders including Bshire Hathaway and the CEO taking into account their current ownership. Um so this is taking into account other um aspects of the problem. So invol evolve sorry. Um so this improves the Apple model by incorporating real world complications like employee stock options um partial debt financing and changes in investor behavior and rerunning the analysis see how conclusions shift. So again we have all of our um functions that we're using. So first to calculate the initial shares held by Bushar um halfway and then you have your CEO shares already defined which are given which was um uh 3 million um then the initial percentage ownership for both um so that's your bash initial ownership percent um which is the initial shares divide by shares times the 100 and then the CEO initial ownership is the shares the initial share shares divided by shares times 100. Then we retrieve the shares post buyback for the previous step. So it's storing the buyback scenario results which I'll show. Um so after the buyback um sorry that's not okay. So it is calculation. Um then it'll calculate the shares held by um Bower Hway after the buyback. Calculate shares held by the CEO after the buyback. Calculates the new percentage ownership for both after the buyback. And it stores all the And then it will take this information and store it into um new couple new charts I will show. So here's all the information all all the data stored and then the summary. Okay sorry the um the graphs are going to be for the next part the reflection um to give a better idea. So okay so this is the um summary of all the data and then it gives the actual data itself what it figured out. So the shareholder impact summary um so the before buyback is 15.5 after is 15.01 01 which is what we solved earlier under Birchshire Hathaway the initial shares are 930 million um the initial ownership is 6% the shares after the buyback is 930 million ownership after the buyback is 6.19% and change in ownership is.19 percentage points so the CEO so under the CEO the initial shares is 3 million um initial ownership is um is 0.0194% 0194% or um around 1.94%. Uh shares after the buyback is 3 million. Ownership after buyback is um 2% at um change in ownership is a 0.6 um percentage points. So now we're at the reflection. So this is just reflecting um everything that we figured out and then kind of putting it all together into one big form of data. So, it took all the information. It extracted data from the buyback, the special dividend, the debt payown. Um, it summarizes the data. Um, put it's like a PDF that I'll show at the bottom. Um, so it will also do a comparison. So, as you can see, this is the summary visualization of the results. So, capital allocation strategy summary. Um, it gives you scenario. So, EPS creation, shares repurchased, use your buyback, the special dividend, and the debt payown. So, here is all the results all in order um to make it a little bit easier to look at. And then it'll create the bar chart. So, using all the information, it'll create um bar charts for the comparison EPS accretion and then the cash position before and after capital allocation actions and then the debt to equity ratio. Um so so this is the comparison of the EPS accretion. So the buyback versus the debt payown. So your buyback is at um 20 per share. Okay. So it's around 20 and then your debt payown is a lot higher which is around 28. Um cash position before and after capital allocations um actions. So it gives you initial cash, the cash after buyback, special dividend, and the debt payown. So as you see, the buyback, dividend, and payown are all around the same area. Um with the um payown being a lot higher, not a lot higher, but higher than the rest. Obviously, your initial cash is a lot higher in the beginning. And then the debt to equity ratio before and after capital allocation actions. So baseline, the buyback, and the special dividend, and then your debt payown after. So that was it. Now we're going to do the quick summary at the end. So in the end, the market capitalization is 2.87 trillion. Uh the implied earnings and implied growth discount. So the implied earnings are 95.58 billion and the implied EPS is 6.17. Um so the analysis did not explicitly calculate the implied growth discount for B but establish a baseline EPS using the given PE ratio. So how does this affect the EPS shares outstanding and leverage? So the result from the 90 billion so decrease from 15.5 billion to 15.01 billion in shares which is the 0.49 billion shares um repurchased. EPS has an increase from 6.17 to 6.37 which represents the EPS accretion at 0.20 leverage so a slight increase in the debt to equity ratio from 0.0384 to 0.0396 and a net equity net debt to equity um ratio from 0.192 to0.198.\nSo what's the net present value of the buyback buyback versus alternatives? So the buyback leads to um a 0.20 20 EPS accretion as slight increase in leverage special dividend cost 93 billion um reducing cost to 72 billion with no direct EPS on leverage or leverage um impact to the model debt payown it uses 90 billion for debt payown uh and would yield 4.5 billion in annual um interest savings increasing FCF to 104.5 billion and reducing debt to equity to 0.00 0070. So acquisitions R&D are not included in the analysis. So these are um the key findings. I pretty much um already explained that. Um so some insights and next steps. So strategic choice for capital allocation. So while the 90 billion um share buyback um directly increases EPS by 3.24% 24% using the same amount for um debt paid out offers a significant um reduction in leverage for example debt to equity ratio dropping from 0.0384 to 0.070 and a substantial increase in C FCF4.5 billion annually. So the optimal choice depends on whether the company prioritizes EPS growth and shareholder return through buybacks or the balance um key strengthening FCF enhancement through debt reduction. So further analysis or alternatives so expanding the analysis to include the net present value of each auction as well as a more detailed look into alternative um uses such as R&D investments or acquisitions. This will provide a more complete picture for capital allocation decisions. This involved forecasting long-term benefits and risk associated with his strategy. Um, so I would say this assignment was definitely a lot harder. Um, I definitely had to fight it a bit to finally get the right um, results. I did have to use many different collab um, sheets in order to figure this out because I kept messing up and I just had to start over. Um, this time I did make sure that the data was accurate to the original problem. Um, it wasn't. Last time I noticed after it was a little bit inaccurate. This time I double checked to make sure that all the data was more accurate. But yeah, that is um pretty much it. I again I used CGBT instead of Gemini because Gemini was fighting me. I wasn't giving the results I wanted. So, um, but I'm I'm happy CAT QBT gave me, um, the right code to use and then Collab was able to take that code and continue from there. I'm also happy that I was able to figure out that Collab can make um, graphs and charts to help give give a better visualization of the data. But yeah, that is pretty much it. I hope you enjoyed and thank you so"
}