{
  "student_name": "Van Uk",
  "org_defined_id": "035723111",
  "username": "vcuk",
  "video_url": "https://www.youtube.com/watch?v=XVrFs0Sgkyk",
  "transcript": "0:04\nHello. So I will be doing the\n0:07\nsession 13 or the capstone project. Um\n0:10\nso it's building your build your uh AI\n0:13\npowered financial innovation.\n0:16\nUm it says you spent 12 sessions\n0:19\nlearning financial analysis. Now prove\n0:22\nyou can create value in an AI powered\n0:24\nworld. My mission is to build something\n0:27\ninteractive that solves a real financial\n0:29\nproblem using AI language models.\n0:32\nOkay, so this is all that the fun stuff.\n0:36\nSo basically what I built\n0:40\nAI build was this. Um it's kind of\n0:43\nincomplete, but I think it's good enough\n0:45\nto get the job done. But basically this\n0:49\nis um I just had AI build me a app that\n0:52\num\n0:54\ncan give me uh the stock the stock uh um\n0:59\nanalysis the datas for\n1:03\nfor um any company really. So for an\n1:06\nexample you you guys can see right here\n1:07\nwhich I already done. Um, so I I had\n1:11\ndone a Apple\n1:13\none for Apple and then let me move my\n1:17\nscreen. Okay, for Apple I typed in Okay.\n1:24\nAll right.\n1:27\nAll right. So for an example, let's type\n1:28\nif we do that AAPL which is Apple. It\n1:33\ncan give us the company name Apple\n1:36\nincorporation. The sector what it is\n1:38\nit's a technology company what industry\n1:40\nis in it's in consumer\n1:42\nthe stock price like right now is $27828\n1:48\nand then the market cap of 4\n1:50\nmillion129789\n1:53\nthen the 52\n1:56\nweek range and it shows the historical\n1:59\nprice data. So if we select the time\n2:01\nperiod this is for one year for one\n2:04\nmonth and it show it gives you the um\n2:07\ncritical or it gives you the uh the\n2:09\nstock market uh visual.\n2:13\nIt also shows the AAPL trading volume.\n2:16\nAs you can see, this is from November\n2:18\n16, 2025, November 23rd, 30, December\n2:21\n7th. Uh this and it also shows\n2:24\ncalculated financial metrics.\n2:31\nAnd yeah, this is the part where it's\n2:33\nincomplete, but I think this is good\n2:35\nenough. Um,\n2:37\nand if we another thing that my app does\n2:40\nis it it um\n2:44\nit compares stocks. So, for an example,\n2:45\nif we um type in Apple here, if we\n2:48\ncompare stocks in a one-year spawn.\n2:53\nOh. Oh, yeah. My fault. So, if we do\n2:55\nApple and like Amazon,\n2:58\nwe compare the stocks.\n3:02\nHere's like for one stock. It shows the\n3:07\nOkay, give me a second. Let me redo\n3:08\nthis.\n3:11\nOkay, let's do Apple and Microsoft MSFT.\n3:17\nAnd if we compare, let's compare these\n3:19\nstocks.\n3:24\nAnd then you can see you can see that\n3:27\ngives you a stock comparison comparison.\n3:29\nThis is relative performance comparison\n3:32\nand you can see that it gives it gives\n3:34\nit here uh this red indicates the um\n3:39\nMSFT which I think is Microsoft and AAPL\n3:42\nwhich is Apple like we saw the blue is\n3:45\nApple. You can see the trends of both um\n3:48\ncompanies and it also shows these key\n3:51\nmetrics comparison. Um it shows that\n3:55\nticker is Apple and then Microsoft the\n3:58\ncompany the price uh the market cap the\n4:01\nP and E ratio the EV to AIDA um the net\n4:05\nmargin the revenue growth and uh if we\n4:09\nthere's metrics that we can visualize\n4:10\nhere such as market cap which you can\n4:13\nsee right here between uh Apple and\n4:17\nMicrosoft\n4:19\num you can go down to stock price\n4:24\nright here.\n4:27\nOh, shows the revenue right here.\n4:32\nAnd then if we go down, it shows\n4:35\nnet income.\n4:38\nAnd\n4:41\nlast but not least, it shows the bid.\n4:44\nAnd so basically what this app would be\n4:47\nuseful for is like for people that um\n4:50\nwell for one for people that day trade.\n4:52\nIt could be really good for them. People\n4:54\nthat are into stocks um and even just\n4:57\nlike people that uh just want to get\n5:01\ninto stocks. They can use this app to\n5:03\nget started on it to look at the datas\n5:06\nuh to look at how well the company is\n5:08\ndoing in like a oneear span or one month\n5:11\nspan. Um and um it's a really good it's\n5:15\na really good um app just for them. Like\n5:19\nit's primarily for like day traders,\n5:22\nstock market people, people that invest,\n5:24\ninvestors. Um but it's also pretty good\n5:27\nfor people that work in like the\n5:30\ncompanies to see how well their\n5:31\ncompany's doing, you know, just for fun\n5:33\njust to see like uh what they're getting\n5:35\nthemselves into. But um if we if we go\n5:38\nback we can look at um the stock data\n5:41\nfor let's let's do Google.\n5:45\nSo Google and I just press fetch data.\n5:50\nIt fetches data for me or this is for\n5:53\nalphabet corporation I guess. Um\n5:57\nso the sectors communication industry\n5:59\nshows industry the stock price the\n6:01\nmarket cap the 52- week range. Um and\n6:04\nthen here is the historical price data\n6:06\nand as as I mentioned from like the one\n6:08\nyear okay let's let's uh do that let's\n6:11\nlook at the one month as you can see and\n6:14\nthen we can go down look at three months\n6:17\nyou see the number changes um the data\n6:20\ngets uh bigger basically it's a longer\n6:22\nspan so six months does the same thing\n6:27\num for one year does the same thing once\n6:30\nagain and then for\n6:33\nfor two years. Let's see what it does.\n6:37\nOh, it expands it again. And if we go\n6:40\ndown the five years,\n6:43\nstill expands. So, it's really it's a\n6:46\nreally useful tool. Also, I forgot to\n6:49\nmention here, it mentions the stock\n6:50\nprice if I didn't say that earlier.\n6:55\nUm, it also shows the trading volume if\n6:58\nI didn't mention it earlier.\n7:00\nSo here here you can see the trading\n7:02\nvolume for the um fiveyear span\n7:08\nand you can also like I mentioned\n7:11\nyou can also see the calculator\n7:12\nfinancial metrics um\n7:16\nyeah\n7:19\nokay let's go back and look at\n7:30\nBut um this process was pretty difficult\n7:33\nonly because I used um Replet using the\n7:37\nfree the free mode. Um and yeah, so I\n7:42\nwasn't able to really do everything, but\n7:44\nI think I've done enough to where I can\n7:47\naccomplish the um the goals and the uh\n7:50\nobjectives.\n7:52\nBut yeah, we can compare. Let's compare\n7:55\nAmazon\n7:57\nand Apple\n8:01\njust for fun and giggles.\n8:03\nLet's see which is doing better.\n8:07\nAnd then the comparison period we can\n8:09\ndo. Let's do it in one month. Let's see.\n8:11\nLet's see how they've been doing. But\n8:14\nokay, here's the relative uh performance\n8:17\ncomparison. And it looks like the return\n8:21\npercentage wise, Apple is currently\n8:24\nwinning from December 7, I should say.\n8:27\nAnd the key metrics comparison, the\n8:29\nprice, you can see Apple is worth more\n8:33\nright now.\n8:35\nMarket cap is more and everything is\n8:38\nmore, but Amazon has shown better\n8:41\nrevenue growth. And let's go ahead and\n8:45\nlook at the market cap comparison\n8:47\nbetween each. See that Apple\n8:51\nbeats it in that. And then stock price.\n8:55\nApple also tops it in revenue.\n8:59\nWhat you think? Oh, now it's different.\n9:02\nIt's Amazon now. And then net income\n9:06\ngoes to Apple\n9:09\nand the Aida\n9:12\ngoes oh it's bas almost a tie but Apple\n9:15\njust slightly beats it but yeah that's\n9:18\nbasically my app. Um, and like I\n9:22\nmentioned earlier, this is I think\n9:23\nprimarily it would be for like uh\n9:27\num traders, investors, um and people\n9:31\nthat are just into the stock market. You\n9:33\nknow, there's always those people that\n9:35\nare like they just they're just\n9:36\ninterested and intrigued and like\n9:38\nlearning about the stock market, uh\n9:40\nlearning about different companies. Um\n9:43\nand then maybe people that work there\n9:44\nthat want to see how well their company\n9:46\nis performing. So yeah, that's my app."
}