{
  "student_name": "Aly Foster",
  "org_defined_id": "035604553",
  "username": "foste304",
  "video_url": "https://youtu.be/PPFcGclPJZE",
  "transcript": "Hi, I'm Alyson and for session 11, we are prompted with Apple's considering a $90 billion share repurchase equal to roughly 10% of its market capitalization. So the biggest part of this assignment is to determine whether this buyback one creates value for the company as a whole, two transfers value among stakeholders and three find out whether or not an alternative use of cash whether that be a dividend or R&D um or there's also acquisition and debt reduction would deliver greater long-term benefit. So from there, we're also provided with Apple's financial snapshot. So for liquidity and cash flow, um there's a cash in marketable investments of about $165 billion. There's an annual free cash flow of $100 billion. And then for market context, the stock price is 185. The PE ratio is price to earnings ratio that is 30. The dividend yield is 0.5% and there are 15.5 billion shares outstanding. So we're also provided that there's debt of 110 billion.\n\nFrom there, the key stakeholders are Birkshshire, which owns 6% of Apple, and the CEO holds 3 million shares, and then retail investors, which typically hold around 100 shares, and then the employees who hold options with a strike price of $170. And their strike price is defined as the price at which an employee can buy Apple stock. So while putting this into my code, I found that it makes um abbreviations rather than spelling all these out. So EPS is earnings per share, which is buybacks mechanically increase EPS by reducing share count. ROIC is return on invested capital that measures how efficiently Apple generates returns on capital. And then WACC or WAK is the weighted average cost of capital. So that is Apple's blended average cost of financing.\n\nSo I put all of that into the code which is shown here. So at first we have the decision problem which is to evaluate the strategic financial and stakeholder implications of Apple's 90 billion capital allocation and then that shows an initial NI of 95.58 billion and then from there are the stakeholders incentives and agency issues. So this shows the primary incentive the retail shareholders immediate value and growth and financial stability which is shown to be high and then it also says that it's short-termism which option value manipulation. So then for represent we have I had it put the formulas out. So we can see here that these were used to solve all the situations that we were running. So the key financial metrics shows debt cost the initial interest and ratio and then for I implement um this shows the different scenarios the new EPS the EPS delta the new price. I don't know why they're all\n\num messed up, but if I exported this, it would the lines would probably line up to show the different percentages. So like to the left over here, retail value is the $6.17 and then as we go on, the numbers should follow. Then for validate and evolve, the capital structure and EPS mechanics solve for the debt reduction which yields the highest EPS boost and highest price which validates that eliminating high-c cost debt is more accretive acive than marginal cash income loss of 4%. So the debt buyback still performs well by swapping expensive equity for cheaper debt. And then one of the others is agency problem which is risk shifting. So the S2 increases financial risk dropping the ICR from 20 to 15.5 which is the core bond holder shareholder conflict. This means that this is where shareholders benefit from leverage at the bond holders expense. And then lastly is the value creation versus value transfer. So S5 and S6 are the only value creation scenarios which are contingent on achieving that ROIC is greater than walk.\n\nAnd then\n\nfor evolve, this also shows the different scenarios and the acquisition ROIC new PS and conclusion. So again, these aren't really lining up, but if they did, it would be much easier to read. And then reflect the stakeholder narrative summary. So the S2 which is a debt buyback maximizes short-term EPS boost which favors the CEO's option value but in return home harms bond holders through increased leverage. The S4 which is debt reduction is best for bond holders and institutional shareholders. Um one example being Birkshshire as it signals financial discipline and reduces long-term risk and costs. And then the S5S6 is a strategic option which represents the management's choice to reinvest the FCF. So the R&D is typically preferred by institutional holders over acquisition due to the lower execution risk and stronger signal of protecting the core EV drivers. So finally the final board level recommendation is a combination of scenario four which is the debt reduction and scenario six which is incremental R&D. So first the financial discipline prioritizes a $90 billion in debt for debt reduction delivering the highest predictable returns which also boosts the EPS to $621 and then also the stock price to $186.38. So this strength strengthens the balance sheet mitigating risk and sending a strong signal of capital allocation discipline.\n\nAnd then second the strategic value creation is the long-term mandate must be secured by continuous investment in R&D which is the safest way to ensure that the value creation which is that ROIC greater than walk are and protect the high PE multiple. So back to this we see that the core the core calculations are the new share count new EPS which is net income divided by shares outstanding the new share price which is EPS times the PE updated leverage metrics and stakeholder wealth changes and then for validate these are the questions that we solved so does EPS increase for the right reasons or due to accounting mechanics. And then another example is does the AI VR acquisition produce ROIC greater than walk.\nAnd then reflect um this analysis reveals that the buyback increases EPS. A debt finance buyback increases risk and may concern bond holders. A special dividend transfers cash to shareholders but doesn't improve the strategic position. Debt reduction materially improves leverage and interest costs benefiting bond holders and also long-term stability. A strong AIVR acquisition could create true value if ROIC is greater than lock and incremental R&D aligns with Apple's innovationdriven strategy and may also generate sustainable long-term value. So based on these outcomes, the shareholder incentives and long-term strategy, Apple should modify the buyback rather than execute the full $90 billion is proposed. And that's because a balanced capital allocation plan may include a smaller buyback. So an example is 40 to 60 billion incremental R&D investment to support long-term growth and selective debt reduction to ma maintain financial flexibility. So in the end, the strategy enhances EPS without overleveraging, protects bond holders in the credit rating, signals competence and long-term innovation, benefits stakeholders more equitably, and supports sustainable enterprise value creation. Thank you."
}