{
  "student_name": "Jon Parrett",
  "org_defined_id": "037141383",
  "username": "parrettj",
  "video_url": "https://youtu.be/ikdTxhtHWa8",
  "transcript": "So for defining the our task is laid out here. It's to present a comprehensive ex executive ready recommendations summary the valuation the valuation range bid strategy and rationale for KKR's acquisition of Panera. So KKR wants to take over Panera and we're going to evaluate that. So, we're going to run through a bunch of different evaluations and scenarios to give the best possible evaluation for um for um um for KKR. Okay. So, we got information from uh Panda's key financial metrics. So, um Panda is just like the information. Okay.\n\nUm first looking at a um it says it right here. Um\n\nokay so this is the discount um discounted cash flow. So um first we have the base scenario, the upside scenario and downside scenario. Baser is like what's most likely the upside would be like an optimistic view and the downside is like a more conservative view. So with that be revenue growth of 0.05 um your margin your net income margin and your whack um I'll define what these are later but your whack is um kind of like the hurdle you want to get over for something to be profitable. So it says you have to get over this hurdle. That's what that means. Okay. So looking at this we have just some these are just like this is our scenario just what's there. Okay. This is the important part. So your EBITDA is your equity um it's your earnings before interest taxes depreciation and amorization. This is basically like a proximity for operating cash flow. So that's what EBITDA is. So um with the base, the upside and the downside. I'm not going to go through every single one, but as you can kind of tell, um the revenue is solid, the EBTA is reasonable, and the net income is great. So um these aren't just from like first glance, they don't look bad at all. And then even from like the conservative scenario, they still look good. And on the left side, they look really good. So, um, now it's going to, um, also implement the the, um, sorry, once again, the FCF FCF, which is your free cash flow. It's basically like the actual cash a company generates like after operating expenses and capital expenditure. So um it's like another part of the discount function of the discounted cash flow. So with that we get these numbers. So um still all just from from a glance very solid. None of these are negative which is really good. And then further for the scenario we'll be adding the terminal value which is the um um sorry second\n\nthe estimated value of a business beyond the explicit forecast period of the DCF. So further than just the like the years we have here. So um is why we have 9 billion, 15 billion and 5 billion. So kind of a wide range but still all very solid numbers. Now the FCF and terminal value are calculated for each scenario. The next step is to discount these values back to today's money. So these are all um like 2028 bills. So that's how much would be in 2028. So we want to see how much it is worth today because that's all we know is what today's money is worth. So back to today's money, we get these kind of terminal values which look very similar to um the ones we had before and they're increasing which is good.\n\nOkay, now that they're all calculated, calculate the enterprise value for each scenario by summing these discounts values as specified.\n\nOkay, so enterprise value for the base, the upside and the downside. So some of the discounted so two billion six billion for the discount and the total enterprise value of 8.71 billion. So all very um solid just from the eye test um but we will be diving further into um more scenarios. So research this for the research for our driver. This is kind of what we're doing. We're getting all these values. We're pulling them from um public information and hypothetical scenarios. Then we're implementing them to real data so that we can look at it and test it ourselves.\n\nOkay. And this is just repeating information\n\num for and now we're looking at comparable companies. So things that are similar to Panera. See how they do. So Chipotle, McDonald's, Starbucks, and Darden's restaurants. All very similar. So these are kind of what they look like. So um like Chipotle not doing as well as Panera and um McDonald's a little bit more, Starbucks a little bit more, Darden's not as well. So comparing to other companies, Pener is in a really good spot. and more information on that.\n\nUm looking at their um um their price to earnings ratio. So that's their multiple. So it's kind of like what they're benefiting from. Um, okay. Now that the EV and EVIT8 and price to earning ratio multiples have been calculated for each comparable company, I will determine the range, min, max, medium for these multiples per their set. So these are the ranges. So um minimum of their um it's listed here. So that's their minimum, it's their maximum, it's their median. And we want to compare that Panera. And this is what Panera has. So minimum of 13. This one has a minimum of 10, max of 27, max of 21. So median of 16. So some of these have better ranges, but I mean it doesn't mean it's bad though, just because it's not as good as the other companies. And then for their equity range, um, still similar numbers.\n\nOkay,\n\nfirst iterate through the comparable companies and print their calculated in P multiples. Then I'll summarize and print drive values from Pera Enterprise from both. Okay. So more comparisons.\n\nI think this would be the most uh important thing to look at. So enterprise value range, min max, mean all numbers we've seen before. So\n\num comparable company analysis. So you want to make a you're going to make a minimum of six billion probably most likely 8 billion max of 18 billion in equity by comparing it to other companies. That's how they come up with those numbers.\n\nSo defensible transaction comps\n\nUm\n\nso these are just looking at um past deals and acquisitions. So um\n\nthat this in this acquisition A the deal was 8 billion the target was6 and the target net income billions was2 for B 12.9.35 so these are all looking very promising for um um Panera because they're similar in what they were looking four.\n\nOkay. So, positions um kind of what their profit rate or how much more they profited was 35 times, 31 times, 25 times, and 35 times. what that means.\n\nNow looking deeper and deeper. It's a really long analysis. I'm trying to skip over some of the unimportant parts. So now looking at Panera's minimum, maximum. So I've current I've already went over this too. Um\n\naccess the financial buyers versus strategic buyers perspective quantify potential synergies for strategic biders and discuss control premiums. So um things to do like just good rules of thumb in the um negotiation process. So synergies percent 5% 15% and a control premium percent of 20% and 30%. So um kind of the range you want to be in when negotiating.\n\nNow that they're defined values have been calculated I'll proceed to calculate how much and what impact scenario's valuation for strategic buyers. So all those calculations more implementation we're implementing the data to get more tangible numbers.\n\nOkay. Strategic buyers valuation impact calculated. Perfect. So for the base we have an EV of 8.71 equity synergies min max men max. So these all look very solid for the negotiation process. I'm sorry but this is really long trying to go fast. Okay, more of the important. So now that we have defined um research, implemented and validated our information, we now want and um\n\nand executed our calculations like this was executed here. Now we kind of want to do more of a summary although I'm going to give more information because I still want to give you that the foot the football field graph. Okay standalone validation rely heavily on methodologies like DCF and rely so rely on tangible numbers that we have. So these are things to look at during negotiation and then leverage your debt and capacity. So you don't have to buy things with the money you have available. You can take out loans to have more money on hand and leveraging your debt to buy things you can't afford now but can later. Um\n\nso operations effic efficiency while not seeking a large scale synergies from integrations with other businesses financial buyers will look for opportunities to improve Panera's operation efficiency to saying when they take over Panera they're going to look for more ways to make it a more efficient business and\n\nand saying that like buyers is if they ever wanted to kind of buy out of what of Panera, they could oh shoot they could kind of set up an IPO or initial public offering. Control premium financial buyers are generally willing to pay a control premium for the ability to direct PIN's strategy and operations to maximize value creation.\n\nOkay, so these are the ranges with synergies. We looked at these before. long-term strategy. The acquisition aligns with their long-term strate strategic goals such as building a dominant position in the food service industry or expanding into new custom segments. The analysis above shows that the factoring in synergies and control premiums, the enterprise value and the equity value for parent can be significantly higher for a strategic buyer compared to its standalone valuation. meaning it's going to make um um I forget what their name is. Sorry. Um KKR's company more valuable if they're buying into the food interest in industry.\n\nUm we've seen this before\n\nand these are just more implement in uh recommendations I guess. though such as operation and distributions, supply chain integration, managing supply chains can be complex. So they've never maybe they've never been in the food industry and so they're going to have to reestablish supply chain integration while taking over Panera's Panera supply chain. They're still going to have to um understand the management behind it and the systems that they use for the system integration and maybe um optimizing those further. And then the cultural clashes finding what the sorry I'm just clicking random things now the um value like kind of what the culture is like at Panera and adopting it because Panera is kind of seen as like a clean food. it's not really seen as like fast food and they're trying to figure out how they can buy into that culture to keep the same culture going and keeping the employee morale high because during management changes it can get um kind of discombobulated for the workers and managers. So, they're going to have to figure out how to um realign those values again. And leadership alignment cuz I doubt that um leadership will stay the exact same when a new company takes over and technological challenges. So, they're going to have to figure out their legacy systems such as systems they've been using for a while and digital innovation. So, coming up with new, more efficient systems and countering cyber security risk. Inflammations of the management rollover of 10%. So motivation for performances by rolling over 10% of their equity, Panera's management teams retains a significant financial stake in the company's future success. So meaning um some of Panera's management gets to keep like the profits that Panera might make in the future after being bought out and just keeping the company stable. roll over signals confidence from the existing management because if they're offering them more money in the future then they know they're going to do well in the future\n\num\n\ndeal structuring and financing. So this is just more into the um negotiation process kind of offering the current owners of Panera some profits in the future instead of just handing them one fat check now\n\nor they are going to hand them a fat check. But um promising them more money in the future sounds more appealing than just offering them money up up front and not having any more um coming in the future.\n\nOkay. So, they could also share governance. So, like people that um have the equity stake can still have some input on the company.\n\nOkay, here is the football field analysis. So, this is kind of the valuation range and that medium range is kind of where they want to be. So the mean range is just the number they're shooting for basically. But this anywhere in this range they'll be okay with. So the pro price earnings ratio the EBT IDA that's kind of getting close towards the end but there it is. And so and it's called the football field ratio analysis because it looks like a football field by the way. Um so they have a lot of room to work with in the EBT and in the discount um flow.\n\nSo looking good for buying for the takeover of Panera. Okay. So now just more of the summary like the real the real review the real summary. We see these numbers. We've already looked at the downside of 3.29 29 billion and an upside of 12.2 and somewhere in the middle of the base of 7.21 billion billion. Yes. Um more medians max and men's are here and then percent transaction analysis equity values. So the median yeah and then what we want is the evaluation. So um the valuation what we're really looking for has a minimum of 3 billion and a maximum of 15 billion and the average equity value would be 9.32 billion. So we want since we're the ones buying Panera, we want it to be as minimal as possible, but that's not what Panera is going to want. So we have to find somewhere in the middle. So\n\nokay. So now when they're proposing the bid, they're going to want to anchor a price and they have to justify it. So um looking at the anchor price is what I want.\n\nOh, these are looking at some of the depth it would take on by the way. Sorry, let me try to find it.\nHere it is. Okay, so the initial offering. So this is kind of their anchor price. This is um something lower than they expect to pay cuz you want to anchor Panera so they don't think you don't want to offer them what you really want immediately cuz then it gives no room for negotiation. So the initial is going to be lower than the target. So the target, the deal price, what they really want to pay is 9.5 billion, but they're going to offer 7.5 billion so there's room for negotiation. Like it's an anchoring price. And then the walk away price. This is the price that if it ever exceeds that. So if it's 10 more than 10.5 billion, they're going to walk away from it because it's just more than they think it's worth and um they would profit off of it. So they have to have a walk away price so they know like what their maximum is. And then so that's what the walk away price is. And then ideal perfect scenario they'd be paying 9.5 billion. Okay. So after all the evaluations we did, we can conclude that um that KKR should um offer an initial offering of 7.5 billion and should walk away if it ever ex exceeds 10.5 billion in an ideal price range for them to actually take over the company would be somewhere between 9 and 9.5 billion. All right. Thank you."
}