{
  "student_name": "Chris Huisman",
  "org_defined_id": "033313257",
  "username": "chuisman",
  "video_url": "https://youtu.be/ou4N48DxAy8",
  "transcript": "How's it going everyone? This is Chris\nHeisman and this is my capstone project.\nI created the insider trading task force\nand to do this uh I used a new um theory\nthat I haven't used before in this class\nand it's called the AI agent swarm. So\nbasically we have a chief AI agent who\ninstructs other agents who have\nspecialized tasks to complete a mission.\nSo, the mission here is to find insider\ntraining. And uh my chief investigator\nis Tony Soprano,\nand he is in charge of three other\nagents. We have Sylvio. He's our\nquantitative math guy. He's going to\nlook at the cash and the stocks that are\nmoving. We have Christopher. Uh\nChristopher is going to look through the\nnews and earnings calls. And we have\nPaulie. Paulie is called uh only when\nthere is suspicion that there's insider\ntrading. and he has access to a um API\nuh called insider transactions.\nAnd so he he uh does the dig uh the\ndigging when it gets real. And all of\nthese agents use um Alpha Vantage. Uh\nit's a finance API and it's the free\ntier. Um and yeah, so let me just demo\nhow it works. Uh I'm want to ask Tony uh\nTony\nuh take\nTake a look at\nCarvana.\nAnd you might notice that based these\ncharacters uh base these agents are\nbased off of the characters from the\nSopranos TV show. Um I thought it'd be\nfunny. Oh, okay. So, let's see. We got\nwe got something here. Tony talked to\nSylvio.\nUm Chris and Paulie. So, let's see what\nwe got here. Okay. He says there's\nnothing wrong here. Uh Sylvio says the\nstock is crashing. Uh so heavy volume at\n2 6.2 million shares. Christopher\nuh he says that there's a not much going\non.\nInteresting.\nSo let's let's see what Chris said to\nTony just now.\nSo, he said suspicious. That's weird.\nLet's see what Sylvia Well, let's see\nwhat Paulie said. I'm more interested to\nsee what Paulie said.\nYeah, he said there's no insider trades\nrecently. So clean. So Christopher says\nhe's suspicious,\nbut um using the data from Chris,\nPaulie, and Sylvio, Tony was able to\ncome up and basically say like, hey, um\nit's painful, but it's all by the book.\nUm there's nothing dirty behind it. So\nyeah, so that was my project. Um I hope\nyou liked it and I think this is a\nreally cool concept using the uh\num AI agent swarm. Um but I do want to\nshow you I've I've used in the past.\nThere's been some uh things where Paulie\nfound some um some insider trading\nallegedly.\nLet's see which one was one.\nlooking for one.\nYeah, this was Beyond Meat. So, uh\nBeyond Meat, he found that every boss\nand executive\num basically dumped shares just before.\nSo, um pretty crazy stuff. He basically\nsaid there might have been some insider\ntrading going on here. Um which is\nreally cool. That was a really cool\nthing when I was working on this. The uh\nto possibly find something big. But\nyeah, anyway, that was my project and Ihope you liked it."
}