{
  "student_name": "Michael Gjorseski",
  "org_defined_id": "036015839",
  "username": "mgjorses",
  "video_url": "https://app.screencastify.com/watch/NpbJkLEAZDdLyJ1O7oJm?checkOrg=6f011b1b-d4b6-4119-b7c9-d036b6594800",
  "transcript": "All right. So, last one of the semester.\nHere we go. So, our assignment overview\nis um a full valuation of Panera for a\nprospect KKR takeover using the driver\nmethod. Uh we want to combine the DCF\ncombine DCF trading comps and president\ntra uh precedented trading transactions\nto produce any to produce an inform bid\nrange while contrasting financial buyer\ndiscipline with strategic synergies. And\nthen here's the snapshot of the deal\nwhich there's a lot uh six billion in\nrevenue growing at 8% 900 million EBITDA\nuh with 15% margin 400 million net\nincome across uh 2100 stores and digital\nsales are already 50%. Market references\num the industry\nP over E is approximately 22% uh\npresidented EBITDA multiplies uh between\n12 and 15 times. Chipotle trades at 35\ntimes and McDonald's at 25 times. And uh\ncapital assumptions are the industry\nweighted average cost of capital is 9%.\nUh management wants a 10% rollover.\nStrategic biders are Starbucks and\nMcDonald's and they're circling. And\nthen growth levels levelers are 500 new\nstores in 5 years. Digital mixed 700% uh\ndinner/catering expansions and then\nearly stage of international rollout. So\nit want we wanted to create an executive\nsummary that recommends um executive\nexecutive ready summary recommendation\nthat states your valuation and there's a\nlot of other things that we have but um\nhere is my uh output that it gave me and\nthis is my project bread basket and um\nthis is my executive summary the deal\ndate it gives the recommendation is we\nrecommend a base bid of 12.5 million\nwhich is $26 per share with the hard\nceiling at 13.8. Um while the strategic\nbuyers of Starbucks and McDonald's can\njustify 14.5 billion and above um via\noperational synergies, our KKR's edge\nlies in our um aggressive balance sheet,\nrestructuring exe uh executing the\ndigital first pivot without public\nmarket uh scrutiny and incentivizing\nmanagement with a 10% rollover. So\nhere's our summary. Our uh DCF is\nbetween 11.8 billion and 14.2 2 billion\nwhich is driven by that 8% growth of\nmargin. This is our football field which\nI'll come back to later I believe. And\nthen the trading comps of 10.5 billion\nbetween uh to 13 billion based on the 22\ntimes uh 22 to 25 times PE and the uh 12\nto 14 uh EBIT TDA and then the president\ntransactions are between 10.8 billion\nand 13.5 billion um which comes from\nthat 12 to 15* 2. And our winning\nstrategy for price is to open at the 12\nbillion um to preempt auction uh\ndynamics. So start off lower to see if\nwe can uh get higher. And then our uh\nsignal willingness to go to 13.5 billion\nstrictly due to uh due diligence\nconfirms the catering or dinner/catering\nlevel is uh derisked. Take that out of\nthe equation pretty much. Um our\nstructure is the 10% management rollover\nis mandatory like we said before. And\nthen our differentiation is the uh\nposition KKR as a partner for the messy\nwork of the international expansion. So\nkind of fall back on them and then yeah\nso here we go with our driver framework\nto\nexcuse me define and discover most of\nthis we pretty much talked about our key\nassumptions like we said the 9 or 9\nbillion in revenue 900 million in uh\nEBITDA\nand then our 15% margin 400 million in\nnet incomes WACC of 9 which is a base um\nsensitized uh plus or minus 1% um you\nhave the tax rate it's all kind of there\nand And uh to represent we have um I\nbuilt a um DCF\nuh use in Python. And so that's yeah so\nthen to show the implementation we have\nhere is the Python um code.\nOne second. So this kind of just has\nthis was actually this originally didn't\nrun. I've never used numpy financial I\ndon't think I've always just used numpy\nbut um yeah so here are assumptions like\nwe've talked about the 600 million 600\nor 6,000 in millions um the current\nmargin the tax rate WACC terminal growth\nexit multiple net debt um here are the\nscenarios that we're talking about the\nbase scenario um growth at 8% the upside\nscenario a growth of 10% and then the\ndownside scenario a growth of 4%\nand this is also where the plus or minus\nthe plus 1% and the minus 1% um margins\ncome into play and yeah there's a lot of\ncalculations that go into it and then it\ngives me the uh output values which\num I'm assuming this is it's in millions\nbut it's a very big number so the base\num the base would come out to uh 900\n9,722\num in millions is our uh approximation\nenterprise value and then the upside is\nthe um 11 11,837\nin millions and then the downside is the\n7,198. So obviously there's almost $2\nmillion difference or $2,000 difference\num in between the base to the upside to\nthe downside. But yeah, that's my\nresults. And I can run this once to show\nthat it comes out. I've I've also never\nseen code come out like this just to be\nhonest. But um yeah, so that's what it\nis in millions. So that's my code output\nand then to show this um based on the\n500 new stores in digital mix uh our\nrevenue growth uh our downside case the\n4% our base case the 8% the upside the\n10% yeah the 10% u our margins obviously\nin uh decrease from the downside case uh\nthe 5 years and our lowest or our medium\nin the base case and our highest in the\nupside case. uh the terminal growth\nincreases from the downside up half a\npercent each in each case and the\nenterprise value on the upside is would\nmake sense that it's the highest there\nbecause it's the best case scenario we\nhave the highest valuation of the\ncompany and the highest uh enterprise\nvalue so yeah and then our base case um\nenterprise value using the sensitivity\nanalysis uh WACC at 8% is 13.8 billion\nWACC at 9% is 12.6 6 and a 10% is 11.5.\nAnd then yeah the market valuation um\nthe trading comparisons that we have\nhere um highly stable premium at 16\ntimes EVI TD TDA um high growth premium\nat 22 peer setting um average between 12\nand 14 like we talked about uh before\nand then yeah our president uh president\ntransactions typically between 12 and 15\nlike we talked about. Uh cons\nconservative would be 10.8 billion.\nAggressive would be 13.5. This was our\num this is our floor that we would pay.\nThis is our ceiling that we would pay.\nSo that's kind of what we talked about\nalready once. This is where just going\nback again the football field um floor\nlike I just said is the 10.8 billion. Um\nthis is supported by our president's\ntransaction the floor 12 times and the\ndown or 12x and the downside of um the\nDCF which I showed before. Um the\nceiling would be 13.8 a billion\nsupported by our upside D DCF uh which\nis like I said perfect execution the\nbest case possible and the high-end\ntrading comps our strategic zone zone uh\nour premium zone is 14 billion or above\nwhich is where Starbucks and McDonald's\nmight bid just because they have more\nmoney and they have more capital and\nthey can just do more uh yeah just to\nlook uh later the uh strategic bidder\nthe McDonald's and Starbucks um they can\nuh realize that these cost energies\nsupply chain purchasing power start uh\nshared tech stack and revenue synergies\nand cross- selling the quantification\nassuming these synergies equal 5% uh or\napproximately 100 million\nproform EBITDA is 1 billion valuation at\n15 times multiple or 15 times or 15\nbillion capacity the risk is that they\ncan pay more but they're facing they\nface integration risk and potential\nbrand illusion um the financial buyer uh\nwe cannot pay for synergies we don't own\nmust to pay based on our standalone cash\nflow enhancement.\nAnd then yeah, just our reflection and\nlooking back uh we cannot win a pure\nprice war against a strategic buyer\nwilling to pay for synergies. However,\nuh uh strategics are currently risk uh\nrisk adverse regarding casual dining\noperational complexity. So the winning\nbid strategy would be opening the bid at\n12 uh2 billion high enough to be\nserious, low enough to allow\nnegotiation. Uh the narrative that we're\ntrying to go off of it to see if we can\nactually do this uh takeover would be um\nwe're the only buyer willing to fund the\ncapital investment uh in in capital\nintensive international expansion and\ncatering overhaul without punishing\nquarterly earnings and uh the walk away.\nIf the bid exceeds 13.8 billion, we\npivot to credit financing uh for strateg\nfor a strategic buyer rather than buying\nuh buying equity ownership at the\nriskreward uh profile inverts. So yeah,\nwe're pretty much saying that we're\ngoing to open our bidding not too low,\nbut at a decent price, and that once it\ngets to a higher enough point, we still\nwant to be involved somehow, but that's\njust too much for us to pay, and the\nrisk and reward doesn't really pay out\nfor us, and we don't have enough capital\nor anything to do that. So yeah, that's\nour strategy. Uh, thank you very much\nfor a good semester. It was a pleasure\nto be in your class, and I appreciate\neverything so far. So yeah, have a good\nChristmas and have a happy holidays."
}