{
  "student_name": "None None",
  "org_defined_id": "038072973",
  "username": "esleeth",
  "video_url": "",
  "transcript": "Hi, my name is Evan, and in this video I'm going to walk you through my AI-powered stock analysis workflow that I built in n8n.\n\nThe idea behind this tool is simple:\nmost stock tools just throw numbers at you. I wanted something that actually thinks about a stock and then explains the investment case in plain English, based on a specific goal like long-term growth.\n\n Big Picture: What This Workflow Does\n\nAt a high level, this workflow:\n\nTakes a stock ticker and an investment goal\n\nCalls a financial data API to get live market data\nUses an AI \"analyst\" agent to interpret that data into opportunities and risks\nUses a second AI \"advisor\" agent to turn that into a clear Buy / Hold / Sell thesis\nAdds a built-in disclaimer so it stays in the \"educational, not advice\" lane\nSo instead of just telling you \"GOOGL is $X today\", this workflow answers:\"Is this stock a good fit for long-term growth, and why?\"\n\n\n\nIt starts with a simple node:\n\"When clicking 'Test workflow'\"\nThis is just the manual trigger. In production, this could be replaced with a webhook, a form, or a front-end UI, but for now I can trigger the analysis from inside n8n while I'm demoing.\n\n\nNext, the trigger flows into my first AI agent:\nNode: \"Data Synthesis Agent\"\n\nThis agent has a system message that turns it into a financial research analyst. Its job is:\n\nUse the Financial Data API Tool with the user's ticker\n\nLook at the price, range, and basic trends\n\nTurn that into:\n\n2–3 key investment opportunities\n\n2–3 key risks\n\nA short summary context\n\nI also give it a simple starting prompt like:\n\"Analyze the stock ticker: GOOGLInvestment Goal: Long-term growth\"\n\nBehind the scenes, this agent is powered by:\n\nOpenAI Chat Model (Synthesis) – using gpt-4.1-mini\n\nFinancial Data API Tool – a custom tool node\n\nStructured Output Parser – to force a clean JSON shape\nSo this first agent is my \"left brain\" – it grabs data and turns it into structured financial insights.\n\n\n\nThe Financial Data API Tool is a custom tool built with JavaScript.\n\nIt expects a ticker as input\n\nIt calls the Alpha Vantage API using the GLOBAL_QUOTE function\n\nIt pulls back key metrics like:\n\nCurrent price\n\nHigh and low\n\nDaily change and change percent\n\nThen it formats a concise text summary for the agent to reason over.\n\nI also added graceful fallbacks:\nIf the ticker is invalid or the API limit is hit, it returns a demo string with example data instead of just failing. That way the agent can still practice the reasoning flow, even if the live API misbehaves.\n\n\nTo keep things organized, I wired in a:\n\"Structured Output Parser\" node\n\nThis enforces a JSON schema with:\n\nticker\n\ncurrentPrice\n\nkeyOpportunities (array of strings)\n\nkeyRisks (array of strings)\n\nsummaryContext\n\ninvestmentGoal\n\nThis is important because it means my second agent will always receive clean, predictable fields, not random unstructured text.\n\n\n\nOnce the first agent has done the heavy lifting, the output flows into my second agent:\nNode: \"Investment Thesis Generator\"\n\nThis one has a different personality: it's an investment advisor who explains things in plain English.\n\nIts instructions are:\n\nReview the synthesized analysis from Agent #1\n\nFactor in the user's specific investment goal\n\nGenerate a clear Investment Thesis\n\nGive one explicit recommendation: Buy, Hold, or Sell\nExplain the \"why\" in a friendly, tutor-like tone\n\nThe output format is structured like this:\n\nInvestment Thesis for [TICKER]\n\nRecommendation: [Buy/Hold/Sell]\nThe Why: [detailed but simple explanation]\nThe Verdict: [1–2 sentence summary]\n\nUnder the hood, this agent uses:\n\nOpenAI Chat Model (Thesis) – also gpt-4.1-mini\n\nSo the first agent thinks like a quantitative analyst, and the second speaks like a human advisor.\n\n\n\nFinally, everything flows into a Set node:\nNode: \"Add Disclaimer\"\n\nHere I:\n\nStore the thesis as investmentThesis = $json.output\n\nAttach a hard-coded disclaimer field that says:\n\"This analysis is generated by an AI and is for educational and informational purposes only. It is NOT financial advice…\"\n\nThis makes sure that wherever I surface this output – a UI, an email, or a PDF – the disclaimer is always attached, not something I might forget later.\n\n\n\nSo to summarize:\n\nThe workflow starts with a manual trigger\n\nAgent #1 + the Financial Data API gather and structure the raw financial story\n\nAgent #2 turns that into a clear, goal-aligned investment thesis\n\nA final node adds a compliance-friendly disclaimer\n\nThis turns a stock ticker like GOOGL from just a price on a screen into:\n\nKey opportunities\n\nKey risks\n\nA clear recommendation\n\nAnd an explanation that a normal person can actually understand.\nThat's my advanced AI finance tool for stock analysis in n8n."
}