{
  "student_name": "Hector Silen",
  "org_defined_id": "036247734",
  "username": "hsilenri",
  "email": "",
  "transcript": "Hello, my name is Hector Selen and this is my video submission for the session 9 assignment. So for this assignment, I'm presenting a cost of capital analysis of Netflix uh for Netflix to evaluate the financial feasibility of a $5 billion content investment. So for this assignment I've used the driver framework to drive uh to guide my uh analysis and a python script I wrote with help of Google Gemini to help me with my calculations. So beginning with the discovery and the define stage. So our primary goal is to define the hurdle rate or the weighted average cost of capital which determines if this investment creates or destroys shareholder value. So for our inputs data integrity is very important as we have strictly rejected book book value in favor of market value. So uh for this analysis uh we value Netflix at its $200 billion market capitalization to reflect the true opportunity cost of equity. Also it is very important that we be transparent about the assumptions and limitations in with this model. So first of all the beta stability. So uh for this uh analysis or this model we are using a beta of 1.3 and this assumes Netflix carries the systematic risk of a high growth tech tech stock and you know uh as Netflix uh or as the company matures into a steady media utility uh steady state of media utility this beta should theoretically trend down towards 1.0 zero or one. And uh the second assumption is the tax shield. So we assume a flat 21% corporate tax rate though in reality complex international tax jurisdictions could create a significant variability. So moving on to our represent stage. Uh yeah. So for our analysis or model we are just uh you know calculating some numbers uh we are modeling economic relationships. So uh in this analysis we must represent the cost of equity using the capital asset price model or the capam uh as this quantifies the premium investors demand for Netflix market volatility. Uh we must also represent the cost of debt using the after tax yield as uh this is very important because it represents the government subsidy on debt financing which is our primary uh lever for value creation. And finally we model whack as the weighted average of these two competing forces. So moving on to uh the implement step. Let's run this code. Okay. And uh as you can see uh the results of uh our calculations reveal a stark spread in capital cost. So equity investors driven by that 1.3 beta demand a steep 11.65% return and debt holders which are protected by seniority and the tax tax shield we talked about before cost us only 4.58%. Seen here. So currently Netflix is heavily weighted toward the expensive equity resulting in a whack of 11.22%. 22%. However, in our primary scenario analysis shows us that issuing a third three $3 billion in new debt allows us to swap expensive equity for cheap debt and uh this action lowers our WA to 11.13. So again seen here uh for my implementation I also ran a sensitivity uh stress test to visualize this relationship and as you can see in this optimization zone graph the curve clearly slopes downward. Uh so this would confirm that Netflix is currently underleveraged and that every dollar of debt added up to a point effectively creates value by lowering the hurdle rate. So uh now we must validate our findings and for this uh we'll do a logic check and a scenario check. So first the logic check is our debt of uh if is our cost of debt lower than equity? Yes, because we convert 4.58% versus the 11 65%. So if this were reversed uh our clearly our model would be flawed. Second of all our scenario check. So did adding debt actually lower walk and the answer is yes confirming that the so this confirms that the tax shield effect is active. We also must ask ourselves why is our 11.2 to wax so much higher than Disney's 8.2% as stated in the textbook. So, uh from what we gather, uh the model is correct as Disney utilizes a 30% debt ratio maximizing their use of cheap capital and Netflix is only sitting at 6%. So, the gap in walk uh is a direct result of this capital structure difference. Now moving on to the evolve step. Uh basically uh our results suggest that we should aggressively add debt but uh that we must layer on operational reality. So basically we cannot strictly apply corporate whack of 11.13% to international content and this is because producing content in emerging markets introduces friction costs that the cap formula ignores. Uh this is because first of all the currency risks. So we earn revenue in volatile currencies. For example, uh the rupee in India but uh service uh our service is in or our debt is in US dollars. So hedging this exposure carries a tangible cost and second of all because of the regulatory friction. though differing censorship laws, labor unions and compilers requirements uh effectively raise the cost of doing business abroad or outside the United States. So therefore using a flat hurdle rate of 11.13% for international projects uh would be an error as it would underestimate the risk. Finally, uh we reflect on our analysis and uh to conclude all all of my work, I would propose a two-part strategy for Netflix. So my first recommendation would be capital structure. So yes, uh we should approve the 3 billion uh 3 billion debt insurance as Netflix has massive unused debt capacity compared to other companies like Disney and this issuance law lowers our walk and utilizes the tax shield and it's also purely value accredited without risking financial distress. Uh my second recommendation would be the uh two-tiered hurdle rate. So uh to account for the operational risks identified in our previous stage or the evolve stage, we must uh divide our investment criterion to so for domestic US content we use the optimized whack of 11.13%. And for the international content, we must add a risk premium uh that would be setting a strict hurdle rate of 13.13%. So finally uh to conclude this approach would allow Netflix to optimize its balance sheet while protecting shareholder value against these specific risks of global expansion. Thank you very much for watching.",
  "video_url": "https://www.youtube.com/watch?v=CS7LyB_G_NQ"
}