{
  "student_name": "Alex Kurtz",
  "org_defined_id": "036915352",
  "username": "ajkurtz",
  "email": "",
  "transcript": "Hi, my name is Alex Kurtz, and this is my session nine assignment. So diving in, we are considering a hypothetical $5 billion content investment. To decide if that makes sense, we are going to need a good estimate of Netflix's cost of capital or WOC. So we're finding out what Netflix's current WOC is. How does WOC change if Netflix issues $3 billion in debt? Should all projects use the same discount rate, or should the U.S. versus international? um how does netflix's walk compared to disney and amazon prime and what is capital structure strategy uh what looks awful so that's kind of our driver stage um that's kind of us starting out our assignment all right so here we are um hold on i have to find it um um okay so um first we're gonna uh estimate or we're gonna research the uh our core finance tools so we're gonna find the cost of equity capital which is um and they're after tax cost of debt they're the walk formula which we see here and leverage in beta so use first sensitivity graph so that's later we're gonna find a cool graph so our solution we see here is to calculate baseline a Netflix walk with our current equity and debt so we're gonna recalculate walk after adding a three billion dollar debt and then create project specific walks is what we're gonna do so if we go down to our driver stage our validate we're assuming that all values are market values for walk not book values a new three billion dollar debt is issued at the same yield which is 5.8% in real life we'd expect our yields to creep up with more leverage but we're gonna hold constant for our simplicity our tax rate is fixed at 21 percent our project betas the us is 1.2 which is safer than the international 1.5 um risk-free rate and mrp or standard 4.5 percent 5.5 so uh now we're going to execute uh this so we have all of our values in here our cost of equity our after-tax cost of debt, our equity weight, our debt rate, and our baseline walk. Then we have our walk after an additional $3 billion in debt. And then continuing on for our project specifics, we find that safer U .S.-focused projects should use a lower hurdle rate while riskier international projects use a higher hurdle rate. So that means that safer U.S. focused projects don't need to have as much return from the investment as the international riskier projects. So our sensitivity to leverage, we're computing our beta from the current structure. Our current beta is 1.3. Tax rate is 21%. We get an unlevered beta of less than 1.3% since our leverage amplifies risk. Now on our R, we're going to reflect and recommend, Netflix currently has a very high equity -heavy structure, over 90% equity. They have a high cost of equity, 11.65%, and a cheap after -tax debt. A walk of 11.2%, which is above the industry range and above Disney and above Amazon. So adding a $3 billion debt, mindlessly raises our DMV. slightly reduced our walk 11 .2 12.1 still keeps our leverage pretty conservative our u.s content hurdle for project specific rates is 10.7 percent international content hurdle is 12 .3 this shows why one single discount rate can be misleading for projects with very different risks Netflix appears under level relative to the benefit of debt tax shields there's room to add debt if we You bring the walk closer to the 8.10% industry range and still maintain an investment grade rating. But given the streaming volatility, Netflix should increase leverage gradually, not aggressively, and use project-specific walk when evaluating big content slates, especially international. That is my session nine assignment. Thank you.",
  "video_url": "https://youtu.be/mw0xE2mq3Cs"
}