{
  "student_name": "None None",
  "org_defined_id": "037312318",
  "username": "rdate",
  "video_url": "",
  "transcript": "0:00 My name is Ryan Date and welcome to my mini project three. Starting from the top with the D portion of Driver, Define and Discover.\n0:11 I created an AI tool that acts as a goal-oriented investment guide. The goal is to set a goal an individual who is making $150,000 a year and wants to buy a $700,000 home in 5 years.\n0:27 Now looking at my Reason the R portion of Driver, I made it so the tool generates clear and understandable outputs from the inputs it was given, so your advice can be directly applied to unique financial situations.\n0:40 For the Implement portion using my N8N tool, I created a practical tool that can generate charts and clear situational analysis based on the parameters in both the application and The interface is very easy to use, making the real world application of my application endless.\n0:57 Looking at what I, this is the tool that I created, right, your path to home ownership, so it creates a nice chart here.\n1:04 Based on parameters, which you can adjust, so annual salary and you will raise, um, in a target home price, as well as the down payment and the time of years.\n1:13 It also, uh, provides a cashflow strategy, investment allocation, um, an annual breakdown. And required monthly savings. Um, so there's, as you can see, just a wide range of highly customizable parameters, um, that will adjust, um, what the, uh, um, what the goal is.\n1:36 And what the chart looks like, helping you customize your investment goal for whatever you want to achieve. Um, for the verified portion.\n1:49 Um, as displayed, my tool works for. A variety of different real world scenarios, making it useful across virtually all demographics.\n1:56 Umm, for the e-portion. Evolve. I improved this tool across three different driver loops. Uh, improving things each time. The first loop was to create a room.\n2:08 To get a rudimentary understanding of how the tools supposed to work. So, what different parameters I need to input, what, in what outputs I want to get from those parameters.\n2:19 Umm, the second loop. Or the next two. Lusearly we're directed towards starting into a legitimately useful tool. I added sending checks with the second loop and for the third loop I decided to add in more advanced features such as multi-step analysis and scenario comparison.\n2:37 So, reflecting on this with the final stage of driver the R. . . portion. Umm, using AI was very helpful in this.\n2:44 Umm, because as a college student I don't have the knowledge base required to, or the Python, um, experience to fully create this tool on my own, so that's where being able to consult a source such as AI, which has so much quick information and quick coding that it can do, especially if the right prompts\n3:09 were used. Umm, was very helpful in creating creating an advanced tool here. That's extremely useful and that can be applied to many different real one scenarios.\n3:18 Umm, ultimately it's made me . . . throughout this entire course, AI has made me much more confident in my ability to analyze different financial scenarios.\n3:28 And as you can see here with this tool that I've created, umm, it has a lot of real world applications.\n3:35 Like, these are, this is a very realistic situation that I could be in or that anybody I know could be in.3:40 This tool, this specific tool here is something I could definitely see. Like myself using in the future. Thank you."
}