{
  "student_name": "None None",
  "org_defined_id": "037141383",
  "username": "parrettj",
  "video_url": "",
  "transcript": "So I built a super simple inn um workflow. The function of it is to give simple information on stocks that you might want to buy. Um a problem you mentioned is that um people kind of look towards AI to tell them to buy something. And what I did is it just gives them information on it. It can't tell you to buy or to not buy. So it kind of avoids that wall. Um, but how it works is it sends a you send your your text or your chat and it goes to the agent, uses its brain or the AI model, uses some memory, and then it uses the Google Sheets to give you the information you're looking for. Um, so it took me a while to build this just because the Google Sheets wouldn't work. It was giving me the wrong information or it wouldn't give me any information or it was saying the wrong things or filling up the wrong columns. So the Google she used to give me a lot of problems but I figure it out now. Um I fixed it by just reversing to what I had to before and then copying it to a new. So like this is my old workflow. This is my new one. I changed nothing but it started working. So I don't know what that was but um so a little trial and error there. But let's see if this work. Oh, so this is my spreadsheet. It's nothing on it. Um, but it looks for your ticker or like what you could find your stock. So, um, I'm going to be using Apple on my example. So, that's AAPL. So, it's going to show like how it would show on stock, stock price, the market cap, the um um the profit earning ratio and the earnings per share, the debt, the cash, the revenue growth, and any additional notes it wants to add. So, I have it typed out, but I'm looking to buy Apple stock. give me available information on it. Um, so we'll send that\n\nshows you process\nsending it to your sheets. Then you look in your sheets and all your information is there. So, Apple, AAPL, um the price, um market cap, profit to earning ratio, your earnings per share, your debt, um your debt, your cash, your revenue growth, and anything else that it wants to have. So, this is just some information to help you decide. It says nowhere whether to buy or to sell it. So that's good. But that's my end. Thank you."
}