{
  "student_name": "Alexander Emenhiser",
  "org_defined_id": "035713425",
  "username": "aemenhi",
  "email": "",
  "transcript": "Hello, my name is Alexander Emenhiser and this is my video for the session 10 assignment. It is currently Sunday, November 23rd, and I am in the section of management 310. Our session today will primarily focus on capital budgeting and investment decisions. We will be doing that by conducting a full cost of analysis, cost of capital analysis. We're going to be doing this by evaluating Starbucks's proposed flagship roaster that requires $12 million upfront outlay and is expected to out operate for 10 years. We will be using an 8 1/2 WACC as our hurdle rate to determine whether the project generates value and to recommend an accept/reject decision which we will support using the driver framework. There are several parameters as we can see here that we will discuss later in the session and that we must keep an eye on. We want to produce a transparent uh cash flow model, core capital budgeting metrics, sensitivity tests and an executive ready recommendation. There are several financial analysis requirements which we will all answer throughout this session. As with other sessions, I have used the assistance of AI to help generate all the hard coding of our Python here. And I'm going to be confirming that with my own work and analysis. Like before, I will also continue to use the driver framework of learning to help guide my work. So, let's begin with our analysis of Starbucks. So the first step of our driver framework as always is to define and discover. In the define and discover stage, my objective was to thoroughly understand the financial decision facing Starbucks and identify all of the information required to build a reliable and defensive valuation of this model. Before touching any code, I started by clearly defining the central question. Does this proposed flagship roaster create enough econ economic value to justify a $12 million upfront investment? From there, I mapped out every component that would influence our financial decision that included confirming the 10-year project life, the $500,000 in working capital needed at the onset and recovered in the final year. the full revenue schedule provided in the case and each category of the operating costs such as cost of goods sold, labor, rent, and utilities, and marketing expenditures. I also noted that the entire $12 million investment must be depreciated straight line over the project's life, which directly affects taxable income and the depreciation tax shield. Our assignment here also specifies the a 25% corporate tax rate and a $3 million terminal value at in year 10. Both of which must be incorporated into the cash flow model. As part of our uh discovery, I ensured I fully understood the financial framework guiding our analysis. This project must be evaluated using the Starbucks's 8 12 weighted average cost of capital which serves as our hurdle rate and represents the opportunity cost of investing capital elsewhere. That makes the discounting process which is the interpretation of our net present value the cornerstone of our decision. The our our session will also require us to generate a complete set of capital budgeting metrics including net present value, internal rate of return, discounted and simple payback periods and the profit profitability index. To meet the technical requirements, I needed a model that could run sensitivity tests, specifically a 20% reduction in revenue and changes in the WACC of plus or minus 2%. Knowing this upfront was essential because it meant I had to design the code so that all assumptions were parameter parameterized, transparent and easy to modify. Finally, during this stage, I outlined the analytical approach that it would take to ensure the work aligned with our driver framework. That meant planning a clear clear flow from defining the problem to structuring the model to implementing and validating results and ultimately translating the quantitative outputs into a management ready recommendation for Starbucks. Spending the time to map out the entire problem in the define and discover stage ensured that once I moved into the represent and implement stages, the work was organized, grounded in financial logic and fully aligned with both the R session assignments and the broader principles of a discipline decision making and capital budgeting. After defining the problem and identifying every parameter as we talked about here that the model needed to incorporate, the next stage of our driver framework of learning is to represent. In this phase, my goal was to translate the conceptual understanding of the project into a structured analytical plan before writing any code. I began by outlining the full financial model on paper, which shows a year-by-year cash flow schedule covering years 0 through 10. This included mapping out how revenues would differ across the three phases of projects, year 1, years 2 through 5, and years 6 through 10, and pairing these revenues with their corresponding cost structures, cost of goods sold at 40%. Consistent labor expenses of 2.5 million, fixed rent utilities of 800,000, and declining marketing spending after the first year. I also identified where depreciation needed to appear, making sure the $12 million investment was allocated evenly over 10 years since this directly affects the EBIT taxes and ultimately the project's after tax operating cash flow. Additionally, I noted that that both working capital development or deployment in year zero and recovery in year 10 needed to be incorporated as well as the $3 million terminal value which must be taxed appropriately in the final year. During the represent stage, I also designed the structure for how the capital budgeting metrics would be calculated once the cash flows were built. This included specifying where discounting would occur to compute net present value and how the internal rate of return would be derived and how both simple and discounted payback periods would be measured from cumulative cash flows. I also estimated the logic for calculating the prof profitability index by dividing the present value of our future inflows by the present value of the initial outflow. Equally important, I built the structure for the required sensitivity analyses, which is one scenario reducing all revenues by 20% and another by adjusting the discount rate by plus or minus 2% around Starbucks's 8 12 WACC. By planning these components up front, I ensure that the Python script would be modular, parameter driven, and easy to adapt. Finally, our represent stage included determining what outputs should be generated to support the executive recommendation. This meant planning clear numerical tables, organized metrics, and visualizations of cash flow and sensitivity impacts so that the results would not only be accurate but also easy to interpret in a presentation setting. By the end of our represent stage, I had a complete blueprint of the model structure, which is what would be calculated when and how. So that moving into the implement stage would be smooth, efficient and fully aligned with the requirements of our session here. So now we move to that next stage of our driver framework which is implement. And this is where we can first start getting into our code a little bit. So as we see here, we have our define and discover stage. as I was discussing before where we have all of our parameters that I described. Then we had some of these code here as I discussed uh in our represent stage. Each of these we touched on earlier but now our goal is to actually go through more of the code. So, in the implement stage, I transform the conceptual financial model into a fully operational analysis, building a year-by-year projection that computes every relevant cash flow associated with our project. I began by organizing the key assumptions such as the initial investment, yearly revenues, operating costs, tax rate, expected project life, and discount rate into a structured set of inputs that the model references throughout. Establishing these assumptions clearly at the beginning ensures the analysis is transparent and allows for quick adjustments during our sensitivity testing. Once the assumptions were set, I constructed a complete financial schedule covering the entire life of the project from the initial investment through the final recovery of working capital in the last year. The schedule starts with topline revenue each year and reflecting the expected pattern of sales growth and decline over the project's 10-year horizon. Below the revenue model subtracts major categories of cost such as uh present the percentage based cost of goods sold the fixed labor cost, rent and utilities. And these cost items are shown explicitly so that anyone reviewing the model can trace exactly how operating profit is formed. Depreciation is then incorporated as a non-cash expense based on the initial investment of net salvage value spread evenly over the life of the project. Including depreciation is important because it affects taxable income and creates a tax shield that later flows into operating cash flows. After subtracting all expenses from revenue, the model computes the yearly operating profit, then applies the corporate tax rate to determine the project's after tax operating income. At that point, depreciation is added back since it's a non-cash to convert uh accounting income into true operating cash flow. Uh next, our model integrates the timing of investment flows in the initial year. The model records the full cost of equipment as an outflow along with the required increase in working capital. At the end of the final year, the model brings in the expected proceeds from selling the equipment as well as the recovery of working capital. These adjustments ensure that the model captures the complete economic impact of the project from beginning to end. The yearly net cash flows are then discounted back to the present using the firm's cost of capital. Summing these discounted values produces the project's net present value, which becomes the centerpiece of a valuation to provide additional insight. The model also calculates the internal rate of return, the simple and discounted payback periods, and the profitability index. Because relying solely on baseline assumptions can be misleading, I incorporated our sensitivity testing uh directly into the implementation. Uh the model can adjust revenues downward by 20% to test the impact of weaker demand or shift the discount rate up and down by two percentage points to explore the effects of changing capital costs. For each scenario, the full cash flow schedule is rebuilt and re-evaluated. This produces a new net present value and return metrics that show how fragile or robust the project is under alternative conditions. Finally, I generated visualizations to support clearer interpretation. One chart displays the project's cash flows over time. And I can actually go down to here to talk about a little bit. So this is our cash flows over time, making it easy to see the size of the project's initial outflow and the pattern of yearly inflows and the surge of recovered value at the end of the project. Our second chart here plots the net present value against the different discount rates to highlight how sensitive the decision is to financing conditions. Together, these visual tools help translate the analysis into intuitive insights that would be easy for an executive to understand. Overall, our implementation stage takes the abstract structure created in the represent stage and turns it into a working model that produces concrete financial results, documents the project's risk, and supports a defensible recommendation. And we can see all of these things that we talked about here actually come together. So we talked about a lot of this in our represent represent stage, but now we actually implemented it here into our code. So now that we've written the code and talked about, you know, how we came about coming up with the code, uh it's time to now validate our code. And that is the next stage of our driver framework. And this is where we're going to kind of look at and see if it makes sense uh for our outputs. And our goal here is to ensure our capital budgeting model not only calculates the correct number but also accurately represents the economic reality of the proposed Starbucks flagship roaster. First, we confirm that all relevant inflows and outflows are captured in the model. This includes our $12 million initial investment and capital expenditures of 500,000. uh and deployment near zero and the uh the annual operating cash flow is derived from the EBIT uh minus taxes plus the depreciation tax shield and the terminal inflow in year 10 which combines the $3 million salvage value and the recovery of working capital. The model outputs year-over-year cash flows ranging from 450,000 in year 1 to 1,950,000 in years 2 through 5. And then 1,50,000 in years 6 through 10. uh with the final year increasing to 4,550,000 to represent the terminal inflow. Discounting these cash flows at Starbucks's 8 and a half WACC produces a net present value of negative1,898,416 as we see here 19 indicating that the project would destroy shareholder value under the base case assumptions. We then evaluated the core capital budgeting metrics. So the internal rate of return of 94.94% is unusually high due to the large terminal inflow which illustrates the potential pitfalls of relying solely on IRR for projects with non-conventional cash flows. the profitability index of.848 uh which is less than one collabor corates the negative NPV suggesting that the project is not a financially efficient use of capital. The simple payback period is roughly nine years, almost the full life of the project, while the discounted payback exceeds the 10-year horizon, showing that the project does not recover its investment in present value terms. These metrics together provide a consistent and robust single signal that the project should be rejected if we ever follow the net present value rule. Next, we then validated the sensitivity of the model to key assumptions. A 20% reduction in revenue leads to a dramatically lower net present value of 7,673,655.77, showing that the project is highly sensitive to revenue performance. While adjustments in the WACC by plus or minus 2% produce net present values ranging from about $755,000 to two to -2,883,811 demonstrating the moderate sensitivity to the discount rate. These results highlight the fragility of the project's value under adverse scenarios and the reinforce the need for careful revenue forecasting and risk management. Finally, we examine the visual outputs uh generated by the model. And our first graph displays the year-by-year cash flows clearly showing the timing and magnitude of the initial outlay, the steady operating inflows, and the large terminal inflow at the end of year 10. This chart makes visually intuitive to understand how the investment unfolds over time. And our second graph, as I've kind of touched on a little bit before, uh, plots the net present value against the variations in the discount rate, illustrating how the project's value changes with the cost of capital, making it easy to see the net present value remains negative across all reasonable reasonable ranges of the WACC. Together, these graphs not only confirm that the numerical outputs are consistent with financial theory, but also provide a clear executive ready visualization of risk, return, and the timing of cash flows. Overall, our validation stage confirms the model's accuracy uh and accurately incorporates every relevant component which are initial investment, operating cash flows, appreciation, working capital changes, and terminal value. and that the metrics, sensitivity tests, and visualizations collectively support a robust defensible conclusion, which is that the project does not generate economic value at Starbucks's 8 12 WACC, is highly sensitive to revenue performance, and it produces multiple indicators signaling rejection. This thorough validation ensures that the analysis is precise, transparent and fully aligned with both our driver framework and standal standard capital budgeting principles. Now our next stage is the evolve stage of the driver framework where we take the analysis be beyond our basic requirements here and explore how capital budgeting approach can be applied for more broadly to to strategic financial decision-m while the base case evaluation provides a clear accept or reject signal for the Starbucks flagship roaster. The evolved stage emphasizes how the same methodology could guide larger scale corporate investment decisions, portfolio management, and even companywide strategic planning. For instance, the net present value framework we applied here can be scaled to evaluate a series of potential roasterries or other major capital projects, allowing Starbucks's management to systematically compare alternatives, allocate capital efficiency, and prioritize projects that maximize shareholder value. Similarly, sensitivity testing and scenario analyses such as our revenue negative 20% case and the WACCC of plus or minus 2% variations can be expanded into Monte Carlo simulations or full probabilistic forecastes providing richer picture of potential risks and uncertainties across multiple investments. Beyond financial metrics, the evolved stage also encourages consideration of strategic and operational benefits that are more difficult to quantify but may influence the company's decision. For example, while the base case net present value is negative, the roaster could enhance brand visibility, serve as an exper experiential marketing hub, or generate operational learning for Starbucks's supply chain and production innovation. Quantifying these benefits alongside traditional cash flow analysises allows management to integrate both financial and strategic value creation into a comprehensive investment decision framework. The visualizations we produced through yearly cash flow timelines and net present value sensitivity charts also evolve in this stage becoming tools for scenario comparison, risk communication, and executive decision-m by presenting multiple potential outcomes. Clearly, these graphs help management understand not just a single expected net present value, but the full range of possible project values under different assumptions. Ultimately, our evolve stage demonstrates that capital budget budgeting analysises are is not static. It is a flexible tool that can guide ongoing strategic decisions. It reinforces the importance of structured evaluation, transparency of assumptions and scenario testing of both individual project evaluation and broader corporate investment planning. By thinking beyond our parameters here, we see how the same driver frame methodology and disciplined financial modeling can support systematic, repeatable, and defensive decision-making for Starbucks's long-term growth and shareholder value creation. And our final stage of the driver framework is our reflect stage where we take a step back to synthesize the insights gained from our full capital budgeting analysis and consider what they teach us about systematic investment decision-m looking at Starbucks's flagship roaster we see that by care carefully calcul by carefully defining the problem representing the cash flows accurately and implementing a detailed model validating results s through sensitivity analysis and exploring broader applications, we were we are able to make a disciplined evidence-based recommendation. The negative MPV at the firm's WACC, the sub one profitability index, and the sensitivity tests all point towards rejecting the project if evaluated strictly on financial criteria. At the same time, the visualizations, including the year-by-year cash flow chart and the net present value sensitivity plot, provide clarity on the timing, magnitude, and risk of cash flows, reinforcing the quantitative findings while supporting communication with management or shareholders. Reflecting on the broader lessons, we see that disciplined application of net present value and capital budgeting principles allows corporate decision makers to separate strategic narratives from hard financial reality. Our exercise demonstrates the importance of considering not only baseline metrics, but also alternative scenarios, risk exposures, and potential upside from strategic benefits that are harder to quantify, such as brand impact or operational learning. By systematically following the driver framework, we also see how a structured approach from a problem definition to implementation to validation to then strategic evolution ensures that financial analysis is transparent, repeatable, and defensible. This reflection underscores that the skills developed in this analysis, including modeling complex cash flows, testing sensitivity to key assumptions, and visualizing outcomes for decision-m are transferable to evaluating other major investments, guiding portfolio decisions, and ultimately supporting Starbucks's long-term value creation strategy. So, this has been our session 10 assignment. My name is Alexander Emenhiser and have a happy Thanksgiving. Thank you.",
  "video_url": "https://youtu.be/9CsgE4m9HvQ"
}