{
  "student_name": "Isabella Corrales",
  "org_defined_id": "037007344",
  "username": "icorrale",
  "video_url": "https://youtu.be/Zx5cI240N9M",
  "transcript": "Hello, my name is Isabella Corrales, and today we are going to decide whether Panera Bread creates sufficient risk-adjusted value to justify this KKR-led acquisition, and at what price that value needs to break for a financial buyer relative to the strategic bidders. You know, as we see down here, Panera operates at scale with predictable cash flows, strong digital penetration, and identifiable growth levers. So unlike the early stage cases that we did with the cloud tech, Panera sits in a much more mature industry where the value creation depends less on Revenue acceleration and more on operational discipline, margin expansion and capital structure. So the goal is to determine a defensible bid range using the intrinsic sorry value and market based methods. So while also contrasting the financial buyer discipline with the strategic buyer synergies. So right here we see that Panera um generates about the generates 6 billion grown at the 8% rate and 900 million EBITDA um as we said strong digital penetration and then the predictable cash flows as we said earlier um but this makes it suitable for a DCF led valuation. So before we jump into it, I'm just just a few, you know, value drivers we have here is that revenue growth from store expansion and digital mix, the margin stability, free cash flow generation and exit multiple sensitivity. So those are our main value drivers. So to kind of represent our models, we have the DCF core model, and this is a five-year operating forecast. It shows the free cash flow, and it gives us what we need to do the terminal value for our exit multiples. And then we have trading comparables. So trade or comparing with, you know, our Starbucks, McDonald's, the Chipotle and McDonald's, you know, like comparing their numbers and then precedent transactions, you know, control premiums observed in the restaurant. And then buyer lens overlay, which is what focuses on our financial buyer discipline versus the strategic synergy logic. And these outputs that we get from these models are synthesized into a football field valuation to support a bid range rather than just a single point estimate. So now to implement those, go over to the collab and start with our free cash flow. So for this, we can see over here it goes by years. It's a lot of it gave us the digital mix, digital revenue, like all of this stuff projected net income and everything. So going to the very end, so free cash flow right here 5.8 billion and down here 580 but down here breaks it up just or just has just the cash flows there and not in this like only thing that you have to scroll over about and then to just talk about I mean 580 is pretty or million is pretty reasonable given, you know, Panera's scale and then it just continues to grow over the years. And so now to go to our terminal value, we, you know, the EBITDA multiples suggest a range consistent with 12 to 15 So for that, I and Google Collab decided on 13.5 right in the middle. And this gives us the 23.8 billion. So this is, I would say, more on the upside case rather than a base case due to the execution risk. But to kind of look at Because I, you know, this is right in the middle, but to look at it on each end, one at 12, one at 5, you can see our enterprise values here. This one, the 12, this one with the 5. So 10.8 billion and then 13.5 billion. And then to go on with discounting, where we bring in our 9% WACC It did a lot of calculations, but to get to the one that shows them all, or the summary, I guess. So right here is where we find our base case, upside case, and downside case. As you see here, this is the base case, which was lower than, you know, what we calculated earlier, which was definitely around the upside at, you know, very close. And then our downside at 13. So yeah, and then to look at trading comparables because earlier, you know, we had the 22 for their P over E, but Chipotle has 35 and McDonald's has 25, so it's lower. So to see how that works, our equity value is 8.8 billion. So Panera trades below Chipotle due to lower growth, but closer to McDonald's due to the scale and brand strength. So, and that's kind of what we just looked at. And to validate these, just kind of cross check, you know, across these methods, the valuation ranges overlap. This increases confidence. The DCF-based case aligns with the president transactions, while the upside reflects strategic style assumptions as we compared and I can go back up for here. And this sensitivity analysis shows valuation is most impacted by the exit multiple and margin assumptions, reinforcing the importance of this vivid discipline. So to compare like buyers, the financial buyer, you know, must earn a target return and therefore, you know, they cannot really justify these exit multiples and assumptions. And then strategic buyers can justify those higher bids due to synergies, but they're not directly transferable to the KKR. So And then, you know, we have our management rollover. That is. Yeah, OK, here it is. Management rollover, which does lower execution risk but does not offset the overpaying. So this whole validation just kind of supports the discipline bid strategy rather than the aggressive escalation. So we kind of just like evolve from that. I would say this valuation reinforces that businesses or that the business valuation is both quantitative and judgment based. That's just because, you know, we calculated things, excuse me, but also has a lot to do with judgment based as well. These models that provide like structure and investment but investment decisions depend on these discipline assumptions and scenario awareness. So some things that you can do would be to establish a clear walk-away price tied to the downside, DCF, and precedent ceilings. And you can just allow strategic buyers to overpay if as soon as you strive through logic and focus negotiations on structure management sentence and operational control rather than a headline prize. And yeah, just the making it where the KKR's advantage lies in execution, certainty and capital discipline and not valuation stretching. So to kind of reflect on everything, I would say that This violation does reinforce a core professional insight that, you know, this comprehensive business violation is not just about precision, it's about decision usefulness. And, you know, like I said, this model does create structure, but that judgment determines whether a deal should be pursued. So both ends of it. That, you know, the the cash flows, the DCF provide intrinsic grounding multiples. The exit multiples provide market reality and you know strategy determines like I said who should win the asset and what deal should be pursued comes all from judgment and strategy. But you know based on this triangulating DCF trading comparables and precedent transactions I do recommend that KKR should pursue Panera with a disciplined bid range and just like I said with a clear walk away price if strategic buyers push valuations beyond financial buyer returns. So that is my conclusion and thank you."
}