{
  "student_name": "Jasvika Patil",
  "org_defined_id": "036591563",
  "username": "patil173",
  "video_url": "https://youtu.be/NRCYTd1ktxE",
  "transcript": "hello so this is my session 11 assignment and today my clear objective is that i'm going to determine a defensible bidding bid range for the leverage buyout of panera bread this is a high stakes acquisitions of a six billion dollar revenue asset with significant growth potential but um The company is also operating in a competitive landscape with other strategic bidders like Starbucks and McDonald's circling the deal. So we are just going to walk our way through it and find a solution. So let's say I'm going to use the driver framework, of course. So let's begin with the define and discover step. We defined our goal as valuing Panera's equity under a standalone financial sponsored case while contrasting it against a strategic synergy case. In the discover phase, we aggregated the critical data that anchors this model. So Panera is generating $900 million in EBITDA on a 15% margin. The growth story is compelling with a plan of 500 new stores and a push to 70% digital sales mix. However, the market context is aggressive. So we have to keep that in mind. Industry price to earnings ratio are hovering around 22 times, but growth peers like Chipotle, they trade as high as 35 times. And we also know that management is asking for a 10% equity rollover, which is a critical discovery point because it aligns their incentives with hours post-close. And we also have a caliber. We have calibrated our cost of capital based on an industry WACC of 9%. So all these parameters, which also includes the operational skills, the market multiples and the capital structure constraints have have been isolated and documented before a single line of code was written. Moving to the represent stage, I translated these discoveries into a flexible Python code. Rather than building a static spreadsheet that breaks when assumptions change, I represent the business logic using a whole Python code. So if you look at the code on the screen, you can see the Panera Assumptions part. I highlighted it on the code. This is the control center of our evaluation. I represent the deal in three district scenarios, a base case, an upside down case, and downside case. So this allows me to toggle the entire evaluation model instantly. For example, in our base case, we represented the WACC at 9.5%. and also adding a 50 basis point premium to the industry average to account for the leverage risk we're introducing. I also modeled a margin expansion from 15% to 17% representing the successful execution of their digital strategy. And I also had two to represent the specific nature of the competition. So I created a dedication. I also created a dedicated function for that. So this mathematically represents the advantage a buyer like McDonald's has, specifically the ability to strip out duplicate public company costs and leverage supply chain overlaps. By defining these relationships in code upfront, I ensure that our subsequent calculations would be consistent and logically sound. They would just seem correct. So that takes me to my third step, which is implement. This is where I execute the calculation engine. I will walk you through the three core valuation methodologies I implemented, which is the discounted cash flow, the relative valuation, and the synergy analysis. talking about first which is the discounted cash flow in this function you can see I projected revenue out 5 years using a cumulative product for our growth vectors. So I didn't just flatline growth. I also modeled the trajectory that reflects the opening of new stores. Crucially, I also calculated the free cash flow to the firm, which in short, you call it as FCFF by explicitly handling the non-cash ad backs and working capital injections. Now, if you look at the console output titled implementation checkpoint, you can see the year-by-year build. And then I also start with revenue and then flow down to the EBITDA and then apply the tax yield to get the NOPAT and then subtract CapEx and networking capital changes. So for the terminal value, I implemented the perpetuity growth method with a 3% long-term growth rate consistent with GDP expectations. This yields my base case enterprise value. And I'm just going to scroll and show you according to that. So second, I implemented the relative valuation function. So here I didn't just pick an average. I looked at the peer set. While the industry trades at 22 times 22x price to earnings ratio, Panera's digital maturity aligns it closer to Chipotle. However, applying a full 35x multiple would be irresponsible for a financial buyer. So therefore, I implemented a selected multiple of 28x multiple. which is 28 times net income. For preceding transactions, I applied a range of 12x to 15x EBITDA based on a recent restaurant M&A activity. So this code automatically calculates the implied equity value by subtracting the 2.5 billion in net debt. Moving on. Moving on. So finally, and perhaps most importantly for the bid strategy, I implemented the strategic synergy boost. So in this function, So basically, there's a cash flow of potential synergies, which is estimated between $50 million to $150 million annually. Now, the code tax affected these savings and discounted it to a net present value. And the code also tells us that a strategic buyer can justify paying an additional premium because they're essentially buying these future cost savings. Now this implementation gives us a price ceiling that we need to be aware of, which brings us to the validate step. It is not enough to have a single number. We also must understand how sensitive the valuation is to changes in our assumptions. So I utilized the sensitivity analysis function to stress out the GFC. I'll show you. So the heat map you see on the screen visualizes the enterprise value across a range of WCC assumptions from 8.5% to 11% and terminal growth rates from 2% to 4%. This visual validation is critical. You can see that the base case value sits in the center of the blue zone. The gradient shows the valuation is highly sensitive to WACC. And a 1% increase in our cost of capital due to rising interest rates would significantly depress our bid capacity. However, even in the downside sensitivity quadrants, the valuation remains supportive of a strong bid. So provided we believe in the terminal growth story. This step validates that our base case is not an outlier. It is a central tendency within a national range of outcomes. So now moving on to the evolved step, I evolved the analysis by synthesizing these disparate methods into a unified view. This is where I look at the I look at this chart, which is named the valuation football field chart, which is generated by the Python code. This visualization allows me to triangulate the position. On the far left, you can see the GCF ranges. And then the base case GCF implies an equity value in the neighborhood of $9.8 billion. In the middle, the trading comps show a wider dispersion.  If I price Panera strictly like a slow growth incumbent at 22 times, the value drops. If I price it like Chipotle, it skyrockets. On the right, I have a precedent transaction, which sets a solid floor for the valuation around $8.3 billion. But if you look at the red dashed line,that is plotted on the chart that represents the strategic buyer max bid. So the code calculated this by adding the net present value of the synergies to the DCF base case. This line sits higher than our standalone DCF. And this visual evolution of the data makes the tension clear. The intrinsic value of the business is healthy, but the strategic value to a competitor is higher. And I'm also evolving from was it worth it to what will it take to win, which brings me to the final stage, which is reflect. So based on the triangulated data and the competitive dynamics, I can give a recommendation. So I would recommend an initial bidding, which  of $11.5 billion equity value. Now, let me walk you through the rationale and the specific negotiation strategy. So first comes the valuation range. My analysis establishes a defensible fair market ranges between $9.5 billion to $11 billion. My recommendation bid of $11.5 billion represents a premium slightly above the standalone range. And why pay this premium? Because of the control premium and the growth levers. So basically, we're paying for the right to execute the 500 store expansion and the digital optimization at 11.5 billion dollars that implied price to earnings multiple times. is like approximately 28.7 times. This is aggressive, definitely yes, but it is defensible given Panera's superior growth profile compared to the industry average. Second would be the financial versus strategic tension. Now, I know that strategic buyers like Starbucks and McDonald's have a mathematical advantage. Our model shows they could theoretically pay up to the strategic ceiling derived from their synergies. However, large corporate M&A is complex and slow. By bidding $11.5 billion, I'm aggressively positioning the company near the ceiling forcing them to pay 100% of the synergy value to beat us I'm betting that they will not be willing to give away all their synergy upside just to win the deal So moving on to the third, which is the management rollover. This is like key in the returns. Management wants to roll 10% and add the $11.5 billion valuation, which is over $1 billion in equity that I do not have to fund with cash. This reduces the check size and more importantly, keeps the team that built the digital strategy logged in to execute it. Finally, is the walk away price. So I must remain disciplined or the company must remain disciplined. If a strategic buyer bids significantly over $11.5 million, effectively paying for synergies that haven't been realized yet, the company could walk away. And at that price point, the IRR for a financial sponsor compresses below the required return threshold. So basically, to summarize this, First, the company can start with bidding $11.5 billion. Then the company could leverage the management rollover to align incentives. And then it could use the speed of execution as a financial buyer to kind of maneuver those slower strategic committee processes. This price creates a winning entry point of $10. for KKR while also respecting the competitive reality of the market. So that was my recommendation. And thank you."
}