{
  "student_name": "Princess Meshram",
  "org_defined_id": "036277056",
  "username": "pmeshra",
  "email": "",
  "transcript": "Hi, my name is Princess Meshram, and this is my Session 9 assignment on the Cost of Capital. I'm analyzing Netflix's capital structure and WACC for a 5 billion dollar content investment. In the Define and Discover stage, I first restate the assignment in my own words. Netflix is considering a 5 billion dollar content investment and possibly raising an extra 3 billion dollars of debt. My job is to calculate Netflix's current WACC, see how WACC changes after adding that 3 billion of debt, decide if US content versus international content should use different discount rates, compare Netflix's WACC to Disney's 8.2 percent and Amazon's 9.5 percent, and then recommend how Netflix should fund the 5 billion, whether with more debt or more equity. To me, WACC is basically the average price of money that Netflix pays to shareholders and lenders. It's the minimum return Netflix should earn on new projects so that both groups are satisfied. Next I summarize the numbers given in the assignment. Netflix's equity value is about 200 billion dollars. The market value of debt is 13 billion dollars. The equity beta is 1.3. The bond yield is 5.8 percent with a BBB+ rating. The corporate tax rate is 21 percent. The risk-free rate is 4.5 percent and the market risk premium is 5.5 percent. If Netflix issues 3 billion more in debt, total debt will be 16 billion. I also state my assumptions. I use market values of equity and debt for the capital structure weights. I assume the new 3 billion of debt comes at roughly the same 5.8 percent yield. I assume equity stays around 200 billion in my scenarios, and there is no preferred stock or convertibles. I also treat international content as riskier than US content, so it should require a higher return. Finally, I note peer benchmarks: Disney's WACC of 8.2 percent, Amazon's WACC of 9.5 percent, and the media industry WACC range of 8 to 10 percent. I will use these later to check whether my WACC estimate for Netflix makes sense. Now I move into the Represent stage and show the WACC formula from class. The weighted average cost of capital is E over V times r e plus D over V times r d times one minus T. E over V and D over V are the market value weights of equity and debt. r e is the cost of equity, which I calculate using CAPM: r e equals the risk-free rate plus beta times the market risk premium. r d is the pre-tax cost of debt, which is the 5.8 percent bond yield. Then I multiply r d by one minus the tax rate to capture the tax shield on interest. I will plug Netflix's numbers into this formula to compute its current WACC, its new WACC after adding 3 billion of debt, and later project-specific WACCs by changing beta for US versus international content. Still in Represent, I outline my implementation plan for Python. I define all Netflix and market inputs: equity equals 200, current debt equals 13 and then 16, beta equals 1.3, risk-free equals 4.5 percent, market risk premium equals 5.5 percent, cost of debt equals 5.8 percent, and tax rate equals 21 percent. I write a function for cost of equity using CAPM, a function for the after-tax cost of debt, and a function for WACC using the formula I just described. Then I use these functions to calculate Netflix's current WACC and its new WACC after issuing the extra 3 billion of debt. After that I run a simple sensitivity analysis where I vary total debt, recompute WACC for each level, and plot WACC versus debt. Finally, I reuse the same WACC formula with different betas to get US versus international project WACCs. Now I move into the Implement stage and switch to my Colab notebook. First I define all the input variables from the assignment: equity 200, current debt 13, new debt 16, beta 1.3, risk-free rate 0.045, market risk premium 0.055, cost of debt 0.058, and tax rate 0.21. Then I define my CAPM function, which returns r f plus beta times the market risk premium as the cost of equity. I define an after-tax cost of debt function as r d times one minus the tax rate. I also define a WACC function that takes equity, debt, the cost of equity and the after-tax cost of debt, and computes E over V times r e plus D over V times r d after tax. Using those functions, I calculate the key numbers. The cost of equity comes out to about 11.65 percent. The after-tax cost of debt is about 4.58 percent. The current WACC, with equity 200 and debt 13, is about 11.22 percent. The new WACC, after increasing debt to 16 billion, is about 11.13 percent. So adding 3 billion of debt lowers WACC slightly. Next in the notebook I run the sensitivity analysis. I create a range of debt levels from 0 to 100 billion, holding equity fixed at 200, and for each debt level I compute WACC using the same functions. Then I plot WACC on the vertical axis and total debt on the horizontal axis. Because I keep the cost of equity and cost of debt constant in this simple model and only apply the tax shield, the line slopes downward. As Netflix adds more cheap, tax-deductible debt, the average cost of capital falls. Finally, I calculate project-specific WACCs. For US content I use the firm beta of 1.3, because I assume it has average Netflix risk. For international content I assume it is riskier, so I use a higher beta of 1.5. I plug these betas into CAPM and then into the WACC formula. That gives me a US project WACC of about 11.22 percent, the same as the firm, and an international project WACC of about 12.25 percent, which is a higher hurdle rate. Now I return to the slides and move into the Validate stage, where I check if my WACC makes sense. From my code I have cost of equity around 11.65 percent, after-tax cost of debt around 4.58 percent, a current WACC of about 11.22 percent, and a new WACC of about 11.13 percent after the 3 billion debt increase. I compare these to industry and peers. The media industry WACC range is roughly 8 to 10 percent. Disney's WACC is 8.2 percent. Amazon's corporate WACC is 9.5 percent. My estimate for Netflix, around 11.2 percent, is higher than all of these, which makes sense. Netflix is much more equity-heavy with very low debt and is a pure streaming and content company with higher perceived risk. It is reasonable that investors require a higher return. This also fits finance theory. Debt is cheaper than equity, and because interest is tax-deductible, the effective after-tax cost of debt is even lower, about 4.6 percent in my model. When I add some cheap, tax-deductible debt, WACC falls slightly from 11.22 percent to 11.13 percent. That matches the idea that moderate leverage plus the tax shield can reduce the blended cost of capital. On the next Validate slide I zoom in on Netflix versus Disney and Amazon. My Netflix WACC is about 11.2 percent. Disney's WACC is 8.2 percent with a capital structure of roughly 70 percent equity and 30 percent debt. Amazon's corporate WACC is around 9.5 percent. Netflix's WACC is higher because it has a more equity-heavy capital structure, so it uses less cheap, tax-advantaged debt. Its equity beta is higher since investors see a more volatile streaming-focused business compared to Disney's diversified parks, studios, and media networks. Its credit profile is also slightly weaker than Disney's, so its debt cost isn't ultra-low either. The implication is that Netflix's projects must clear a tougher hurdle rate, so fewer investments will look attractive compared with Disney's. Next I move to the Evolve stage, where I extend the analysis to project risk and capital structure strategy. For project risk I make one simple assumption. US content has \"average\" Netflix risk, so I use the firm beta of 1.3. International content is riskier because of currency risk, regulation, and local tastes, so I assume a higher beta of 1.5. Using these betas in CAPM and the WACC formula, US content has a WACC of about 11.22 percent, while international content has a WACC of about 12.25 percent. That means safer, core US projects only need to beat about 11.2 percent to create value, while riskier international projects must beat around 12.3 percent, so fewer of them will pass the hurdle. This illustrates the divisional cost of capital idea: different parts of the business can use different discount rates instead of one firm-wide WACC. I also use my WACC-versus-debt plot to draw a capital structure insight. In my simplified model, where the cost of equity and cost of debt are held constant, WACC declines as debt increases because of the tax shield. That suggests Netflix is probably underlevered compared to Disney. Carefully adding more debt should lower Netflix's WACC, at least up to a point, and make more projects positive NPV. In the Reflect stage I summarize what I learned. I learned how to translate the WACC and CAPM formulas from class into simple Python functions and see how changing inputs like debt level and beta change the company's hurdle rate. I saw how capital structure matters: with very low debt, Netflix has a relatively high WACC; adding some debt with a tax shield brings WACC down and can make more projects attractive. Using project-specific WACCs helped me connect finance theory to strategy: US content can use the firm WACC, while riskier international content should use a higher discount rate. Overall, this assignment made WACC feel less like a random formula and more like a practical tool for Netflix's 5 billion dollar content decision and for comparing it to peers like Disney. That completes my DRIVER cycle for this assignment: Define and Discover, Represent, Implement, Validate, Evolve, and Reflect.",
  "video_url": "https://youtu.be/dCF_cwhaUwc"
}