{
  "student_name": "Gavin Henning",
  "org_defined_id": "035722847",
  "username": "gjhennin",
  "email": "",
  "transcript": "Hello, today we're doing the session nine assignment that is calculating the weighted average cost of capital or WACC for Netflix in connection with a hypothetical 5 billion content investment decision. Your analysis must determine current WACC, evaluate the impact of additional debt financing, assess project specific versus firm wide discount rates and compare Netflix's cost of capital for industry partners. um so now i'm gonna go ahead and hop over um already pre-ran the code um so these are just the variables uh now we're trying to find the calculate the cost of equity using capham so again let's start with netflix's current wacc based on our analysis netflix's present weighted average cost of capital stands at approximately 10.77 percent this figure is derived from two components. So you have the cost of equity using CAFM with a risk rate of four and a half percent, a market risk of five and a half percent, and Netflix's equity beta at 1.25. We get an equity cost of 11.38 percent. This reflects the return shareholders demand for the risk they undertake. So the same thing and here it just shows you that that cost of equity is 0.1138 or 11.38 percent. Then you have after -tax cost of debt. So with a pre-tax bond yield of 6% and a corporate tax rate of twenty one percent Netflix is effective after cost of tax that is a lower four point seven four percent the tax of benefit significantly reduces the true cost of borrowing so you can see again the point oh four seven four is four point seven four percent for the cost of debt after tax so these costs are then weighed by Netflix's current cost of capital structure which leans heavily toward equity at ninety point three percent with that making up nine point one seven percent of their total market value of capital So this equity heavy structure is a key factor influencing their WACC, so the calculated market value equity 198 billion, and here's some of that stuff, so you can see that calculated weight of equity being 90 .83%, and then the calculated weight of debt being 9.17%. so and then there's that calculated WACC of 10.77% so now question is what happens on Netflix decides to inject the additional 3 billion in debt for content investment the WACC actually decreases slightly from 10.77 to 10.68 percent. This seemingly small change is highly significant. By issuing more debt, Netflix shifts its capital structure, increasing its debt weight from 9.17 percent to 10.41 percent. This demonstrates the initial benefits of leveraging cheaper tax-deductible debt. However, this advantage isn't limitless. There is an optimal point in which the increased financial risk outweighs tax benefits pushing WACC upwards and here's just some of those findings adding additional debt issuance and there's your new weight of debt at 10.41% and calculated WACC after 3 billion debt issuance, like I said, decreases slightly to 10.68%. So this is a crucial point concept of WACC sensitivity your leverage. This visualization illustrates that as Netflix increases debt-to-equity ratio, the WACC initially declines reaching an optimal point before then on the other side of this extended it would keep rising again. The U -shaped curve highlights a fundamental financial trade-off that debt provides a tax shield and is often cheaper than equity, but excessive debt does amplify your financial risk, eventually increasing both the cost of equity and the cost of debt itself. Identifying that sweet spot, the minimum WACC is key to maximizing your firm value. um so now we're talking about um let's put it into respective of uh firm wide versus um just company um or project specific i guess uh so netflix is wacc um compared to its peers so So you have Netflix at 10.77% WACC, which is quite a bit higher than Disney's hypothetical WACC of 8.5% and exceeds the broader media industry range of 7% to 10%. So why does this discrepancy happen? Netflix's focused growth -oriented streaming model is inherently perceived as riskier by the market. It faces intense competition, significant content, cost inflation, and the continuous need for subscriber acquisition. Disney, on the other hand, is a diversified entertainment with stable revenue streams from theme parks, studios, and different sources that de-risk its overall operations. As far from a capital structure standpoint, companies with more stable cash flow like Disney can often sustain a higher level of debt at lower rates, optimizing their WACC Netflix with its current equity-heavy structure. It bears that higher cost of capital because its equity is typically more expensive than debt. And then from a maturity market position standpoint, Disney, being a century -old brand, enjoys a mature market position and established brand equity, leading to lower perceived risk on Netflix, despite its size, does remain in its growth phase, particularly internationally, demanding high return from its investors for its upfront investments. So a higher WACC means that Netflix's projects face a steeper hurdle rate. They need to generate higher returns to create shareholder value, which can potentially eliminate their ability to compete on projects that have a lower WACC competitor, like Disney, might find viable. So this is a crucial discussion, the applicability of a project -specific WACC versus a firm-wide. For Netflix, a firm -wide WACC serves as a general hurdle rate for projects with an average risk profile. However, Netflix's content investments are incredibly diverse, from relatively low-risk US-based productions to high-risk international content. So using a single -firm YWACC for such varied projects is problematic. It would likely lead to undervaluing low -risk projects, so rejecting profitable ventures that merely appear unattractive against an artificially high discount rate. Conversely, it could also overvalue high -risk projects leading to investment in ventures that ultimately destroy value because their true risk wasn't properly accounted for. so to summarize basically a project specific WACC is not just applicable applicable but essential for Netflix by tailoring the discount rate to the unique characteristics of each content investment considering factors like country risk market risk genre specific betas Netflix can be more informed risk adjusted can make more informed risk adjusted decisions and then this this approach will ensure that capital is allocated efficiently maximizing shareholder value across this global content portfolio so this is all the same stuff um So then what's some recommendations for Netflix's optimal capital structure strategy? One would be to explore a moderate debt increase. A modest increase in debt could further reduce Netflix's WACC. They can conduct a detailed modeling exercise to pinpoint the leverage that minimizes their cost of capital without increasing financial risk it could also involve targeting a debt equity ratio closer to that of like a more mature diversified company you could also implement a robust project specific WACC framework given that they have a diverse content investment a Netflix must formalize and implement a project -specific WACC framework. This will ensure that the investment decisions are truly risk-adjusted, preventing both the rejection of value -creating projects and the acceptance of value-destroying ones. They could also do a strategic use of tax shield, continue to leverage the tax shield provided by debt, um as they grow and their cash flow becomes more stable they can comfortably support a higher proportion of debt which drives down their cost of capital and enhances shareholder value so just by managing their capital structure and applying risk adjusted discount rates netflix can continue to innovate expand and dominate the streaming platform that they're currently growing in and that's all I have this is all the same stuff so thanks bye",
  "video_url": "https://youtu.be/ut5feip5-ws"
}