{
  "student_name": "Tanish Kukreja",
  "org_defined_id": "036513412",
  "username": "tkukrej",
  "video_url": "https://youtu.be/5NaWm90ShSU",
  "transcript": "Hi, this is my session 12 assignment for management 310. Uh so for this assignment I'll be first going over through our financial analysis problem. Uh I'll be using the driver framework for this project. So the first stage for that is define and discover in which I'll be explaining the problem that we have. So for this uh assignment we need to deliver a full valuation of Panera bread for a prospective KKR takeover using driver combine uh DCF trading comps and precedent transactions to produce an informed bid range while contrasting final buyer discipline with strategic buyer synergies. This is all the information that we have regarding this buyout. So basically uh we need to give a range of the valuation uh in which we find the enterprise value and we find in what range should the bid be placed uh for this takeover. So we have all this information uh for us to use and then explain a financial analysis using that. Uh I'll just go over through all of this first. So the scale is a a $6 billion revenue which is growing at 8%. We have $900 million uh dollars of a beta which is a 15% margin, $400 million net income across 2100 stores and digital uh sales which is already 50% of the whole revenue. The market differences is the P ratio is like 22x. Uh the presidenta multiples are 12 to 15x. Chipotle trades at 35% X uh PE and McDonald's at 25 XP. Why we have this information for Chipotle and McDonald's is because uh this is the part in which uh they can have the strategic bid in which they can like combine their stores uh with Panera and then that is why we need to have we have basically two problems regarding that. So we need to find the strategic bid and the actual bid by KKI. The growth levers that we have are they have like 500 new stores in the five years they have the target of that uh a digital mix to 70% they want to increase their digital revenue uh dinner and catering expansion and early um stage international rollout. What we need to do in this assignment right now then is to create an executive ready recommendation that states your value range fitting bidding range and rational for choosing financial versus strategic positioning. This is what we need to find through this analysis. So I'll be using driver framework for this assignment. Uh this was basically the define and discover stage. uh over here using the word document I'll be going through all of the stages. So the first stage is define stage in which what problem we have. The goal of this analysis will be to determine how much an era bread is worth and to decide what price KKR should be willing to pay for this acquisition. KKR is a financial buyer. So the key objective is to generate strong predictable cash flows. Achieve acceptable returns without overpaying. Maintain discipline even if strategic buyers bid higher. For the define and discover stage again this is all the information that we have from the question. The market context is also given to us in the question. The grow growth opportunities are available in the question. Capital and risk assumptions that we are taking is WACC of 9%, KKR applies a slightly higher WACC 9.5% to reflect return discipline. uh only after this stage we'll be moving to the represent stage in which how will we solve this problem of finding the bid range uh choosing between the financial positioning or strategic positioning of McDonald's or Chipotle so we'll be building a a DCF uh that there'll be three parts in that which is the base upside and downside we'll run market multiples using coms and precedence and We'll be analyzing strategic bio synergies and control premiums. Um we'll be doing all this through a football field in which we'll get a whole overview of which option to go with and we'll be recommending recommending which option is better in both of the cases. So now the implement stage here uh I use Gemini to produce this code for this assignment. Um I I I'll I used uh my prompt as to have this in a driver framework and also using the kiss principle so it's easy to explain. So this is now we starting the implement stage in which we'll be going through over our code. Uh this all is the define and discover stage because we had that already through the question. Uh it take it took all of those values from our question. Then we go to the discounted cash flow uh model that we built in this code. So the first section of the code creates a single parameter dictionary which is the basically the define stage which includes all of this. Then this is the implement stage in which we discounted cash flow model that we created that'll basically help us to find a solution to the problem. So this function over here uh calculates the enterprise value using five-year projection and terminal value. Uh how this discounted cash flow model works is uh the revenue grows each year using a scenario specific growth rate. A beta is calculated using a target margin of 16%. Uh the cash flow formulized over here. Each year's cash flow is discounted using WCC and a terminal value is added using the golden growth metal uh model. Uh this is all the information that we have. So this is basically the part of the code uh code that is we are building the model in uh we have three cases in this model. the base case uh in which the management aligned growth assumptions are taken in the upside case which is the strong digital and unit expansion case and downside case in which there will be slower growth in execution risk. So this whole part of the code is basically the discounted uh cash model that we build. Okay. What this discounted cash model will be helping KKR with is uh it'll help define KKR target price and walk away price at which they'll bid basically. After that uh we also did market multiple functions uh which is over here and this whole part of the code will help us with that uh to compare and all the information that we had then the question we used like the industry multiple of 22x high growth reference of chipotle say at 35% x or McDonald's at 22x uh so this is basically to see uh the strategic synergies that we have in the question We calculate this ratio through this code. Next, this whole part of the code will help us uh do the analysis for the strategic buyer. These are the assumptions that we took and we already had in the question. Uh so this part of the code will this part of the code will help us basically find that why strategic buyers can justify higher bids than KKR because with strategic buyer there are other options too. So as there are like two types of buyers, one as the financial buyer and a strategic buyer. Strategic buyers like Chipotle and McDonald's can help uh in strate strategizing uh how they can help Panera Bread to grow more because they already have that experience already. They can partner with Panera Bread to increase their uh revenue and meet their targets while the financial buyer would only help with them with basically funds and investment. So this part of the code help us with strategic buyer analysis. After that in the validate stage uh to check if everything was right uh we basically use this part of the code in which it took three scenarios of the three cases. Now I also did a football field synthesis in which uh this combines the whole part of the code basically. So uh it has the discounted cash flow model with all the three stages of downside, base and upside. It has a comparable company midpoint. It has the president transaction midpoint and a strategic buyer valuation. Uh this creates a clear valuation range of what KKR should pay to buy or acquire uh Panera Bread and what the strategic investors should pay. After that we also did a sensitivity analysis uh in which we took a few cases uh we tested if the WCC increases or decreases the terminal growth rate that we use in the DCF model changes. Uh this will help us with different assumptions because in real life all of the all of these things can happen uh and it includes a lot of risk. So after we ran the code uh this is what we basically after the football field analysis this is what we get in which we have the entire uh valuation or enterprise value at which the downside value the DCF base per KKR the upside value and what the strategic buyers should pay. So my recommendation according to this whole code would be if it is going with the financial uh investors uh the KKR target valuation should be at the midpoint of base DCF and pre precedent range. Uh it should be an aggressive but a disciplined bid. It should be near the uh base DCF case. So this would be the valuation for that and walk away price for KKR should be before reaching strategic buyers valuation. So that way it'll be better for him uh for KKR to acquire Panera. Uh KKR should not chase strategic buyers because their synergies justify prices that would destroy financial buyer returns. Uh so if according to this was the basically the bed range but my final recommendation uh would be that KKR should not chase strategic buyers because of the synergies that they can play into this role and if KKR changes uh chase the strategic buyers it can be risky for them because the valuation that they'll be giving if they chase the strategic buyers. So I think this would be my recommendation for the whole financial analysis problem. Uh through this uh whole in the reflect stage through this whole analysis I was able to use Python to improve transparency and speed. I was able to define the problem with the whole driver framework and I was able to combine the financial theory with a decision making analysis basically. So this was my whole assignment. U my pleasure. Thank you."
}