{
  "student_name": "Abby Goldstein",
  "org_defined_id": "035857284",
  "username": "goldst13",
  "email": "",
  "transcript": "Hello everyone. My name is Abby Goldstein and this is session 8 assignment. Um, and today we're tackling one of the most famous market anomalies of the modern era, which is the 2020 to 2021 GameStop short squeeze. Um, our assignment was to analyze this event using the driver framework to test the core assumptions of the efficient market hypothesis or the EMH um, and see if the market truly is rational. Before we proceed, the critical first step under verify was to check um the stated fact that the GME traded at 0.04 in August 2020. So, I'm going to run my code and you can see that um the this box right here um stated that this fact is incorrect. Um based on our code verification using the split adjusted historical data, the lowest closing price for GME during August of 2020 um was approximately $14 and this is 25 times um the stated figure. Now the define in review stages um the problem is pretty simple. Um, how did a struggling uh video game retailer with a fundamental value estimated between $10 and $40 per share? Um, reach an astonishing price of nearly $483. Um, this massive disconnect is the anomaly we are investigating. Um, so the key fa uh the key facts um laid out in our code respiratory output um confirm the events mechanics. uh the short interest meaning the bet the bets against the company peaked at an extreme 140% of the public share float. This created the mechanical potential for the squeeze. Um next the price surge was driven by an unpreented uh precedented 10-fold increase in retail trading volume uh coordinated largely through platforms like Reddit just stated right here. Oops. Now for the investigation um phase we uh we were to test the three forms of market efficiency. Uh the GME short squeeze appears to violate at least two of these forms. So the weak form EMH um this form states you can't profit from looking at past prices. Uh the GME uh event challenges this because the extreme short interest arguably created a predictable target. If we assume the short percentage was the information, um the market was arguably inefficient in the runup to the squeeze. Now, the semi strong uh form, EMH, this form states that prices reflect all public information. Um this is the biggest failure point. The price peak of $483 far exceeded the analysis consensus of the $10 to $40 share price. um showing the market was widely overrated to the public news of a potential company turnaround. Um next was the strong form. Uh this form states that even private information and market structure uh can't be exploited. Uh the controversial trading restrictions imposed um by brokers like Robin Hood raise a profound question here. When retail investors were suddenly restricted from buying, it suggested unequal access to market execution um which is structural violation of strong efficiency. To explain the anomaly, we must look beyond traditional finance and into behavioral uh finance. uh the rational uh mechanism. The core short squeeze was rational um mechanical function of uh the core short squeeze was a rational mechanical function of the high short interest. Short sell shell short short sellers uh were mathematically forced to buy back shares to limit losses uh driving the price up. Next was the behavioral amplification. Um the sheer magnitude was driven by emotion. Our analysis points to three key behavioral anal uh biases. Um hurting, which is investors following the crowd on Reddit. Uh sentiment-driven trading, which was trades um motivated by anti-Wall Street uh sentiment rather than profit. Um and then information cascade was people bought because other people were buying um creating a self uh self-fulfilling price bubble. In conclusion, the GameStop event demonstrates that markets are complex. Um, the GME short squeeze did not entirely disapprove the EMH. Um, but it did expose the fragilityity of semi- strong and the strong forms in the EMH. Our recommendation is that the GME uh anomaly is best understood as a rational market mechanic which is the short squeeze um amplified to an irrational extent by coordinated behavioral finance biases. Um this event proves that while markets may be efficient over long-term short-term efficiencies driven by retail coordination and emotion can have a massive systematic impact. Um and this was my assignment. Thank you guys for watching.",
  "video_url": "https://www.youtube.com/watch?v=D0eyRFmsvGg"
}