{
  "student_name": "Jose Casiano Trujilo",
  "org_defined_id": "037715236",
  "username": "jcasian",
  "email": "",
  "transcript": "Hi, this is my session 10 analysis for the cost of capital and in this assignment we're our goal is to evaluate whether a 12 million investment generates enough free cash flow over a 10year horizon. And we're going to evaluate that in order to justify if the upfront spend it is actually positive for the company using the 8.5% of Starbucks whack. So we're going to start with our driver framework which is obviously define and discover. And in this section, what I did was that I started to anchor the problem into the core investment decision, which it is basically that Starbucks is considering a flagship roaster that requires a 12 million upfront plus the 50 no the 500,000 sorry in working capital. What I also did was to stage all of this framing into into a like visual map which is in a Google doc and it was basically saying that it will last 10 years and that the revenue wouldn't stay constant and then there's a mix of fixed and variable cost and the depreciation is going to be straight line over 10 years. the terminal value and the actual whack. So the point to stating all of this was to prevent some coding mistakes later that they usually happened and also to be sure that every assumption used in the model exist here before any calculations. So then we can move to the stage two which is represent here. What I did was to convert all of the assumptions into a full cash flow map. So the project timeline will run from the year zero to year 10. And in year zero, what it's going to do is that we're going to what I intend to do is to subtract the 12 million investment and to I think it was that I need to lock up the 500,000 of working capital. Then in year 1 to two revenue is going to be 8 million but it then stabilizes by 11 million and in years then in years 6 to 10 the revenue again normalizes to 9 million. So this is important as and I also have the other information like cost and the person and year 10 and this is important because the representation is serving as the blueprint to be to after we write the code we know where each component it is located and why do each component actually matters. So then we move to stage three which is implement and firstly I made this prompt to Gemini which as always is kind of repeating the same the same words from the define and discover and some of the represent which is why those stages matter. And after inputting this code to Gemini which I thought it was going to do a good job it didn't. the code kind of failed. I think it was in two sections because it says that it needed a numpy financial and it couldn't really interact with it or something like that that I didn't really understand. So what I did was to ask an AI to refine my prompt in order to to like to negate the errors in in co in collab and it gave me this new prompt which it also failed again but I tried a third time and this was my final prompt that it actually worked and this code oh sorry and this code. It worked because it stated I think it was it was here like only use Python code, no stacks, no comics, no markdowns. And then it also like it specifically stated what the script must be, which was something I kind of didn't do. So, this was why the II prompts work better than mine. And we can move into the actual code which it started as the it started here in the like the building blocks of the code. It stated what we already know what we give in order to work. And then the first let's say important section was right here which was the free cash flow engine. Here this long function is kind of the core of the model as it constructs the free cash flows year by year. For example, in year zero which is this one. It isolates the upfront drain on cash and like these values never going to touch the EBIT as they're purely cashbased. Then we can move to this specific part of the depreciation which is computed once and used every year. And the reason that the this equation matters in the code is that is that it is as stated in the textbook a strain line depreciation and it is fixed. So it creates a text field for every year. Then there's some other things in order for the loop to operate. For example, the revenue, the cost of goods solds, the annual marketing, the appreciation. And what that does is to build a EBIT, which is like these values. And that is the real operating core of of what we're trying to look because once the abit is formed that is what determines the taxes which is very important. Taxes which are here exactly and the taxes in this specific equation are only applied when it is positive stated by this right here. because no tax credits are negative. They just can't be. Then in this section is the free cash flow little equation which converts the accounting income like this one into the let's say real cash as it subtracts the affformentioned taxes and also as the depreation back because it is non-cash. And finally this equation in this section is the final year and this captures the salvage value and the release of working capital and these two inflows are something that it can't really affect the long run project value. So we need to we need to include those. Then we move into this let's say third section of the NPV and this manually discounts the loop by using by using the NPV formula and to explain that a bit in the year zero it stays undiscounted and then in the like in the future years the cash flow it's based on the distance from today. Then we can move into the IRR bisection which is the IRR calculation. And here is where the IRR rate is equal to no here's where the IR is equal to zero as it is also equal to the NPV as the internal rate of return for Starbucks company as for each other company is equals to the net present value when it's zero then we can move into the here. Then I think we can move into the payback and PI functions. And this one specifically, it tells how many dollars of the present value you get per dollar invested. And the simple payback ignores discounting, which is something to take a look for. And the discounting payback it respects the time time value because it usually pushes recovery later. And here is also a fractional year to to avoid rounding errors. And uh for me I think this is a one of the important things in finance in corporate finance and something we are going to use in the future. simple payback which is the simple payback and then the discounted payback and yes here and then we have the running base case and in here it was the different scenarios for example when revenue decreases by 20%. We use the code basically did this equation and then for the base calculation and then this ones satisfy where the whack is plus or minus 02 exactly as it is 0.08 then 0 85 sorry then 0.65 and then 0.105 and Here is the base case which collab gave us to us and to start the NPV here it is clearly positive. So it means that the project does add value. Here the IR it is above whack in a very comfortable way. So it confirms the economic viability. Here the PI is being above one. It shows how the discounted inflows exceed the investment and the simple payback period of 5.28 years. This time frame it comes into the mid project which also it makes sense as the size of the upfront cost was really high. So it makes sense and a discounted payback period of 8.21 years here is longer because most of the value of the project it arrives later especially given the terminal value that we had. Then we have some this section which is the sensitivity analysis when revenue decreases by 20%. And when we lowered the revenue, we got a net present value of negative and the IR decreased and the PI is below one. And these all of the things it crushes the economics because the storage has large fixed cost. So once revenue slip once revenue slips then the avid collapses and the project can't sustain itself which in in my opinion it also matches how real retail stores and real stores in general they behave and actually work. Then we have the whack. Oh, sorry. The both of the whack for the plus or minus 2%. In these ones, the IR stays constant because the IR is the internal to only the cash flows. However, the NPV it shifts kind of drastically but also predictably because and yes and this all of this it shows how the financing matters but it doesn't matter that much compared to the operational performance. And finally, we have the visualization chart of the base case free cash flows. And I think this is a pretty good way to understand what we just mentioned in a visual manner. We have a red huge bar going into the negatives on the first year due due to the huge investment. And then we have some steady inflows and also we have a big jump in year 10 due to the terminal value and the working capital recovery that we have mentioned prior. And in here I think we can see in one picture and only one the exact cash flows that shape and what the cash flows how they drive the financial metrics. So after analyzing the code we can move into we can jump away from the stage three and move into the stage four of validating. And here to give a quick summary what I did was to double check that the model behaves in a financially consistent way. I have four main points which is first that the base case cash flows follow a realistic pattern. It is heavy upfront cost than a steady operating inflows. Second, we have the discounting produces expected expected patterns longer paybacks but solid NPVS. Thirdly, the IR converges smoothly which it means that the cash flow signs signs pattern are stable and fourthly that the sensitivity responds exactly how theory predicts. For example, the revenue shifts the revenue shift changes the economics of the project dramatically while the discount rate it only kind of tweaks the MPV but it doesn't break the project as a whole. So in those four points I what I understood was that everything behaves in a real world compared to the real world in the compared to how the how a real world investment would behave which validates the actual code. Then we can move into the stage five which is evolve and once again to give a brief summary here a I initially used the model to test how fragile or resilient the project could be. I think we if the revenue shifts completely it changes the economic profile which highlights the importance in volume consistency when it is in a project with high fixed cost operations. Also the discount rate movements matter. However, the project never really flips from good to bad and because it only changes the whack which means that the project sensitivity is not really financial it is operational which is why I think if we're trying to evolve we need to keep an eye in in that regard and finally in to my last last stage which is the reflection Here, as always, I reflected upon the whole process, how the driver structure made the analysis much clearer and how being able to break into each stage. It forced me to think from like it forced me to think of the economics before the math and the timeline before the code and the cashful logic before the metrics and the and the risk before the recommendations and I think that is a really important process to do as as in my opinion I think that's how somebody can actually really understand what they're doing and then replicate that in the future instead of like only being a computer and do it manually and not really understand what you're trying to do. And also I think this help tie operational reality back to the financial outputs which is what I I think the class really wants. For example, the long payback runaway matches how flagship stores behave because they have a big upfront cost and they then try to have a brand upside and then the financial recovery is kind of slowed and and I think also being able to parameterize everything made it easier to test the alternative futures without really rewriting the model. And this that is why I felt that the project was not really math math like a math exercise rather than an actual investment decision. And after doing my driver framework and explaining the code and everything and I think we can we can move into here. I think that the the base case it creates over three million value. The IR clears the hurdle comfortably and the economic prof profile is stable as long as long though a stopline performance holds. So the biggest risk is revenue softness not the financing conditions and given the results. And given the results, the project is financially attractive as long as Starbucks is confident in to sustaining the traffic and brand driven demand because as we have mentioned many and many times operational leverage. It is what it makes revenue stability and it is the key driver for success in this project. So this was my assignment and I hope you like it.",
  "video_url": "https://youtu.be/0vDn7-iFeiU"
}