{
  "student_name": "Samantha Paguia",
  "org_defined_id": "036278125",
  "username": "spaguia",
  "video_url": "https://www.youtube.com/watch?v=fN2s0JT_ejM",
  "transcript": "Hi everyone, I'm Samantha Paguia and this\nis my capstone project. So I wanted to\ncreate a financial tool that would\nactually be useful in my time as um\nworking in finance. This summer I have a\nfinance internship um with\nManderlay/Nabiscoco\nwhich is a um a snack company but also\nCPG company. So, I wanted to do\nsomething kind of relevant to the market\nand look at our competitor PNG actually\nand comparing um different acquisitions\nthat they're looking at and\nhypotheticals\num to see what would acquiring look like\nin that part of the business and what\nwould make something a good deal and\nnot. So, let's get right into it.\nUm here is what I use. I use NAND um for\nCPG brand acquisition screening and\nscoring system. So here is um my first\nnode which is the deal intake web hook.\nAnd this is a tool that I got based off\nof um the AI tool here to help me build.\nScrolling all the way up, it helped me\nbuild um from this. I constructed this\nfrom um the help of AI through like chat\nGPT.\num and Google Gemini um using the driver\nframework\nto kind of streamline my process a\nlittle bit better and formulate my ideas\nmore clearly um for this. So basically\num I wanted to have um high level flow\nintake normalize analyze score decide\nreturn. So this node is the web hook um\nmethod would be post path is um snack\nscout/inttake\num purpose is to accept raw brand data\nfrom form inter tool internal tool\nanalyst input raw JSON pay payload. just\nusing um JSON file there or um code that\nis compatible with that. And then why\nthis matters, this mimics an internal\nM&A intake portal. So for this I had to\nkind of research what this all kind of\nmeant and it took a very long time but I\nfound that\num through using open AI and acquiring\nthat through an outside source. So, I\nused um chat's free API one um to make\nmy\napp here. And so, as you see on the next\nslide,\nI used um Talon API tester and the post\nmethod. Um and I got this hyperlink by\nconstructing with my AI here.\nAnd then if we open this\num you're not supposed to use a test\nURL. I used the production URL instead.\nAnd then as you could see the post\nmethod here instead of get that's what\nit originally was. And then the snack\nscout/intake.\nAnd then authentification right now is\nnone.\nUm\nbut yes. And then our header here would\nhave to be the application of the JSON\nfiles.\nSo that was already inputed which was\nnice. I also picked this um by doing\nresearch into what API tester I should\nuse. And then the body here is um my\nsample data which we will see outputed\num in my Google Sheets later. So that's\num categorized in brand name, category,\nrevenue, revenue growth, PCT, margin\nPCT, and then the year it was founded.\nAnd then going back\nto my application here, um I tested all\nof these workflows as individual steps\nto make sure that there was no errors or\nkinks within them. So, if I go\nexit out of here\nand look at the executions, you can see\nall of the different executions that\nI've tried and all the ones that\nsucceeded. Um, obviously there were\nerrors at points, but um I reconstructed\nthat enough with the help of AI\nactually.\nSo if we go into our first step here is\nthe workflow configuration\nand that's going to have our revenue\ngrowth and minimal channels\nand then normalizing inputs revenue\ngrowth margin brand name channels\ncategory year founded um and then this\nis how it's going to be organized using\nthose JSON functions\nand then this is where our decision\nactually happens in the minimum\nminimum viability gate. So that goes to\ntrain through true or false. Um both\nending up\nin our return decision to user here\nwhich I'm going to more talk about\nrather than\nshow because I know what it was outputed\nto. But when we open the minimum\nviability gate here, um it inputs this\nwhich is is greater than or is greater\nthan or is greater than or um just\nshowing the different workflow\nconfigurations and the kind of if and\nstatement that goes with that as well if\nwe want to um acquire the company or\nnot. And then here's the open AI um\nactual templates here.\nUm so these response texts are going to\num scour the web for us and business\nfactbased anal analysis. I got these um\nfrom also compatibility with AI. So\nthose aren't something I specifically\nconstructed myself, but um I used AI to\nkind of help prompt me with that. And so\nif we open those up, you can see the\ndifferent brand data and the JSON files\nthat go in with that. So it's a lot of\nrepetition. And then um for this one\nspecifically, I provided a structure\nacquisition summary including um\nbusiness overview, key value drivers,\ncritical assumptions being made, and\nthen formatting as an overview here.\nAnd then here we're going to have the\ndriver scoring.\nSo this just helps um overarch our\ndriver method within the approach. And\nfor all of these I used the chat um\nGPT40 model\nfor market attractiveness, margin\nquality, scalability, brand mode,\nintegration, risk and then for each\ndimension provide a score 0 through\nfive. the one sentence justification\nreturn as JSON structure here\nand then we wanted to calculate\ncomposite score. As you could see um\nthere like the different errors that\ncome up there but I looked them up and\nit said that um to just ignore some of\nthose because those aren't actually\ngoing to affect our coding at all. Um\nfor this I had to use language\nJavaScript for that um run once all\nitems. So this is showing you the\nweighted composite score for each of\nthem\nwhich we will see later. Um building on\nour um recommendation the composite is\ngreater than or equal to 3.0 Oh, the\ntier monitor recommendation potential\ncandidate minus monitor for strategic\ntiming returning those composite scores\num market margin scale mo and\nintegration kind of like how we talked\nbefore and then we um got the open AI\nfor PNG specific strategic fit analysis.\nSo here we had to prompt it as well with\nthe different categories for brand\ncategory um revenue and composite score\nanalyzing strategic fit with um a large\nCPG acquirer PNG style that prioritizes\nscale and market leadership cost\nsynergies and operational efficiencies\nbrand portfolio extension distribution\nleverage um provide analysis covering um\nstrategic synergies potential conflicts\nand um cannibalization risks integration\ncomplexities and timeline\npostacquisition value um creation levers\nand then arraying those um using strings\nthere and then using that open AI again\nfor eval\nsorry for evaluation of logic\num so provide valuation screening logic\nnot a full DCF. So with that we want\ncomparable multiple ranges for\ncategories and growth profile growth\nwith uh versus margin trade-off analysis\nkey value creation levers\npostacquisition\num valuation sensitivity factors and\nthen what can move the multiple up or\ndown again testing for comparability and\nsensitivity analysis is mainly what\nthat's for and then assemble the final\ndecision packet. If we open that up,\nthis is showing us the different um\noutputs that we should have. Decision,\ncomposite score, recommendation, brand\nname, revenue, key risk, next steps,\ntimestamp.\nSo that will date us there. And then\nthis Google Sheets here, I made it so it\ncreated a whole new Google Sheets cuz I\ndidn't have one um directly made for\nthis yet. Um, but if we inputed\nsomething that um wasn't necessarily\ngoing to be a great fit, it would just\ngo or something that was inputed fault\nlike um with faulty material, it would\ngo through this false line and then it\ngo through here for not acquisition\nready response and then it would return\na decision to the user that would be um\nthat we should not acquire it or if\nthere's not enough information.\nSo once I inputed it\nand ran that from this API tester, this\nis what we got here. Um, it's saved as\nsave deal. And I'm just going to read\nacross everything that it says,\neverything it outputed just to outline\nwhy we should acquire this specific\ncompany. So, DID D001 brand name\nHealthbite Snacks category protein bars\nyear founded 20 2018 revenue um 25\nmillion revenue growth 35 gross margin\n45 um the primary channels DTC retail\nAmazon um channel diversification score\nfive scale score um four growth score\nfive margin score four um category\nattraction so these are all kind of\ncoming from our triggers of the open AI\nsources um to help um research for us um\nso we don't have to do it all ourselves.\nAnd then total deal score 87. So that's\num on a scale of 0 to 100 um meaning\nthat it is probably a good investment to\ntake. So that's what the second box is\nsaying here to take the investment. Um\nconfidence level is high because it's in\nthat 80 to 100 range. um key strength,\nstrong growth, um key risk. Um this part\nI wasn't too sure might be an error um\nbecause that also just outputed strong\ngrowth. So that's something that I would\nwant to look into my code as well if I\nwere to redo this. And then notes um\nthat it's in the protein bar category.\nAnd um I think I would add to this too\nas well. I would input my own notes\nwithout the code just because this is\npretty surface level. I would probably\nadd other categories that it could go\ninto or different brands that it is\nsimilar to. Um and then date evaluated\nwas today. So 2025 1214. Um another\nerror that kind of came up was that it\ncreated a second sheet and I'm not sure\nwhy. Um, but other than that, I think\nthat this created a lot of value for um,\nspecifically the field that I'm going\ninto and is a tool that I can definitely\nuse in the workforce. So, um, I'm glad\nthat I chose to do this. Um, it is a\nlittle more difficult than I intended it\nto be. And something that I'd maybe also\nchange going forward is instead of\nmaking it extra difficult and putting um\nthe API tester and making it go into\nthis node of web hook, I would just put\num a chat like we learned in class and\nsave it to simple memory and um have\nthat input there of the different\ncategories\num just so it's easier. And then the\nreturn decision to users just directly\nleft to right as well. Um so thank you\nfor listening and that was my capstoneproject."
}