{
  "student_name": "None None",
  "org_defined_id": "036250202",
  "username": "shongc",
  "video_url": "",
  "transcript": "Hello, my name is\nChristine Xiong and this is my\nmini project 3. So to start off, what\nfinancial decisions need explanation,\nnot just calculation. Most financial\ncalculators on the web are purely\nmathematical. They tell a user how\nmuch money they might have, but not how\nto invest it to get there. A user seeing,\nfor example, a $50 ,000 projected balance\ndoesn't know if they should buy bonds,\nstocks, or crypto. And through this\nassignment, our goal is to create a tool\nthat acts as a junior financial planner\nand must interpret the user's specific\ncontext, meaning their age, risk\ntolerance, and their goals at the stage of their\nlife, and provide a strategy their\nasset location allocations alongside\nwith the math involved so now with the\nreasoning how can ai make this smarter um standard\ncode cannot understand goals like i want to\nbuy a house in five years ai is required\nto bridge the gap between hard numbers and\nhuman aspirations for the so the logic for\nthis flow one we have input which is the user\nprovides quantitative data money age and\nqualitative data before i run go into google\ncollab to run the code and everything\ni'm just going to give you a brief rundown is\nexactly what i'm doing right now two is math\nlayer which i used um an html javascript\nto be able to run in a python format code\nand essentially you calculate compound\ninterest deterministically AI is prone to\nhallucinating math, so we keep\ncalculations and code. And third,\nreasoning layers of AI. The AI acts\nas a fiduciary. It looks at the user\ncontext and decides the appropriate asset mix.\nSo for example, like high bonds because\nthe timeline is short. And then our last\nnumber four is output, which is a split view\nshowing the strategy, which is the text,\nand the result. which is a chart and\nto implement this we made a custom web\napplication which i mentioned html javascript\nwith the google gemini um model and of\ncourse we just uh um i went to google ai\nstudio and copied it right before i started\nthis video so we don't leak any ai um api\ncode key codes and then key advanced capabilities\nand one we have multi-step logic The\napp performs linear regression math locally\nwhile simultaneously sending a context\n-rich prompt to the AI. To guardrails,\nthe system prompt explicitly forbids the\nAI for our recommended specific tickers.\nSo as, for example, like buying\nTesla or promising guaranteed returns\nensuring safety. Our workflow consists\nof me using the API key, which is\nthe security best practice key is not\nhard-coded. as you can see as a\nsubmission requirement. Keep APIs private,\nwhich I will do. And application\nsends JSON payload to Gemini API\nresponse is parsed and displayed\nalongside a dynamic chart, JavaScript\nvisualization. And to verify if\nthis actually works, we divide it into\ntwo scenarios, which I'll get to.\nOne will be a very young version and\nthen an old version. So essentially the\nopposite to see if the code essentially works\nand um and agrees with our logic insanity checks\nthe math projections aligns with standard\nfinancial formulas the ai advice\nconsistently respected the no crypto guardrail\nduring stress testing uh what would make the\nai more useful we could integrating an api\nlike alfantage to pull current smp 500 prices\nwould make the entry points smart accurate\ntax logic adding a layer to calculate tax\nimplications like the 401k versus brokerage\nwould increase the net worth accuracy and\nto reflect all of this um ai changes the\ntool from a calculator to a consultant um the\nuser feels um feels heard because the\noutput references their specific goals buying a\nhouse their an ethical consideration may be\nthe biggest risk is the user taking the\nai's word as legal financial advice which\nisn't always true so i mitigated this by adding\na prominent disclaimer and programming the\nai to use educational language rather than\ndirective language um i would trust this\ntool for planning but not for execution\nwithout a human review because AI and computers\nand tech in general are not all reliable\nand okay so now um to get on with my code um\nlike I said my mission was to build a tool\nthat uses math for the projections but\nAI to explain the why behind the investment\nand this is the code um I built this as a\nlightweight web application using javascript and\ngoogle gemini api I'm just gonna go ahead\nand paste it just in case so like okay and\nthen go back um the reason uh so i hard\ncoded the compound interest calculations\nin javascript for 100 accuracy uh then i implement\nthe ai as a strategic brain i specifically\nengineered this prompt with guardrails\nyou can see here in the code where i explicitly\nforbid the ai from recommending penny\nstocks or promising guaranteed um returns\nthis ensures the advice remains safe and\nprofessional and um and now like uh once i run\nthe code again i could do that yada yada\nyada and i paste in my api key and this is our\nscenario one um i will be inputting the it\nwill be 25 years old user with an aggressive\nrisk, aggressive risk high risk profile\nwants to retire early. The initial goal is to, let's say, retire early. Then if I generate\nplan, it will show, give it a few\nminutes or seconds. Yes. And you can see\nit gives you a long AI\nstrategic advice. The code calculates\nthe growth curve instantly.\nright here you can see that it grows\na 9% return the AI analyzes the\naggressive profile the AI suggests a\nheavy stock allocation heavy stock allocation\nbecause the user is young explains why\nthis risk is acceptable it says so it explains\nwhy so aggressive stocks at 90 bonds cash\nwhy this fits retire early and their major\nrisk highlights and important conditions\nyes and you could all read this right here\nand to see if this actually works we're\ngonna go with scenario B with an age much\nhigher than this so let's say we're gonna input\nan age at 60 and the risk tolerance is\nconservative very low risk and in goal is\nto project savings and we click generate\nplan it does might take a few seconds\nto and here yes now let's verify it\nworks so I changed it to 60 years old and\nconservative notice how the AI adapts\nand now recommends bonds and cash\nwarning against market volatility this\nproves the context awareness is actually\nworking um that's disclaimer right\nhere um building this taught me that ai is\nto reflect on all of this um it taught me\nthat ai is best used as a translator of\ncomplex concepts not a calculator the\nhardest part was prompt engineering the\nguardrails to prevent hallucinations while\ni wouldn't trade real money solely on\nthis bot yet it provides a much better\nstarting point than a simple spreadsheet.Thanks for watching."
}