{
  "student_name": "Josh Saarnio",
  "org_defined_id": "037335313",
  "username": "jsaarnio",
  "email": "",
  "transcript": "All right, this is my session 10 assignment. So the first thing we want to do is the discover phase, which is kind of just figure out what we wanted to do with the assignment here. So as we can see, we want to evaluate Starbucks proposed flagship roaster that requires a 12 million upfront outlay and is expected to operate for 10 years. use the firm's eight and a half percent whack as the hurdle rate to determine whether the project creates value and to recommend and accept or reject the decision. Some of the parameters are the initial investment is $12 million depreciating straight line over 10 years. The working capital is $500,000 display deployed at launch and recovered in year 10. The revenues is 8 million in year 1, 11 million in 2 through 5, and then nine in years 6 through 10. Uh the cost of goods sold is 40% of the revenue. Labor is 2.5 million. Rent and utilities 800,000. Marketing is 300,000 in year 1 and then 100,000 afterwards. And then for the taxes, it's 25% corporate tax rate and then terminal value of $3 million at the end of year 10. saying a good way to show what I kind of wanted to do is just show what I ended up doing. So, the first thing is you obviously need your uh you need to put all your cash flows out from year 1 through 10 to actually see what's going on. So, obviously we have our revenues, our depreciation, our operating expenses, taxes, our cash flows, all that sort of stuff. And the next thing you want to look at, obviously you want to find out what your whack is. Then you want to find out what your net present value is. Then your what your IRRa is. And then compare your IRRa versus your whack. Find out what your payback period is. And then find your NPV versus the zero decision. Then do a little bit of sensitivity analysis so that if the whack if something ends up happening where the whack isn't exactly accurate, you know how that would potentially change the decision. And then a recommendation at the end. So that's kind of what I decided we should do here. And then in terms of the refined stage, because it's a madeup scenario with all the numbers out there, you don't really have to go and validate the numbers because they're made up. And so this is typically where you would go and figure out what the numbers are and make sure that they're correct. But they are correct. So we can kind of move on from that. And then so looking at what we actually did here, uh I'm not going to read through this whole table because that's not going to tell you much. Uh but again, as we can see, our whack is 8.5%. The NPV is 3.02 million. Our IR is 13.25 million. So when you look at the IRRa versus the WAC, that tells you that you should go ahead with the decision. Then also with that information when you look at the NPV versus the zero decision it also shows that you should go ahead with that and accept it. Looking at the sensitivity analysis as we can see up here the initial whack was 8 and a half%. So we went down by 2% up by 2% and up by 4% just to kind of get a decent range of possibilities. But as we can see, as the wax change and the NPVs change, the decision does not change. So even if we are potentially a little bit off with our whack calculation or something ends up going ary, we should still be in a pretty good spot regardless of that. We should still go on with the project even if something unforeseen happens. And then uh short and sweet overall looking at the recommendation obviously from what we've seen is you should accept it and go on with the projects. Uh the NPV is positive at 3 million which is higher than the hurdle rate which is the same as the whack at 8 and a half%. And then uh the NPV or I already said that the irr is 13.25 25 which is again as we said earlier it's higher than the 8 and a half whack. So really all the uh metrics right now are showing that this would be a good project to advance with and even if there is some potential uh some potential for something go wrong or for a calculation being correct the project would still bring value. So overall, this seems like it'd be a very strong project to go on with and my overall recommendation would be to accept the projects. Thank you.",
  "video_url": "https://youtu.be/9biV1Osb9sE"
}