{
  "student_name": "Justin Ng",
  "org_defined_id": "038445183",
  "username": "ng216",
  "email": "",
  "transcript": "Hey, guys. It's Justin here. So, in this project, I'm analyzing Netflix cost of capital in the context of a hypothetical 5 billion content investment. The goal isn't just to get one weighted average cost of capital, which we call WACC, but to understand how Netflix current capital structure or potential three billion debt and different types of content raise all fit into its true hurdle rate. I also compared Netflix's WACC to media industry range and to peers like Disney and Amazon to see where Netflix sits in terms of risk and financing costs. So let's move on to the Define Discover stage. So in this stage, um... (clicks tongue) Define and discover, I'm basically trying to set up the Netflix problem as clearly as possible before I start coding anything. Netflix is thinking about a $5 billion content investment, and management might issue a $3 billion of new debt to help pay for it. So the big question is... How does that change their cost of capital, and should they rely more on debt or on equity when they fund the content? So to answer that, I break it into a few questions for my model that I need to solve. So first at the firm level, what is Netflix's current worth under its existing capital structure? Then if Netflix issued 3 billion more debt and recapped equity at 200 billion, how do the debt and equity weights change? How does the equity beta change using Hamada and what happens to the cost of equity, cost of debt and overall WACC? After that, I care about project-specific discount such as should Netflix use one firm-wide WACC for everything or different WACCs for US content and international content since those risks are not the same? I also need context, so I plan to compare Netflix's WACC to Disney, which has an eight point two percent WACC with about seventy percent of equity and thirty percent of debt, and Amazon, which uses a nine point five percent corporate WACC for Prime Videos. Finally, once I see all of that, I want to be able to say something about capital structure strategy. Like, given these numbers, what kind of mix of debt and equity actually makes sense For financing this five billion dollar content spend and future projects- So, To keep all of these assumptions straight, I load the key case number into this output table using pandas, as see here. So, you can see the equity market value, that market value, the planned beta, extra three million of that, the current beta, bond yield, tax rate, the risk-free rate, the market risk premium, and the benchmark WACC for Disney, Amazon, and the industry range. Having everything in this one table means that when I move onto the next stage, my code can pull from a clean set of inputs instead of hardcoding numbers everywhere. (clicks) So let's move on to the Represent stage. Here, I'm not really doing any computation yet. I'm basically setting up the structure of the model so that later my Python codes can just follow the rules I've already decided. So, Let me show the two tables here basically define those rules. So this is the first table, Table 1. So the first table covers the core WACC pieces. It shows, the first one you can see here, which is the WACC formula, which takes the equity weight times the cost of equity, plus the debt weight times the after tax cost of debt, which is the whole thing here you can see here. So, the second one is the definition of total firm value as equity plus debt and how that gives us the weights EV and DV. You can see this is EV and this is DV. And the CAPM cost of equity, which is this one, this line, is where I use the risk free rate, Netflix beta and the market risk premium, and the after-tax cost of debt where I take the bond yield and multiply it by one minus the tax rate to capture the tax shield. So, this is the result I got. You can see like all the formulas is here, like I was saying just now. The WACC, the V equals E plus D, EV, DV, cost of equity, and after tax cost of debt. So everything is right here. So let's move on to the second table. The second table shows how I handle beta when Netflix takes on more debt, right? So first, I back out the effect of the current debt level from today's beta to get a pure business risk beta, which is this one. You can see this is called the unlevered beta. Which is this one. So it removes the effect of current leverage to isolate Netflix's underlying business risk. So after that, I adjust the beta for the new debt to equity mix after the three billion dollar issuers to get a new equity beta. So you can see like, this, this here, and this here. The fourth one, you can see here, is, to adjust beta to reflect higher leverage, fits into CAPM to get the new cost of equity, which is this one, and this is the new cost of equity, which is a higher leveraged beta, leads to a higher required return for equity holders. And then I plug that into a WACC formula under the new capital structure, so you can see here. So everything is here. So this is the table of it. So laying all of this out here gives me a clear blueprint for the implement stage. Once I start coding, I just need to feed Netflix input numbers into this relationship to get the base WACC, The post-debt WACC, and the project-specific WACC in a consistent way. So let's move on to the implement stage. So in this stage, this is where I actually turn the WACC formulas and beta relevering logic from represent into working Python code and real numbers for Netflix. So I follow the setup to three point five. This is the setup, you can see this is the first table. We have the set up, the 3 . 1, 3 . 2, 3. 3, 3.4 , and 3.5 . There's six things there. So first I set up my function, then I calculate the current WACC, the post debt WACC, project specific WACCs, and finally I run two sensitive analysis. That's how those six tables came from. So let's move on to the first table. In the first cell, I import NumPy, pandas and matplotlib, and then I pull in all the key case inputs from earlier, like such as 200 billion, debt of 13 billion, a levered beta of 1.3, a 5.8% bond yield, 21% corporate tax rate, and the market condition of 4.5% risk-free rate, and 5.5% market risk premium. So we can see everything is right here. I also defined the potential extra three billion of debt and assumed that if Netflix add this debt. The pre-tax cost of debt will rise to 6 percent, which is here. So after the inputs, I define my helper function. You can see here, this is the first one, which is the cost of equity. It applies CAPM so it takes a beta and returns. The second one, which is after tax cost of debt, takes the bond yield and multiplies by 1-t to capture the tax shield. The third one, which is WACC, computes total film value, which is V = E + D, the equity and debt weights and returns both weights plus the blended WACC. And the last two, which is unlevered beta and the relevered beta, implement the Hamada formulas so I can strip out the effect of leverage and then add it back at a different D/E ratio. So this setup cell doesn't show any final answer yet, but it's the engine I will use in every scenario. So let's move on to the 3.1 table, which is Current Netflix WACC. So in section 3.1, I used those functions to compute Netflix current WACC. I start by feeding the current beta of 1.3 into the cost of equity, which give a cost of equity of about 11.65%. You can see here, like the fourth one. Then I run the 5.8% bond yield through after tax cost of debt, which gave me an after tax cost of about 4.58%, which is the fifth one. So when I pass equity of 200 and debt of 13 into WACC, the function calculates total firm value and give me the weights. So you can see that the equity is about 93.89% of value, which is the second one here. And the debt is about 6.1%, which is the third one here. You can see here. Blending the two costs with those rates give a current value of roughly 11.22%, which is the last one. So the conclusion from 3.1 is under its current capital structure, Netflix's firm-wide hurdle rate for average risk projects is a bit over 11%. That's already on the high side if you take that and compare to the eight to ten percent media industry range. So let's move on to the second one, which is what happens after the three billion debt. So this section 3.2 looks at what happens if Netflix issued three billion of new debt. So in the code, I set D1 equals to 16, you can see here on the first line. and keep equity at 200, which is this one, the second line. So step one is to get the pure business risk beta, So I called unlevered beta on the original beta, debt and equity, and that gave me an unlevered beta of about 1.2365. You can see here in number four. This is step one. Step two is to relever the unlevered beta and the new DE ratio using relever beta. So you can see here. So the new levered beta comes out around 1.3147, which is slightly higher than 1.3 because the firm is taking on more debt. So let's move onto step three, step three is to update the cost. with the new beta, cost of equity gives a cost of equity about 11.73%. You can see number six here. And with the highest 6% bond yield, the after-tax cost of debt become around 4.74%, which is the center one. So finally I run WACC again, you can see the step four, with E1 equals to 200 and D1 equals to 16. The new equity rate drops to about 92.59%, and the debt weight rises to about 7.41%. So the resulting WACC is around 11.21%, you can see here, number eight. The last line of the table shows the change in WACC is basically -0.006%, which is this one. So almost no change between both WACC. The takeaway here is that at this moderate level of extra leverage, The tax shield benefit from additional debt basically offset the higher risk and higher required returns, so issuing three billion of debt barely moved Netflix's WACC. So let's move on to 3.3, which is project-specific WACC. So in 3.3, I shift from the firm level to project specific WACC for different content segments. The idea is that not all projects have the same risk. I assign US content a slightly lower beta of 1.2 because that market is more mature and predictable, and I assign international content a higher beta of 1.4 due to country and currency risk. So you can see here, using cost of equity with this beta, we can see here, the cost of equity for US content is around 11.1% and for international content it's about 12.2%. So I keep the same capital structure as the base case and run this through WACC again. You can see here. So the data frame in 3.3, it shows that firm average for WACC will equals to 11.22%, you can see here, and beta equals 1.3. If it's US content, the WACC will equal to 10.7% at beta 1.2. You can see the second one. And the last one, which is the international content, the WACC equals to 11.74% at beta 1.4. So this tells me that using one flat WACC of 11.2% for everything would be misleading. It would over-penalize safer US projects and under-penalize riskier international content. A divisional WACC approach around 10.7% for US and 11.7% for international makes more sense. So let's move on to the 3.4, which is WACC versus leverage. Section 3.4 asks a bigger question, which is how does Netflix WACC change as we move the debt ratio over a wide range. I keep the unlevered beta from earlier and create a grid of debt to value ratio from 0% to 60%. You can see here, 0%t to 60%, So for each point in this loop, the first step is to compute the new D and E as share of total value, you can see here. the second step is to relever beta at that DE using relever beta, you can see here, which is this line, uh, this line. And the third step is to compute a new cost of equity with CAPM. So you can see this line. So for step four, I'll let the cost of debt slowly rise as leverage increase using a simple rule, which is Kd_sens equals to Kd (0) + 0.01 * D/V. So you can see here, this thing, this thing. So I plug those into WACC, which is this line, to get one WACC for that level of leverage. So I'll show you the graph first. So I store all of those WACCs into a list and then plot WACC against D/V. On the graph, the dash vertical line is Netflix's current DV, which is only about 6% the blue curve shows that in this illustrative setup... WACC is actually highest at almost 0 debt. You can see on the top left, arou- about 11.3%, and gradually declines as the firm has more debt. You can see it from zero to 0.60, it goes down like that. And falling to around, like, 10.8% when DV reach 60%. You can see on the bottom right. The small summary table here, which is below the graph, give a few exact value. So at DV equals to 0 The WACC is equals to 11.3%. At 20%, the WACC is around 11.06%, and at 40%, the WACC is around 10.88%, and at 60%, which is the last one, is around 10.78%. So visually and numerically, this suggests Netflix is underlevered in this scenario. There's room to increase debt and enjoy more tax shield without sharply increasing WACC, at least up to moderate debt levels. So let's move on to the last table, Which is WACC sensitivity to beta. So this last part of implement, section 3.5, it looks at how sensitive Netflix's WACC is to changes in the equity beta. So here I hold a capital structure fixed and just vary the beta at three points, which is 1.1, 1.3 and 1.5. You can see here. So for each beta, I run cost of equity and then WACC. So the summary tables show here, the first one at beta one point one, the cost of equity is about 10.55% and WACC is about 10.19% at beta equals to 1.3, the cost of equity is around 11.65% and WACC is our base, which is 11.22%. At beta equals to 1.5, the cost of equity is about 12.75% and WACC jumps roughly to 12.25%. So just moving beta by 0.4 changes WACC by more than two percentage point. That tells me Netflix cost of capital is quite sensitive to how risky investor perceive its equity to be, which is important when I later compare Netflix to Disney and Amazon, and talk about strategy implication. So overall, the implement stage gives me a full set of quantitative result such as Netflix current WACC uh, Netflix WACC after issuing three billion in new debt, project-level WACCs for U.S. and international content, and two sensitivity analysis over leverage and beta. So in the next stages, uh, which is validate and evolve, I'll compare these numbers to peers and the industry range, And then use them to argue for an optimal capital structure strategy for Netflix. So let's move on to the validate stage. So this is my validate stage. Here, I'm just checking if all the WACC numbers I got actually make sense before I use them to make any big conclusion. So in this code cell, I'm not doing any calculation yet. I'm taking the result from the implement part, so things like the current WACC, the WACC after adding three billion of debt, and the project WACCs, you can see here, these three. So I'm organizing them into a few tables using Pandas. So the code is basically, take the numbers I already compute and put them into a dataframe so I can compare them side-by-side. So in the first table, I compared the current structure to the \"+3 billion debt\" structure. So you can see the equity weight, debt weight, cost of equity, after tax cost of debt, and the WACC for both cases. So the main thing I'm checking when Netflix adds a little bit of debt, do the cost go up slightly but the overall WACC stay almost the same? So let me show you the result of it. So you can see here based on the result, the WACC only, moved by a tiny amount, which is what I expect because Netflix is still mostly equity financed. So let's move on to the second table, which is this one. In the second table, I compare Netflix's WACC with the media industry such as, Disney and Amazon. And also the industry range. And Netflix ends up with the highest WACC. Let me show you how. Right, this is how I compare it, and let me show the result. So you can see from here, based on the result, Netflix ends up with the highest WACC, Which fits the story that it's more focused on streaming and uses less debt than Disney and Amazon does. So the model isn't giving me some weird result, like Netflix having the lowest WACC in the group. So let's move on to the third table, which is the last one here. So in the third table, I look at the Firm, US Content, and International Content. I gave US Content a lower beta and International Content a higher beta. So what I want to see is US WACC is smaller than Firm WACC, and Firm WACC is smaller than International WACC. So let me look at the data first. That's exactly what the table shows, So the discount rate are moving in the same direction as the risk I assumed. So based on all these three tables, uh, because these three tables line up with both the theory and the case study, I feel confident that my WACC model is behaving properly. That's why I'm comfortable using these numbers in the next stage, when I talk about how Netflix should think about its capital structure and financing strategy. So let's move on to the evolve stage. So this is my evolve stage. At this point, I've already validate my work, model makes sense. So now I will use it to explore different capital structure option for Netflix instead of just describing the current one. So let me show you the table of it. So in this code cell, I will use the same unlevered beta and use the same helper function as before. But now I plug in a few different debt to value ratios. So I look at four different scenarios, which is the current structure, the structure after adding the 3 billion dollars of debt, And then two target cases where debt to value is 20% and 30%, which is the last two here. So for each scenario, the code leverage data recomputes the cost of equity, adjust the cost of debt slightly upwards as leverage increases, and then calculate the new WACC. So this is what I got from the formula and how I calculate it. Okay, you guys can take a look first. So this is basically the same thing, but I just changed the value of it. Let me, slightly go through it. And this is the table. So in the table, it shows that for each scenario, the DV level, the levered beta, the cost of equity, the after-tax cost of debt, the equity and debt weights And the resulting WACC. The pattern I found out is that with the current low debt ratio, WACC is the highest, and as I move toward 20% or 30% debt to value, the WACC comes down. That's exactly what we expect for a firm that's starting off under-levered and can benefit from using a bit more cheap debt without taking it on extreme financial risk. So this evolved step is what links the model back to the strategy, which is instead of saying Netflix's WACC is about 11.2%, I can now say that if Netflix slowly moves towards a capital structure with around 20% to 30% debt, its WACC will be lower than today, which makes future content investment slightly easier to justify. so let's move on to the last part which is, the Reflection part. So in reflection, I'm going to say that this project helped me see WACC as more than just a formula I memorized. By building the model step by step, I saw how each assumption pushed the numbers around, such as with the higher beta immediately raises the cost of equity. A small amount of cheap debt barely moved the WACC. and a very equity-heavy structured like Netflix naturally leads to higher hurdle rate than more diversified, more leveraged peers like Disney and Amazon. So the project-specific WACC part also reminds me that by using only one flat discount rate would have hidden the fact that U.S. content is actually cheaper to finance than higher-risk international content. That made the idea of divisional or project specific WACC feel much more real. The driver structure actually help me a lot. It forces me to slow down at the beginning and actually plan the analysis instead of jumping straight to the codes. So define and represent push me to... be clear about what decision I was supporting and which scenario I needed, and then the rest of the work was just executing that plan, checking if the result made sense and using them to explore better capital structure option. So overall, I feel more confident now. That I can use WACC and capital structure analysis to support a real financing decision, rather than just treating it as a homework calculation. And that's all I got for today. Thank you for listening.",
  "video_url": "https://youtu.be/lOT9lmRffXI"
}