{
  "student_name": "Juan Moreno Morales",
  "org_defined_id": "035730816",
  "username": "jmorenom",
  "video_url": "https://youtu.be/7u66xjeUQKI",
  "transcript": "hey professor in this\nvideo i'm going to i'm going to deliver\na comprehensive violation of panera\nbread for a potential kkkr takeover using\ndriver framework so to deal with this\nsnapshot panera generates about 900\nmillion of ebt id at a 15 margin which\nimplies around 6 billion of revenue\nacross 2 000 stores net income is about\n400 400 million digital sales are\nalready at 50 percent of the revenue industry\np.e. is about 22 times penance and multiples\nare 12 minus 15 next chipotle\ntrades at 35 times p.e. mcdonald's\naround 25 times p.e. industry wacc is\nabout 9 percent the management wants a\n10 percent rollover which while potential\nstrategy buyers like Starbucks or McDonald's\nmay also bid. The core question is,\nwhat is reasonable violation range for Panera\nand what bid strategy should KKR use\nconsidering both financial buyer discipline and\npotential strategy? currently current\npanero shareholders who care about sales price\ncontrol premium kkr as a financial buyer\nfocuses on returns and downsize protection\npotential strategy buyers who may realize uh\ncertainly see management rolling 10 equity\ncaring about government governance and upside\nlenders and bond bondholders who care about\nleverage and cash flow from the discovery\nside i bring this core this course concept vcf\nand tvm for industry value wacc and risk\nfor earlier seasons capital budgeting logic\nfor growth levers and stakeholders and\nagencies considering for how a financial buyer\nversus a strategic buyer my value panera okay\num so my goal is a is to build a multi\n-scenario dcf downside based upside trading\ncompost and partisan transaction multiplies a\ncomparison of financial versus strategic\nbuyers perspective and finally a bid range of\nwalkaway price for kkr so represent now i'm\ngoing to represent the stage and explain\nhow i structure my model and collab before\ni start coding which i coded beforehand it\ntook a little while so dcf engine starts\nfrom my current revenue 6 billion and\nabt margin 50 percent project 5 revenue and\nabt margins under the two scenarios\ndownsides lower growth limited margin expansion\nbased monitoring growth and some margin\nimprovement upside stronger growth and more\noperating leverage uh so ebt and taxes\ndepreciation as percent of revenue capex as\npercent of revenue working capital needs as\npercent of revenue apply scenario specifically\nwacc and terminal growth to compute\nenterprise value multiple block use pe multiplies\nindustry 22x you pull it 35x mcdonald's\n25x or current net income to create an\nequity value range from an enterprise value\nuse epitda multiples from predictions\ndeals 12 minus 15x on paneros 9 million epi\ntda to create ev range synthesis football field and buyer perspective okay so employment i'm\nabout to the google collab now you'll\nbe switching me okay so and so when i set up my base inputs\nfrom panero uh 900 epitda equals\n100 billion million epitda margin 50 percent\nimplied revenue 6 billion net income is\n400 million industry wcc is 9 million percent\nstandard assumption for tax rate capix\nuh depreciation and working capital as a\npercentage of revenue For each scenario, the\nfunction starts from a current revenue\nEPT margin, applies a consistent revenue\ngrowth for five years, calculate EPT taxes, NOMPAT, assume\ndepreciation, CAPEX, and\nworking capital is a fixed percentage\nof revenue, Computes free cash flow\nevery year, discounts FCF as scenario\n-specific, WACC, and adds a terminal value\nusing a coding growth model. I define three\nscenarios. Downside low revenue, consistent\nmargin, higher WACC, lower terminal\ngrowth. Base model of the raw assumption,\nupside, stronger growth, higher margins,\nslightly lower WACC, higher terminal growth within a\nreasonable range. In cell 3, I ran\nthe DCF for the three scenarios\nand stored them in a data farm, which\nis right here. The project revenue, EPT margin, FFCC, and PV, which is right here, and FCF. The enterprise\nvalue and how much of value comes from\nthe executive period versus terminal value.\nThis gives me an intensive violation\nrange from DCF alone. Downside, EV at\na low end, base case EV in the\nmiddle, upside in the EV at\nthe high end. I'll use these\nthree points later in the full field. And so three, I marked\nup a base violation. Trading compost\nPE and EPT IDA. I apply PE range\naround the industry 22 times and peers like\nChipotle 35X and McDonald's 25X. multiply\nthose p rate ratios by panera's 400 million\nincome to get an equity value range then\nadd assumption that to get an enterprise\nvalue range i use the 12 minus 15 x epta\nrange given in the assumption applied\nto the panera's 900 million epta to get a\ntransition of ev range okay and then this\nis right here and then i combined dcf\ndownside my over base over upside optional\nvalues trading multiples low high ev\npercentage conditions low in e and a\nstrategic dcf that assumes surgeons for\na strategic value uh an addition five\nto ten percent uplift for apt stores\nfrom overlap supply chain and digital\nscale this gives me a higher ev range that\nstarbucks or mcdonald's might be willing\nto pay compared to disciplined kkrb bid\nthis okay and then the chart shows a\nvisual that DCF gives up fundamental art\nanchor trading comps and predictions\nprovided market context ok and then the last\npart was this one in sales 6 I run a simple sensitive analysis\nbase of DCF I vary WACC up and\ndown, I vary terminal growth and I show how\nthe enterprise value moves, this highlights\nhow sensitive valuation is discount rate and\nlong-term growth explains why professional\ninvestors trade DCF outputs as range not a\nsingle point estimate. In the violation stage, I check both numerical integrity and economic\nlogic. I confirm revenue EBTA growth look\nreasonable for a scale restaurant chain and\na digital growth new stores. I verify EBTA\nmargins, free cash flow margins converging\nto a realistic range not something extreme\ni checked that terminal value is big but not\ninsane but sure of total dce value\ntypically in the 60 to 80 range i compare dce to\nmultiple base ranges um i validate the story\npanera has already scaled digital penetration\nand growth levels like 500 new stores\nmore dinner and category a financial buyer\nlike kkr cares about returns leverage capacity\nand exit multiples. My final DCF and\nmultiply ranges are close enough that I'm\ncomfortable telling a coherent realistic\nbuyer story. In the evolve stage\nI move from just what it is word\nhouse to KKR bid. DCF downside upside\ngives a fundamental range trading composed\nin a percentage suggestion that the\nmarket recent deals price assets energy with DCF\nbased on what I have based on that I might\nrecommend KKR should increase opening bid\nsomewhere around the lower half of the\nfundamental DCF and percentage range I would\nalso like to highlight that emphasize\noperational improvements store growth and\ndigital leverage kkr can help execute but push\nback on strategical uh pricing but pointing\nout a financial buyer cannot justify\npaying for a statistic that can realize\nreflection the most challenging part of the\nassignment is for me was to magnify different\nvalidation approaches and balancing\nfinancial versus strategical buyer\nperspective what i've learned was dcf proves that\nstructure and discipline that is extremely\nsensitive to WACC and terminal growth.\nTrading composed and predecessors are critical\nmarket checks that can be noisy depending\non the sentimental. The real skill is\nusing all three DCF composed transactions\nto build a valuation range, then levering\na synthetic control premiums risk\nto arrival on an actual bid. Overall,\nthis project integrated everything\nfrom TME and WSEC to capital budgeting andstakeholder analysis."
}