{
  "student_name": "None None",
  "org_defined_id": "037512866",
  "username": "case47",
  "video_url": "",
  "transcript": "Hello, my new my name is Lucas Case and\n0:03\nfor my advanced AI finance tool, I built\n0:06\nthe financial scenario generator. Um,\n0:09\nwhile most investment calculators just\n0:11\ngive you single numbers, uh, I found\n0:14\nthat the real world isn't linear and\n0:15\nit's important to think about all of the\n0:18\nscenarios that could happen. Uh, my\n0:21\nmodel has three scenarios, which is a\n0:24\nbare case, a base case, and a bull case.\n0:26\nUh, so first I'm going to show you a\n0:28\ndemo and then we're going to do a deep\n0:29\ndive into the background of my model.\n0:32\nHello, my name is Lucas Case and today\n0:35\nI'm going to be going over and giving a\n0:38\ndemo of my financial scenario generator.\n0:42\nSo here we're going to go into the chat\n0:44\nand we're going to do a scenario where I\n0:48\ninvest $50,000\n0:50\ninto\n0:52\nTarget.\n0:54\nSo, I'm going to type this into my\n0:57\nprompt. I would like to invest\n1:01\n$50,000\n1:03\ninto Target.\n1:07\nYou'll see some things I talked about\n1:09\nearlier on in the video. Uh, I've much\n1:13\nI've upgraded this one considerably\n1:15\ncompared to my mini project 2 because I\n1:18\nadded the structured output parser and\n1:20\nthen I used the split out mechanism\n1:22\nbefore it goes into my Google sheet and\n1:25\nthen we also have coding through\n1:26\nJavaScript.\n1:28\nSo now we're going to go look into the\n1:30\nGoogle sheet and see what happens.\n1:33\nSo these first\n1:36\nSo first you'll see that I used\n1:38\nformatting on the Google sheet just to\n1:40\nhelp uh make things easier for the\n1:42\nviewer. Uh these first two cases are\n1:44\ntest cases. You'll see this first one\n1:47\nwhen I tested Amazon. There's not much\n1:49\nreasoning, but then I upgraded my model\n1:53\nto give better uh explanations as to\n1:58\nwhat goes on behind the bear case, the\n2:00\nbase case, and the bull case.\n2:02\nSo let's look into this for Target. The\n2:04\nbare case for Target is\n2:08\nthat the 50,000 turns into 44,000 after\n2:11\na year due to a significant economic\n2:14\ndownturn that could be triggered by\n2:17\ninflation or interest rate hikes. Uh the\n2:20\nbase case is that after a year your\n2:23\n50,000 would turn into 54,000. And this\n2:26\nis just because target strategy of uh\n2:28\noffering curated products and has a\n2:30\nrobust omni channel capabilities such as\n2:33\nstore pickup uh drive up and obviously\n2:36\nyour typical\n2:38\nsupertore environment. And that should\n2:41\ndrive steady and moderate growth in line\n2:42\nwith historical trends. And there's also\n2:45\na bull case where your 50,000 turns into\n2:47\n59,000 due to a stronger than\n2:49\nanticipated economic growth leads to\n2:52\nincreased consumer confidence.\n2:55\nUh now that you've seen the demo, uh\n2:58\nyou'll be able to see the deep dive on\n3:01\nthe rest of my model. Thank you so much\n3:04\nfor your time.\n3:12\nNow that you've seen the demo, uh we're\n3:15\ngoing to be talking about what goes on\n3:17\ninside my model. First, in our AI agent,\n3:20\nyou'll see my\n3:22\nuh script or brain for the agent. You'll\n3:25\nsee I told it to act as an expert\n3:26\nfinancial strategist and simulation\n3:28\nengine. And its task is to present a\n3:30\nbare case, a base case, and a bullpace\n3:33\nwith critical instruction, which you saw\n3:35\nin my demo. Uh note, I did give it some\n3:38\nguardrails that it must not give advice\n3:40\nand if the user asks for illegal advice,\n3:42\nnot to give it. I also told it to be\n3:45\nrealistic with the math, which is why\n3:48\nyou'll see that I added the calculator\n3:50\ninto my model just so the compound\n3:54\ninterest could be done more adequately.\n3:57\nAnd on the right here, you'll see my\n3:58\nJavaScript code for my structured output\n4:01\nparser. I helped generate this code\n4:04\nusing Gemini just cuz I'm not too\n4:07\nexperienced, but uh we did it together\n4:10\nand we implemented it into our NA8\n4:12\nmodel. This was one of my more advanced\n4:16\nparts of this model and I'm very proud\n4:19\nof it.\n4:21\nAnother thing you'll see here is my\n4:23\nJavaScript code on the right and my uh\n4:26\ninformation on how I did the Google\n4:28\nsheet on the left. Uh the Google sheet\n4:31\nimplementation was actually an upgrade I\n4:33\ndid as I was making this model. I\n4:36\nthought it would be best if I could have\n4:37\nit output with some conditional\n4:39\nformatting that I mentioned in my demo\n4:41\nand using the structured parser as well\n4:45\nto give a structure. That way the model\n4:49\nreturns the same type of response every\n4:52\ntime just for consistency for the user.\n4:55\nWhether it be you want 5,000 in Tesla,\n4:59\n10,000 in Amazon, whatever it be, you\n5:01\nget the same style of response. and I\n5:03\nthought that'd be best for learning.\n5:07\nOverall, I would say my most advanced\n5:09\nparts on this were using the JSON data\n5:12\ninstead of text in the structured output\n5:14\nparser. And then\n5:18\nlastly,\n5:19\nI wanted to talk about how I implemented\n5:25\nthe program that this is a simulation. I\n5:28\nthought that was important in regards to\n5:30\nethics and knowing that\n5:33\nuh that it's a simulation and so people\n5:35\ndon't get too caught up into that.\n5:37\nOverall, thank you so much for your time\n5:38\nand I hope you enjoyed my AI tool."
}