{
  "student_name": "Alex Lenig",
  "org_defined_id": "035836182",
  "username": "alenig",
  "email": "",
  "transcript": "All right. So, today uh we're looking at GameStop GME uh when they had a short squeeze uh in basically 2021, January 2021. Uh we'll be doing a little case study on it. Um so, timeline we're looking at um 2020 GM nearly bank hits near bankrupts. Their trading stock is really low. Uh and then it's September 2020. Uh Ryan Cohen uh acquires a 13% stake uh 20 January 2021 uh on the Reddit rwall street bets. Um the price uh skyrockets basically due to a big collusion between a bunch of different people on the subreddit. Um and then February 2021 there's collusion hearings on market or congressional hearings, sorry, on market manipulation. Again, ton of people were buying the stock to try to drive the price up. Uh so, government was a little worried about that. Uh and then presently, uh this big squeeze is kind of slowed down. So, it's back to hopefully where it should be. And I mean, that's what we'll be looking at today. Uh we've also got some key data points here. Um kind of just tells us a little bit more about the situation. Uh some important ones are the retail trading value or volume that increased tfold during the squeeze. Again, the squeeze happened because a ton of people were buying and selling the stock. So, it's going to make sense that uh the volume is going to increase a lot if there's a squeeze like that. Um they put some trading restrictions at its peak uh basically because they were worried about um you know this kind of collusion almost. Um then hedge fund Melvin Capital sustained a 53 loss or 53% loss. Uh they're one of the groups invest in invest uh buying and selling a lot of or basically buying a lot of the stock. Um and yeah so they took a big hit because of that. Uh then really the big important one is analyst fundamental value estimates $10 to $40 per share. So this is where we expect uh the share should be sitting at their price. Um, which as you can see here, uh, the they say the price surge goes to 483. Um, so before I get into the driver framework, I'd like to just validate uh validate some of this data. Uh, so we're asked first to validate uh we're told GameStop traded at 4 cents in August 2020. Uh, so we want to check is that actually true. In reality, it's not. Um, we get data that it opened at one $11 and closed at 160 at 160 uh 167 and its lowest was a dollar which we can confirm. Uh, I was looking just on Yahoo Finance. Um, in the past and we can see here we can look at pretty much all of August. Uh, and it's really around a dollar the entire time. It never actually uh drops below a dollar. Um see like the first one uh the first date for August uh that it's trading at is at 10 101 um it's around that. So basically what we're getting at is that it is bigger than that. 04 um there's that 4 cents. Um, but in the way we're looking, it's really not a big issue because we're looking at uh where it said the uh fundamental value is $10 to $40 per share. So, it's bas it's already well below that $10 uh minimum. So, at that point, a 4 cents to a dollar difference uh 4 cents to a dollar really doesn't make a huge difference because we're low below that fundamental valuation. Um, but it is a difference. So, it's key to be pointed out. Um, a second little part I noticed um was the height in January 2021. So, when the situation with the Reddit uh Reddit was happening um when I was looking I saw it only hit 121.75 max um which we are told it hits uh has a price surge up to 483. Uh again, if we look at Yahoo Finance during that time, uh if we get to January 2021, uh see a slow increase, but nothing too that seems too severe. And then I thought I had it a little higher. Let me update the date a little further. I'll go just a little bit. There we go. Uh just so we get a full view of it. Um, we can see here when we're looking at our maxes, um, as it's increasing, the biggest Wait, did I put that right? Yeah, 120. Um, so anyway, we can see that the max it does hit is $120.75. Uh, so that's a really big difference obviously in maxes, but it's still way over that fundamental value. So it does matter uh because again that's a big difference and we want to note those differences uh when we're looking at our historical data. But again it's over what our fundamental value seems to be and we can see the uh like pretty we can pretty vividly see the spike in its uh in its value. So just important to note but we know we still have a spike there. Um but we note that it's a little lower than what we're told in the uh problem for our analysis. So now that we got that out of the way, we can actually get into the driver framework. Um so our first stage is discover uh define discover. Uh we ask what is market efficiency testing and then what are we actually anal at analyzing? Uh so first off, what is market efficiency testing? Um it basically looks at the market uh the market and we're trying to see is a spike like this because of a random event um something like a Reddit uh a bunch of people on Reddit buying a stock at the same time um or is it natural um is it like just basically not there's not a discre discrepancy and um kind of looking at how fundamental value plays into it and uh trading how like if it's natural trading or um is there something with behavioral finance mixed into it? Uh we don't know. So basically looking to see is it some sort of event that makes it happen um that's actually driving the price up uh and like sustainable or is it something that's not sustainable and uh it's just a big collusion to shoot the price up and make a squeeze. So uh this leads us into efficient market hypothesis. Um we're looking at basically uh ways to assess if uh GME has ever violated uh any of these hypotheses that lead to efficient market. Uh so weak um the weak weak form efficiency this means uh this is when current prices reflect reflect past prices and volume data um which we can see with where we at uh we can see with Reddit again there's a huge spike here um and all the data below is it does start to steadily increase from that dollar but uh go growing from $5 to $10 to 20 to 60 90 just shooting up like that um isn't something that's based off of pure historical data. Uh you don't get an increase like that just out of the blue in in a single month or in a few days. Uh so you can tell that it's not um not weak the weak form efficiency that's being violated. Uh semi-trung this is when current prices reflect publicly available information. Uh so something like people talking online that might know some things or uh different news or financial statements that have been released. Um and this is kind of indicated that is what uh what is being violated. Uh again there's people talking we get told uh uh there was an investment uh Ryan Ryan in acquired 13% stake um which is good for the company. Um, and then we can see in January, uh, Reddit, Wall Street Bets, uh, everyone can look at that subreddit and see that, uh, they're happy or they think that GME is about to explode. So, they can look at that and say, well, I'm going to go buy it before it explodes. Um, that leads to more and more people buying it. Um, and yeah, eventually it just it definitely exploding like we saw. Uh, but not something that's not really sustainable. So when we look at that uh it does suggest that uh semi- strong uh efficiency has been violated. Uh then we get to strong um strong uh form efficiency. So when current prices reflect all information public and private um so again it's basically everything with semi strong plus private information which is hard to actually prove. Um, it can I guess it can happen with a squeeze, but it's hard to prove when uh there's stuff like insider trading or things like that. Um, which obviously is illegal, but uh if that's happening, it's not really as private. Um, it's going to be more public. So, it's a little more theoretical, but it is something to talk about, but in this case, it doesn't seem like that's what was violated in Reddit's case. So, this uh um so here again what are we analyzing we basically want to see was Reddit's uh big increase in these days something that happened naturally or something um in something that would have been possibly sustainable or just a random event. Um so that gets us to represent uh we're going to talk about event study meth method methodology and the C. Uh so uh event meth study method methodology sorry I don't know why I keep messing up on that word. Um so the goal is to find AR uh which is basically just the difference between observed and expected return in this event that had not occurred. uh if this event had not occurred. Um so we're looking at the result we did get and then we have to actually kind of get a prediction for what it would have been had uh people on Reddit not been talking about this stock GME. Um so that's event study study methodology. Uh and then C is cumulative abnormal returns. Uh so basically the summation of abnormal abnormal returns in a over a specific period. So again, kind of basically what it sounds like if we have a m massive spike uh look with squeeze like what happened with Jimmy uh trying to summate those returns um and then we can actually analyze them. So that's the uh what we'll be using to study this event and uh look at its price changes uh relative to the market. So uh one important thing to mention I guess for event study methodology is that to do this calculation we're going to need alpha and beta. uh last time I talked about it, I guess. But beta is basically how uh closely a stock follows the market. Uh how risky it is, I guess you could say. So if it's above one or much higher than one, uh that means it's a pretty risky stock, but it has a high return. If it's lower than one, has a lower risk, but not quite as high of a possible return. Um so that's one of the things we'll have to be calculating to actually get these results. So that gives us to uh the code for our implement stage. So um I'll kind of be mixing implement and validate here. Uh I guess I I'll go with the implementation first because this kind of does our represent stage. Uh gets results for a represent stage. So here we go. Uh so we have a bunch of imports from different uh finance websites. um to get some actual accurate data. Um we have our defining parameters kind of what we did with driver uh just knowing what we want to do. Uh one of the important things is looking at the event date uh or event window. So we're looking basically 21 day 21 trading days. So 3 weeks of uh between this event. So we look here, we look 10 days before this leakage um or before the squeeze. Um here we get that set. Then we have our peak squeeze. Those days when it was hitting its peak around this spot and then we have our uh post squeeze. So basically when things start to settle back to normal. So these are the three time periods we'll kind of be looking at uh to make a analysis on. uh get some helper functions. Uh second step uh basically just collecting the data we need. Um sip of water. Uh so getting the data we need. All right. Uh then we get into our parameter estimation. So this is where we're actually going to be trying to calculate uh what we want for our event study method methodology and our C. So goes through uh does some calculations pull some more data in uh we're able to extract our parameters alpha and beta here which I said we need and then also some our residual variance uh which is important to look at how consistent our data is. Um step four. Oh, I guess this is technically I guess this is where we get to see our C. Uh does our abnormal calculations here um then a aggregates it. Uh and then we get into validate which I guess I'll talk a little bit more after I cover this. So basically what this code does uh tells us what our event window is um and then does this whole regression result uh gives us these regression results for our uh market model. Um basically bunch of different information sorry um it's not too important for us to look at right now. It goes more in depth than really even I know what to do with uh but some of the important results that come from it. uh again are the alpha and beta we need. Um so we can see here our alpha is our intercept uh which is pretty close to zero. Um and then our beta is hanging around one. So again this means that generally in the past um GME had moved pretty well with the market. Um didn't really have any major spikes or major dips uh compared to the market. It's not like it was just randomly jumping up. Wasn't a high-risisk highreward stock. It wasn't a lowrisk lowreward stock. is pretty in the middle. Um something you'd kind of expect if you're matching it with um the uh why can't I think of the name? S&P. Uh yeah, S&P. Uh it might move pretty well with that. Um and then we get to our cumulative returns. Uh I guess I'll talk a little bit more like that. We have a better graph with that. But uh let me talk about the validate stage real quick. uh because this is where we'll be doing some statistical significance testing. So u um this is basically just testing if our C for each period uh has a an abnormal return or not. Um so something again we're seeing if that Reddit spike uh that spike that we assume is caused from Reddit is out of the blue or something we could have actually expected and maybe uh someone smart would have been able to see coming. So, get back to the code here. Um, so I normally for this I would just use a t test. Um, and it does use a t test. Uh, that's the one we'll kind of I'll kind of talk about here. Um, just to see again if it's abnormal or not. Uh, it also does a will coxin uh signed rank test. I'm not too familiar with it. Uh but it's basically just taking some a little more of the uh randomness out of it. Uh it doesn't use a normal hypothesis uh like the t test does. Um but it does have those calculations. So uh so we get to this graph and again it tells us uh basically our all of our information. So pre-event leakage uh which is again the 10 days before the event uh we get a p value of 0.588 um and what we're looking at with this is if it's under 005 I guess tells us here uh if it's under 5% our p value that means that we're looking at something that is abnormal um something that wouldn't be expected from past data uh given our variance uh and our expected values So again, this is a lot higher than the 0.05. Um, so that means the 10 days leading up to it, uh, we actually have a, uh, C value that's negative 11. Um, so that means it's actually kind of un underperforming in the market. Um, which makes sense when you look at it. It's not doing too great. Uh, especially if you compare it to the market. But um yeah, 111% uh C isn't isn't ideal, but it also doesn't uh if we look again at the P value doesn't mean anything really abnormal is happening here. Um so then we look at peak squeeze. So that three days where it goes ballistic and increases by tens tens of dollars all the every day up to what was it 120? Yeah, 120. Um so if you look at that it has a CR value of 66%. Uh so this is a huge increase. Um it indicates that we have a abnormal return during the short squeeze. We can see the p value is zero. Uh which means there's really nothing to base it off base it off of. Um and it means most likely we have some event happening that's causing it to spike as it did. Uh then post postevent uh next six days about uh we get uh 156% increase um which is very high uh I'm sure you can tell but um sorry. Yeah. Okay. Um, so basically we can tell it still is seeing very high returns. Um, even after the event, uh, which we can see it's much higher than it was, uh, it's at 12% or 12% $12 compared to hanging around about the four or five dollars it was before. Um, so this again is a big jump, but we can see here it's kind of starting to be sustained. And if we look a little further into the future, go go June, sometime in June, we can see it's definitely still high and a lot higher than it had been before. So you can say that maybe this spike actually helped pe bring people like to view this stock and value it. Um, so again, it's a lot higher than we would actually expect. Um and it got a lot higher because of something not really based on history or based on anything with the stock which we can see because we have a lower p or basically no p value um and which is lower than that 5%. So uh basically that's our analysis here. Um that gets us to our uh evolved part which is basically just asking why did this happen? Why did the price shoot up like it did? um what caused people to buy into the stock and make it uh make it grow so much. Um so this is where we can kind of talk a little bit about um some uh what are they called? Behavioral finance. Yeah, behavioral finance uh reality. Um so people like to buy things uh can get drawn I I should say get drawn into buying things um if a big group of people are actually just buying them. Uh there's a there's a an or a proof called uh hurting behavioral uh social proof. Um this is when a bunch of people basically say okay we're going to buy this stock and drive the price up. Um and to do that a bunch of people have to buy into it. um buy into that stock. So, which is exactly what happened here on Reddit. People were saying, \"Well, this is a great stock. We're going to buy into it.\" Uh, and the price shoots up. But again, it's not something that's really sustainable. Uh, especially with Reddit, uh, they basically consider Jimmy a meme stock, which means they're buying into it more as a joke, but they also expected big returns out of it. Um there's also confirmation bias uh which is when people focus only on news that makes it sound like uh that basically good news. So they expect that okay because I'm only listening to Reddit has or Reddit uh GME has shot up tound 120 bucks. It's going to stay there. So I need to invest now because or it's been shooting up so much. I'm going to it's going to keep shooting up. So if you had bought at it highest here at 120, you're going to lose money. But as you can see, I guess now in the future, you can see, but just seeing that it's going up and not actually looking at the reasons why it's going up. Um, so it's always important to analyze why things are happening and uh why a stock is increasing or things like that. Um, so that basically gives some of those uh reasons for that. Um, and then again, it was basically just a VA volatile stock. Um, you shouldn't have been expecting or people that were buying into it shouldn't have been expecting it to stay as high as it did. But that's what happens when uh stock explodes. People buy into it and they think, well, I'm going to get rich quick and buy it. Uh, if I buy it now, it's going to increase because people are talking about it so much and then I'll sell it at its peak. But you don't know when that peak is going to eventually die. And if it dies, it might die. It might drop off considerably like it did with GameStop. Um which again afterwards there were still pretty good profits like way higher than it had been in the past, but um not well enough. So finally getting to sorry about that. uh getting to synthesis. Um this is basically just telling us um how our image theory uh binds with our behavioral finance reality. So our theory would tell us that uh people are going to look at historical data to make decisions. They're going to look at publicly available data and make smart choices. Um a stock's not just going to increase for no reason, you know. Um, but behaviorali finance theory tells us that people aren't they aren't machines. They're not going to make decision always make decisions based on what's reasonable. Uh, they're going to see things that they like, uh, things they think may be funny. Uh, things they are invested or like mentally invested, not like with money invested, but they're like, \"Oh, I want to see this do good, so I'm going to put money into it, even though it might not be the smartest choice.\" Uh, so I feel like that's a big part. uh people not always making the smartest choice but following their gut rather than their minds. So uh yeah, that's a big big reason why event like this can happen where people buy into a stock and shoot its price up even though it has realistically no reason to actually happen. Um so finally I think there were a few yeah required analysis uh verified the historical prices talked about the market efficiency uh could anal irrational investor have profited systematically uh so systematically no um that's when you look at historical data like we were talking about and say like for certainty I could have made huge profits with this um and again there's no way to actually predict that as we figured out here uh kind It happened spontaneously and um yeah, maybe you did get lucky and had money into it and it uh boomed, but there's no way uh someone who actively analyzes the market could have looked at that and been like, \"Well, I'm going to make a huge profit here.\" Um so yeah that that really a rational investor uh unfortunately wouldn't have been able to just look at and see but you know uh there's plenty of other choices out there. Uh compare efficient marketing to observe behaviors did that um observe anomalies. Yeah, kind of went over that. So that's the analysis with this situation with GME um the shorts market squeeze. Um, and yeah, again, kind of just a random event that happened with a bunch of people talking about it and shows how the public uh and especially social media with Reddit here because I feel like this is one of the first instances where it really shot up like that because of a website like Reddit. Um, but yeah, shows how a stock people can group up and talk about things and make a stock shoot up in price or blow up uh for really no reason other than that they find it funny or they want to uh they just want to make the price higher. So, yeah.",
  "video_url": "https://youtu.be/S6PI5dufZN8?si=xPHK8aFMarArZbTm"
}