{
  "student_name": "Fabian Segura Vargas",
  "org_defined_id": "037407177",
  "username": "fsegurav",
  "email": "",
  "transcript": "So the session 10 assignment is a cost of capital analysis. We're going to be following the driver methodology as always the define, represent, implement, validate, evolve, and reflect. Starting off with defining what are our goals, we're going to evaluate the financial viability of Starbucks's $12 million roaster or their proposed project. We're going to use WACCC to determine whether the project creates shareholder value. Going to build a full 10-year incremental cash flow model and in the process calculate net present value, payback, discounted payback, and other other metrics. Some of the parameters are an initial investment of $12 million, a WC of $500,000 to be returned at the end of the 10-year period. Revenues for the first year will be 8 million, then from years 2 to 5 will be 11 as the product ramps up and then 9 million in the last four years as the product hype winds down. And then operating cost, the cost of goods sold will be 40% of revenue. Labor costs are 2.5 million every year. Rent and utilities are a a set 800,000 every year. Marketing is 300,000 the first year and then 100,000 year after that and the tax rate is 25%. Some of the concepts we're going to be exploring in this analysis are capital budgeting, cost of capital, free cash flow modeling, and sensitivity analysis. So in the represent stage we want to set up sort of what we're going to be building the timeline of our steps would be first to collect the project assumptions which we did in this fine and discover then we want to map the free cash flow calculate the capital budgeting metrics and then forecast sensitivity scenarios all this in Python we're going to be using variables like the revenue the fixed operating cost like labor rent and marketing cost depreciation schedule we're going to be using flat line depreciation uh the tax rate the working capital changes the terminal value and the discount rate uh from the WACC which is set at 8.5%. Then some of the calculations will be EBIT taxes free cash flow MPV IRRi uh POA payback and discount payback. So the first part of the code itself will be set setting up the parameters. We can see here the initial investment the $12 million the working capital $500,000 tax rate 25% and WACC 8.5%. As we said previously then we also set up a dictionary with revenues uh as it was described previously as well. The first year 8 million, second year, second, third, fourth and fifth year 11, 6th, 7th, 8th, 9th, and 10th year 9 million. These are all the same numbers we described previously. Then the first part will be implementing the free cash flow calculation. We once again create a dictionary for all the values. Here you can see the revenues, cost of goods sold, labor, and then we create a for a for loop to repeat the 10 times for the 10 calculations we're doing. We set all the values as at a zero to begin with and then we do that loop doing all of these calculations and we'll end up with number values for all the 10 years. Then for the calculating the capital budgeting metrics, we use these numbers and a sum of them to in functions to create the the metrics themselves whether it be the net present value, the integrated return, profitability index and simple and discounted payback. And here we run all the functions at the bottom. And then finally the sensitivity analysis to test out different revenue scenarios, different WACCC scenarios and compare the net present value using these different scenarios. So the validate stage will be to see our output and test our core assumptions and what we know um in in theory to see if the numbers are correct. So we can see here this is the free cash flow table. We can see the n the revenue numbers line up with expected. The first one is 8 million then 11 million for the next four years and then nine for the last five. The cost of goods solds are a percentage of the revenue. So you can see it is proportional. And then labor, rent, marketing for the most part are all fixed costs. The flatline depreciation you can see repeats every year. EBIT changes depending on the tax rate which is here. Here you can see the comparison as well as well as with the notepad. Then here you can see the original capital which will be returned at the end along with a $3 million investment. And then at the end here we have our free cash flow. From these numbers we generate the net present value at 8.5 WACC which is a little bit over $3 million which is good. This is what we were looking for. We wanted to see if the net present value would be greater than the $3 million which we are getting in return. That is basically the number we need to be on the lookout for to see if it is profitable. But of course this is all carrying out with assumptions. Uh 13 of return profitability index of 1.2. This is all carried out using assumptions of what we think. Which is why we create a sensitivity analysis. As we can see on the table here on this table we can see different revenue scenarios. We can see the blue line is if you were to generate 20% less revenue. The green line if we were to generate 20% more revenue. And then the WACC on the left would be if the hurdle rate was 6.5% instead of 8.5. And then on the right this line was it was 10.5 instead of 6.5. Some of the things we can determine from this is that the impact of the revenue is much more impactful than the impact of the hurdle rate. And also uh the higher the hurdle rate because of the slight curve and exponential decrease of these lines, it is less impactful than the revenue itself. What I mean by that is that it is as you can see the orange line and this P and this point on the 8.5 hurdle rate this represents the $3,22,000 of mark of the net present value using the standard method for example from here we can see that having a bit of a lower hurdle rate or even a bit of a higher hurdle rate really doesn't affect it that much as it would you can see there's a way bigger gap with both the revenues in positive or negative. So missing on the revenue assumption would be much more impactful than missing on the WACC assumption. So our conclusion is that with the current assumptions, it would be a good investment since it is above $3 million, but also we would want to be able to make sure that the revenue is not going to be lower than where we have assumed since it is cutting it a bit close. And we can see the impact of for example the blue line. Even if it had a much lower hurdle rate, it will still have a negative net present value. Some of the ways we can evolve and reflect this analysis. We can evolve it by adding a Monte Carlo simulation for revenue uncertainty. There's a different type of sensitivity analysis that tests out different scenarios. We can introduce inflation growth rates and we can extend the model for multilocation expansion different projects and how those relate to each other and the distribution of capital. A reflection Python automation drastically improve the precision and speed of this. Instead of doing it in Excel, it can automatically basically calculate the 10 different scenarios instead of having to copy paste and setting up the whole formulas, which makes it much easier once you have a set a set number or constants. For example, this strengthened my understanding of cost of capital and capital budgeting. I better understand what I'm looking for, how all the different factors we have learned up until this point, the tax rate, some of the accounting principles all take into account at this point of the year. And also we can reflect that this model is reusable for any future investment decision as you can plug in different numbers for the different valuations. Thank you.",
  "video_url": "https://youtu.be/tiC1gevMODg"
}