{
  "student_name": "None None",
  "org_defined_id": "036275825",
  "username": "kuper",
  "video_url": "",
  "transcript": "0:00 Hello guys, I'm Andrew Cooper. I'm going to be talking about my project, Mini Project 3. Pretty much, it's a financial project.\n0:08 What I would pretty much say it is, I had a long prompt and pretty much talking about, like, all the different things I need for it, based on the assignment details.\n0:17 And, I pretty much made it. So, if I want to have a growth, let's say you want to invest for five years growth, and you have, how, how should I invest 50, oops, let's put the dollars in, $50,000 if I, what did I say?\n0:43 How should I invest $50,000? Because I already put the moderate in five years. I was going to put all that, but pretty much it gives me like a, oh, it should be diversified.\n0:53 It gives me a recommendation, pretty much talking about the recommendation, a reasoning, key factors, suggested actions. And then it also tells you that this is for educational purposes and that you should probably talk to a financial professional before making a decision.\n1:07 Which is a very important thing for this AI tool. And then it shows you a little graph of what you should do.\n1:13 And it tells you the expected return and so on. And it tells you which stocks and stuff, which I think is probably what I would use this for the most.\n1:21 Tells you the type of stocks for graphs. And it tells you type of stock for the amount of money. But again, it does say the educational, and that you should seek professional advice before you do anything.\n1:37 It also tells you the amount of confidence you always true. If you have 90% confidence, it will be like most likely 90% confidence.\n1:46 But it is AI. What if it says 100% confident? Would you really trust AI 100%? I don't know. But then you could also ask questions like, how much should I save?\n2:01 Percentage wise to retire. And then I would have to put that on a new chat retirement, and it would probably be more like this and this.\n2:16 And then it would pretty much give me like a. Significant portion of your income for the horizon. Gives you kind of broad stuff.\n2:26 Like a little more accurate stuff. Pretty much saying like the volatility, like the worst case, best case scenario, the same.\n2:33 Sort of like bonds type stuff it has before, but yeah, so pretty much this is my project and, uh, it works pretty well.\n2:41 And it has everything I need. Confidence, it has key factors, a bunch of reasoning, recommendation slides, etc. Chart tables as disclaimers, but how does AI change the user experience?\n2:59 I think that it makes it easier but harder at the same time. I think AI is very, very helpful because you can instantly type, like, a sentence or two and get an instant result.\n3:09 You can also type a very in-depth message and get an instant result on what you should logically do based on AI.\n3:16 But that's based on AI logic, not based on, like, a financial advisor logic. I feel like you still need to two-factor that, two-factor authentication with, like, a advisor, but that's just me.\n3:29 How hard, how, what was it hard about? I thought that prompt engineering was pretty hard because it didn't get, I had to type line-by-line exactly what I wanted or it wouldn't work.\n3:41 And it would kind of make its own, which was pretty annoying, but after I typed like a very long prompt and it made it, it made it so I got every type of information, all the values, everything I needed.\n3:53 The ethical considerations I needed to worry about were like, like I needed to put on the webpage, uh, about, uh, AI and that their advice is not a hundred percent trustworthy and that they are not a hundred percent accurate because if it didn't have it, I'm sure that a person could still.\n4:13 Sue this AI webpage and would win because it was not on the webpage. Would I trust this tool with my actual money?\n4:20 I thought about this for like 20 minutes. I think I would trust this tool with my actual money, but I think I would need some type of.\n4:25 Two-factor authentication, like someone like my, like a financial advisor or someone I knew that was good with it. Uh, investments and I would use them as a two-factor to see if AI, what AI I come up with.\n4:41 Sorry, let me rephrase that. If what AI came up with is good through them as well. But that's pretty much it for my project.\n4:52 You can ask it many questions about what you need for your portfolio and it, it could be based on anything gross.\n4:58 With retirement income, everything. And yeah, that's about it. Thank you. Oh, and this, this portfolio is free. For anybody 18 plus, I would say it would probably work for anybody in their 60s, 70s as well.5:11 I think that this is perfect for it. Just if you're looking to invest."
}