{
  "student_name": "Max Vogt",
  "org_defined_id": "035680961",
  "username": "vogt14",
  "email": "",
  "transcript": "Okay, so for this project we are looking at basically a decision that Netflix is making with a $5 billion content investment decision and we're seeing what kind of, if they should take on more debt or basically keep a heavy equity based company and we're going to do that. So, for Define and Discover, Netflix is evaluating a $5 billion content investment which they are considering financing through a $3 billion additional debt issuance. So for this, we're going to need to calculate Netflix's current WACC, recalculate WACC after a new $3 billion debt, determine project-specific WACC such as U.S. content and international content, compare this to Disney's 8.2% and Amazon's 9.5%. And then we're going to recommend optimal capital structure strategy. So we were using a Python program to calculate CAPM, cost of equity, after tax, cost of debt, current and post debt WAC, and WAC sensitivity versus leverage. We have some provided financial inputs such as a $200 billion market cap, a $13 billion market value debt, a $3 billion proposed new debt, 1.3 equity beta, 4.5% risk-free rate, 5.5% market risk premium, a BBB plus bond rating, a 5.8% Netflix bond yield, a 21% corporate tax rate, 8-10% industry WAC, and then we have Disney with an 8.2% and Amazon with a 9.5%. So for the represent stage, we're gonna basically we're gonna list some of the information we need And we're gonna need to use a variety of equations to find out the information that we'll be using to make our decision So for this will you using cost of equity which will estimate the return on equity investors require based on market risk We have the equation right here And then we'll do after tax cost of debt which calculates the effective cost of debt after getting the tax shield from the interest deductibility The equation is right below it right here Capital Structure Weights determines the percentage of financing that comes from equity versus debt, with the two equations below it. Weighted Average Cost of Capital, which is WAC, which combines equity and debt costs into blended required return for the firm, using this equation here. And then New Debt Amount for Post-Issuance, which basically just updates the firm's debt level after issuing new debt. So for our implement, we're using a program in Colab to basically do all of this for us and then list all of the returns from the equations. So here is my script right here. Top part imports all the tools that we're going to need. We're going to move down and it's going to list default inputs for the problem that are provided from the Textbook, and then it's going to set up the user inputs. And then it's going to collect the user inputs. It has all the listed formulas right below that. And then it's going to calculate these formulas using the collected user inputs. And then it's going to plot the graphs, and then basically print the statement of all the results that we got throughout this. So if we run this right here, we are going to just use the default Use the default values that come from the problem, and then we're going to get this return right here so we have the Just simple calculations up here. We have a whack versus leverage table, and then we have a wax sensitivity graph and So we're going to take these results. So it has a cost of equity of 11.5%. This means the expected return from Netflix equity investors reflects Netflix being slightly more volatile, which has a higher risk rate free because investors require more compensation for risk. We have an after tax cost of debt of 4.58%, which shows Netflix's cost of borrowing after accounting for a 21% tax shield. And then it shows that debt is cheaper than equity because interest is tax deductible. We have a current WAC of 11.21%, which is a hurdle rate for new Netflix investments, and then this means that projects must return more than 11.21% in order to be valid. We have a WAC after new debt of 11.13%, which is slightly lower than the previous WAC, which means that the capital structure becomes slightly more leveraged and shows that Netflix is very equity heavy. And then our WACC sensitivity table shows WACC decreases as debt ratio increases. And this kind of illustrates the trade-off of theory, trade-off theory of capital structure. And then we have our plot right here with our current WACC far to the top left. And it shows that as WACC increases, our weighted average cost of capital, or as our, yeah, as our debt to capital ratio increases, our weight to cost of capital, weighted average cost of capital decreases. So that's the relationship it has. It's also shown within the table of the WACC versus leverage data. So then moving on to the validate, we have the, we're going to calculate the cost of equity and final cost of equity to kind of, or cost of equity and current WACC to kind of validate and make sure that the program is working correctly. So here we have the equation 1.3 times 0.055 which equals 0.0715 and then we're going to add 0.045 to that and get the 11.65% which matches up with And then for the WAC we are going to do .058 times 1 minus .21 and then which will equal .058 times .79 which gives us a 4. 58% which also lines up with the program. So, to evolve this, moving on to the evolve stage, we're going to just do some analysis on this. Based on the current WAC, any project that will return more than 11.21% should be pursued. This decreases to 11.13% after the new debt, which shows that debt will slightly reduce WAC, which indicates debt is cheaper than the current equity that they have. Moderate additional debt is beneficial for financing content investment. Cost of equity versus after-tax cost of debt shows that equity is more expensive than debt, confirming the strategic use of debt can lower the cost of capital. Netflix's whack is higher than both Disney and Amazon, which they could reduce this by further increasing debt but still maintain flexibility with equity compared to Disney and Amazon. They're basically just a lot higher because they hold a lot more equity compared to those two companies. I think that Netflix should maintain moderate leverage to lower WAC while keeping flexibility. They can use debt to partially fund content investment and avoid over-reliance on equity. So moving on to Reflect, there's some things that I noticed about this and then we can move on with this. The debt issuance had a pretty small impact on WACC, which I think is surprising. This overall shows how equity-heavy Netflix as a company is. And then even with cheaper debt, Netflix's overall WACC remains high due to a large equity portion. So this overall process that we just did can be applied to any new investment or expansion project. by adjusting the data needed. Some restrictions is this model assumes a constant beta which is not the reality. The reality would lead to a slightly increased equity cost. I also think it's surprising that using SumDep can actually lower WACC even for a huge equity company such as Netflix. So overall we can just kind of allow our findings show that the effects that these have that the debt has on Netflix is kind of restricted by its heavy equity and then it's high whack and things like that are due to its high equity. So that's the basics of this analysis.",
  "video_url": "https://www.youtube.com/watch?v=1VKKsgwhpzg"
}