{
  "student_name": "Jay Saini",
  "org_defined_id": "037907174",
  "username": "saini52",
  "email": "",
  "transcript": "\"All right, so this is the session nine assignment. Um, we were supposed to calculate Netflix's current weighted average cost of capital, analyze the impact of the hypothetical $3 billion debt issuance, and then evaluate how the project-specific risks for different content types might influence that. Additionally, also to compare Netflix's WACC, which is the weighted average cost of capital, to that of Disney and broader media industries to recommend an optimal capital structure strategy. So, our first task right here was clearly define the weighted average cost of capital and its core components, so cost of equity, cost of debt, corporate tax rate, market value of equity, and market value of debt in the detail formulas below. So, Gemini here was able to kind of produce and show us exactly what we need to do. So, before we get into the code um to calculate the asset pricing model, it's going to be KE, which all of our um stuff has been mentioned up here. So, cost of equity basically equaling RF plus beta times uh in parentheses RM minus RF, where RF is the risk-free rate, beta is the equity beta, and the RM minus RF is the market risk premium that is expected to return of the market minus the risk-free return or risk-free rate. The cost of debt, which is represented in the variable KD, uh, the cost of debt is basically an effective interest rate a company pays on its borrowings. It's typically that yields to maturity maturity on the company's outstanding debt since like the interest payments are tax deductible, the effective cost of debt for a company is reduced by the corporate tax rate. Therefore, we have to use this after-tax cost of debt, which is KD uh in parentheses after tax equaling KD times in parentheses 1 minus T in parentheses, where KD is cost of debt before tax and T is the corporate tax rate. The corporate tax rate is a percentage of a company's profits paid to the government as taxes. So, its role in WACC is significant because the interest expenses on debt are tax deductible, which reduces the company's taxable income and um it becomes basically a tax liability. The market value of equity, which is represented by E, represents the total value of the company's outstanding shares in a stock market, which is typically calculated as E equals share price times number of shares outstanding. And then the market value of debt, which is represented by the variable D, it represents the fair value of all outstanding debt instruments issued by a company like bonds and loans. Overall, to get that formula, it's going to be E divided by E + D times KE plus in parentheses D divided by in parentheses E + D uh close parentheses times KD times in parentheses 1 minus T in parentheses. So, we have um right here, Gemini extracted what each component means. So, the first part of our equation right here is the proportion of equity. The second part up there is going to be the proportion of debt. The KE is the cost of equity, and then the last part of our equation here is the after-tax cost of debt. So, our subtask for this was to extract and a list and provide all the Netflix financial data and the marketing conditions such as market capitalization, total debt values, equity beta, bond ratings, yields, corporate tax rate, risk-free rate, market risk premium and all that good stuff. So, to extract that, we would have to define some uh Python variables for each parameter and assign numerical values. So, for Netflix market capitalization, we have $180 billion. For the total debt, we have 100 or $14 billion. For the equity beta, we did 1.25. The bond yield is 5%, which is the cost of debt before tax. The corporate tax rate is 21%. The risk-free rate is going to be 2%, and the market risk premium is going to be 6%. And so, then we just go ahead and print all these statements down below so you can see everything printed out nicely where with the proper formatting, as you can see right here. Then we have to calculate the cost of equity for Netflix. So, to do that, we need to use the CAPM model or formula, which provided, provides the risk-free rate, equity beta, and market risk premium. So, for that, we have the uh Netflix cost of equity equaling risk-free rate plus Netflix equity beta times market risk premium, and that uh whole figure right there would get us 9.5%. Then we have to calculate the debt for Netflix. So, with that, we again would do Netflix cost of debt after tax, which would be Netflix bond yield times one minus corporate tax rate, and with all that being computated, it would be 3.95%. Then we have to determine the market value of equity and debt to calculate their respective weights. So, here are the formulas provided for the total market value, weight equity, and weight debt, and those would the weight of equity would be 92.78%, and the weight of debt would be 7.22%. Then we need to compute Netflix's current weight weighted average of capital using the calculated cost of equity. So, using this formula right here, which is Netflix's weight uh equity times Netflix cost of equity plus Netflix weight of debt times Netflix cost of debt after tax, uh computing all that would get us 9.10%. Then we need to analyze the impact of that $3 billion additional debt issuance um that's in the prompt originally for this assignment. So, we have to recalculate Netflix's capital structure after a hypothetical $3 billion debt issuance and recompute basically every figure that we just did with that $3 billion put into place. So, the code right here, we have the uh debt issuance of $3 billion. So, we still have the very similar formulas like the ones I've mentioned up the top, um just with a few changes, and to get all that computated, our initial original Netflix WACC was 9.10%. With the $3 billion debt issuance, it's now 9.02%. So, the analysis of that is a decrease from 9.1 to 9.02, and this indicates that the additional debt, which is a cheaper source of capital due to its tax deductibility, has reduced the overall cost of capital for Netflix, and has increased the proportion of debt in the capital structure, assuming the cost of debt doesn't uh rise significantly. So, then our next subtask for this would be discussing the conceptual approach to evaluating project-specific WACCs for different risk profiles such as US content versus international content um and considering how the project risk affects those discounted rates. So, here um right here, we talk, or Gemini, I guess produced a little bit of a list to kind of see how our project risk affects the discount rates. So, we have risk differentiation, which is not all projects have the same risks. For Netflix, a documentary produced for a stable U.S. market might have a lower risk profile compared to a drama series produced in an emerging international market. There could be also higher risks, higher discount rates. So, projects with higher inherent risks should be discounted at a higher rate, which would mean the international content with potential political instability, currency fluctuations, or higher production complexities, a high project-specific WACC would be applied. And then we would have lower risk, lower discount rates. So, this would be projects with a lower, more predictable risks such as a stable U.S. content with established viewership and revenue streams. The importance of this would be accurate evaluation. So, using the average corporate WACC for projects can lead to erroneous investment decisions, applying an average of WACC to high-risk international projects. Avoiding sub-optimal decisions. So, conversely, using an average WACC might overstate the cost of capital for lower-risk U.S.-based project, and strategic capital allocation, which would be differentiating WACC based on project risk. Netflix can ensure that its capital is allocated to projects that truly offer returns um with particular level risk levels. Then our next part would be comparing Netflix's calculated WACC values to Disney's WACC values and broader media industry. So, the reasoning for this would be uh to basically define all the Disney's values so we can kind of compare and contrast. So, with the same that we used there, our the Netflix's current was 9.10. Netflix's new after the $3 billion debt insurance was 9.02. Disney's was 8% flat, and the media industry range is about from 7% to 10%, which both of the companies fit into and that spectrum. So, to get basically an analysis of these values, um Netflix's, like it said, falls around that 9%, which is currently higher than Disney's, and the difference of that can be from many things, but mostly from the business model maturity. Disney is more diversified media. Uh, with established revenue streams from theme parks, linear TV networks, and a long history of intellectual property. Uh, Disney is very branched down several markets. Netflix, which is dominant or is more of a dominant streaming player, is more focused on one thing, which is a subscription-based streaming model, which can have higher perceived or can be perceived as having a higher growth-rate related risks and competition, uh, intensity. The cost of equity, so Netflix typically has a higher equity beta, so 1.25 used in our calculation that we did, compared to a more stable company like um uh, or to a more stable company like Disney, which might have a beta closer to one or lower. And the capital structure, so Netflix recently issued more debt. Its capital structure might still be more equity heavy compared to Disney. And the second uh main thing would be that Netflix uh versus the broader uh industry would be that within the range, but on the higher side, Netflix's WACC is positioned towards the higher end of the illustrative industry range, while the overall is a little bit lower. Factors influencing this position could be Netflix's aggressive content spending, global expansion, and their highly competitive nature of streaming market contribute to a higher perception of operational and financial risk. So, to kind of just sum it all up again, um comparing Netflix's values to Disney and to just the overall industry right now, Netflix tends to be a little bit higher. Um with Disney, like we mentioned before, is because Netflix is more of a singular focused entity right now where they're focusing primarily on streaming services, while uh companies like Disney have theme parks, they have uh collaborations with apparel, merches, and they have streaming services. And um they also house other different like big companies um for instance, like the Marvel movies, like these different really big different franchises that are not initially produced by Disney that are housed in uh with Disney, and like Disney Plus with their the parent company, they have Hulu, ESPN Plus, all these other streaming services that are all connected, which can kind of add and contribute to that. Um, and then the last bit is just to kind of analyze everything again, um which is what I just talked about, how Disney overall has um a lower rate just because of how more branched out they are compared to Netflix, and while both of those companies have a different approach towards this, they both do still fall into the same range and understanding how a big debt issuance can really affect the WACC rate, and, you know, just to have that range perspective of 7 to 10%, it still kind of tells us that both companies are doing pretty well on their tracks. Um, but yeah, that was this assignment. I hope whoever's creating this, you have a great day.\"",
  "video_url": "https://www.youtube.com/watch?v=ayMfQWot4C0"
}