{
  "student_name": "Robert Dinn",
  "org_defined_id": "035870380",
  "username": "rdinn",
  "video_url": "https://youtu.be/jJLqaMoNhxM",
  "transcript": "Hi guys. Um my name is Robert Den and today I'm going to be um or this is my AI powered actuarial reserve analysis tool uh that I built using Replet and Open AI. Uh for my project I wanted something that actually works solves a real actuarial problem since I'm in actuary science and it's something employers would see and think yeah this kid gets it. Uh I used the driver framework to build the whole thing. So I'll walk through each part and show the live demo as well. Um so the first part of driver is D. Define the problem. The problem I'm solving is simple. Actuaries waste a ton of time manually cleaning triangles, calculating development factors, and building reserve summaries that non-actuaries don't understand. So in school, we learn chain ladder, but in companies, people are constantly asking, can we run it again with new data? Can you explain these results in plain English? Can you give me a quick executive summary? And most tools are either too expensive, too slow, or too technical for non-actuarial teams. So my project solves that gap by creating an AI powered reserve analysis tool that lets anyone upload a CSV triangle and instantly get development factors, IBNR, total reserves, charts, and an AI generated summary. This is something analysts, actuarial students, small insurance startups or even CFOs could actually use. So the next part of driver is the R and that's road mapap um slash approach. Uh my my approach was to build something uh interactive um easy to use not just uh calculator but an explainer. So I used Replet uh to build a front end clean modern um fintech look uh open AI um for the natural language insights a simple chain ladder uh engine that processes the loss triangle uh and then a CSV upload so users can bring their own data an autogenerated charts for visual development patterns. The idea wasn't to build a perfect actuary grade reserving engine. It was to build a tool that automates the repetitive work and adds the communication layer actuaries are always asked for. Um, and the next stage is I for implement. Uh, so let me show you how it actually works. Um, the first thing you see is the reserve analysis interface. It's clean, modern, and super simple. Um, so step one is upload this CSV. Um so um so here's the sample triangle I built. Uh accident years 2018 to 2022. Typical increasing development missing values on the right side just like um a real incomplete triangle. Um so I'm I uploaded it and instantly the app reads it and formats it uh and prepares the modeling. Um step two is choose the method. Um so when I click run AI analysis the um so I can so for now I'll only include chain ladder since it's the core of actuarial reserving but this could easily expand to um born header um Ferguson or uh Cape Cod um but we'll just do chain ladder for now um so when I run AI analysis the model calculates age to age factors cumulative LDFs uh projected ultimate losses, IBNR by year, total reserve estimate, and then the AI creates plain English uh effective summary and explains the results the way you explain them to a CFO or a board member. For example, it points out that 2018 is fully developed at 250 $225,000. Uh the development pattern is stable. uh action year 2022 uh drives most of the IBNR because it's early. Um so this is exactly the part of actuary spend time writing manually. Um so step four would be interpretation in charts. Uh the the tool also generates visual charts like reported versus ultimate um reserve by accident year development factor trend. Um this way the the user gets both the numbers and the story behind the numbers. The next stage is validate for V. Uh to validate the tool, I checked three things. Does this model produce reasonable chain ladder results? Yes, I compare the development factors to typical industry ranges, and they're stable and consistent. Uh does the executive summary sound like something an actuary would write? Yeah, it's clear, concise, and uses the right terminology without overwhelming non-technical people. Uh would someone actually use this? Actuarial students definitely would. small MGA or startup insurer. Why why not? Um even a CFO who wants a high level uh view before the actual report comes in. I shared it with a classmate and they said they'd use it uh just to practice reserving concepts. Um and then next letter is E. So there are so many ways this could grow. Um sorry. Uh some expansions include adding a bond uh Hooter\nuh running a Bond Hooter Ferguson in Cape Cod allowing multiple lines of business um in uh building scenario testing uh adding rate level adjustments or non-level factors would also be a way to expand it. enhancing dashboards without um automated reserving memos, building a historical comparison mode, deploying it so real companies could test it privately, and honestly, I'd want to turn it into a more complete actuarial toolkit, kind of like a lightweight AI powered version of ARS. Um, and so the last letter is R for reflect. Um, so what what I learned from this project is that AI doesn't replace actuaries. It replaces the boring parts of actuarial work. The real value is understanding the data, choosing the right methods, interpreting the results, and communicating them clearly. AI just makes that faster. I also learned how to integrate APIs, building a functioning interface, troubleshoot C CSV issues, and design something people actually want to interact with. Um, but yeah, now I have a portfolio piece that shows I can build something real, not just talk about it. Um, but yeah, that's my AI powered actuarial reserve analysis tool built with Replet and OpenAI. It's simple, it works, and it solves a real problem that actuaries deal with every day. Uh, thank you guys for watching."
}