{
  "student_name": "Brock Oros",
  "org_defined_id": "036147335",
  "username": "oros0",
  "email": "",
  "transcript": "Hello, I'm Brock and for the session N assignment, we're going to be learning about the weighted average cost of capital. So, our assignment overview is calculate the weighted average cost of capital for Netflix in connection with the hypothetical 5 billion content investment decision for the Netflix. And your analysis must determine the current WACC, evaluate the impact of an additional debt financing, assess project specific versus firmwide discount rates, and compare the Netflix cost of capital to industry and peers. So the hypothetical perkers we're going to get in today is the market capitalization with 200 billion. Total debt, which is the book value is 14 billion. Debt with market value is going to be 13 billion. Equity beta is 1.3. Bond rating is a BBB plus yield which is 5.8 and then uh corporate tax rate is going to be 21% and current stock price is 450. The market conditions we have today is the risk-free rate which is a 10-year treasury and that's going to be 4.5%. The market risk premium which is 5.5%. The media industry WACCC range is going to be about 8 to 10%. So that's the range they're going for for these companies. And strategic context is Disney Capital Structure is going to be 70% equity and 30% debt which has a WACC of 8.2% which is pretty good. And Amazon Prime Video uses the Amazon corporate WACCC and that's around 9.5%. So it's a little more than Disney. Netflix is considering a $3 billion uh additional debt insurance or issuance for content investment. All right. Okay. And then the required analysis is where we're going to calculate Netflix current WACC. Determine WACC after 3 billion debt issuance. Evaluate project specific WACCC. Uh compare the Netflix to Disney and explain differences. And then number five is going to be recommendal capital structure strategy. So to get into this, I have my session 9 assignment driver form. And so we're going to start with the discover and design. So the problem provides key financial information about Netflix including its market capitalization, debt levels, beta tax rate, and borrowing costs. Market conditions such as the risk-free rate and market risk premium are also given. In addition, the assignment includes competitor WCC's like uh Amazon and Disney. And this is the benchmark range or these those are included in the media industry benchmark range. So our objective today is to calculate Netflix's current determine how it changes with the $3 billion issuance, compare the discount rates and evaluate its position compared to the peers. So represents so so as we approach our analysis. So several key terms that we must be calculated must be calculate the cost of equity. We learned that last chapter and it's going to be using the CAPM formula and that is used to estimate the return of the equity investors expected taking on a taking on a risk for owning the stock. We're going to be learning about the after tax cost of debt which is uh based on the Netflix's bond yield and its effective interest rate that a company pays on its borrowings. The current WACC is using market ways of equity and debt represents the average return a company must earn to satisfy both of its shareholders and also its lenders. And then we got the revised WACC after adding $3 billion in new debt, the project specific for the US and international content and then the comparison to Disney and Amazon. And then the capital structure analysis is going to be how a company finances itself aka what comes from equity versus the debt. And then the tax shield effect is going to be the reduction in taxes a company gets because the interest payments are deductible and this is paid by the government through the tax savings. So understanding what each photo represents uh helps interpret what component uh means for Netflix investment decisions. So next what I did was I got to chat GBT and I said can you create me a Python code to paste into collab that calculates all of this information. This is the market conditions for that the hypothetical market conditions strategic context and the required analysis and then I said use the KISS principle and make it very easy to understand. Also at the end of the code include a summary section that goes through required analysis in detail and explains the answers for that. So what I got was in collab this is the code and it works. So I'll be explaining that now. Let me turn my brightness. All right. So the firm values we got all the firm inputs up here. You can change these if you want but this is what is given to us. the tax rate, market debt, additional debt, cost of equity inputs, 4.5%, 5.5%, and then the beta which is 1.3%. The cost of the debt inputs, the bond yield right here, and then the industry benchmarks, this is for the other companies, the WACC for that, and the Amazon Prime video, and the low versus the high industry range. So, our functions is going to be the this is going to use the CAPM to calculate the cost of equity. So this is the CA capm formula. It's going to return that. We got the after tax cost of debt formula right here which has the cost of debt and the tax rate. And then we're going to calculate the WACC which is all of these added together. It's the cost of equity cost of debt after tax with the WD and the WE. So this is the current WAC calculation right here. Number two is after a $3 billion new debt assurance. It's going to include the new debt total right here and then the cost debt after tax. And the new debt total is going to be equal to market debt plus the additional debt of $3 billion. And then we got the project specific discount rates. So the US content is more stable and it's going to be using a a firmer WACC. And the international content has higher political and currency risk and adds a simple risk premium on top of that. So 1% premium and then it's going to display all of our outputs and I will go ahead and oh looks it's already done here. All right. So the Netflix WACC analysis the simple output is cost of equity is going to be around 11.65%. The after tax cost of the debt is going to be around 4.58%. And the current Netflix WACCC is going to be 11.22, which it sits a little bit outside of the the 10 range, but that's okay cuz it's pretty close. And it means they're not going to be overpaying for capital. And it's pretty average in the media industry range. And this is the comparison right here. We have the the Disney and Amazon Prime right here. All right. So, Netflix cost of equity is relatively high due to it 1.3 beta. So, that 1.3 beta skews the cost of equity, which then adds a little more to the WACCC. So, after adding the $3 billion debt, WACC becomes 11.13, which is slightly lower than before because the debt is cheaper than the equity. However, too much leverage increases the financial risk for long term. So there's a bigger risk to that in the long term. Project specific discount rates, the US content is going to be 11.22 because the domestic risk is lower and international content is going to be 12.22 after adding the 1% for the risk premium. Disney comparison it's 8.2 which is lower than Netflix. And why does it have a um lower WACCC is because it's more it has a more diversified res revenue base. because it has the parks, TV, merch, films, all that. It has all the attractions lowering lowering its overall beta and risk. Netflix is more it's more of a pure play streaming and has higher volatality and higher equity cost. And then the strategic recommendation is going to be adding a moderate debt. It reduces the WACCC and can be and can help fund content, but Netflix should avoid exceeding over 25 to 30% to prevent rating downgrades. And the best capital structure is going to be a balanced leverage, enough debt to lower the WCC, but not too much to threaten the credit rating. All right. And for the last part, I'm going to go back here. We did the implement. Let's do evolve. The analysis connects WBC to Netflix long-term strategy. This includes thinking about whether Netflix should use more debt, stick to its current mix, or sorry, or rely on more equity. Overall, improving the analysis helps WACC become more than just a number. It becomes a tool to help Netflix understand its risk, plan, investments, and make better financial decisions and moving forward. And then for reflect overall the driver process creates a clear organized path for the Netflix WACC and capital strategy. It shows its current WACCC fitting inside the range. Adding a moderate debt can lower WACCC slightly. International products require a higher discount rate because there's higher risk factor. Disney's lower WACC results from broader diversification. And then Netflix benefits from a balanced mix of equity and debt. There's not excessive leverage and it's because they have a lot of diversified revenue base and by using the driver framework the entire problem is becomes easier to understand and explain. The results tie together financial the formula strategic reasoning reasoning and datadriven conclusions in a structured and meaningful way. So thank you very much for listening.",
  "video_url": "https://youtu.be/56HbWz6prFY (screen cam)\nhttps://youtu.be/xEj0KwTyFDw (face cam)"
}