{
  "student_name": "Jon Parrett",
  "org_defined_id": "037141383",
  "username": "parrettj",
  "email": "",
  "transcript": "goal was to um look at a Starbucks project and look at a cash flow from 0 to 10 years and see if it would be a good idea to open it or not. And we're going to do this using net present value, internal return rate, and um other factors. So just to define quickly what net present value is. Your net present value is your um like your net from your um your present values flowing in and out. So um inflows minus outflows and then that gives you your net present value and then your internal return rate is the discount rate at which the net present value is equal to zero. So, um, now that we know like what we're looking for and what our task is, we're going to look more at just like the numbers we were giving. So, the internal investment is 12 million. Internal working capital is 500,000. I saw something about a salvage. Yeah, project's 10 years. Salvage of equipment is 3 million. Um, so if the salvage is 39, there's some sort of depreciation. And so we want to find like the depreciation too. And then the corporate tax rate 25%, walk is 8.5%. Um, all these numbers, I mean, labor costs, sprint utilities, these are all just expenses that we're going to have to factor into our cash flows. These are annual revenues for the for the 10 years. and marketing expenses for 10 years. So, now that we have all this, we can start to build our cash flow. Um, sorry, just making sure I'm not missing something. Um, so that was discover. Now, we're going to represent. So, represent was our plan. And I mean, our plan is just to show you this cash flow um to kind of map out what we're doing. Oh, here's some more things I want to define. Um, the EBIT is your um um it's basically like your um your your money before taxes and then this is your money after taxes to define it in the simplest terms possible. Um, so these are all just okay for 00 everything zero makes sense. And then um using the salvage rate and all the other info that we had, we got this. And to quickly add um how this was refined, the first time I did it, it only gave me the first 5 years and everything else was zero. And so I just sent it back and they gave me all 10 years. So these are everything you need to look at, everything we would need to look at. Revenues are very important and these are our expenses. And so looking at our inflows and outflows, we can now look at a net present value and get a internal return rate. And um yeah, we find that our down here I lost it. Okay. Yeah. Our net present value for the base year was um 2,600,90 690,000. Our internal return rate was 12%. Okay. And then now to put it in a different scenario, we look at um um we look at if the project revenue was decreased by 20%. So obviously a lot of things are going to drop if it's dropped by 20%. Which it does. We lose $3 million in revenue and our internal return rate is 2.41%. So everything drops significantly. And then another scenario in which the walk kind of fluctuates. So 6.5 and 10.5. Um for the 6.5 we sign we find that our net present value is 4 million. And then when our walk is 10.5% we find our net present value is 1.3 million. And this is our internal return rate for the 6.5. They kind of it stays the same for both years. Okay. And in summary, um I kind of like this to look at it. This was helpful. So for the base case meaning like very normal scenarios like very average scenarios in the simulation we have a net present value of 2 million and then um for the revenue sensitivity when we drop revenue by 20% we have a net present value of 3 million and then 4 million in that in the scenario of the walk sensitivity and third 1.3 million in that scenario. So we find using all these parameters that um we wouldn't be profitable in the end. So um okay of our initial 11 $1.1 million investment working capital of 150,000 and a walk of 10% we find that um we'll lose money. So um the initial cash flow the user was obviously negative negative a million cuz we haven't done much yet but with the salvage rate and so on um we have a net a negative um net present value and this is our negative net present value. Oh sorry. Okay. And then the revenue sensitivity still have a net negative net present value. And then in the walk sensitivity, we still have a negative net present value. So these were just the parameters by the way. I don't know if I said that. Um these were the scenarios we drawn out. And so negative net present value. So in none of these scenarios, it would be profitable. So looking at the summary, the project is not recommended for approval for the current parameters due to its consistently negative net present value and the IR. Oh, I forgot to mention when the internal return rate is you want it to be above the walk. So if it's ever below it, then you shouldn't invest in it. And if it's above it, then it means it's less risky and um it's more financially stable. Forgot to include that. And that's where we're at. So, I would not get this. I would not open this server project.",
  "video_url": "https://youtu.be/rd5smm5v1gs"
}