{
  "student_name": "Ivy Fu",
  "org_defined_id": "034845705",
  "username": "fu450",
  "email": "",
  "transcript": "Hi, my name is Ivy and today we're going to talk about the driver framework um Starbucks flagship rosary investment. So if we start with the define and discover, we can find that the goal is to eval evaluate whether Starbucks 12 millions flagship rosary creates value over 10 years and recommend you either accept or reject. So our key facts is for the initial investment there's 12 millions for building equipment training straight line depreciation for 10 years uh working capital is 0.5 million upfront recover in year 10 and then we have revenue forecast of 8 million for year 1 million for year 2 to 5 9 million to year 6 to 10 and then we have operating costs so we have cost of goods sold as 40% of revenue labor as 2.5 million per year rent and utilities is 0.8 million per year. Marketing is 0.3 million in year 1 and 0.1 million thereafter. The taxes is 20% corporate rate. Terminal value is 3 million at end of year 10. Discount rate is 8.5% WACC. The objectives we have four of them. Um determine the instrumental cash flows. compute MPV, IR, payback periods and profitability index. We also want to see run sensitivity test for revenue drop and WCC changes and make a recommendation considering financial and strategic fit. So for our represent part um the c we have so first one we have cash flow timeline first one is year 10 we invest 12 million plus 0.5 million working capital for year 1 to 10 we have operating cash flows that's revenue minus operating cost minus taxes plus depreciation taxes shel and for year 10 we have recovered 0.5 million working capital plus 3 million terminal value for key mattress interests. So we have four of them. The first one is MPV, the present value of all cash flows minus initial investment. We have IRR, discount rate that makes MPV equals to zero. The payback period is the time to recover initial investment and then profitability index the present value of future cash flows divide the initial investment. We have uh risks and there's four of them. So revenue underperformance, higher financial costs and higher financing costs and the cost overruns in labor or marketing brand strategy misalignment. And then here we can click into our code. So if we see in here um there's the code that I have for this project and after we run it um we will have this Starbucks flexure royary analysis we have MPV we have IR and all the data then it has generate a graph for us for easier references and I copy it right here. So to validate our data for cash flows, we check the revenue minus cost, taxes and depreciation match, the annual cash flows and year 10 investment and year 10, oh sorry, year zero investment and year 10 terminal value plus the working capital should be correct. And for depreciation and taxes, so we have 1.2 million per year depreciation gives a 0.3 million tax shield. this applied properly in our in our section here and then we have metric so positive MPV of 3.0 3.02 million and IR of 13.25% above WACC of 8.5. So we can see here we have IRR of 13.25%. Uh we also have the MPV of about 3 million and the data is all here. That makes sense because the payback periods align with cash flow timing and the sensitivity. So the revenue drop and WC changes this affects the MPV and IR as expected when showing the model response logically. So for all the references we can check from the data that it generate for us. So all in all the model is consistent output are reasonable and it behaves correctly under different scenarios. So to involve the code that we have includes the revenue, cost and the ACC which makes testing different scenario straightforward and the graph that we have that also makes the result easier to understand and more clear to share with others. So these parts help show the numbers clearly making it easier for anyone reviewing the analyzis to see the risks and potential outcomes at a glance. The final reflex is that looking at our results, the project seems to create value seems to be good. The MPV is positive, the IR is above the hardo rate and the profitability index is over one. But the sensitivity tests show that if revenue drops a lot, um the MPV the MPV goes negative. So that's the biggest risk, the problem that we will have to look into. and changing the WACC didn't affect IR too much. So that was pretty interesting. And also if we go into the driver steps uh we can find that this helped things to get more organized. I feel that this process gives better understanding of both the financial modeling and how to think about the project risk. So all know um that's our final reflect for this project and thank you for watching.",
  "video_url": "https://youtu.be/lAxdRu-T66M?si=00baXHA7fT6VJbCZ"
}