{
  "student_name": "Tanish Kukreja",
  "org_defined_id": "036513412",
  "username": "tkukrej",
  "email": "",
  "transcript": "Hi, this is my session 10 assignment for management 310. So for this assignment, first I'll be going through our problem and the analysis we need to make. So for this assignment, we have evaluate Starbucks proposed flagship roaster that requires a $12 million upfront outlay and is expected to operate for 10 years. use the firm's 8.5% WACC as the whole rate to determine whether the project creates value and to recommend and accept/resect uh decision supported by driver documentation. So the parameters that we have for this assignment is the initial investment is of $12 million. It includes building equipment and training uh depreciated straight line over 10 years. The working capital is $500,000. Revenue is 8 u million in one year, 11 million in year 22 to5 and $9 million in year 6 to10. The operating cost includes cost of goods sold to be 40% of the revenue. Labor is $2.5 million. Rent and utilities is $.8 million. Marketing.3 million in year 1. Then.1 million. after that taxes would be 25% corporate tax, terminal value $3 million at the end of year 10. So this is all the information that we have uh regarding the Starbucks case. The requirements or the analysis that we need to make is we need to build a year's 0 to 10 incremental cash flow schedule that includes revenue, operating cost, depreciation, tax field, taxes, working capital and terminal value. We also need to calculate the net present value, the internal rate of interest, uh discounted payback period, uh simple payback period and profit profitability index. The third thing or the third requirement for this assignment is we need to run a sensitivity analysis. Uh in which in part a the revenue is reduced by 20% and in part B the um WACC is either plus 2% or minus 2%. And we then finally need to provide a recommendation that weighs financial results, strategic fit and brand implications and key project risk to see if Starbucks should pursue this project or not. So this was basically defining the issue or the goal for this assignment. So I'll be using this word document to go through the uh driver framework. So the define and discover stage was basically this that I explained the whole analysis of the problem. The objectives to determine whether Starbucks should invest the $12 million in a new flagship roaster or not. These are all the parameters that I went through uh and were given to us in the question. So this was our define and discover stage. Before going to our next stage, I'll just quickly um explain the concept that I'll be using in this analysis. So it's easier for people that are not in finance to understand this. So the net present value is the present value of the project cash flows minus the initial investment. So this is basically the value that will be provided in the project. So in this case uh as we are investing $12 million in the new flagship roaster so we'll have to calculate the net present value for this project. The internal rate of return is the discount rate that makes NBV equal to zero. So IRRa is basically the rate of return that you're expecting from this project. As we are investing $12 million into a new royal, we are expecting a return and that is how we'll measure if we should invest in this project or not. So that is why we need IRRa to calculate that. Payback period is the time required to recover the initial investment. So payback period is the period basically we investing $12 million into this project. When will we get the $12 million back? So that is why we need to calculate the payback period. the profit dability index would calculate. So say Starbucks is investing $1 um in a project. How much profit will that $1 um make per Starbucks? That is basically the meaning behind profitability index and we'll calculate the in this assignment. Hurdle rate is also WCC. Uh it is the minimum acceptable return. So the IRRa should be more than the hurdle rate which is basically the cost of capital. So the IRRa should be more than the hurdle rate then only it'll make sense for us to invest in the project. So these were the key concepts that I just explained. So it is easy as I'll be using all these concept further in the video. Okay. Now let's go to the deep present stage. 3D present we'll be using Python uh and a code in that uh that'll help us calculate all of this. Um in the code we'll be building a year 0 to 10 incremental cash flow schedule. We'll uh evaluate all of these metrics and we'll run all of these test case. The code will be in using this principle. So it's like simple to understand. Okay. In the implement stage now we'll be implementing and running this code to show and calculate all of the metrics that we need for this assignment. Okay. So in the first stage he has uh the code has all the metrics that we got from the question. These are all the requirements for making the cash flow table. So if we run the first part, we'll get this cash flows table. Okay. So this cash flow table includes everything from year 1 to 10. It includes the revenue, the cost of goods sold, labor, rent, utilities, marketing, expenses, depreciation, earnings before interest in tax, taxes, depreciation, notad, operating cash flow and at the end it gives us the total cash flow. So as we can see in the year zero, sorry. So as we can see in the year zero, there is a negative cash flow. This is because we are investing the $12 million into the new roaster. So that is why the total cash flow is negative. Now we see year 1 to year 9. We see that the cash flow is positive and is way more than the year zero. This is because we are finally getting that revenue back on the investment or the project that we invested in. And after year 10 we can see the total cash flow is way more than these years. This is because we are finally getting the payback. This is the payback. This is basically at the end of the payback period that we are getting the money back that we invested in. So this was one of the uh stages of this assignment in which we calculated a cash flow table from year 0 to 10 for this project. Next, the question wanted us to calculate the net present value. So this code basically helps us calculate the net present value. So if we see the net present value was calculated over here. So the net present value is three uh mill around $3 million. So as it is positive and this number is a great number. This shows us that we should invest in the the $12 million into this project because it is a positive number and it's greater than zero. The IRRa which was also calculated through this code over here. Yes, these were the codes that help us calculate the IR. IRRa is 0.13% so it is basically more than zero so it gives us an indication that we should be investing into our uh project over here it says strong positive net present value which means value creation so it increases the shareholder value so we should be investing in this project irra much higher than 8.5% hurdle rate so as it is 1 uh 0.13 and it is 0.85. So it's higher than the hurdle rate. So we should be investing in the project short payback period. The payback period is just 5 years and $12 million for 5 years. We'll be able to uh match our investment approximately 5 years. So I think this is a good payback period and we should be investing in this project. And the profitability index which is basically how much profit you will earn per dollar spent by Starbucks it is 1.24. So it is a good and it is greater than one. So it also shows us that we should be investing in this project. Okay. For the validated stage to ensure accuracy uh we confirmed the depreciation schedule is correct taxes are implied. So all this calculation was run on basically the concept that I explained before. So this was part of the uh valid stage in the evolve stage. The test alternatives we did. So over here I'll show you the code that helped us make this. Okay. Over here the sensitivities this code basically helped us uh answer to the this question that we have. So run sensitivity analysis for revenue received by 20%. WCC or the hur rate plus or minus 2%. So this will we'll be able to answer through this code. Now if you go over here we see base the net present value is positive so we should be investing in our project. IRR is greater than the hurdle rate so we should be investing. The payback is 5.2. 280 years profitability index is 1.24. So in the base we should be investing in this project. But if we say the revenue goes down by 20%. The net present value goes down by a lot. It's a negative. So this is the indication that if there is 20% less revenue we shouldn't have invested in this project. The payback period increases to 9.39 years. So it'll take us approximately four extra years to get our money back on the investment. So I think this case is not a good case in which we should be investing our uh money in. Say the hurdle rate goes up by 2%. The IRRa remains the same but the IRRa is lower in this case. So we still should be investing and it wouldn't affect that much. But there are many other factors that would um relate in this case in the negative if the hurdle rate is decreased by 2% then the net present value increases even higher. Uh so we should be investing in our project in that case to show this I also visualized basically this concept. So as we can see here base year the net present value is this much in negative 20% or when the revenue is 20% less the net present value goes negative. So in this case we shouldn't be investing in our project. If the hurdle rate increases by 2% the net present value goes down a little bit then the base year but it's still investable in that case and when the hurdle rate is -2% there's no issues and we should be investing in the project. So this graph basically shows us that I also made a graph um to show basically the cash flow. Um in the year one as we invested $12 million the cash flow would be in negative slowly we'll recover and we'll see that the revenue is increasing and after the payback period we'll get our money back and that is why there is a hu cash inflow. So this was basically answers to all the problems in our question. Now in the ending of the final reflect stage we see in this financial case there was a strongly positive net present value high IR and fast payback. So in this case I feel Starbucks should invest in the roaster invest $12 million but the key re risk that would be included in would be uh demand uncertaintity cost overruns and macroeconomic slowdown these are the possible risk my final recommendation would be to accept the project in all the cases except for when the revenue is down by 20%. And that would be my reasoning because the net present value goes down by a lot. So this would be my final recommendation for this project. Thank you.",
  "video_url": "https://youtu.be/hANOcpFnBzw"
}