{
  "student_name": "None None",
  "org_defined_id": "035647509",
  "username": "marsh86",
  "video_url": "",
  "transcript": "0:05 Hello, today we'll be looking over mini project number three using the driver framework. So, to start, um, we want to, uh, or a financial decision that needs.\n0:16 And it's actually, You can be specific about multiple investment options, and AI can help make the analysis for you quickly and easy to understand.\n0:40 So, looking at our tool, we have our umm, oops, sorry. We have our intelligent financial synthesis. So, to start, we have a umm, apple to look at, and then we want long term 5 plus years, you also have the option of short term or medium term, and then you can choose your risk tolerance.\n1:04 So, we'll start in the middle at 5 out of 10. So, and then it will calculate for us. And here we are.\n1:20 So, it is a 7 out of 10 sentiment score. So, it's a positive outlook on services, growth, and new product pipeline.\n1:26 So, that's our market sentiment. Then we have key news drivers. You can go to different websites and just kind of like, read through it, look at it.\n1:35 Umm. And then it has, like, more information. And then it also has a plain English translation. So, something that's easier to understand and easier to read for everybody to be able to understand, even if you don't necessarily have a background in finance.\n1:52 Um, and then you also have your risk analysis explaining whether it is good or bad. Um, and I like this.\n2:00 Also, they have the top, the analysis results. So, the current price, um, 70 change, and then our verdict to buy.\n2:08 So, I really like this because it just kind of breaks everything down into simple terms, whether or not it's good, and you can go back here, analyze another asset, and then choose another stock, um, to analyze.\n2:25 So, I believe this would be a great tool to use when wanting to invest. I believe this kind of tool would be something I would use in the future, because, um, stocks can confuse me sometimes, and it can be hard to, um, calculate them, and, like, see.\n2:40 Is this a good investment? What would it look like in the future? What does it look like now? That kind of thing?\n2:46 Um, so I think it could be very helpful. Um, to evolve, something that can make this tool more useful is adding a spreadsheet to store the data to easily come back to, and then you can also see.\n2:56 See how much option changes with time. So, um, this can help to evaluate, like, different stocks, and then also, um, compare them.\n3:06 And I think this would be helpful to, like I said, compare different stocks, and then also you can come back to, in the future, and you already have, like, the data from the past, and then see kind of how it changes.\n3:18 So, building an AI can make projects, building with AI can make projects easier, and help to build a tool faster than without AI.\n3:26 It also helps to make changes easily. However, it does not always turn out how you plan, so sometimes you have to play around with the AI a little bit, to make your tool to your satisfaction.\n3:38 So, for Loop 2, I edited the, um, tool. To make it where you can compare two stocks, so you have stock A and stock B, time horizon, again, long-term, medium-term, short-term, and then the risk tolerance, low, medium, or high, and then you can compare the assets.\n3:57 So, I already compared those. Um, it has, as an advisory caution area, and then it has our, umm, our first stock option, giving the profile much, the ratio, umm, how much it is, it gives different examples here that you can, click on, umm, and then it says that this one is the better fit, but then we\n4:20 can go to our second option, umm, the price, and it has all the same things, and then at the bottom, we have our strategic comparison, just explaining, like, why one is better than the other, and why that one would be a, better situation to go through.\n4:35 Umm, so I think this is super helpful, so that if you have two stocks that you think are really good, and a good fit for you, then you can compare them and see why they are, but what, umm, why one is better than the other, or why you should, but invest in one, rather than it, and why you should invest4:52 in the other. Umm, but yeah, so that is my mini project. Thank you."
}