{
  "student_name": "None None",
  "org_defined_id": "037593398",
  "username": "white977",
  "video_url": "",
  "transcript": "Hello, I am Harry White and today I'll\nbe going over my mini project 3. Um, so\nfor our mini project 3, we had to build\nan AI tool that can help us\num, analyze or explain something on a\nfinancial decision using AI to complete\nthis. So for my discover, I chose to\nexplore specific investment goals over a\nperiod of time and why one should invest\nin certain stocks and choose certain\nrisk strategies. Um, basically what I\nmean by that is, let's say I have a\ncertain amount of money saved. I have\n$5,000 saved, but I want to buy a car in\ntwo years that's worth eight grand. I\nwanted to figure out what my best course\nof action investment wise was. Um,\nbasically excluding any money that I\nwould save up just from working or from\ndoing anything. I wanted to purely uh\nclose the gap between my savings and the\nmoney I needed to purchase the car\nthrough investments. So, uh I also said\nthis can be used for personal finance,\nbut it can also be used to help others\nand can even be sold. Um yeah, for my\npersonal finance, I wanted to build a\ntool that could do this and you know, an\ninvestment that would um or a portfolio\nthat would compound in the certain\namount of time and give me a good chance\nof being able to purchase the thing I\nwant to in a few years. It can also be\nused to help other people and could be\nsold if it is worked out more. um you\nknow, saying like if somebody else wants\nto buy a house or something big in three\nin 10 years and they need to save\n$100,000, this could help them out. Um\ninvestment advice for certain saving\ngoals, valuable information in choosing\ncertain stocks to invest and need an uh\nin need of an explanation. It can be\nhelpful in scenario like this. I have\n$10,000 saved, but I want to buy a car\nthat is $4,500 more than I have right\nnow in three years. What do I invest in?\nThat is what I tackled today for my\nreason. How can AI make this smarter? AI\ncan be used to find stocks and give\nvalid explanations behind each choice.\nCan also provide multiple strategies and\nrisk options by utilizing the financial\ninformation given. It also makes it very\neasy for this to use this tool for\nprofit because one can type in an\nindividual's information and the tool\ncan immediately send the information\nfound. So this was another aspect I had.\nI wanted to make the tool be able to get\nsend this information to somebody if it\nwere to be used for profit or even if I\nwanted to it can send it to my email.\nSo, uh I wanted AI to tackle this very\nquickly. It's you just type in your goal\nand it will help you out. Um but yeah,\nimplement going into my work right here.\nThis is my code. This is my AI tool that\nI built. Um, it has the chat message\nreceived, which I type in the\nconfiguration, the investment\nparameters, and then our generator right\nhere uses our OpenAI chat model and a\ncalculator to calculate the investments\nthat it wants me to put in, how much I\nshould put into what, and the\nexplanation behind each stock and why it\nchose to invest in that. Um, it also it\nch if it's a long-term goal, it changes\nwhat it invests in rather than if it's a\nshort-term goal. For example, if it's in\nif I want to compound this in 2 years,\nit'll invest in things that are more\nthat have more risk. But if I want to\nsave up for something large like a\nhouse, it can um over a period of 10\nyears, then it will invest in something\nsafer, but that's something that will\nstill make your money. And my output, it\ngoes to an email. It sends an email. I\ncurrently have it hooked up to my\npersonal email, but um you can type in\nanybody else's email and use this to\nsend it to them. Kind of as what I was\nsaying before, it could be used as a\nbusiness tool or something that people\ncould use to sell this information or\ngive investment advice to people through\nthis. So, um I'm going to go over this\nreal quick, but as you can see, this is\nmy personal email, and there's currently\nno emails from this in here. This is the\nlast email I have. So, let's say uh I\ncurrently have uh my current savings. I\ncurrently have $12,000 and I want to buy\na car that costs $18,000\nand I want to buy this car within four\nyears.\nSo,\nthis was the situation I have right now.\nYou type that in and it will calculate\nwhat I need to do and the personal\ninvestments that I should make. Um,\ncurrently, yep, just give it a second.\nIt will work.\nUm,\nyep. Doing the math.\nOkay. So, if you go over here now, I\njust got received this email. There's my\npersonalized investment guide created by\nmy AI tool. Um, so, yep. My current\nsavings, the target cost item, and a\ntime frame of four years. Step one, the\ngap analysis. you need an additional\n$6,000.\nUm, you have 48 months to save. So, you\nneed to save $125 per month. The\ninvestment strategy recommendations that\nwe are given, uh, your time frame is\nmedium-term, 3 to seven years. So, this\nallows for moderate risk-taking within a\nmix of growth stocks and index funds.\nSuch investments typically offer a good\nbalance of growth potential and risk\nmanagement. Uh, our risk assessment,\nmoderate risk tolerance is suitable for\nyour 4-year horizon. aim to build to\nbalance growth and stability and avoid\noverly volatile or very high-risisk\ninvestments to protect principle over\nthis medium time frame because I don't\nneed this in a short time. It is four\nyears and thinking about it $125 a month\nis not a large investment. It's not like\nI'm trying to save up for a house where\nI would need to save hundreds a month or\nsorry, not save but rather make hund uh\nthousands or hundreds $500 a month in my\ninvestments to save up for this. Um,\nstep five, expected returns.\nHistorically, a balanced portfolio of\ngrowth stocks and index funds might\nyield around 6 to 8% annual returns.\nCombining these with disciplined monthly\nsavings helps meet your goal potentially\nearlier or with more financial cushion.\nand I could have more than the $18,000\nwhich obviously would be perfectly\nideal. Uh so step six, this is where we\nget into the specific stock and ETF\nrecommendations that we are given. Um\nfirst is Vanguard VTI is their ticker\nbut Vanguard total stock market ETF.\nThey want me to place 40% of my uh what\nis it? $12,000 into this and a projected\nreturn uh annually of 7%.\nAnd then uh the what do you call the\nrationale or the explanation behind this\nbroad market exposure and diversified\ngrowth. This will help me. This is one\nof the safer options but it is still\nexpected to return very well for me. And\nthen our next uh the next stock it tells\nus to invest in is Schwab US dividend\nequity ETF 20% which is expected to\nreturn 6% annually. Uh it focuses on\nstable dividend paying DOC reduces vol\nuh volatility which this is the safe one\nright here. It helps me out. I'm still\nreturning an expected 6% annually but it\nis not like I'm going to lose the money\nI place into this very likely. Uh triple\nQ the third part of the portfolio it\nasks for 20%. It is Invesco QQQ trust.\nIt's 8% return annually expected. It\ntracks tech heavy NASDAQ\num and it's good growth potential. You\nknow, this is one of the riskier ones I\nwould say in this portfolio, but still\nexpected to return good annually and you\nknow, it's very great potential for\ngrowth as it says right here. Uh and\nthen BND, the Vanguard total bond market\nETF of 20% of my portfolio. This is only\nexpected to return 3% annually, but the\nbonds provide income and reduce risk.\nAnother safe step. So that is the\nportfolio recommended to me to place my\nmoney in ex and it specifically says for\neach one how much to place in each bond\nand stock and ETF. Um the summary and\nimplementation.\nThis will save me approximately $125 a\nmonth. Uh it will invest savings in the\nproposed ETF proposal. Sorry. In the\nproposed ETF portfolio for diversica\ndiversification and growth, it adjusts\nallocations yearly based on market\ncondition and risk uh personal risk\ntolerance. Expected portfolio growth\ncombined with monthly contributions\nshould help you achieve the $18,000\ntarget within four years. Um yeah, so\nthis relies on me contributing\nmonthly, which I will plan on doing if I\nwant to purchase an item like this. So\nyeah, that is my tool right there. Um,\nfor my verify step, I think this tool is\nvery helpful. It explains how much uh it\ncost allocated in each stock and why\nthey chose the stock. Gives a short\nrundown of each stock and how much to\nplace in it and what it expects it to\nreturn annually. Um, this was very\nhelpful for me because I just don't want\nthe tool to give me a list of things to\ninvest in. I want to know if I should\nplace the majority of my portfolio in\none stock or ETF and then riskier\nstocks, put a smaller portion of my\nportfolio in there. Um, I think the\nemail aspect of the tool is very\nhelpful. Uh, you can help out friends,\nother people, you know, you know,\npotentially use it as a business\nproposition. You know, you can say,\"Hey, I mean, people pay a lot for\ninvestment guides and personalizedinvestment tools.\" So, this is something\nhelpful because you just type in their\ntheir uh their situation and what they\nwant to save for and very quickly it can\nsend you an email of what it recommends.\nUm, yeah, the tool can help people save\nmoney to purchase houses, cars, or even\nreach investment goals over a period of\ntime. If they want to, you know, double\ntheir investment, double their portfolio\nin 10 years, this can help us out very\nmuch. For my Evolve, what would make\nthis tool more useful? Um, I think it\nwould be more useful if I could give\nmultiple options for investments. Uh, I\nwent over a couple times tweaking the I\ndid tweak this a bunch. You know, it\nstarted off with just a chatbot and this\nright here and it was only really giving\nme what to stocks to buy and what um, it\nrecommended, but it didn't put in how\nmuch uh, you should buy of each stock\nand what and what the explanation behind\nit. Um, I tweaked it so that it would\ngive an explanation based off each stock\nand then it would give a summary of uh\nthe situation you're in and how it plans\non reaching your investment goal over\ntime. But if I could make it better from\num what I have currently, I would\nprobably give it mult I would probably\nchange it to multiple paths or multiple\nsuggestions. Whether you know you have\nthis right here, but then you have\nanother one on the bottom to choose\nfrom. So the individual that does\nreceive this email can do their research\na little bit if they want and choose\nwhich um plan of action they like\nbetter, they prefer.\nUm\ncan also give also another thing I might\nchange in the future uh give specific\ninformation from the tool what uh why\nspecific information on why they chose a\nstock regarding financial documents,\nfinancial statements and you know market\npatterns and tendencies. Um it does give\nshort rundowns of each stock and why it\nthinks it's a promising thing to invest\nin. But I would like to see, you know,\nmaybe hear about uh something that the\ntool found on financial documents or\nsomething that they found in market\ntendencies that gave them the reason to\nput this on and thinks it's a promising\nstock to invest in. Um it does use the\ndata. It just does not go into detail\nabout the data it uses in the response.\nJust a short rundown. But uh I tweaked\nthis a few times\num and I like where I'm at right now.\nbut it can definitely get better. And AI\nis an extremely helpful aid for my\nreflection. It's an extremely helpful\naid for building tools such as the one I\nbuilt to map out personal investments.\nIt could complete tasks such as pulling\nout financial documents and predicting\nmarket patterns in a fraction of a time\nit would take someone to do. Um, if I\nwere to do this, I would have to\nresearch the market, research all kinds\nof different stocks that there are and\nsee which ones show the most promise in\nthe future and then also send it to, you\nknow, bunch all this information up. Um,\nchoose how much I want to allocate per\neach stock and then send it to the\nperson I would need if I'm sending it to\nsomeone else. The the tool does this in\na fraction of the time. It only took\nabout 15 seconds for it to calculate my\ngoal and my uh plan of action that it\nrecommends me to take. Uh it also\nautomates the process of creating\ninformation and sending to the desired\nindividual. Uh instead of researching\nstocks and bonds and creating the\nportfolio and then sending it to\nsomeone, all one has to do is input\nthree pieces of information, it is\ncompleted. So yeah, AI is very helpful\nespecially in this project for me. uh it\ndid take a lot of tweaking to do because\nit can give you confusing information at\nfirst or not enough information and not\nexplaining the choices behind why they\ndecided to put this certain stock in\nyour portfolio and recommend you to\ninvest in it. But um over time, you\nknow, I tweaked it for a couple hours\nand now I'm at here and I think I'm very\ngood and I think AI helped me out a\nbunch and it can be a very helpful tool\nand I do plan on using this in the\nfuture for my own personal investments.\nUh whether I have a goal of buying\nsomething or not. Let's say I have\n$5,000 saved and I want to invest that\n$5,000, but I don't want to keep it in\nthere for a long period of time. and I\njust want to multiply that or add, you\nknow, make a 50% return on it over 3\nyears. This could help me out very much\nand give me in-depth explanation on why\nit shows that each stock. Thank you."
}