{
  "student_name": "Adisyn Nichols",
  "org_defined_id": "037075344",
  "username": "nicho307",
  "email": "",
  "transcript": "Hi, I'm Madison Nichols. This is my session a assignment. So, starting with the define and discover portion, the goal of this assignment is to perform a case study on the GameStop short squeeze event of 2020 to 21 and and use that to investigate market efficiency. So, the first claim we have to explore before we start with anything is that GameStop traded at 4 cents in August 2020. This is not true. So looking quickly at Yahoo Finance, we can see that it's all above $1. That statement isn't true. So for the purposes of this assignment, we're going to use the historical data because we know that's what's accurate and true to this event. So looking at the timeline, in August 2020, GameStop is near bankruptcy levels. In September 2020, Ryan Cohen acquires 13% stake. In January 2021, the prices surged to $483. And this is because of a Wall Street gamblers or bettererss um kind of hurting thing. And then February 2021 there are congressional hearings on market manipulation. And then in the present there are postevent price stabilizations. So short interest peaked at 140% a float. Um retail trading volume increased 10fold during the squeeze. Trading restrictions implemented at the peak by Robin Hood. Hedge fund Melvin Capital sustained 53% loss requiring bailout bailout or bailout sorry and then analyst fundamental value estimates $10 to $40 per share. So starting with the background of the EMH the hypothesis this says that stock prices reflect all available information. So the weak form is that prices reflect all past price and volume information which means the technical analysis or patterns won't work. Semi form says that prices reflect all publicly available information which would mean that fundamental analysis doesn't work. And then the strong form is that prices reflect all information including private information which would then not lead to insider trading. So moving on to the represent portion. What we're trying to do is market efficiency testing. So we're going to test the semi-strong form of the EMH. And what we're going to do is we're going to look at the year leading up to the event to determine their normal behavior and then the short period around that event. So then from that period leading up to it, we're going to kind of determine their expected return and try to find their beta based off of that and the normal relationship to the market and then with that calculate the expected return during the window and then find the abnormal returns which we do by doing actual minus expected return and analyze that. So a couple more key concepts information in corporation is the speed and accuracy at which new information reflects the assets price. So some shortcomings of EMH is that it assumes that humans are perfectly rational economic agents and some site behavioral biases as reasons to reject it. So some of those can be overconfidence. You think you know more than you do. Anchoring so you're being stuck on a piece of information like I bought this at $200 and I don't want to sell it until it's at least $200. So hurting is just following the crowd. Um kind of bandwagoning. So that's kind of what the Wall Street bets driven price surge was caused by loss aversion is just that you don't want to lose money and then mental accounting. So say I get a $1,000 tax return. I don't I may not treat that as real money because that's not money that I planned to have. So then it's kind of free reign and putting into the market. There are also some anomalies in the market. So momentum um tendency for stocks that performed well in the past to continue performing well contradicts the weak form of the EMH which basically says that if that is true then the patterns shouldn't be able to tell us anything. Value effect which is that value stocks outperform growth stocks over the long run. Similar thing with size effect with small capitalization versus large capitalization companies. And then the calendar anomalies. So in January there's January effect which stocks have unusually high returns. Um there's also an asset substitution problem. So if a company is in debt, equity holders don't have anything to lose because the debt holders are those who get paid first. So equity holders now have an incentive to substitute their safe assets with risky assets. Um and then limits to arbitrage are the reason that apparent inefficiencies can persist in markets. Um, so there are two kinds of investing we define active and passive. So if you do not believe in EMH, you are an active investor. So you're going to look for mispriced stocks and try to exploit biases to beat the market. But if you do not believe in it or if you do believe in EMH, you're a passive investor. So you're probably going to buy lowcost index funds like the S&P 500 because you're not going to think that you can beat the market. So moving on to implementation. Um there are some there's some Python code to go over this. So essentially starting off what this will do is it's going to implement all the historical data that is relevant to our analysis. So we'll just see some outputs that are available to confirm with what we see on Yahoo Finance which will come in the validate portion. So that's what these are for. And then what this block of code is going to do, it's going to create a time series for um the GameStop's close price in relation to key events. So what we see is that on this graph, we see a big spike in the close price during this short squeeze peak and then immediately at its peak, Robin Hood implements those restrictions. So then we see it go down, then it goes up again. Um, so we see this like very volatile graph. It's going up and down compared to previously where it was a pretty flat line, pretty low. And then we also see this with the trading volume. There's a lot more trading activity during that short squeeze peak um which does go down after those restrictions are implemented. So that's just kind of the visualization of these um of this timeline in relation to what was happening with the price. So we see their near bankruptcy levels and then suddenly there's a price surge based on the Wall Street bets. Um and then we see it go down after that as restrictions are implemented and there are congressional hearings. Um and then from that what this code is going to do it's going to calculate log returns. What this is all for is to try to extract a beta from the previous behavior. So it's just a lot of statistical work. Um and then you'll see the output as the log returns. And then what we're going to do is we're going to estimate beta from that um through a regression. So it'll have it kind of how confident we can be in it. And based on this, we do see a pretty decent level of confidence um with the regression results. And then we see that it estimates the beta as being about 1.1581 um against the spy. So what we're going to do with that then is we're going to calculate the abnormal and cumulative abnormal returns. So this will use the beta that we um extracted from the regression to find what we would have expected the returns to be during this short squeeze event and we're going to visualize that. So that's what we see through this code and then putting that into a graph. So we see that previously it's pretty normal. It's close to zero a lot of the time and then when the short squeeze happens we see a lot of movement and then a similar thing with the cumulative returns um close to zero and then suddenly it goes up. and how we interpret this. Um so in a semi- strong efficient market all public news like the short interest because we know from the context that um there was short interest peaked at 140% a float that would assume that that should be priced in instantly. So there should be in this cumulative returns chart one jump on the day of that news but instead we see it continuously climbing for days and we see it kind of moving a lot which um violates the semi- strong form of the EMH because that should have been priced in instantly if that were to be true. So moving on to the validate portion. Um, what I chose to do for this is compare the downloaded data points from here into the um to the Yahoo Finance. So, just to validate that what we're doing is correct, we see that in August 2020, it says that the minimum low price for GME is 1.0. And then we also see that right here in the Yahoo Finance chart. And then for these we see the adjusted close in January. Um so for example on the second it's 1.5 something. Um which is consistent with what we see on Yahoo Finance. So that's how I did the validate portion. So that way we know that the values I'm using in the code and what it's importing are accurate. So for the evolve portion apply efficiency insights to investment strategy. Since this um event kind of contradicts to EMH, one of the better investment strategies in my opinion is the core satellite structure. So 80 to 90% of your stock is going to acknowledge the EMH and that it's correct and you can't beat the market. So you would put that in lowrisk funds like the S&P 500. But then that other 10 to 20%, you kind of acknowledge that the EMH may not be correct. um which is kind of what we see with this example and use that 10 to 20% to explore the inefficiencies in the market and try to exploit them for better returns. So that would be able to take advantage of situations like this where the EMH doesn't necessarily seem to be true but also acknowledging that it can be and keeping that risk kind of um measured. So for the reflection part, in conclusion, this event does not support the EMH um based on the way that we see the cumulative abnormal returns behaving because it is so varying and not just one jump. It's not priced in immediately from the news. Um we it doesn't support the EMH. So as a reflection, I was not really familiar with this hypothesis before and what it meant. So being able to explore the different types of the hypothesis and also including some more statistical knowledge with the um with finding the beta was very helpful. Um but we do see mostly overall with our goal of performing a case study to investigate market efficiency that the EMH does not appear to be consistent with the semi- strong form based on this event. Thank you.",
  "video_url": "https://youtu.be/-JruEFFPemQ"
}