{
  "student_name": "Ryan Date",
  "org_defined_id": "037312318",
  "username": "rdate",
  "email": "",
  "transcript": "Uhm, my name is Ryan Date and welcome to my session 8 assignment to just jump right into things, uhm, starting with the D method of the driver method. Pardon me, the D portion of the driver method, define and discover, uhm, a quick factual correction of the GameStop timeline. Uh, GameStop did not trade at 4 cents in August 22, or in August 2020, pardon me, as the assignment suggests at the beginning of Per Exchange Historical Data, uh, GME closed at around $1.67 on August 31, 2020. And in late August 2020, it traded for roughly $1.20 to $1.80 intraday. Uhm, I have a screenshot for you. From the Yahoo Finance data displaying that information with the highs of the day, the lows of the day, uhm, and the closing price along with some other information. Uhm, so I just wanted to address that data point to begin with. Now moving on to our goal, it's to assess whether the GME episode is inconsistent. With market efficiency, the various forms of market efficiencies, uhm, identify the anomalies and evaluate rational profit opportunities. Uhm, and the key discovered facts that we can use as inputs here are historical prices, uh, the short interest at around $100,000. The Robinhood trading restrictions, the Ryan Cohen stake announcements, the Melvin capital losses. Uh, the massive retail trading volumes and social media coordination. For the represent stage, I just wanted to. Create a chart displaying what happened with the, with the, uhm, GameStop surge. So here you can see. January 11th, um, active investor, Ryan Cohen joins the GameStop board. It's about 13%. Um, and over the next couple days, the stock price triggered a short squeeze, further driving up the price. Uhm, At this point, January, uh, January 20th, around there, uhm, Reddit users on r slash WallStreetBets joined up forces. to buy the still heavily shorted GameStop shares, and the short sellers are forced to abandon their positions and buy up GameStop. GameStop shares, losing billions in the process, uhm, on January 27th, and at this point the stock is up 135%. Uhm, and then around January 29th of February, the stock tumbles as the frenzy dies down and it's cash in. Uhm, so some noteworthy things here. GME's price rose dramatically in mid-January to late-January 21, uhm, from about $10 to $20 to $300-plus in a few days. A very large data percentage change. For example, one week in January, it returned, uh, about 236%. Extreme volatility. And trading volume spiking in the squeeze phase. Uhm, now, to test what forms of volatility. The market efficiency were violated in my represent stage. I created this chart with the, uh, form of efficiency. Uhm, and the status during the GME event, and the explanation explaining, uh, why that violation, or lack of, lack thereof, was concluded. Uhm, so for the weak form, efficiency, I, we, I, with the assistance of AI, I concluded that it was partially violated, uhm, temporary momentum and speculation. For the semi-strong form of efficiency, it was completely violated, uhm, prices detached from the public fundamentals, uhm, and for strong form efficiency, it was not clearly violated. There wasn't an insider report. There a driver advantage detected and it was more mispricing due to behavioral factors. Now for the implement stage of the training. I have created Python code to examine the GME search. The code takes data from sources such as Yahoo Finance to create an analysis of the stock trading price as well as compare it to a benchmark such as a NASDAQ. Uhm, this code can be seen in my collab notebook which is displayed here. Just to sort of walk through the code. Right at the beginning it sets the parameters, uhm, and identifies the event dates to test, at which point it then fetches the data from the outside web. sources, this requires internet, uhm, then it uses the adjusted close returns, uhm, and it computes the daily log. Then it creates an estimation of market model, uhm, and an event study function. After that, it creates, er, it runs the event studies for each event, and produces data outputs, which can be all be seen here, and then there's some additional analysis, autocorrelation, uhm, predictability to predictability. Measuring squeeze, uhm, and then it plots the price and the volume for the January 2021 period. Here is a chart that I created showing the events of January 2021. Of the GameStop stock compared to the Nasdaq. And as you can see, the Nasdaq. Uhm, increases in value very slowly, but steadily. Uhm, and the, GameStop stock shoots up in January 2021, uhm, has a lot of volatility, a lot of unpredictability. And then comes back down to a reasonable price by 2022, really. Uhm, and what this displays is the year. Here on the x-axis and the indexed price, uhm, base 100 on the y-axis. And the red line is the GME stock, obviously, and the blue, the NASDAQ. Now, moving on to the verify stage, the fee stage of driver. Some observations or an empirical summary of what we found, uh, huge abnormal returns, right? Returned thousands of percent in late 2021. Uhm, an example would be in the month of January, it went from about 17,000 to to intraday, uh, to intraday highs of $483, which is absurd. Uhm, extreme CAR is inconsistent. Normal pricing dynamic. Uhm, and for predictability and momentum, a large positive, or, or, sorry, there are a lot of large positives. Positive autocorrelations and momentum were evident during the squeeze. Returns were not, uhm, random walk-life, or walk-like in general. Uhm, and then for information incorporation, the market did react to some public fundamentals. Uhm, such as the Ryan Cohen 13D filings, leading to earlier price rises, but the Reddit-driven rally appears to be, to reflect coordination and social momentum, and mechanical short-squeeze dynamics beyond the, uh, new fundamental information. Uhm, looking at the market micro, microstructure effects and trading holds, broker restrictions, and, and clearing house margining, uh, materially changed who could trade and when, and this interrupted natural price discovery. And looking at the interpretation versus EMH, uh, weak EMH was violated in the short run during the squeeze. Past intraday returns helped predict near-term future returns due to non-fundamental buying pressure and forced short covering. For semi-strung inmates, it was partially violated. Uhm, public disclosure. Disclosures like 13th D were incorporated, uh, as expected, but public social signals and coordinated retail actions created persistent outbursts. I have no more terms that were not immediately arbitrage in a way arbitrage the way also supported. Supply constraints, uhm, with short interest greater than 100% mean, mean prices move mechanically rather than. Purely on new fundamental info undermining the semi strong predictions. And for strong images not supported. Private insider info or monopolized info is always possible. Uhm, sellers and buyers, buyers with privileged access. can help perform, but it's just not, uhm, evident here. Uhm, the bottom line is the GME episode behaves like this. Like, a failure of weak or semi-strong image in the short run, but many mechanisms help explain. Why markets fail to immediately correct prices. Um, some of these are limits to arbitrage, supply constraints, and market migration. Moving on to the E stage of Driver, involve behavioral finance explanations, looking at what we saw. Uhm, we saw hurting and social contagion, right, right at social, right, and other social media platforms created, uhm, coordinated. Buying and social reinforcement with, like, likes, the upvotes, all that narrative, and this produced information cascades. Uhm, overconfidence and gambler's fallacy. Uh, retail traders were willing to accept high prices. High risk for outsized upside and community signaling. And limited attention to insalient narratives. Stick it to Wall Street narrative. Amplified participation beyond fundamentals. Looking at would rational investors profit? One of the central questions, uhm, for this assignment. Some traders profit massively ex post, but systematic. Profit opportunities were limited and risky. You could be run over by momentum or kind of the wrong side of the squeeze. And. Arbitragers faced unlimited short risk and liquidity, uh, liquid, liquidity constraints. Overall, risk-adjusted returns were not reliably positive for passive arbitrageurs, and given tail risk, and margin-level dynamics. The evidence for this is hedge funds, such as Melvin, incurring large losses. Uhm, up to 53% in January, despite being on the right side, economically, for long periods. And for the final stage The GME episode shows that market prices can diverge sharply from fundamental value for extended periods. When social coordination creates sustained buying pressure, uhm, supply is mechanically restrained, and market structure, Frictions limit arbitrage. Uhm, and behavioral models and market structure frictions explain a lot to, ah, explains the hurting, limited attention, short squeeze mechanics, and liquidity margin constraints together. Uhm, proof of producing the observed outcomes without invoking conspiracy. And looking at active versus passive management. For most investors, this episode supports limits, supports the limits of active management in dealing with social media driven events. Active managers who try to arbitrage face extreme risks with some large firms lost heavily for a small sum of money. A subset of traders who timed the moves well. Outsized gains were possible, but timing and luck played large roles.",
  "video_url": "https://youtu.be/CbyuuLni0-0"
}