{
  "student_name": "Evan Sleeth",
  "org_defined_id": "038072973",
  "username": "esleeth",
  "email": "",
  "transcript": "\"Hi, my name is Evan, and this is my capital budgeting analysis for Starbucks' proposed $12 million flagship roastery. I built the model in Google Colab using Python and followed the DRIVER framework step-by-step.\" \"The core question is whether Starbucks should invest $12 million today for a roastery expected to operate for 10 years. Starbucks' 8.5% WACC is the hurdle rate. My objective is to build the incremental cash-flow model, calculate NPV, IRR, payback, and profitability index, run sensitivity analysis, and make a final accept/reject recommendation.\" \"In Discover, I gather every assumption: Revenue: $8M in Year 1, $11M in Years 2–5, $9M in Years 6–10, COGS at 40%, labor $2.5M, rent $800K, marketing $300K in Year 1 then $100K. The $12M investment depreciates straight-line, taxes are 25%, working capital is $500K invested in Year 0 and recovered in Year 10, and there's a $3M terminal value. These inputs drive the entire model.\" \"Before coding, I outline the model: calculate yearly revenues and costs, compute EBIT, taxes, and NOPAT, add depreciation, include working-capital changes and terminal value, discount everything at 8.5%, then calculate NPV, IRR, payback, PI, and run sensitivity tests for revenue –20% and WACC ±2%.\" \"In the Implement stage, I translate that plan into Python. The model automatically builds the full Year 0–10 cash-flow table, calculates free cash flow, discounts it, and computes NPV, IRR, payback, discounted payback, and profitability index. Because all assumptions are parameterized, the model updates instantly for sensitivities.\" \"To validate the model, I confirm Year 0 free cash flow is –$12.5M, reflecting capex plus working capital. The cash-flow chart shows the expected pattern: negative at launch, strong positive inflows during operations, and a spike in Year 10 from WC recovery and terminal value.\" \"In the Evolve stage, I run sensitivity tests. When revenue drops 20%, NPV and IRR fall sharply—showing revenue risk is significant. When WACC moves ±2%, NPV changes but stays positive, meaning the project is less sensitive to financing changes than demand.\" \"In the base case, NPV is positive, IRR is above the 8.5% hurdle, PI is greater than 1, and payback occurs well before Year 10. Strategically, the roastery strengthens Starbucks' premium brand experience. Despite revenue risk, both financials and strategy support an ACCEPT decision.\" \"This concludes my DRIVER-based analysis of the Starbucks roastery project. Thank you for watching.\"",
  "video_url": "https://youtu.be/m6047Aa_RF8"
}