{
  "student_name": "Yanxi Liu",
  "org_defined_id": "038231480",
  "username": "liu4186",
  "email": "",
  "transcript": "Hi, I'm Yanxi Liu, and this is my Session 9 Assignment. I followed the DRIVER framework. In the Define & Discover stage, the goal is to clarify exactly what needs to be calculated and which concepts are required. The central objective of this analysis is to understand Netflix's Weighted Average Cost of Capital (WACC) today, to see how a new $3 billion debt issuance would change that WACC, and then to interpret what these numbers mean for Netflix's capital structure and future projects. The first concept is that WACC is the average return that a company must offer to all its capital providers, both shareholders and debt holders, in order to compensate them for the risk they take. Next, we will use the Capital Asset Pricing Model (CAPM) and define the after-tax cost of debt. With the concepts in place, we discover and record the specific input parameters for Netflix. The market value of equity is assumed to be $200 billion, representing the total market capitalization. The market value of debt is $13 billion, which is more appropriate than book value because it reflects current financing conditions. Netflix's beta is taken to be 1.3, indicating that the stock is 30% more volatile than the market. The pre-tax cost of debt is 5.8%, based on the yield of Netflix's BBB+ rated bonds. The corporate tax rate is 21%, representing the U.S. corporate tax environment. The risk-free rate is 4.5%, proxied by the yield on a 10-year U.S. Treasury bond, and the market risk premium is assumed to be 5.5%. Conceptually, we are choosing market-based inputs and current yields because we want WACC to reflect the current opportunity cost of capital, not historical accounting values. In the Represent stage, we translate these definitions and inputs into a clear sequence of computational steps. First, we calculate the current capital structure. Second, we compute the current cost of equity, using CAPM. Third, we calculate the after-tax cost of debt. Fourth, we plug the calculated weights and costs into the WACC formula to obtain Netflix's current WACC. Finally, we extend the representation to consider how a $3 billion debt issuance would change the capital structure. We define a new debt level while temporarily assuming that the equity market value remains unchanged. This produces a new total firm value. We then recalculate the new equity weight and the new debt weight. In the Implement stage, when we run the calculations with the current inputs, we find that Netflix's total firm value is $213 billion, consisting of $200 billion of equity and $13 billion of debt. This leads to an equity weight of approximately 93.9% and a debt weight of about 6.1%. In other words, Netflix is overwhelmingly financed by equity; it uses very little debt compared with many other large companies. Using CAPM, the cost of equity comes out to around 11.65%. This is relatively high and reflects Netflix's high beta and growth-oriented, volatile business model. The after-tax cost of debt is much lower: starting from a 5.8% pre-tax yield and applying the 21% tax shield gives a net cost of about 4.58%. This big gap between the cost of equity and the cost of debt is the fundamental incentive for using some leverage: debt is simply cheaper, especially after taxes. Combining these costs with the capital structure weights, the Python output shows a current WACC of about 11.22%. That number represents the minimum average return Netflix must earn on its investments to compensate all investors and preserve firm value. The implementation is then repeated under the scenario where Netflix issues $3 billion of new debt. Total debt rises from $13 billion to $16 billion, while equity is still $200 billion. The new equity weight drops slightly to about 92.6%, and the debt weight increases to about 7.4%. Again, assuming the costs of equity and debt remain unchanged at 11.65% and 4.58%, the new WACC falls modestly to approximately 11.13%. The key insight here is that adding a moderate amount of cheap debt lowers Netflix's overall cost of capital, because the firm is substituting a small portion of expensive equity with cheaper, tax-advantaged debt. In the Validate stage, we check whether these numbers make sense by comparing them to industry benchmarks and peer companies, and by interpreting the differences. The analysis reports that Netflix's current WACC is 11.22%, and that the post-issuance WACC is around 11.13%. By contrast, the media industry WACC range is estimated to be roughly 8% to 10%. Disney, one of Netflix's closest content competitors, has a WACC of about 8.2%, and Amazon has an even lower WACC of around 9.5%. This comparison shows that Netflix's cost of capital is materially higher than its peers and above the typical industry range. The table and explanation highlight several reasons for this gap. First, there is a capital structure difference. Netflix finances about 93.9% of its value with equity and only 6.1% with debt, while Disney uses a more balanced structure with roughly 70% equity and 30% debt. Because debt is cheaper, this higher use of debt allows Disney to lower its overall financing cost. Second, there is a risk difference embedded in the equity beta. Netflix's beta of 1.3 is higher than that of a diversified, mature conglomerate like Disney, so CAPM assigns a higher cost of equity to Netflix. The explanation also notes that Amazon's lower WACC is linked to its massive scale and diversification, which spreads risk across many businesses and allows it to borrow at relatively low yields. This validation step confirms that the calculated WACCs are consistent with economic intuition: a company that is more volatile, more growth-focused, and more equity-heavy should indeed face a higher cost of capital than diversified peers with more debt. In the Evolve stage, the analysis moves beyond just computing WACC and asks how these insights should change the way Netflix evaluates projects and structures its financing in the future. First, it questions whether using a single firm-wide WACC of around 11.22% for every project is appropriate. The conclusion is that this is only valid if every project has the same risk as the average firm. For Netflix, that is unlikely. Different content and technology projects have very different risk profiles. For example, U.S. content targeted at a well-understood domestic audience tends to face lower regulatory and currency risk and may have more predictable demand. As a result, its appropriate discount rate might be lower than the firm-wide WACC. In contrast, international content is exposed to foreign exchange volatility, local regulations, censorship, and varying piracy risks. These additional uncertainties might justify a higher project-specific WACC. The analysis suggests that if Netflix simply uses the firm-wide 11.22% figure for all investments, it might over-accept risky international projects and under-invest in safer domestic content, leading to misallocation of capital. The Evolve section then considers capital structure optimization. Since Netflix's current structure is described as \"significantly under-levered,\" the firm may be paying an unnecessarily high WACC compared to peers. The recommendation is that Netflix should gradually increase its leverage to move toward an optimal range of around 20–30% debt-to-capital, similar to Disney. The analysis argues that, up to that point, the benefit of the tax shield and cheaper debt outweighs the incremental risk of financial distress. The hypothetical $3 billion debt issuance is presented as a first step in this direction: it nudges the capital structure toward higher debt, reduces WACC from 11.22% to around 11.13%, and thereby increases the value of future cash flows. Because Netflix currently holds a BBB+ credit rating, the conclusion is that it has sufficient borrowing capacity to pursue this strategy without immediately jeopardizing its financial health. In the stage of reflection, WACC is driven by both business risk and financing choices. Business risk is captured by beta, which feeds into the cost of equity, while financing choices appear in the relative weights of debt and equity and in the tax shield on debt. For Netflix, the main reason its WACC is high is not only that it operates in a volatile, growth-oriented sector, but also that its capital structure is heavily tilted toward expensive equity. This creates a core trade-off: equity financing offers high flexibility and no mandatory payments but comes with a high required return of about 11.65%, whereas debt financing imposes contractual obligations and covenants but has a much lower after-tax cost of roughly 4.58%. For the proposed $5 billion content investment, the post-issuance WACC, around 11.13%, becomes the minimum hurdle rate the project must exceed in terms of expected return in order to create value. However, because not all content projects share the same risk, the firm should consider adjusting WACC for project type, distinguishing, for example, between U.S. content and international content. By combining a more efficient capital structure with project-specific discount rates, Netflix's management can make more disciplined decisions, avoid overpaying for risky growth, and maximize shareholder value over the long run. Thank you.",
  "video_url": "https://youtu.be/aj3JBZl0ccg"
}