{
  "student_name": "Isaac Buche",
  "org_defined_id": "036112318",
  "username": "buchei",
  "email": "",
  "transcript": "Hello, this is Isaac Bushy and this is my session 8 uh assignment for management 310. So jumping into it, we want to define what we're what we're here doing. So our first critical step here is to verify the statement that GameStop traded at four since the shared in August of 2020 um against actual historical data. If incorrect, document the accurate figures and determine the appropriate comm communication approach for correcting the professor. So this shows us our little event timeline here of um what's going on in the market during that time. Gives us some key data points and some of our required analysis here. So the first thing that I immediately jumped into was was figuring out if this statement was correct. So over here I'm in Google Finance and if we go to it was August of 2021 or 2020 I believe. Yes, August of 2020. There's August 7th, 2020. It's sharing at approximately a$14. So a whole dollar above what the claim is in um in this statement here. So, um, so this this originally this right away is wrong. Um, and then we're going to want to move in to looking at this spike that they're talking about. So, if we look this up, the this right here, this spike that they're talking about here is something I've written into my code here for my um implement session. This spike is shown right here with within GameStop's trading value. This is that time. This is around January of 2021. And the price rocketed because of because of information from that time. So it was a big thing. Um it completely changed this the trading price is it rocketed and then plummeted again later. So overall my initial statement here is that as part of the initial um validation step all price data was sourced um through um Google finance and while the prompt noted that it was four it's trading at 4 cents a share in August 2021 the verified split was at a around $14 as we saw when we looked at it at August 7th. So, this analysis proceeded using the verification um with those data which the the peak price being $483 pre-split on January 20, 2021. And this I did confirm um GameStop did peak out of at at close to $483 um during its time in January of 2021. So moving into our the project goal here, our present stage, we're trying to figure out um how we can represent this and how we can show this within a um within our code here. So this is what I created. Um this is what I continue to work on to find um our our EMH testing. So we use this code in Gemini just to understand just to code it through here just to understand what um give a kind of a visual on what we were looking at. So um and all these prices within this is is through public information. I found this all through Google um Google finance. So, as we move in down through this data, we kind of talked about it earlier. Um, so this graph just shows the adjusted price of of GameStop throughout um and then kind of its overall graph kind of similar to what this is here. And um it shows some peaks. This is our all-time peak up here of January 2021. And it just kind of shows the the ins and flows of the adjusted price down here. This is the graph that um I find extremely helpful. This is the graph that shows that that that shows that super high peak of um from the Reddit um price comparatively and then it sees if you go down here you can see your um how the stock price is super low comparatively um and then it rockets up and then it does settle back down completely. So it it completely shows the the massive spike and the mass and then the and then the um plummet. Um so it val it completely validates that that the $483 was correct. So um through this we learn a bunch about um about GameStop and how it's and its stock price traded. So we kind of go back into this required analysis and just to answer some of these questions. So we verified that all this data price and we we did that we figured out that that that the 4 cents was wrong and that the 483 did that that is accurate and it did come in. Um test which form of market efficiency weak semi- strong strong was violated. So we through this we find that the uh the weak form violation was violated. Um it claims that all past trading data is already reflected in the stock price making technical analysis use useless. So the the GameStop um trade clearly violates this. The entire uh Reddit subreddit um thesis was a form of technical m momentum and analysis arguing that the past price suppression and the high interest created a predictable future price and it just didn't. this the um the behavior was just not like that. It just was driven up and down completely. So the semi that that creates that the semi- strong form violation was clearly um violated as well. These semi- strong um claims that publicly available information, news, Reddit posts, things like that is instantly and accurately priced. Um this was um clearly violated through the high short interest the 140% float this says was public and that Ryan Cohan's um investment was public. So this um the market contractage was neither neither instant nor accurate. Instead of the price moving to a new rational fundamental data, it became completely detached from it driven by social sentiment. The price of $483 did not reflect GameStop's earnings potential. It reflected a market mania based on public information. And then moving could moving to the next question. Could rap could rational investors have profited systematically? Um the key word here being systematically and the risk adjusted um from GameStop here. So this would all just be this would all just be dependent on the investor. I think it would be extremely hard um for rational investors to have profited. It just they just have to know because it was so um in and out. Um so I think overall it would be extremely hard and then compare um efficient market hypothesis predictions to observed behavior. So by doing this we look at the um the price versus the fundamental value. So prices are set by rational investors and reflect the asset's true worth and then the observed behavior being the price had no connection to fundamental value. The 483 it was driven entirely by um supply to NAM and like in the online and things like that that that was just going on during that time. Um it was not set by anything within it. Um so that's like one major thing the differences between these um um conclusions. So just some um wrap up some closure here. Clearly um these statements were wrong um or at least the the four cents was wrong and this investment strategy um was something um this this market efficiency investigation was something um very important and very interesting throughout because especially GameStop as a company um I reflect on that because GameStop as a company now is completely it's kind of going out in these like weird market like highs and then lows and then now it's like getting like super down comparatively. So like GameStop's just like if we go here, yeah, GameStop's just losing. It's negative down, down, down. And then like we go to the month, it's just it's just plummeting compared to like compared to like what we're looking at here when it rock when it skyrocketed up like even that's 5 years ago. So I think this was like this was a very interesting market analysis like how we can learn from this and um how we can go from this. But thank you. Uh this is Isaac Bushy and that's the end of my uh assignment.",
  "video_url": "https://youtu.be/jo2ja72sehs"
}