{
  "student_name": "Gage Pittman",
  "org_defined_id": "037005578",
  "username": "gcpittma",
  "video_url": "https://youtu.be/K-CAhizg8oI",
  "transcript": "Hello, my name is Gage Pitman and today I will be walking you through this app that I created to analyze real estate and compare. So, just to kind of walk you through how the app works, you copy and paste the URL from the listing and it autogenerates as you can see listing price, the monthly property tax, HOA fees if any. Uh, and then here you can input your credit score, your annual gross income, uh, your closing costs, which are set to standard 3% of purchase by default, but you can always change as they change. Down payment is also automatically put at 20%, but you can obviously change that as the amount that you put down may vary. and it will tell you also how to create the investment analysis for house flippers or for people who look to rent out real estate. So, this one we used the 70% rule where we take the ARV times the 70% minus repair cost to determine if it's a good investment for a house flip. And then the 1% rule, which is just is the is the amount uh is the mortgage being covered by the rent? And in this case, we see that both of those fail. However, if you determine that the after repair value is more, so as we see listing price is 145,000.\n\nIf we believe that, you know, we can get this value up to 200,000.\n\nLet the app do its thing. Okay. Still still doesn't meet the the 70% rule. So, you have the loan summary here. Let me get myself out the way. Try\n\nSo we see the loan summary. It has our list price, the down payment, which we can change if we wanted a different uh monthly payment. So as we see with our current interest rate, this is the amount of interest we pay, our current income. This is our debt to income ratio and our estimated monthly payment. However, if we were to be able to put say 25% down.\n\nThis is 24%. As we can see, it dropped our monthly payment by nearly $100. And I wanted a comparison feature. So, we can save this property.\n\nOkay. And now it's saved for comparison. And let's go ahead and show you how hauling a property works.\n\nSo we head over to Craigslist. Find us a house. Okay, this one looks good. We will copy this link. Head back over to our app.\n\nPaste it in here. Enter. Let the app scrape. Now, when I was creating the app, I ran into a lot of problems because a lot of uh real estate sites uh block scraping. So, there was a lot I had to go through and eventually came to the term that smaller sites such as Craigslist, which still offer real estate investments or properties as you can see. So, pasted this one in our listing price, monthly property tax, our HOA fees, still credit score, gross income, closing cost, down payment. Let's see. All right. This one is within our our monthly income. It's affordable, but it still doesn't meet our investment analysis.\nAnd we can always save this one so that we can compare it to our previously saved. And now the app can save up to 10 properties. And currently we have two for comparison, but we could always add more. and it'll tell us our better investment property. This is very useful for people looking to invest in housing or even if you're looking just to just to buy if you're trying to get ideas. But uh I do have a friend who is in real estate and she actually is interested in using this tool. So it's useful."
}