{
  "student_name": "Gurpreet Multani",
  "org_defined_id": "036767359",
  "username": "gmultan",
  "video_url": "https://www.youtube.com/watch?v=YO0SxQBw2AU",
  "transcript": "So here we have session 12 assignment where we have to make a full evaluation of Panera Brad for prospective KKR takeover using driving method. So we'll run through this pretty quickly because my last video was like 20 minutes. So we'll try to do this quicker. We begin by the with the define and discover stage by identifying the decision decision maker and the known facts. Here we have everything that listed in the snapshot created into a table right here with the items and values separated. Then here we have the representation. So we have to make assumptions over using some of the snapshots given because they don't provide none of the taxes or percent revenues for Panera Bread in here just these things right here. So we have to look it up and include it. We'll be creating the scenarios for downside base and upside as well. And then here you see the growth the EBIT margins and the synergy percentages for downside base and upside. Then we get into the implement process of operating projections and free cash flow. See provides all the formulas and then it creates a table for all the scenarios for downside base and upside. As you can see revenue grows at different rates across scenarios. In the downside case, revenue grows at 5%. Um, in the base case, revenue grows at the given 8%. In the upside case, revenue grows at 10%. And you can see what they all reflect like the downside one reflects slower store expansion. Base uh is just represent the 8%. The upside case is reflecting successful execution of growth levers such as the new store opening, digital expansion and catering.\n\nThe EBIT TA\n\nis uh they evolve over time as well as you can see current 15% margins and transitions toward the margins by year five. In the base case, margins expand modestly due to higher digital mis mix. In the upside case, margins expand further due to operating leverage and efficiency gains. And in the downside case, margins are compressed due to cost pressure. The the free cash flow is calculated using the standard corporate finance formula. Operating profit after tax plus depreciation minus capital exponentials minus and change capitals. So that's that. And then we go on to the discounted cash flow and terminal value. So you have each scenario and then the enterprise value at the end.\n\nThis produces an enterprise value for each scenario. The downside case reflects weaker execution. Base is uh the the base is moderate and then upside has the most value. So for a financial buyer like KKR the base case DCF serves as the primary valuation anchor because it reflects standalone cash flow generation\n\nand the upside case like I said reflects strong execution and limited synergies. So the base case represents the most realistic outcome right here. Then we go into trading comparables and precedent transactions. You got the financial buyers and the strategic buyer saying. So we analyze the trading comparables using price to earnings multiples from the industries like McDonald's and Chipotle. We chose Chipotle instead of Starbucks. We analyze the price of transactions using the EBITDA multiples of 12 to 15 times applied to Panera's $900 million. This produces an enterprise enterprise value of a\n\nof what is it of dollars and EBITDA. You see all this here too as well. So trading comparables they uh you see this too. The trading comparables they uh provide market context while present transactions reflect actual takeover pricing. Together they serve as important reference points for the DCF results. So anchors on standalone DCF can pay for synergies does not the finance by that does not pay for synergies. This negative is I thought it was negative. So 60 million EV ITDA synergies lower integration risk 810 million synergy EV 10% management rollovers alliance incentives that's a higher integration risk then you have the evolve recommendations you have the evolve which is the end so we had to come up with the executive recommendation for Preer badge so the valuation range DCF EV range is\n3 million 3.934 million then 9.25 million present EV range 10,800 million 13500 million. So the strategy would be that KKR should anchor at the base case DCF value of 5,896 million EV. A disciplined walkway price is approximately 8,348 million EV. Strategic buyers may rationally pay more due to synergies and KKR should maintain financial buyer option, financial buyer discipline. So overall the the base case scenario is the best one to use, the most realistic one to use. Yeah, that's all."
}