{
  "student_name": "Angel Guadarrama",
  "org_defined_id": "037977947",
  "username": "guadara",
  "email": "",
  "transcript": "Hello everyone and welcome to my session 10 video. Today we will be discussing cost of capital analysis. So essentially we are going to evaluate Starbucks' proposed flagship rostering that requires $12 million of outlay and is expected to operate for 10 years. Using the firm's 8.5 WACC as the hurdle rate to determine whether the project creates value and to recommend and accept or reject decisions supported by driver documentation. So what are the parameters? Here we have the parameters. Initial investment of $12 million, building equipment training, depreciated straight line over 10 years, working capital of $500,000, supply at launch and recovered in year 10, Revenues of $8 ,000,000 in year 1, $11,000,000 in years 2-5, and $9,000,000 in years 6-10. Operating costs, costs of goods sold, 3 % of revenue, labor is $2.5,000, rent and utilities is $0.8,000, marketing is $0.3,000,000 in year 1, then $0.1 ,000,000 thereafter. Tax is of course going to be 25% corporate rate, terminal value of $3,000,000 a year at the end of year 10. So we want to focus our analysis on producing a transparent cash flow model, core capital budget metrics, sensitive tests, and executive rating recommendations. So what I did to answer is I had Google Germany assist me to come up with a comprehensive capital budgeting driver framework to ensure disciplined, sequential, and transparent analysis culminating in an executive ready recommendation so first one is finding discover so we want to evaluate the proposed road street project that requires a 12 million inch outlay you know as determined earlier this is your criteria in the present value wrote using a hurl way of 8.5 WACC so to go our discovery key parameters we have the initial investment of 12 million the life expectancy of 10 years project duration of course WACC of 8.5 percent this required this is a required rate of return the hurdle rate corporate tax rate of 25 percent we have our working capital of five hundred thousand dollars terminal value of three million and appreciation method is straight line of over ten years next we want to represent what this all means so we have to come We have to use our core formulas, such as the annual depreciation, which is equal to initial investment divided by the project life. In this case, it's 12 million divided by a 10-year lifespan, which comes out to be $1.2 million. That's for the operating cash flow, which is the easiest method. It's going to be our revenues minus our operating costs minus the depreciation times 1 minus TE plus the depreciation. And for our textured method, we have the net present value, which is our negative initial outlay plus the sigma of OCF t divided by 1 plus r the power of t, so on and so forth. We are going to use all these different formulas, and we must define the cash flow components as well, such as year 0, 1, 9, 10. So to calculate the total net cash flow, we have to do our OCF plus capital spending plus the changes in WC and plus adding our total value. Next we want to implement this. So we want to calculate annual operating cash flow. So for year 1, our revenue was eight million dollars as discussed the cost of goods holds of three percent of that which is 3.2 million the operating expenses 3.6 million depreciation of 1.2 the ebay about zero taxes of 25 percent million zero and ni zero as well and operating cash flows plus depreciation is 1.2 for years two through five our revenue was a million 11 million dollars which makes our costs sold about 4.4 million the operation expenses is 3.4 depreciation is the same our eBay has a rise to two as for tax has arrived to 0.5 the NI has rose into 1.5 and the OCF operating cash flows has jumped up as well into 2 .7. Figure 6 through 10, revenues 9 million, cost of goods holds 3.6, operating costs 3.4 as you can see so on and so forth. So our operating expenses labor is plus the rent slash utilities plus the marketing because our operating expenses and we wanted to call within that final net cash flow schedule for years one through ten so this is what it looks like is our operating cash flows for each year if there was a change we noted the change with terminal value which is only sort of in year 10 the NCF or discounted factor or PV of NCF and accumulated PV if you wanted to calculate our core capital budget metrics so we have the NPV NPV which is the sum of PV's and NCF's which is a result three million dollars and twenty one thousand dollars nine in our IR where our rate where NPV is equal to 0 is it going to be about 13.43% simple payback time until cumulations if is greater than 0 is 7 plus 1.8 divided by 1.8 which is comes out to be about 8 so your time into cumulative of PV is less than 0 is 8 plus 0.1855 plus or divided by 0.8637 which comes out to be roughly about 8.21 years so for our profitability index is going to be at 12 million plus 12.5 million plus 3.0 to 1 9 million divided by 12 .5 million originally which comes out before validated from this check decision rules so mpv is going to be about 3.02 million since mpv is greater than zero the project is value creating of course IRR is 13.43 percent since IRR is the 13 .43 percent is greater than the WACC with about 8.5 percent this project should be accepted and for our profitability index with about 1.24 cents PI is greater than one and the project should be accepted all these core metrics unanimously unanimously support acceptance. The discounted payback period of 8.21 years is long but acceptable given for the 10-year period. Sensitivity analysis. We test the NPV sensitivity to most critical values, revenue and WACC. Our base case is a 0% change, while our new NPV has 3.02 million. And a percent change in NPV is not said, but for our revenue drop is about 10%, making a new NPV of negative 0.24 and a drastic change of 107.9% negatively. For our WSEC, it has increased by 2% to 10.5 % with a new NPV of 1 .76%, making our change in NPV negative 41 .8 percent as for the decrease is going to be negative 2 percent so that goes down to 6.5 percent for a new NPV well our percent change in NPV is going to be plus 48.3 percent so the interpretation of this is the project is highly sensitive to revenue projections a mere 10 percent drop in revenues across all years caused the NPV to turn negative of about $0.24 million, as discussed earlier, indicating a significant risk. As for the WACC, the project is less sensitive to WACC changes, even if the cost of capital jumps to 10.5%, the project remains. Value-creating NPV of about $1.76 million. To evolve this, based on the sensitivity test, the primary risk is revenue shortfall. shortfall the firm must focus marketing efforts to ensure revenue meets these projects projections particularly in particular in the critical years 2 .5 when the cash flows are highest and it's just $300,000 marketing expense in year one seems low given the 12 million investment in the high sensitivity revenue actionable of our recommendation so increase the initial market budget to $800 ,000 to mitigate their revenue risk we will not rerun the model but this highlights a potential post announced action to reflect on this discipline progression through the driver framework ensure all cash flows components such as OCF depression tax shield WC internal value were correctly handled and aggregated the NPV calculation was transparent and the sensitivity announced to succeed and then it successfully identified revenue projection as the major vulnerability transforming a simple accept slash reject decision into an informed strategic recommendation. So our decision is to accept the Flagship Roadstreet project. And here's the little table as to why. So starting to accept as NPValue Fathers at 3.02 million and IRR at 13 .43%, significantly exceeds the WCC. It's viable. Strategically fit, you know, flex your brochures are branch anchors that showcase Starbucks pre -immunization strategy. It's got positive brand implications and key project risks are revenue sensitivity above 10%, drop in expected revenues causes MPVs turn negative. This is the primary financial risk that we must discuss. This requires aggressive front -loading marketing and robust contingency planning for sales targets and for a final recommendation we must accept the project with budget and increased contingency funds for enhancing marketing efforts in the initial two years to do to de-risk the revenue projects. The strategic and barren benefits of the roastery likely outweigh the moderates financially risk identified. And so moving on to our coding part of this, I simply asked Google Jonah to help perform a capital budget analysis versus finding financial parameters, you know, as we kind of discussed earlier today. initializing the final schedule, calculating revenue costs, periodation, EBITDA, EBITDA, tax, NOPAT, OCF, operating cash flows, CAPEX, and working capital changes that computes free cash flow, subsequently, calculate key financial metrics such as the net present value, internal rate of return, profitability index, and discounted payback period, and and so on so forth so it had to find parameters I gave it the information lifespan of ten years through ACC so we discussed earlier next we want to initialize the financial schedule data frame with relevant columns so we have revenue cost of goods sold labor costs rent costs working costs depreciation so on and so forth and we want to calculate the property and populate the revenues cost of goods sold we have you know all these data columns based on the defined parameters so we're just inputting our values all right data then we want to implement straight line depression for the investment over the 10 years ensuring the asset depreciation to zero dollars i need to calculate the annual straight line depreciation by dividing the initial investment by the project's life and then populated depreciation column in the final schedule for years of one through life now next we have to calculate the EBIT DA EBIT tax and no cap so we must compute the earnings but before interest taxes depreciation and amortization earnings before interest and tax EBIT tax expense using the private tax rate and then the operating profit after tax so we will calculate all this for each year in the financial schedule ensuring that tax is not by if EBIT is negative as per the instructions so plugging this all in so we come up with our changes in working capital next we want to calculate our operating cash flows so i need to do this for each year for 1 to the end of the lifespan, project duration by summing EBIT, depreciation, and subtraction tax from the financial decision data frame that populates the OCF column. Next, we want to calculate the CAPEX in working capital changes. we must reflect the initial investment in working capital outflow and the recovery of working capital in the final years in the final year i should say i just need to update the cpx and change in working capital columns in the financial schedule from year zero to ten as per the instructions next we want to calculate the free cash flows by computing free cash flow for each year using our formula we are able to define the data frame within their appropriate cash flow signs then I will be able to calculate and add the terminal value to the free cash flow rate in the final year as you can see here finally want to calculate the final metrics financial metrics we want to calculate the personal value internal rate of return profitability index of we discussed earlier so i had google chat when i compute this coding for me so it would come up with a net present value of five million the internal rate of 225.62 percent profitability index of 47 percent the discounted pay back period of 0.4 years play schedule metrics so we wanted to print the complete financial schedule data frame and then calculated financial metrics mpv irpi discount a paycheck in a clear and readable format so basically we predict the entire financial schedule data frame into here next we implemented sensitive analysis function to create a python function that takes adjustment parameters mpv scenario defined Let's execute the sensitivity function for the three separated scenarios for the MPV for different scenarios. Finally, let's visualize the sensitivity analysis. The MPV sensitivity analysis shows our base case of the net present value is pretty high compared to the revenue shock, which is much lower than any of them. For our WACC volatility low scenario, it's very high in the NP net present value scale. And our WACC volatility, which is our high, is times a third. So this is basically a graph representation of this information that we just calculated for the different scenarios using tax rate investment working capital terminal values revenue per unit unit sold per year revenue growth and so on and so forth and this is my videos thank you guys for watching see you guys next time",
  "video_url": "https://youtu.be/quposVsI0eI"
}