{
  "student_name": "Leon Francis",
  "org_defined_id": "037379655",
  "username": "franc103",
  "video_url": "https://youtu.be/13ymQ8laqzQ",
  "transcript": "This is my response for homework 11. So let us start off with the define and discover stage. So after reading the assignment given to us and the information, I realized that our goal for this assignment was to evaluate whether Apple's $90 billion share repurchase is worth it for creating enough value and balancing stakeholder incentives. So let us look at some of the key information that was provided to us. Um so apart from the basic requirements from this assignment, we also have some key information which helps us with the analysis to be done. So we have the capital allocation snapshot. So we know how the liquid how the Apple company's financials are separated. So we have the liquidity with uh $165 billion in cash and investments whereas $100 billion of annual free cash flow uh income. So in terms of the market, we have a $185 share price with a um PE value of 30 and dividend yield of 0.5% and 15.5 billion shares which are outstanding. Additionally, we have other information in terms of how much debt Apple has right now, how much Bergkshire Hathway, which is a uh investment based company and how much they own of Apple. So that accounts for 6%. We're also told that the CEO of Apple uh holds 3 millions of shares. So this connects back to the U stakeholder incentives making CEO one of the stakeholders who will be impacted by the decisions that we take as the company. Then we have retail investors which average 100 shares and employees who have 170 uh strike options. The proposal again is that um yeah $90 billion payback executed over one year. So over the course of the next year, Apple is deciding to spend their $90 billion um allocated income to repurchase shares. And here are some of the alternatives that we'll be looking into. So here is the required analysis and I'll be going through each of these um individually over the course of implement and the evolve stage. So let us start off with the represent stage. So what I want to do in this stage is set up a stable platform in terms of the information provided to us so that we can have a concrete um place for us to jump upon and do the analysis. So if you run the code um this is just a simple code. So it's all based on formatting and printing statements. We have a clear and brief summary of the information provided to us. Again we have the liquidity of $165 billion annual free. We know this as well. Um the buyback proposal the main uh information to remind us is the amount or keep in mind is that the amount is $90 billion. The time frame is one year and the estimated impact is 10% of market cap and some informations about the key alternatives and stakeholders. So we have the three different stakeholders the investors in the terms of a company Berkshire Hathway. we have the employee options and the CEO. So let us now move on to the implement stage. So in this stage here is where we do the actual calculations and all the different things. So to start off with the code we have the required information. So we have the cash balance all the given information we're just putting it up here. Um and then we come to the bas calculations. So we have EPS which refers to earnings per share. So how much earnings or shares is giving the stakeholders? This is calculated by the share price divided by the price to equity ratio. Then we have the net income which is EPS times the total number of shares. We also have the market cap. This is the price times the total shares. So these are just comments which are telling us a briefly what the equations actually mean. So ROIC is actually return on invest investment capital. So that is calculated by the net income divided by the debt plus equity market cap minus the simplified um share value. Then we have the leverage ratio and that's just total debt divided by the annual free cash flows. So here we have the base scenario or the scenario we're actually analyzing. So this is just and under this scenario we're just calculating the shares that will be repurchased using the amount of money that we have allocated for the project or initiative. We have the new EPS as the earnings per share will change upon the buyback um plan being taken up. We have the projected price buyback value as well. So all these have each of the different equations and I'll don't I won't go too much in detail because we'll see the outputs as well. And then we also have the different scenarios in terms of a special dividend because we know an alter we know that even though this is a hypothetical um step to be taken by Apple there are alternative uses of cash flows in terms of $6 special dividend which we know will likely make the investors more happy because they're getting they're getting a higher earnings from these stocks themselves. um and then other debt reduction opportunities and acquisition and R&D growth. So if we run the code, we are given the EPS on the baseline. So right now without taking any any different um steps, we have a EPS of $6.17. U Berkshire Hathway's ownership in Apple is still 6%. The leveraged ratio debt divided by the free cash flow is 1.1 and the return on investment capital is 3.21%. So let us look at the main step that we're planning on taking. So this is scenario one which is the buyback or share repurchase step. So with the amount of money we spend uh we'll be able to repurchase um almost $486 million. So 0.486 486 billion and the new share count would be um 15.014 in market because we know uh currently there are 15.5 shares outstanding. So if you buy back 0.486 486 makes sense the new EPS will actually increase and we know going back to the equation for EPS um it's earnings per share so it's share price divided by price to equity ratio and I'll be adding on to how the share price is affected as we know if you link back to you know the basics of economics the less supply there is in the market the higher the price is so with the less supply of shares in the market the price actually goes up and this will impact the stakeholders in a certain way and I'll get into it in a in a bit. So as I said EPS increases the projected share price also as I said increases to 190 from the current 185. Um, in terms of stakeholders, Berkshire Hathway's ownership rises to 6.16%. CEO's wealth also increases by 18 million because their shares are worth more. The employee options also rise in value by 20.99 per share. And the equations for this are right here in the Yep. Employee option value is the maximum of the projected price buyback minus employee option strike and then so on. And in the scenario two which is the special dividend the payout per share would be 5.81% 1% when we are offering a 6 $6 special dividend and the EPS will not be impacted in this case because shares don't really depend or are influenced by uh dividends uh share earnings about uh stakeholders retail 100 shares. This is another stakeholder we're looking at actually receives a check for $580.65 $65 and this is including the uh $6 additional um dividend that they're getting from the uh alternate use of cash flow by the company Apple. Debt reduction. This is actually the most lowrisk one because there's no um uncertainty of how things are going to go in the market, how businesses or other uncontrollable factors will impact the revenue of Apple and debt reduction. And as we know, Apple currently has a debt of $110 billion. And by reducing this debt, it offers the same offers a safe way of uh using the money or cash flow of $90 billion. So new debt would decrease and it'll be 2020 $20 billion. And the leverage which was around 1.1 previously, now it's just 0.2, which is again a sign of low risk. and the bond this actually impacts the bond holders rather than the stakeholders because it's not as as I said it's not changing the EMS um it's just impacting the risk associated with the debt of the company so for bond holders the risk is reduced which is great and then the credit rating is secure because there's no uncertainty or volatility associated with their bonds since the debt is lower strategic acquisition Um it's strategy fit is high. So it allows for entry into new markets which could lead to better uh revenue and better uh business because you're entering new markets and there are many possibilities there. And there's also a new return on invested capital of 3.53% because obviously you're investing money into um you know new AI and VR acquisition which are new technologies which are coming up in the world and the risk is high because we're not sure whether we're not 100% certain that the uh spending would give us business or give us more revenue. So that's a risk that the company should be willing to take in the case that they do decide to um go into the path of strategic AI and VR acquisition. So just to validate um one of the things I wanted to do was just look at the certain equations that the code is giving us. So EPS is net income divided by the total shares outstanding. And this is actually a different form of EPS um equation which also gives the same uh value as well as the EPS equation here is the share price divided by the price to equity ratio. So it just goes to show how there are different ways to calculate different elements in financial um yeah in in the world of finance. Yeah. um ownership and this is more um directed to the um Berkshire Hathway scenario because their uh ownership percentage actually increased. If we go back here, it went from around um let me just make sure I'm looking at the right thing. Yep, it went from yep 6% to 6.1 9%. And that increase is calculated by the shares owned by the investor divided by the total shares outstanding. And since this total shares outstanding value goes down, obviously the shares uh the ownership percentage would increase. It's the same here. EPS also increases because we know total shares and goes down. So basically the denom denominator in both of these equations is going down which makes the subject or the metric in question higher. For the evolve stage, I just want to focus on some visual elements and other uh analysis that we can do to help make our analysis more concrete. So, if you run this code, this is also quite a big code and it's using the same type of equation. So, I'm not going to focus too much on the code itself. But to focus on the analysis, this is a EPS impact. um let make sure I'm saying the name right. Yes, EPS path in other words of how each of the different scenarios will impact the EPS uh metric itself. So we know that buyback is actually giving us the highest uh EPS or earnings per share which is $6.37. And we know these three this is baseline so we don't want to focus too much on that but that's just for like a comparison sake but we know the dividend and the debt paid on don't impact the EPS. So we see how the buyback would be the best case scenario in terms of increasing uh earnings per share to help out the stakeholders um and the acquisition while it does increase the earnings per share from 6.17 to 6.35 it's not as effective as um the buyback option of $90 billion spend into repurchasing shares. And while this may be a small difference in terms of the lot scale of how many shares and how much money we're talking about, that small difference could um you know make a great impact. This is again just a um quick visual on how uh the ownership percentage of brochure will increase and it's not a great amount but again as I said with the number of with the magnitude of values that we're working with in terms of Apple Bureau and everything being in terms of billions these small percentage changes can impact a lot um in terms of ownership and revenue. So in the terms of evolve stage we have value creation versus value transfer. The buyback dividend process pure is a purely value transfer method. So we're just moving cash from the balance sheet to the shareholders and there's no new products being created. Whereas in the acquisition R&D there is potential value creation but there is a risk that capital for future growth may be lost as higher EPS in the long run. And this could give us higher EPS in the long run if su successful agency and governance. So the conflict is that the CEO holds 3 million shares on options and the buyback boosts share price immediately. So again just a quick insight into how the CEO benefits from the buyback as their revenues will go up increase like by a lot because the supply of shares is quite low in the market. or lower in the market. The risk is that is a CEO choosing to buy back to boost their personal wealth rather than investing in difficult R&D. So this just goes on um the decision- making of personnel in the company and their motives because being a CEO if they're told like we discussed in class if we're told that they should just focus on you know helping other stakeholders they might take a different path whereas if they're focusing more on personal benefit they might take a different path. So it's just the risk associated with um the CEO making certain decisions and signaling effects buyback signals that we believe our stock is undervalued and we are a mature company with limited high growth reinvestment opportunities. So these are just signals that stakeholders can look on to or refer back to uh to see how they'll benefit or they'll be impacted by the buyback. um method we have the dividend signal. We are a cash cow utility and in terms of which retailer will benefit most from this. Which stakeholder will benefit most from this is retailers as they are gaining a quite a big uh dividend payment increase whereas the growth investors hate it because they're more focused on the actual price and selling stocks at a higher price than when they were bought. Then we have debt paid on signal. So we have risk averse and this just goes on to you know should the debt be going down since we have the money why not just put in the debt and keep it low risk. But this is unnecessary given our $165 billion cash pile. So, Apple again has a lot of money to choose uh and balance out the debt and be more um impactful in the way that they're choosing to clear the debt. So overall, I believe Apple should take the investment opportunity and repurchase the shares because as we can see, it's going to impact a lot of stakeholders in a good way and it will um you know make their investment investment opportunities for the future in terms of the inflow of cash higher because people want to see their uh people want to leverage on the increasing um cash increasing ing price of stocks of Apple. And in other in other words, this was a great experience to see how uh or a great experience to be put in the shoes of a financial analyzer. Um as these are the types of jobs that people will be doing in certain companies in the financial sector to re-evaluate and come up with certain solutions or possible steps that they can take to improve a company's um investment opportunities or uh stability in the long term. So it was a great opportunity to see how different elements act together to impact uh different stakeholders in the world. Thank you."
}