{
  "student_name": "Ethan Sleeth",
  "org_defined_id": "038097599",
  "username": "sleethe",
  "email": "",
  "transcript": "My name is Ethan Sleet and this is my market efficiency investigator. on the GameStop short squeeze. So the objective of this project was to test how efficiently markets incorporate new information. specifically whether GameStop's Extreme Price behavior in 2020 and 2021 have violated the efficient market hypothesis or EMH. The star I verified the factual claim for our assignment starting or stating games 2020 and using the Yahoo Finance data, the lowest adjusted close that month was around $4.00 not 4 cents. So that statement was... clearly inaccurate. So, documenting, correcting this kind of data claim is critical because we analyze market efficiently. um so the it's The efficient market hypothesis, the EMH, has three forms, the weak form semi-strong and the strong form, which you see right here. And our main focuses... semi-strong efficiency which tests how quickly and accurately markets react to new and public information. Alongside this, I consider the behavioral bias. [100:40] and like overconfidence, hurting and loss of a version that may explain the anomalies in the real markets such as the GameStop Frenzies. [110:50] So I implemented an event to study using the CAPM framework to measure the abnormal return. [120:00] the process automated in the Python. Download it for... [130:10] You want to download GME SMP 500 and the T-Build proxy dated with Y Finance. Then you can commute that. [140:20] access returns to the GME in the market and then estimate alpha and beta over 200 today estimation window and then you [150:30] calculate the abnormal returns in the cumulative abnormal returns in the negative 10 to plus 10 day window around each day. [160:40] And then unless you want to run statistical tests like T-tests in scientists who evaluate whether those abnormal returns are significantly different than zero. [170:50] And then the code is a modular, meaning that is easy test or easily test new events or triggers with one line of input. [180:00] So my results are here. The statistical results showed that the wall game stop had extremely high short. [190:10] I have no road turns around key new dates. These effects were persistent or were not persistent. I'm sorry. Event day I have no road turns where statistically s- [200:20] significant for January 27th, 2021 and then when reddit driven short squeeze pete it quickly mean-roverted. [210:30] the pattern suggests temporarily an efficiency followed by rapid information and corporation, which still aligns with semi-strong EMH when viewed over. [220:40] slightly longer horizon. But however the behavioral component is undeniable. [230:50] combination of hurting behavior and overconfidence, created large short lived, mispronunciations and apertures and couldn't [240:00] fully exploit due to the trading holds and the risk constraints. Classics examples of limits of arbitrage and then [250:10] These are my numbers. [260:20] And then to reflect this, so then to find this cover we clarified that [270:30] misinformation and identify key event dates represent we modeled expected returns using CAPM and marketing module [280:40] We perform statistical tests on AR or CAR results. Evolve the frames. [290:50] work easily send the multi-firm studies like momentum and size anomalies and then reflect the evidence shows at wall markets. [300:00] Our most efficient behavior researchers can temporarily break down. So from an investment standpoint, these results are reinforced by passive investing remains dominant but it consists of [310:10] of his heart to sustain the market digest information. So in conclusion, my finding show that use such as Serbs was in an album. [320:20] explained. Explainable through the NOMH and behavioral finance procedures, presses do not react, but efficiency. [330:30] largely for return as new information was absorbed. The project combined finance theory, data analytics and empirical testing. [340:40] I'm sure you have modern market B8 under pressure. Thank you for watching my analysis on market efficiency in the games that I've case study.",
  "video_url": "https://youtu.be/n-EN5StLXu0"
}