{
  "student_name": "None None",
  "org_defined_id": "037076876",
  "username": "jmunkhol",
  "video_url": "",
  "transcript": "Okay. So for mini project three, this project is all about um building a AI finance tool um intelligently basically so that um the AI is doing most of the work and doing most the analysis and then just giving you an output and showing you kind of like why that is and doing a lot of explaining and stuff like that. So the progression so for the first project you can build things for the second project you can build your useful finance tools and then um for the third project you can build intelligent finance tools. So it says build more advanced AI finance tool using um a platform it should analyze explain and or advise financial decisions using AI as the brain. So what makes this different? Um it's understanding the context, explaining complex concepts, providing personalized insights and answering why and not just what. So first um the driver loop. So discover what financial decision needs explanation, not just calculation. And I went with investment analysis beyond numbers. So using AI to show why a stock would fit slashnot fit if you want a portfolio based on how risky the stock is. using a 10-year forecast, including past and future predictions on the stock behavior, given a full picture on how the stock has been in the past and how it is predicted to be in the future. And then it doesn't just show how it's been, but it also assesses based on certain factors like um the stock's beta and price to equity ratio um to determine how risky it is. So R for reason, how AI makes this smarter. AI makes the process of assessing stocks 10 times faster with a device like this because all you have to do is input the kind of stock you're looking for and it shows you what kind of stock it is in terms of risk and will give you a short description and forecast all in the same place. Also gives you other recommendations for similar stocks to better help you with your research. So this is kind of showing you contextual analysis um for the stock all located one place and then also a damic recommendation. So it show it doesn't just give you the stock you're looking for but then also recommends other stocks um that are similar in this case or if you're looking for a stock you input a stock it doesn't work for what you're looking for it'll give you recommendations for that as well. So now for the implement stage, we're gonna go over here and I did this in Google AI Studio. And so here is an example, but um I used Google for this one. And then I also did um the risk profile as safe. So let me just make this a little bigger here. There we go. Okay. So first I want to just go through and show you the prompts I used um to build these. So, first I just wanted to build a model that I can input a ticker symbol into and either and and either a safe, moderate or risky um description. And then it will use AI to grab the last 5 years and future forecast 5 years of the stock and then measure on a scale of safe, moderate, riskier based on the the um vitality and other relevant factors. And then based on what I put in, tell me if it's a yes or a no whether the stock is okay um for what I want it for. And so that was kind of the first thing I did and it did a great job. It imported um um stock charts and stock analysis from Google and then kind of did all that and then I just wanted to take it a little step further on this first part. So also with each answer give me recommendations for what stocks similar to the stock entered in the same industry act could be either safe, moderate or risky depending on what they wanted. So, this kind of helps um if your option that you wanted doesn't work, trying to lead you in a different direction and really helps speed up your stock process when you really have no idea what to buy after that first initial idea. And then, so then the last thing I said is make it clear where this data is coming from and what could be false because it's AI still. we really don't know um if the information is accurate because it's probably pulling from different sites on Google every time. And so we just want to make sure that if anyone is using this that they're aware that this really um isn't exactly correct that we know of. And so for this I put in so for this example I put in Google and then I chose safe. And so the recommendation at the top is no. And it is also color coordinated which is super helpful. Based on your risk profile, Google um is likely not a good fit. Um the current price is 320.8. So the analysis um shows a little bit of why um a little bit about the dividend yield, the beta, um the stock's performance in the last few years, and then just gives like just a little description on the stock's behavior. And then the key matrix show the volatality um the beta the price to equity ratio and then what sector it's and then it overall based on that data gives it a risk rating and then it also is includes a 10-year trajectory history and forecast of the stock. So you kind of can kind of see the growth um of this stock based over the last 10 years. So this is um what's it what it's like right now. to 2025 and then what it's expected to be in 2030. Um, which I think is kind of cool. Um, especially if you're looking to hold stocks for a longer period of time. This kind of shows you the direction you're going in and um, kind of when's a good time to buy this stock, yada yada yada. Um, so and then there's also a warning right here which is super helpful. AI forecast warning. So it says this chart above includes 5 years of AI generated forecasts. These are hypothetical projections based on past trends and not guarant not guaranteed to occur. Market conditions can change rapidly. So, it's a great warning um because really no one knows what's going to happen in the future. So, and then alternatives um for your risk profile. So, this is where it shows other things that um you could bet on for like a safe option in the technology industry. So, Microsoft um IBM and then Vanguard dividend appreciation index funds. It also gives you an index fund, which is super cool because that's kind of like a different option than just doing a regular stock. Um, so it really gives you all the options to make this efficient as possible. And then again with the making sure that um the users know are aware that this isn't um might not be 100% accurate. So data sources and reliability page at the very end generated by AI Gemini. The future forecast, risk assessment and um suitability judgment are generated by artificial intelligence. These are synthetic estimates derived from part um patterns not guaranteed financial models. Forecast accuracy. Future prices are hypothetical and AI cannot predict market crashes or black swan events. Hallucinations. Um AI models can occasionally output incorrect numbers for matrix like beta or P ratios. Then context suitability is general recommendation and does not um account for your total financial picture. So as I said um no models do this and it's doing a good job of kind of explaining um the risks of solely basing your opinion on one set of data based on just a few factors that go into buying stocks. But it's definitely a great way to start if you're really wanting to focus your stocks either safely, moderately, or want to go risky. just a great way um to find stocks. So verify is the AI actual helpful. Um use this to create a balanced stock valuation with one safe, one moderate and one risky stock all in different sectors. So I've been kind of playing with this a little bit and what I was easily able to get the information on the companies and took me less than 200 or sorry 20 minutes um to get together. This I this AI it um too is actually helpful um when explaining like the other things included in um the output like the forecast and all that. It really shows you the history of the stock as well which I find very helpful. Um also check the information presented with Yahoo Finance um for Google and then also Apple when I put the information in and it was correct. So, um it seems pretty reliable, but obviously um everyone and every AI can make mistakes. So, you just got to be sure and not just base your whole analysis on it. So, evolve, what would make this AI more useful? I said if you could also create a portfolio within the site and save your past searches to also have the AI compare which are the best for what you're looking for and then also if I it used more parameters to test vality um to give a more accurate measure. And then lastly, if it was connected to an investing service that you could implement your investment plan and you build through this service directly to your real life investment accounts, which probably isn't likely, but would be very helpful um if you are looking to um actually buy some stocks. Then reflect what's different about building with AI as a component. Using AI as a commment makes it 10 times easier when looking at the output of the data due to the fact that it reflects on the information it finds and then tells you the solution not just giving you elements to the answer and waiting for you to make your own conclusion. And then it is harder to make that AI do this in a reliable way. I had to tweak the prompt many times before I got it to be able to do a full analysis on its own and then continue to build my research from there. So that is my assignment or that is my mini project three and I hope you found this as useful as I did."
}