{
  "student_name": "Shea Wickstrom",
  "org_defined_id": "034209490",
  "username": "swickstr",
  "email": "",
  "transcript": "Hi, my name is Shealyn Wickstrom and I will be going through our session 8 section five assignment. Okay. Um in this assignment I'm acting as a risk manager at a h at a hedge fund and recently we've experienced an 8% single day loss um which our current s risk system did not predict. So to start I used Gemini as always. Um let me find my prompt here. Okay. I'm going to move myself here real quick. All right. So, I said I'm acting as a risk manager at a hedge fund. I went on to say all the given details of the problem. Um, please act as my financial adviser specializing in risk analysis. I need to implement a value value at risk and stress testing to create a better risk monitoring system. help me help me implement value at risk calculations in Python. And then for my define and discover, I sort of just repeated the um given information from the problem here. And then I said I would like to create a daily monitoring system. Um, it needs to have a 95% confidence level and my portfolio because I needed to create a portfolio for the system to analyze. I said it consists of Apple holding 25% of the portfolio. Um, JPM which is 20%, Microsoft 15%. um TLT which is just a bond at 20 20% a government bonds or government treasury I think and then um an S&P at 20%. Um and I included this just so we could have a good measure of what how the sort of general stock is doing. Okay. And then I said run a risk analysis on these investments as a step in the risk system process. Uh represent calculate value at risk in multiple ways historical parametric and Monte Carlo. Uh because I am running the system daily it could be reasonable to assume an expected return of zero. Um account for volatility and possible unprecedented events. I also need to identify and ex identify any expected shortfall or conditional value at risk to identify what conditions would be like if losses go beyond the value at risk predictions and then use stress testing to analyze how the portfolio would perform in different extreme scenarios such as market crash or increased interest rates. All right. So then it went on here to get to the coding. It gave me several different outputs for each section that I was asking for. Um, for example, this first code that it gave me. Um, it's sort of just defining my entire portfolio and giving the historical data so that we can use that to find um the historical value at risk. Um, so the first coding here was just kind of laying out all of the defined informations. Um then it gave me another coding here um specifying what I would want for the historical um value at risk. Uh one day 95% value at risk. Um that's basically saying I'm 95% confident that blah blah blah whatever it's going to output me. um it gave me another code box here which is doing the exact same thing but for the parametric uh value at risk um all the important calculations we have the zcore here which is also just representing the confidence level of 95%. Um and then the Monte Carlo value at risk, same thing. Um calculating the same values with the same 95% confidence level. All right. And then it goes on to just give more codes. We have for expected shortfall. Um, which this basically is going to give me what would happen if if there was an an extreme enough event to where we would go beyond our value at risk threshold. Um, so in this case it went to 8%. Which was beyond our threshold. Um and the expected shortfall is sort of saying what to what we would expect to lose if we were to sort of break that um limit. All right. So it is going through we have the historical right here Monte Carlo right here. it did not give um the expected shortfall for parametric um which is basically giving a normal distribution and I believe this is because um if it's normally distributed we wouldn't expect it to go beyond the tail. Um so I think that's why it didn't return anything for that. And then same for stress testing. Um I gave it the scenarios of a market crash and increased interest rates. Then what would happen um to the portfolio here it shows the different betas for the different um investments in my portfolio. That's basically just showing the different elasticities or correlations or sensitivities of the individual um stocks to the market as a whole. And then perfect. Okay. So, I took all of these different codes and I put them into collab, which I will show here. All right. So, here is just all of those same codes just compiled all together into one big cell. and it output me with this here quite a bit. Um, here at the top is just sort of showing what would be in the portfolio. Um, I believe these values here are log returns per day per stock. Um, so for example on November 6th for Apple there was a negative return of 0 um and it says that it is using a total trading days of 969. So it is going back 969 days into each of these um companies port or yeah company's stock information. All right. So then we see here pulling from that data we have the historical value at risk. Um once again it's at a 1 day 95% um meaning in 1 day we are 95% confident for the historical value at risk that we wouldn't lose any more than 1.68%. Um which in dollar terms would be about $167,000. Um, this is sort of just repeating this here. We are 95% confident that on our 1-day loss will not exceed 1.68%. Um, it did the same for parametric value. Um, like I said before, parametric is sort of just saying that it's on a normal distribution and that there are it's sort of assuming that there are not really any extreme outliers. Um, we have the zcore representing the confidence level of 95%. And this one is saying that we wouldn't expect a loss of more than 1.76. So with the parametric, it's sort of expecting a little bit higher potentially higher losses than the historical data. Then we have the Monte Carlo value at risk. Um, these values here are showing are accounting for more extreme situations. Um, it's simulating 10,000 one-day outcomes. Um, so it's got a bit of a broader database that it's pulling from. Um, and for that one day 95% value at risk, it is negative 1.74%. Um so not too far off from the parametric here. Um moving on to the expected shortfalls. So what would happen if we did breach that boundary? Um we have CV which is this this is just saying conditional value at risk. Um for the historical method it is showing a -2.4 4 um expected loss. And for Monte Carlo, it is showing a -2.18 expected loss. Um moving on, this is sort of just repeating everything I just said. and to our stress testing scenarios. Um, I found that this was the most important part of the implementation stage um of my assignment um cuz it sort of revealed the what I think is the most important information. Um so this is when I gave it different scenarios to deal with as a hypothetical. So here we have asset shocks. Um, oh, first it's showing the different betas. That's what I wanted to mention. Um, showing different betas for each of the individual stocks. Sort of like I mentioned earlier, um, how these stocks would react to how the market reacts as a whole. Um, and this is why you see the S&P 500 stock at a value of one because it would be moving the same. It's unit elastic. it would be moving the same as the market. Um, Apple is a bit more elastic, um, bit more reactive to how the market moves as a whole. And TLT here, which is the government treasury bond, um, that one is the least elastic, uh, which makes sense. Um, and then moving on to the different scenarios. So, here's what I wanted to really point out. um my first scenario of an asset shock being a market crash and it showed this here of an expected loss of 8%. Um I thought that this was really interesting um because in the problem, let's see if I can pull this up. Perfect. In the problem, it said that there was an 8% single day loss. Um, so I thought that a market crash could very well depict what is going on in this scenario here. Um, given that 8% loss here and about 8% loss here, it seems like a very similar situation. Um, so then what I did was went into Gemini. One second. Okay. So after sort of making that connection um I went into Gemini and said in the case I was provided there was an 8% single day loss. When I ran a value at risk simulation I found and found potential outcomes for different scenarios. I saw that a market crash would lead to around an 8.1% loss. These two situations seem comparable. In a market crash scenario, how could I improve my portfolio to be less volatile and acquire less risk? Um, and it in a nutshell, it basically told me to better diversify. Um, it said that my current portfolio is pretty equity dependent, I believe is what it said. Um, 80% of the portfolio in assets that are highly correlated to the S&P 500. So, it said um a potential solution that I could have is to add an additional I'm not sure if it's here, but is to add an additional um investment in my portfolios that would sort of offbalance all of the highly sensitive um um investments that I already have. So for example, I could invest in gold. Um that was one of the options and that is what I decided to go with. So after finding that I went into collab. I ran the exact same code as I did before. However, this time I used my Gemini here um to say I now want to update my portfolio and reallocate my investments. Um let's see if I can find what I said. Oh, well, it's not showing what I said. Oh, I said I want to change my portfolio slightly, but run the same test. My new portfolio is Apple with 20%, Microsoft 10%, JPM 15%, spy 15%, TLT 20%, and now gold at 20%. So now I have a more spread out portfolio and it returned me with this here. Um all of this initial information remain the same. Um for the historical V I still have the same um expected losses. Same for parametric Monte Carlo. All of this is consistent. Um what what is most important to look at is that scenario that I had earlier um the market crash scenario and with that now no more diversified portfolio um I would expect a loss of only about negative of only about 5% losses um which is a lot better and less risky. So for my solution of a new risk system or a proposal of a different way to allocate um investments, I would recommend to add some investments that aren't so sensitive to the market as a whole. Um so that if there were something like a market crash or or something of that nature um we would be a bit more balanced out and be acquiring less risk. And that is all. Thank you.",
  "video_url": "https://www.youtube.com/watch?v=8r0WBQZLMtI"
}