{
  "student_name": "Hector Silen",
  "org_defined_id": "036247734",
  "username": "hsilenri",
  "email": "",
  "transcript": "Hello, my name is Hector Sen and this is my video submission for the session 8 assignment. So for this assignment, I'm analyzing on the efficient market hypothesis using the GameStop short squeeze uh event as a case study. So uh first of all I started with uh the define and discover stage of the driver of my driver framework where I established the core pro problem for this assignment which was to test the efficient market hypothesis using the GME event like I previously said. So uh the assignment first of all had a critical first step which was to verify that the uh the statement that GameStop traded at 0.04 in August 2020. So after uh my investigation I found this statement to be incorrect. Uh according to my research uh the which I use Yahoo Finance for uh for the actual split adjusted stock price in August 2020 was between $1.04 and $1.67. So this uh data correction was my first analytical finding and uh from here on now uh my entire analysis analysis will be done using this corrected verified historical data. So now that I have the data corrected uh I developed three of my main uh research questions. So the first question is which forms of the uh efficient market market hypothesis did the GME event violate the so in in uh these forms I have the weak semi- strong and strong. Uh the second question was what behavioral biases and social factors explain the price action that the efficient market hypothesis cannot and third of all why couldn't rational investors you short the stock back to its fundamental value. So now onto my uh represent step or or the represent stage. Uh my plan was to first of all download GM GM's price and volume data from 2019 to the to the present to get a clear baseline and second I plan to create uh two key visualizations which uh will help me uh with my analysis. The first the first one would be an event study of a price and volume uh to see the anomaly of this event and the second plot would be my main EMA test plot which would be plotting the stock market's price against against its own fundamental value band. So this plan would give me the visual evidence needed to test the weak and semi- strong forms of uh market efficiency. So now on to uh my implement stage of the driver framework. Let's run the my code which I wrote with help of Google Gemini and well in this code I first uh uh installed the Yahoo Finance Python library as it as seen here in the beginning uh and imported all the other necessary libraries. for the code to run and get this important data. Uh for example, uh the the code also downloads the uh the GME historical data uh confirming the 2020 prices. So now that the code has run, as you can see here in my first wait, as you can see here in my first plot, uh this is my event study. Uh you can clearly see the price uh on the price on a log scale and the corresponding volume. So the annotations mark the key events from uh Ryan's coin's investment to the peak in January 2020. So this visual confirms the anomaly. Second of all uh here's my uh second plot uh which is my main analytical test. So here I've plotted the market price in blue against the publicly known fundamental value band and uh uh which is in red and the red band represents the $2 $50 to $10 split adjusted analyst estimates. So as you can see the market price completely decoupled from all public uh fundamental information and this massive gap is the abnormal return that the efficient market hypothesis cannot explain. So this is a clear v visual violation of the semi strong form. Now onto my validate step. So uh basically I perform a sanity check for this uh and my code ran successfully and the Yahoo Finance and the GME historical data uh you know uh were accurate as I uh checked it with the actual Yahoo Finance website and the data validated my initial data correction. So the plots are therefore the plots are accurate and you know match the known uh historical uh data of the event. Um so onto my evolve step. So I looked at how uh to take this analysis deeper. uh and first of all um I thought that to evolve this uh analysis in uh quantitative way the next step would be to calculate the community cumulative abnormal return or the C using the CAPM model and not just visualize it and second of all I deepened the why you know why you know this happened so this wasn't just hurting it was specific biases uh like social identity and the house money effect for investors who got in early and finally I analyze the limits to arbitrage so rational investors couldn't stop this because of specific operational constraints so number one there was no shares to borrow so the short interest was at 140% uh the second of all the short squeeze mechanic itself forced short sellers to buy and third of all margin calls forced even rational funds to liquidate at a loss becoming part of the problem and finally in the reflect stage um here are my conclusions. So first of all uh my first finding is that the uh GME event was a decisive realworld violation of the efficient market hypothesis as it is clearly it has clearly violated the weak form and as part two shows it annihilated the semi- strong form. My second finding is that the why uh so that would be my second research question uh is that it has uh a two-part answer. So basically why it happened it's because it was kind of a perfect storm where behavioral biases provided the fuel and the market's operational mechanics which uh you know are the limits to arbitrage provided the engine for the explosion. Let's say and lastly on the process itself the of this analysis the driver framework was essential. So the define stage forced me to verify the data first uh and make sure that uh which ma made me make sure that I had the correct historical data for my uh analysis and it helped me to immediately catch the error that was g that was given to us in the assignment prompt. And so this would be uh almost one of the most critical parts of my assignment. So yeah, that's it. Thank you for watching.",
  "video_url": "https://www.youtube.com/watch?v=5TeTcKVoGX4"
}