{
  "student_name": "Mauricio Echeverria",
  "org_defined_id": "036820322",
  "username": "echevem",
  "email": "",
  "transcript": "Hi, this is Mauricio. In this session, I'm working through a classic corporate-finance problem: calculating the Weighted Average Cost of Capital (WACC) and using it to decide whether a project is worth pursuing. The company I'm analyzing is Wayne Enterprises, and the big question is simple: D-Define Does this project create value, or should the company reject it? To answer that, I need one number—the WACC. That number becomes the hurdle rate. If the project's expected return is higher than the WACC, it's a good investment. If it is lower, it will destroy value, and the project must be rejected. R — Review What's Known Before doing any calculation, I organize the information. Equity information includes 80 million shares outstanding, a stock price of $25, an equity beta of $1.10, a risk-free rate of 3.8%, and an expected market return of 9.3%. Debt information includes a bond face value of $500 million, bonds trading at 97% of face value, a pre-tax cost of debt (coupon rate) of $5.6, and a corporate tax rate of 24%. Finally, the project details are an initial investment of $120 million and an expected return of $10.5. This is everything I need to compute market values, costs, and the final decision. I — Investigate the Components Now I break the problem into smaller pieces. First, I calculate the Market value of equity (Shares $\\times$ Price), which tells me the size of the equity portion. Second, the Market value of debt (Face value times 0.97), noting that bonds are trading at a discount. Third, the Total capital (Equity + Debt), which allows me to calculate the weights of each. Fourth, the Cost of equity using the CAPM formula: r_e = r_f + beta (r_m - r_f). This connects risk and return, where a higher beta requires a higher expected return. Fifth, the After-tax cost of debt, recognizing that interest is tax-deductible, making debt cheaper. Finally, the WACC, which is the final weighted average of both costs, representing the minimum return Wayne Enterprises needs to create value. V — Validate With Calculations Here is the logic that the Python script follows. Step 1: Market values. Equity market value is 80M times $25, and Debt market value is $500M times 0.97. Step 2: Weights. Equity weight is equity divided by total capital, and debt weight is debt divided by total capital. Step 3: Cost of equity. This is calculated using CAPM with the risk-free rate, beta, and market return, determining the return shareholders demand. Step 4: After-tax cost of debt. The pre-tax cost of $5.6 is adjusted for the tax rate. Step 5: WACC. This is a combination of both costs, weighted by the firm's financing structure. Step 6: Compare with project return. If the project return (10.5%) is above WACC, we accept. If below, we reject. The Python script automates this entire sequence, prints each step, and ends with the final decision. E — Evaluate the Outcome Once everything is computed, the script prints the firm's WACC and compares it to the project's expected return. If the WACC is lower than 10.5%, it means: The project beats the hurdle, it adds value to Wayne Enterprises, and it should be ACCEPTED. If the WACC is higher: The project doesn't meet investor expectations, it destroys value, and it should be REJECTED. The whole purpose of computing WACC is to make this decision in a transparent, quantitative way. R — Reflect & Extend By walking through these steps, I not only get the final decision but also understand: How equity and debt contribute differently to financing, how taxes affect borrowing costs, why CAPM matters in real corporate decisions, and how companies evaluate whether to invest millions into a project. This method isn't just for this problem—the same approach works for any WACC calculation and any corporate capital-budgeting decision.",
  "video_url": "https://www.youtube.com/watch?v=JmX6xqBaXJI"
}