{
  "student_name": "Clara Weinzapfel",
  "org_defined_id": "036170079",
  "username": "cweinza",
  "email": "",
  "transcript": "Hello, my name is Clara Weinzapfel And today I'm going to be going over the session 10 assignment. I started by reading through the assignment and the overview is to evaluate Starbucks proposed flagship roster that requires a $12 million upfront outlay and is expected to operate for 10 years. We are to use the firm's 8.5% WACCC as a hurdle rate to determine whether the project creates value and to recommend an accept or rejection decision supported by the driver documentation. I then copy and pasted the assignment into Google Gemini and went back and forth having it create a Python script and then working out any errors that it provided. So once I had the Python script like here, I copy and pasted it into Google Collab. So the script initiates the financial modeling process by importing essential Python libraries. Numpy which is crucial for numerical calculations and array manipulation pandas utilized for organizing the financial data into structured data frame. the cash flow schedule and the PLT which is necessary for generating the required visual outputs adhering to the KISS principle. The model defines all primary assumptions as constants at the onset fulfilling the assignment requirement for parimeterized inputs and ensuring clear audibility. These constants establish the 10-year project scope. Set key financial rates like the WACCC base which is 8.5%. And tax rate which is 25%. and specify in investment parameters such as the Apex initial which is 12 million, the NWC initial which is 500,000 and the terminal gross value which is 3 million and above that we can see This whole section is the parameter section. We see that the project life is 10 years. And then moving down to this line here, the nonlinear or this is the straight line depreciation which is pre-calculated from the kex over the project life resulting in an annual expense of 1.2 million. And then finally, the nonlinear revenue and marketing cost structures for years 1 through 10 are structured using dedicated dictionaries. Revenue by year right here and marketing by year right here, which drive the varying financial results across the project's timeline. Two, core financial modeling function. We're going to skip a little bit down. to this section here. To ensure the model is self-contained and avoids external dependencies, custom functions for net present value and internal rate of return are implemented using only base numpy. That's what is shown here. First is net present value. the calculate NVP. This function computes the present value of all cash flows using the WACCC. It requires the rate and the array of cash flows. The function calculates the discount factors for each time period and then applies the standard MPV formula which is what's showing in the these lines of code. and then the internal rate of return here in this next line. This function uses the Newton Rafson numerical method to solve for the rate where NPV equals zero. This approach requires defining two nested functions. One for the NPV itself and one for the derivative of the NPV with respect to the rate which is what's shown here. This allows the solver to continuously refine the rate guess until the NPV converges to zero within a specified tolerance. So you can see it working through that. And then here we have the calculate FCF schedule. This function is the core financial engine building the FCF for years 0 through 10. The function iterates through each year starting with revenue lookups based on the year and the rev multiplier parameter used in sensitivity analysis. So then we can move back up in the code where we start with the operating income. The costs or cost of goods sold at 40% of revenue plus fixed cost and the 1.2 2 million annual depreciation are subtracted from revenue to yield earnings before interest in taxes or EBIT. Next, taxes are calculated only on positive EBIT. As you can see here, taxes only apply if EBIT is positive. And then we have free cash flow. The final FCF includes OCF plus non-operating cash flows. The results are stored and returned in a pandas data frame completing the cash flow schedule requirement. And you can see we now have the OCF non operating cash flows and FCF initial capex and investment working capital change and terminal value total free cash flows. close and then we can move back to where we were at. The calculate metrics function here processes the FCF series to produce the core capital budgeting outputs. NPV and IRR results. The base case analysis yields an NPV of 277,485 and an IRR of 8.13%. Since the NPV is negative and the IRRa is below the 8.5% WACCC, the analysis concludes the project is financially unviable in the base case directing directly addressing the decision-making requirement of the assignment. And then for for the profitability index which comes after the net present value that we've calculated in the internal rate of return. The profitability index is calculated as the ratio of the present value of future cash flows which is NPV minus initial outlay to the initial investment resulting in 0.98. And then moving on to simple payback period. The script accurately calculates both simple and discounted payback periods. Using linear interpolation satisfying a key assignment requirement, the simple payback is 8.11 years and the discounted payback is 9.28 years. You can see the discount payback period section here. And then next we move on to the sensitivity analysis function. This function systematically executes the required stress tests revenue down 20% WACC plus or minus 2%. A sensitivity analysis is critical to the assignment. The results show the project is extremely sensitive to revenue with a 20% drop plunging the NPV to minus 6.48 million. So here it's showing scenario A revenue reduced by 20% and scenario B the debt VACC plus 2% and then scenario B is WACC minus 2%. Next is the visualization function which is creating the plot and the rest of the code goes towards that. So now we have our output here which gives us the incremental free cash flow schedule for years 0 through 10. We have the hurdle rate WACCC showing at 8.5%. the core capital budgeting metrics. So we have the NPV again at negative 277,485, the IRRa at 8.13%, the PI at 0.98, the simple payback in years is 8.11, the discounted payback in years is zero. Running sensitivity revenue reduced by 20%. WACC plus 2% is 10.5%. and WHCC minus 2% is 6.5%. We then have the sensitivity analysis summary with the base free cash flow schedule shown as a bar graph as well as the NPV sensitivity to revenue and WACC changes bar graph. These two plots are generated using the map plot lib function. the base case FCF schedule over time and a bar chart showing the NPV sensitivity across all scenarios visually supporting the final analytical conclusion. The project must be rejected due to its negative base case NPV and lack of resilience. And that is the end of the session 10 assignment. Thank you.",
  "video_url": "https://www.youtube.com/watch?v=IYXeT3I0FKA"
}