{
  "student_name": "Isabella Wish",
  "org_defined_id": "037174968",
  "username": "iwish",
  "email": "",
  "transcript": "Hi. So today I'm going to be going over cost of capital analysis for this session assignment. Um and I'm going to be using the driver framework to go over it. So first in define discover we're going to go over context and the given information that we're given in the problem. So the problem is we are going to have to evaluate Starbucks proposed flagship roster that requires a $12 million upfront outlay and an expected and is expected to operate for 10 years. We're going to use the firm's 8.5 WACC um and as the hurdle rate to determine whether the project creates value and we're going to have to recommend either to accept or reject that. Some of the project parameters that we're given is there is initial investment of $12 million for stuff like building, equipment, training that depreciated um straight line for over 10 years. So that $12 million of all that stuff is going to depreciate. Working capital is going to be $500,000 that's deployed at launch and recovered in 10 years. Revenue is 8 million in year 1, 11 million in year 2 to 5, 9 million in years 6 to 6 to 10. Operating cost is cost of goods sold is 40% of revenue. Labor is $2.5 million. Rent and utilities is $0.8 million. Marketing is 0.3 million in year 1 and then 0.1 million after. For taxes, it's going to be 25% corporate rate. Terminal value is 3 million at the end of year 10. Now, we're going to go over some of the financial object objectives over today's video. So, the primary financial objective is to determine if the project's net present value is positive when discounted at 8.5% WACC, thus creating value for the firm. So for define and discover, we're going to list the context, financial, objective, and understanding of some terms. Represent, we're going to sort of just go over the formulas and the variables in those formulas. It for implement, we're going to I'm going to walk through the Python code and kind of explain some of the logic in there. Validate is we're going to verify the results that we got from those from that Python Python code. evolve. I'm gonna sort of reflect on the results of the Python Python code and see any potential improvements or different scenarios that I could apply and then reflect. I'm just going to kind of go over everything that I had established throughout this video. So for some financial term terminology that will be useful is there's incremental cash flow. This is the change in the firm's total cash flow that occurs because of the project. This is the focus of the financial model. WACC or weighted average cost of capital is the minimum required rate of return for the project used as the discount rate and hurdle rate. Straight line depreciation is a non-cash expense that provides depreciation tax shield which is depreciation times tax rate. NPV is net present value. This is the sum of the presence present values of all cash flows CFS net present value if net present value is greater than zero it implies value creation and you should accept it. So irr initial return rate the discount rate makes it the discount rate that makes NPV equals zero. Um if IRR is greater than WACC the project is accepted profitability index or PI is the ratio of the present value of CFS to the initial investment. If PI is greater than one, it implies that there was value creation in the project. Um, payback period is the time required to recover from the initial investment discounted pay payback is more rigorous is the more rigorous metric. Sensitivity analysis is testing how the metrics NPV divided by RR change when the key inputs like revenue or WACC are varied. Now going on to represent to go over some of the formulas that we'll be using. We're going to look at annual depreciation. This is for straight for the straight line depreciation. It's going to be initial investment divided by project life because it's all equal. Annual earnings before investment and taxes it which is EBIT. re is going to be revenue minus operating cost minus depreciation. Annual net income or NI is going to be the EBIT times one minus the tax rate. The annual operating cash flow is or OCF is the net income plus depreciation or the EBIT times 1 minus the tax rate plus DTS. The initial cash outlay for year zero is going to be initial investment plus working capital. And then terminal cash flow for year 10 is going to be OCF of year 10 plus recovery of the of NWC plus terminal value. Then for things like NPV, IRR, DP PBP, SPBP, NPI, those are going to be calculated using full incremental cash flow series and the WCC. And as for the sensitivity results, that's going to be recalculated. That's going to recalculate the MPV divided by and the IR for the three scenarios. Now, moving on to implement. I'm going to come over here. So, and kind of walk us through the steps or the code that we got. So, we're going to see here some of the project parameters. We're going to we have the initial investment of $12 million, the project life of 10 years, the working capital of $500,000, the tax rate of 25%, the WACC of 8.5%, and the terminal value of $3 million. Then we're going to come down here and see some of the cost parameters parameters. It's going to be for we have cost of goods sold which is 40% of the revenue. Labor cost which is um 2.5 million rent utilities 800,000 marketing cost 300,000 and marketing cost after that is going to be 100,000 or for years 2 to 10. Uh going down here, we're just doing some calcul calculations for things like revenue and revenue and operating costs. Um then here they're going to calculate things like PBVP, which is the discount payback period, simple payback period, discounted payback period, profit profitability index. Then for the executive base, they're going to be looking at everything compared to the WACCC of 8.5%. And coming down here, they're going to this scenario is going to apply to the evolved stage because it's seeing different scenario if revenue is reduced by 20%. or if the WACC is goes down by 2% or if it increases by 2% and just kind of seeing how everything is affected by those changes. Uh then here they're going to be making the charts that I'm going to be going over and here's where we go over the recommendations. So this now on to the results. This is the incremental cash flow schedule for all 10 years and then this is the change in NWC capital spending terminal value for all 10 years. Now going on to the core capital budgeting metrics we for the scenario the NPV um is 4.34 million. This is for the base case. So of the base case of WCC of 8.5% the NPV is going to be 4.34 million irr is going to be 3.25% is 13.25% WACC is going to be 8.5 the simple payback in years is going to be 11.67 years discounted payback is going to be 22.26 years and then profit profitability index is going to be 1.242 242. Then for the I'll go over the sensitivity analysis more in the evolve stage. But moving on to just some of our images. We're going to see the base case of the free cash flow for over the project life of all 10 years. So you see the initial outlay makes it goes down to around 12 $ 122.5 million and then because of those annual clash cash flows that are coming in it will just slowly increase and then you see the NPV of NPV sensitivity to revenue and WACC changes. So the NPV it for the base case is going to be around 4.34 4 34 million and then with the revenue solo this is all going to be also seen in the evolve stage but this is sort of visualizing it. It's going to this is down to around just underg -2 million. Then with an increase of negative 2% it's just gonna it's going to equal just under six million and an increase of two for the WCCC WACC is going to be just over 3 million but we're going to go dive deeper into that in the evolve stage. As for that that's the end of the implement stage and I'm just going to kind of validate all the information that I just showed everyone. So for some validation points for Z for year zero C uh FC FCF correctly accounts for the $12 million of capex and the 0.5 million of NWC deployment resulting in a total initial outflow of a negative $12.5 million and that was shown in the Python code for depreciation and tax shield. Annual depreciation is correctly set to the $1.2 million in year one. EBIT is precisely at $0 resulting in also $0 in taxes. The OCF is the then equal to the depreciation of 1.2 million effectively utilizing the the depreciation tax shield fully which is shown in the Python code. For terminal cash flow of year 10, the final FCF of 5.3 million is logically composed of OCF for year 10, which is $1.8 million, and NWC recovery, which is $0.5 million, plus terminal value of $3 million also shown. Then for the metric consistency, the NPV is positive. the NPV being 4.34% and the IRRa is 13 the IR of 13.25% is higher than the WACCC of 8.5. These core metrics are consistent and lead to a clear accept decision based on value creation payback anonymally. The payback period um so the payback period of simple 11.67 years and the discount of 22.26 years are longer than the 10-year project life which is unusual result for a project with high positive MPV. This suggests suggests that the project is heavily relies on a large cash flow late in its life like the 10 like the 10-year terminal value or has a slower cumulative cash flow trajectory. However, since the NPB and IR are superior decision metrics, this does not override the accept the acceptance recommendation. So now I'm just going to kind of come back to the Python statement and go over the executive recommendations that was given. So with the base case of NPV of 4.3.4 of 4.34 million and base case IR of 13.25% 25% with the hurdle rate of 8.5. The financial conclusion is to accept the project has a positive NPV and the IR exceeds the WACCC indicating that ex it is expected to create shareholder value. Some strategic rec strategic and risk considerations are going to be strategic flick fit which is the flagship rosteries align with Starbucks premium experimentile brand strategy which is high fit brand implementations which is enhance brand equity and provide a unique customer experience positive and then key risks high sensitivity to revenue New V validity demonstrated in demonstrated by S1 execution risk of large scale sites and labor cost execution. Now for the evolve stage that we kind of saw a little bit in the Python code the I'm going to go over the sensit sensitivity analysis summary. So for just kind of our base, we see the 8.5 WCC and equals the 4.34 million and the IR of 13.25%. Which would lead us to accept the decision strongly because both of those lead us to believe that. However, for the scenario one, uh, where revenue is decreased by 20%. We still have the WACC of 8.5%. But NPV goes all the way down to $1.92 million and IRRA then is 3.88%. This is then we're going to strongly reject that because of how value destroying that outcome would be. For scenario two, with a WACC of -2% decreasing by -2%, the WACC would then be 6.5% which would leave NPV to have a high of 5.75 million and an IRRa of 13.25%. accept we would accept this scenario over the base scenario because even though IRR is equal and still over greater than the WCC the NPV is a lot high is a good amount higher than the base case. Then for scenario three where they increase WACC by 2%. we get WCC of 10.5% which would then equal NPV to be 3.1 3.11 million and an IR of 13.25 still accept strongly just would we would rather have scenario 2. Now for the key insights and the visualization. So high revenue sensitivity. The analysis reveals that projects profitability is highly dependent on revenue. A 20% drop in sales as shown in scenario one shifts shifts NPV from a positive 4.34 million to a negative of $1.92 million. making the project financially unaccept acceptable and providing it and proving it is highly vulnerable to market risk. Then for WACC resilience, the project is resilient to fluctuations in the cost of capital. Even if the WACC is increased by 2% like in scenario 3, the NPV remains positive of $3.11 million. Now going on to our final stage in the driver framework reflect. So as I said in the Python code the exe executive recommendations is so for the financial conclusion is to accept the base case is of NPV is a lot is very positive of 4.34 million and the IRRa of 13.25% 25% provides a significant margin over the 8.5% hurdle for strategic and brand considerations. The project represents an excellent strategy fit by aligning with Starbucks push towards premium experimental retail the ro the ro ra rotary concept the the this streng strengthens the brand's premium image and different differentation against its competitors for risk mitigation the greatest financial threat is revenue volatil valid validity. Starbucks must implement robust marketing and site selection to ensure demand meets or exceeds the base case forecast as 20% shortfalls kills the project of a 20% decrease in revenue would kill the project's profitability. And then for the reflection of the driver process and define and define and represent we established a clear parameters for cash flow structure class flow cash flow struct structures and necessary formulas and implement I automated the complex multi-year calculations providing reliable metrics validate confir we confirmed the logic especially the initial and terminal cash flows ensuring the base decision was sound involved we tested the sensitivity of the base case highlighting that revenue risk as crucial variable for management to monitor. And then for reflect, we kind of synthesized these qual quantitative and qualitative factors into a balanced recommendation. And that's all for my assignment. Thank you so much for listening.",
  "video_url": "https://www.youtube.com/watch?v=dZNcrsJm3ZQ"
}