{
  "student_name": "Alexander Emenhiser",
  "org_defined_id": "035713425",
  "username": "aemenhi",
  "email": "",
  "transcript": "Hello, my name is Alexander Emenhiser and this is my video for the session 8 uh assignment. I'm in the section of management 310 and it is currently Monday, November 10th. In this assignment, we are learning about market efficiency by looking at a specific case study from GameStop during their short squeeze event of 2020 to 2021. We want to verify the accuracy of stated facts, analyze price behavior relative to the efficient market hypothesis predictions and evaluate whether market anomalies constitute evidence against market efficiency or can be explained within existing frameworks uh which is kind of the basic overview right here. In this assignment, we are going to verify all stated historical price data and document corrections. Uh test which form of market efficiency, which is either weak, uh semi semi- strong or strong, was violated. Uh we're going to evaluate whether rational investors could have profited systematically. And we're going to compare the efficient market hypothesis predictions to observed behaviors. We're going to assess behavioral finance explanations for observed anomalies and these are all right here in the required analysis. Uh like before uh I'm will use all of answer all of these using the driver framework of learning and I'm going to continue to use the assistance of AI to help me uh build the models while validating with my own calculations. But before we begin, there's a statement that we need to verify in this assignment. uh and that is that GameStop traded at 4 cents in August 2020 right here. And I checked the historical price uh data for GameStop in August 2020 using Yahoo Finance as we see right here. And the closing price at the very end of August on August 31st was $167. As you see here's the close price and we can see here that the close prices is pretty much across the board all over a dollar. So that statement is incorrect. And the best way as we see here that we'd be able to communicate that is likely by going face to face is that is often uh the most persuasive way and the most direct way to uh tell someone. So now that we've cleared up uh this critical first step here uh it's time to use the driver framework to begin our analysis. So as we know here the first part of the driver analysis is to define and discover and that is a crucial step especially in this assignment as we see here. So in this stage I'm defining the market efficiency question and setting up the foundation for my research design. The goal of this project is to test whether the GameStop short squeeze of 2020 to 2021 represented a violation of the efficient market hypothesis or whether the extreme price movements can still be explained within an efficient market framework. Specifically, I want to determine which form of efficiency was most challenged during the event. To clarify, the efficient market hypothesis can take three forms. These include the weak form where where prices reflect all past trading data, the semi- strong form where all publicly available information is absorbed, and the strong form where even insider information is fully reflected in prices. To start, I verified the accuracy of one of the key claims provided in the prompt, which is that GameStop traded at 4 cents a share in August 2020. And after checking historical data, I confirmed that the statement was incorrect. This verification step is crucial for ensuring that the rest of my analysis is based on valid data. So now that the data is verified, I can summarize the timeline that frames my efficiency investigation. And we can see some of this right here. So in August 2020, GameStop was trading at low levels and was viewed as near bankruptcy by many investors. In September of 2020, Ryan Cohen, the founder of Tui, acquired a 13% ownership stake, introducing new information to the market. In January 2021, the Reddit driven short squeeze occurred within prices spiking as high as $483 a share. In February 2021, congressional hearings were held to examine possible market manipulation and trading restrictions such as those implemented by Robin Hood. And in the present, the stock is stabilized to more typical levels relative to its fundamentals. In addition to this data, in addition to this timeline, I'm noticing the key data points that form the foundation of our analysis, which are again down here. Short interest peaked at 140% of the available float. Retail trading volume volume increased roughly 10fold during the squeeze. Hedge fund Melvin Capital sustained 53% loss requiring external support. Analys analysts at the time valued the company between 10 and $40 per share far below the observed market prices. With this background, the central question becomes, did the market fail to incorporate new information efficiently or was this a rational though extreme reaction to risk, liquidity constraints, and collective behavior. To use this, I will use the efficient market hypothesis as my theoretical lens. The weak form will test whether past price and volume patterns could have predicted future movements. The semi- strong form will evaluate how quickly public news like Ryan Con's investment or the Reddit activity was reflected in prices. And the strong form will consider whether any group of investors appeared to have insider level information, persistent or persistentformational advantages. The research design for this analysis will still follow the driver framework, ensuring a structured and transparent process. In the define and discover stage, I am identifying a question and validating my data. So the next step here is to present and in this stage I'm translating my research question which is whether GameStop's market behavior violated the efficient market hypothesis into a structured analytical framework that I'll test using the event study code. My event focus my event study focuses on the five major points in GameStop's timeline. As we discussed right here, each state acts as a market efficiency test specifically targeting the semi-rong form of the efficient market hypothesis which says that prices should reflect all public information almost immediately. Using the Python code, I imported GameStop's historical data uh here uh through Yahoo Finance, then used the S&P 500 as a market bench bench and the code calculates daily returns, expected returns from a simplified CM and the abnormal returns. These are then aggregated into a cumulative abnormal return uh for event windows around each major announcement. The plotted charts that I'm going to show later uh in the code visualize GameStop's price trading volume and uh cumulative abnormal returns with vertical lines marking each key event. For example, if we observe a price drift or delayed adjustment after Conan's announcement or the congressional hearing that suggests a semi- strong form violation, meaning that the market did not immediately and rationally absorb new information. The code also helps visualize behavior anal anomalies, sharp spikes in trading volume around Reddics activity, overreaction patterns, and volatility clustering that aren't consistent with rational price discovery. These datadriven visuals make the analysis easier to interpret and connect directly to the behavioral finance explanations like hurting, overconfidence, and limits to arbitrage. In summary, this stage represents my analytical blueprint using the event study code to empirically test the efficient market hypothesis predictions against GameStop's real world behavior supported by clear data visualization and behavioral context. We can see some of this that we described here. And we have the driver framework that we'll continue to use that kind of summarizes the code here. So now that we've given a little bit of background on the thought process behind creating uh this code, the next step is the imple implementation stage. And in this section, I'll demonstrate the systematic implementation of the event study methodology using our Python code. The goal is to quantitatively test whether GameStop's price movement around 2020 to 2021 events were consistent with market efficiency. or reflected behavioral irregularities. The process begins by loading all relevant Python libraries. Pandas and num numpy for data handling, Yahoo Finance for historical stock and market data, stats models for regression analysis, CYP for hypothesis testing, and Mattplot lib for visualization, which are all kind of in this area here. Then I define two key time windows. The estimate estimation window and which runs from August to December 2020. A calm pre-event period using used to estimate GameStop's normal relationship with the overall market. And then I use the event window which covers January 13th through January 29th uh at the height of the short squeeze. By separating these two periods, we can measure what returns would have been expected under normal conditions and then identify how far reality deviated during the event, which is kind of all of this right here. Using the estimation window, I fit a market model, essentially a regression, where GameStop's daily return is predicted from the market's return. The estimated coefficients alpha and beta describe GameStop's typical performance pattern before the event. This fitted model gives the expected return each day, allowing us to compute abnormal returns, the difference between actual and expected performance during the event period. Those abnormal returns are then summarized into the cumulative abnormal return, which measures the total deviation from market expectations over the squeeze window. If the cumulative abnormal returns is significantly positive, it suggests that the stock outperformed what standard models would predict, potentially indicating a violation of semi-strong market efficiency. To confirm whether the cumulative abnormal returns are uh are meaningful, I run statistical tests. A t test checks whether the average abnormal return differs significantly from zero. And a bootstrap test resamples those returns thousands of times to ensure robustness even if returns are not normally distributed. Low P values from these tests would show that event returns were statistically abnormal, not just random noise. The next part examines behavioral evidence. Now, our Python code here compares average trading volumes before and after the event, showcasing how retail uh activity exploded well beyond historical norms. It calculates uh the an AR1 coefficient essentially measuring whether returns were predictable from one day to the next. A higher AR1 values during the event suggest short-term momentum and hurting behaviors inconsistent with weak form market efficiency. I also check skewess and curtosis which quantify the asymmetry and fat tails in return highlighting the presence of extreme one-sided market movements. To test whether rational investors could have exploited these anomalies, I run simple trading simulation. The code applies a naive movement rule, buying after a positive abnormal return and selling after a negative one while factoring in realistic trading cost and short scale restrictions. This shows whether the anomalies were actually exploitable once transaction frictions were considered. If profits disappear once costs and constraints are added, that supports the arguments that markets may appear inefficient but still aren't systematically beatable by rational investors. Finally, the model produces a structured decision output summarizing the form summarizing which form of the efficient market hypothesis appears violated. Persistent return autocorrection indicates weak form inefficiency. Significant cumulative abnormal returns point to semi- strong form violations and strong form efficiency is assumed untestable with public data. The printed results summarize these findings alongside alpha beta cumulative abnormal returns p volume multipliers and trading outcomes. Our Python code here concludes with several visual v visualizations that make these results easier to interpret. Our first chart chart plot scheme stops price over time with uh several visualizations that make these results easier to interpret. uh the window shaded uh visually capturing the short squeeze spike. The second plot here shows the cumulative abnormal return curve highlighting how price deviations build up across the event period. And our third uh graph here compares average trading volumes before and during the event as well as the assignments stated retail volume multiplier. Together, these visuals make the analysis more digestible and directly connect the data behavior to the concepts of market efficiency and investor rationality. Overall, this implementation executes the event study methodology end to end from data gathering and regression modeling to abnormal return analysis, statistical testing, behavioral indicators and visualization. This systematic approach ensures that every step in the analysis is transparent, reproducible, and linked directly to the economic interpretation of the efficient market hypothesis. So now that we've implemented our code, and I've even further explained it, uh the next step is validation where we test whether our findings are statistically and economically meaningful rather than just random noise. So from our output we can see that the cumulative abnormal return uh during the event window was 3.99 or that roughly equates to 399% with a t value of 043. Uh this means that under traditional significant testing, these abnormal returns were statistically distinguishable from zero at the 5% level. Evidence that something unusual was happening in GameStop's price behavior. Uh the first chart plots as we've described uh plots their price over time. The second is the abnormal returns and the third compares the average trading volumes. Uh however when we apply a bootstrap test which resamples the data thousands of times uh without assuming normality the p value rises to 96 as we see here suggesting that once we account for the heavy tails on volatility clustering the statistical case for inefficiency becomes weaker. This tells us an important story. While price surge look while price surge looks extreme, it is difficult to statistically separated from the kind of rare events that occasionally occur in the market. To strengthen our validation, we also check economic significance, which is whether a rational investor could have earned systematic uh profits after considering risk and transaction costs costs and constraints. The back test results show that profitability depended heavily on the borrow limit. When shortening wasn't possible, returns were large, but under realistic constraints with borrowing costs and transaction fees, profits quickly dropped toward ordinary levels. That reinforces the idea that even though prices were inefficient temporarily, it is it wasn't easy for rational traders to exploit that inefficiency in real time. Finally, robustness checks confirm that the volume surged by roughly 9.2 compared to normal levels uh are consistent with behavioral activity. But over our efficiency market hypothesis test results show no clear violation of weak or semi- strong form efficiency. once transaction and liquidity frictions are considered. So in the validation stage, the takeaway is that while GameStop's event window produced massive abnormal returns, the results are fragile under bootstrapping, constrained by real world trading limits and are only marginally significant statistically. So the next stage is to evolve. And in this stage, I take what I've learned from GameStop's event and apply those insights into real world investment strategy and market policy considerations. The evolve stage is about in turning empirical findings into actionable knowledge, bridging theory with practice. From our result results, we observe that GameStop's cumulative abnormal return during the event window was nearly 400% as we can see here with significant short-term deviations from the market model. However, these extreme returns occurred only just a few trading days under conditions of exceptional volatility and market frictions. The key insight here is that even when markets appear inefficient, uh in the short term, systematic and riskadjusted profits are often impossible to capture Exxante due to limits to arbitrage, high transaction costs, and borrowing constraints. The back testing portion of our analysis reinforces this. When we simulate rational trading strategies across varying uh excuse me, when we simulate rational trading strategies across varying transaction costs and borrowing limits, the total return and sharp ratios decline sharply once realistic frictions are introduced. For example, under normal liquidity conditions and modest transaction costs, profitability dropped from over 400% in frictionless case to less than 30% when realistic limits were applied. This demonstrates that while inefficiencies may exist in theory, practical constraints are often revert are often prevent arbitraries from eliminating or exploiting them fully. for investment strategy. This implies that passive management remains the optimal approach for most investors even in the presence of occasional abnormalities. The efficient market hypothesis especially in its semi-rong form remains a powerful guiding framework because it predict correctly predicts that consistent outperformance is difficult once cost and risk are factored in. However, behavioral insights add an important layer that while prices are generally efficient, investor sent sentiment and coordination through social media can generate temporary dislocations that active managers may monitor, not to exploit directly, but to manage risk exposure exposure during volatility spikes. On the policy side, these findings emphasize the importance of the market infrastructure and transparency. The GameStop episode revealed how broker imposed trading restrictions and margin requirements can amplify short-term inefficiencies. Strengthening liquidity management, transparency in short-term interest reporting, and communication between retail and institutional participants can help stabilize markets without suppressing the without suppressing legitimate retail participation. Ultimately, this stage shows that our understanding of market efficiency must evolve from a binary concept to a con continuum. Markets are not perfectly efficient or wholly irrational, they are adaptive systems where information, incentives, and human behaviors interact dynamically. The practical takeaway is that while inefficiencies can emerge, they are typically unpredictable, short-lived, and difficult to monetize systematically, reinforcing the enduring relevance of efficient market principles for long-term investors. In the final stage, which is reflection, we step back to synthesize what our analysis reveals about how markets truly behave, not just in theory, but in practice. The efficient market hypothesis predicts that prices fully and instantly reflect all available information in this weak form. In its weak form, prices should already incorporate past price movements. In its semi-rong form, all publicly available information should be embedded in prices and in the strong form, even insider information would be reflected, leaving no room for consistent excess returns. Our analysis of the GameStop short squeeze shows that while prices deviated dramatically from fundamental values, these deviations were not a straightforward violation of the efficiency market hypothesis. The cumulative abnormal returns were statistically large. They occurred under extreme conditions including concentrated short interest, unprecedented retail coord coordination and temporary trading restrictions. These represent structural and behavioral distortions rather than persistent inefficiencies. Often those factors subsided. Prices quickly realigned with fundamentals consistent with the idea that markets are self-correcting over time. Behavioral finance provides the missing context for understanding why the efficient efficiency market hypothesis appears to break down during events like this. hurting behavior, social amplification from platforms like Reddit, and overconfidence created positive feedback loops that drove prices far from equilibrium. Simultaneously, limits to arbitrage, including high borrow cost, margin pressure, and platform imposed restrictions prevented rational investors from correcting the mispricing. These mechanisms explain how temporary inefficiencies can emerge even in an otherwise efficient market framework. When we bring both when we bring both perspectives together, the conclusion is that the efficiency market hypothesis is not wrong, but that it's incomplete without behavioral and structural considerations. The efficiency market hypothesis captures the long run equilibrium forces that restore efficiency while behavioral finance explains the shortrun deviations driven by human psychology and institutional constraints. In reflecting on this project, the key lesson is that the real world markets operate in the intersection of efficiency and emotion. Information does not move rapidly, but human behavior determines how it is interpreted and acted upon. The GameStop event ultimately reinforces a nuanced understanding, which is that markets are broadly efficient but subject to short-lived inefficiencies when a collective sentiment, constraints, and incentives align in an unusual way. Overall, this case demonstrates that while markets can bend under collective emotion, they rarely break under reason, illustrating the dynamic coexistence of behavioral forces and the long run market efficiency. Thank you.",
  "video_url": "https://youtu.be/hoEPGzF3bE8"
}