{
  "student_name": "Cruz Tirado Rojas",
  "org_defined_id": "037412563",
  "username": "ctirador",
  "email": "",
  "transcript": "For this assignment, we are to do a a cost of capital analysis. We calculate the a weighted average uh cost of capital for Netflix in connection with a hypothetical $5 billion content content investment decision. Your analysis must determine current walk. Evaluate the impact of additional debt financing. Assess project specific versus firmwide discount rates. And compare Netflix's cost of capital to industry peers. So let's look at the Netflix financial parameters. The market capitalization uh is $200 billion. The total debt uh book value is $14 billion. The debt market value is $13 billion. And then the equity beta is 1.3 with a bond rating of BBB plus with the yield of 5.8%. The corporate tax rate is 21%. The current stock price is $450. Then some of the market conditions, the risk-free rate is a 10-year Treasury of 4.5%. Uh market risk premium is 5.5%. The media industry walk range is 8 to 10%. And then some strategic context is Disney's capital structure with a 70% equity 30% debt with a walk of 8.2%. Then Amazon Prime Video uses Amazon corporate 9 walk of 9.5%. Then Netflix is considering a $3 billion additional debt issuance for content investment. What is Netflix's walk? These are the three main steps. What is Netflix's walk? How does Netflix's walk change after $3 billion debt issuance? How does Netflix's walk compared to Disney? So, we're going to be using these two formulas for the CAPM and the walk from the textbook. So first we use the CAPM formula to calculate the cost of equity. The risk-free rate is 4.5%. The beta is 1.3 and then the market risk premium is 5.5% as we stated earlier. So we can easily calculate it with uh the calculate the cost of equity. So we do 5.5% plus 1.3 * 5.5% which will end up as 11.65%. Then I mapped out the walk. So the market value of equity is $200 billion. The market value of debt is $13 billion. Then the total firm value is $213 billion. The cost of equity which we just calculated was 11.65%. The pre-tax cost of debt is 5.8% and the corporate tax rate is 21%. So I went ahead and gave Gemini these these uh this information. And so we can see the Netflix financial parameters, the market conditions and the strategic context. So step one is to calculate component cost, cost of equity, cost of debt. Then uh the equity weight, debt weight, current walk for the current walk, then the we calculate the pro for walk, which is the post $3 billion issuance of that. And then uh this is what Gemini gave us. So we can see the cost of equity cap m is 11.65% which is we we calculated earlier. The cost of debt after tax is 4.58%. The current capital structure is uh the equity weight is 93.9%. The debt weight is 6.1%. The current walk is 11.22%. Then proforma capital structure which is post $3 billion debt issuance. Uh the new equity weight is 92.6%, the new debt weight is 7.4%, the new proformal walk is 11.13%. So here are some uh strategic insights. So the impact of debt, the new walk 11.13% is lower than the current walk due to the tax shield. The peer comparison Netflix's walk is high versus Disney's which is 8.2%. This is driven by lower low leverage of 6.1% as we can see here the debt weight is 6.1% uh versus Disney's 30% as we saw earlier uh and a higher beta of 1.3. So the hurdle rate the 11.13% walk is the firmwide hurdle rate. High-risk projects must use a higher rate. So the walk is basically a benchmark for high-risk projects. They must have a higher rate um in order to be uh chosen. So does the cost of equity make sense? Is the walk sensitive to leverage? And why is Netflix's walk much higher than Disney's? So the cost of equity does make sense since the beta of Netflix is 1.3. The walk is sensitive to leverage since it changed from 11.22% to 11.13%. I believe it is higher because Netflix focuses on one thing streaming service while Disney is spread out to different ways of generating cash. Another thing that we can see is that Netflix is barely leveraged and Disney uses a 30% cheaper tax advantage debt. So what is the walk major role in financing decisions? So the walk will act as a hurdle rate for the $5 billion investment. It can also be used as a discount rate for average risk projects. We are able to see that the walk can be lowered by a debt issuance. So we can change the capital structure of the company and optimize it. So here's a little reflection. After analyzing Netflix's walk, we can see that the walk is higher than that of Disney. We can explain it by the cash flows of the companies and their capital structure. We can also say that the walk is higher than that of Amazon Prime Video and also higher than the media industry average. So this gives Netflix a disadvantage since their hurdle rate for projects is much higher. We also see that we can lower the walk by adding a leverage by like the debt issuance. This demonstrates that the capital structure is not optimized. If we optimize the capital structure and lower the walk, it will allow Netflix to invest in more projects with the $5 billion investment. That is all. Thank you.",
  "video_url": "https://youtu.be/hO9CVupekEU"
}