{
  "student_name": "Julia Munkholm",
  "org_defined_id": "037076876",
  "username": "jmunkhol",
  "email": "",
  "transcript": "this assignment we are talking about um opening a new roaster in flagship and so here I'm going to read the problem to you then the parameters and all that and then we can get started with our driver analysis so evaluate Starbucks proposed flagship roaster that requires a 12 million upfront outlay and is expected to operate for 10 years the firm's 8.5% WACC as the hurdle rate to determine whether the project creates value and to recommend and accept reject decision supported by driver documentation. So the project parameters initial investment is 12 million um and depreciated straight line over 10 years. Working capital is 500,000 deployed at launch and resolved in year 10. Revenue is 8 million in year 1, 11 million in years 2 through 5 and then 9 million in years 6 through 10. And then operating cost of goods sold is 40% of revenue. Labor is 2.5 million. Rent and utilities is 08 million. Marketing is.3 million in year 1 and then 0.1 million thereafter. Taxes um 25% corporate rate terminal value 3 million at the end of the year 10. Um so focus the the you're supposed to focus your analysis on producing transparent cash flow model core capital budgeting metric matrix sensitivity test and an executive ready recommendation. So specific requirements build year 0 through 10 incremental cash flow schedule that includes revenue operating costs depreciation tax shields taxes working capital changes and terminal value. Um, calculate NPV irr, discounted payback period, simpler payback period, and profitability index using Starbucks's WACC run sensitivity run sensitivity analysis for first revenue reduced by 20% and WACC um, plus or minus 2% and summarize the impact on NPVIRR. Provide a re recommendation that weighs financial results, st strategic fit, brand implications, and key project risks. Use Python to automate cash flow construction, metric calculation, and scenarios. Parameitize assumptions so that revenue, cost, discount rate, inputs can be updated easily. And lastly, visually visualize cash flows and at least one sensitivity output to support the narrative. So first for the define and this discover Starbucks is considering launching a flagship roaster required 12 million upfront investment plus 500k working capital. The project operates for 10 years and is evaluated using Starbucks 8.5 policy. Leadership needs to know whether the project creates economic value, fits strategic objectives and withstands the sensitivity to revenue and discount rate changes. So, does the flagship grocery produce a positive NPV and strategically enhance Starbucks's brand or should it be rejected is basically like what we're trying to figure out. So, then the represent um this is just kind of what we should go off of when like reading the results we get from this. So um the net present value formula first MPV equals um the sum of um basically the initial investment um divided by 1 plus the rate over um t which is the period and then r is the discount rate and then yeah you can you can see the formula right there and then the decision rule is so if NPV is greater than zero you accept the project if NPV is less than zero you reject the project and if MP V is equal to zero um it's indifferent so it earns exactly the cost of capital so like it wouldn't earn you anything but it won't hurt you either um operating cash flow calculations so OCF equals revenue minus cost minus depreciation time 1 minus T which is time plus depreciation or um OCF can also equal EBIT * 1 minus t plus depreciation. So total project cash flow components initial investment is the equipment working capital installation costs operating cash flows after tax operating income plus depreciation and terminal cash flows asset sale value plus working capital recovery. So now the implement stage. So use information this is what I plan to do. Use information given to input into Gemini while answering all the questions about above NPV and having the code use this to determine if flat ship roaster is a smart decision. Use Gemini to create code that will answer our question in clear and organized manner so it is easily easy to interpret the data given by the codes. So basically I put all the questions that we wanted answered that I read earlier into the code plus all of um the requirements and the past data that we were given and um told it to solve for NPV do the cash flow thing all of that. So now we can go look at that. Oh, sorry about that wrong one. There we go. So here is the code that I created. Um we can run it real quick. And then so here it's just going to start um it gets the data that we have. Um this is the base assumption. So this is all the data that we already had and the operating assumptions as well. And then this is when it's starting to calculate like um well this is like the like how much revenue we're getting per year and then the marketing costs and the cash. So this is when it starts calculating the cash flows using depreciation straight line as it said um in the problem and so it's doing cash flows and it starts a loop to um get the cost of goods sold and revenue and start getting the cash flows um taking into account taxes. Um so then if you just scroll down here and then right here it's calculating the um net present value and the IRR so execution and reporting. So it starts with the base sensitivity WACC and then out the output um generation. So there's that. So now we get back out to our like actual output. So here's the cash flow schedule um for years 0ero through 10. Um as you can see so it's like the revenue so zero and obviously 01 um in the first or in the before we start the project I guess um 8 11 111999 so that was all already given to us then the FCF um for this cash flow schedule is -2.5 for year zero 1.2 2 for year 1, 2.7 for year two, and then 2.7 for the rest of the years until year six. At year six, it's 1.8, and then it's 1.8 until um the 10th year, and then the 10th year, it's 4.55. So, the description for this, the schedule begins with a 12.5 out outflow. Um that's the building costs and such. And then the peak is from years 2 to five. And then year 10 spikes due to asset liquidation. So then um to the capital budgeting matrix. So the MPV is at 8.5% is 2,690,879. The IRRa ends up being 12.84% and the payback period is 5.28 years. And then the profitability index is 1.22. Um MPV sums the present value of all FCFS. IR was solved um um using a bisection search until MPV was equal to zero. Payback identifies when cumulative FCF turns positive. So sensitivity analysis base MPV is 2.69 million. The revenue um for minus 20% equals um negative 3.08 million which is an impact of negative 214.6%. 6% um on this and then the WAC ACC at 6.5% equals 4.24 million. The WACCC at 10.5% equals 1.35 million. So in summary, the revenue is the critical driver. 20% drop turns NPV negative um destroying the value and then WACC is WACCC's voltality is manageable even at 10.5 WACC the project remains profitable so recommendation is to accept while the project offers a strong base MPV of 3.2 2 and a 13.5 IRR. It is highly sensitive to topline performance. We recommend accepting providing that the marketing team validates the 11 million revenue target for years 2 to 5 as a 20% shortfall makes this project basically um makes it so you would lose money. So it would not be the choice if there's a 20% shortfall shortfall um in revenue. So now we can go back to this. So that's the implement stage. So validate quality checks include so we confirm the depreciation matches capeex ensuring the um working capital deployment recovery appears correctly in FCF reasonable reasonleness checks on margins and cost structure. Yep. Cross-checking IR through multiple methods in Python. We did that. And then recomputing MPV under different rates to test consistency. So that was done. So basically the evaluate base um base case MPV um was greater than zero and IRR was greater than WACC. So that is why this decision is acceptable and then the benefits um to this project expand the Starbucks experimental brand presence reinforces premium market segment creates marketing halo for global stores and potential tourist destination/ flagship experience. So the risk high fixed cost exposure if revenue falls. Um so like we mentioned in the code if there's more than a 20% fall this would not be a profitable endeavor for Starbucks to do um luxury experience traffic can be um cyclical and execution complexity and then lastly brand man damage if performance disappoints which is always the case for this kind of stuff. So from my reflection I said working through this capital budgeting analysis reinforced how valuable a structured framework like driver is uh for organizing complex decisions and balancing quantitative results with with strateg strategic judgment. Building the cash flow model made the importance of transparent assumptions very clear, especially how small changes in revenue cost and discounts discount rates meaningfully shift MPV and irring how sensitive long horizon retail projects can be. The exercise deepened my understanding of depreciation tax yields, working capital timing and terminal values. And the sensitivity analysis highlighted the difference between a project that merely looks good on paper and one that is actually robust under uncertainty. Most importantly, integrating financial result results with broader considerations like brand positioning, experimental value, competitive differentiation and exe execution risk showed that strong recommendations require both analytical discipline and an appreciation of Starbucks strategic objectives. So that is um this project about Starbucks and",
  "video_url": "https://youtu.be/keLTCcvm23Y"
}