{
  "student_name": "Caden David",
  "org_defined_id": "035815616",
  "username": "david54",
  "email": "",
  "transcript": "Hi, my name is Kaden and this is my management 310 assignment 8 project. In this assignment I will provide a structured analysis of the 2020 and 2021 GameStop short squeeze specifically to investigate the principles of the market efficiency. So, the case study is GameStop from 2020 to 2021. The objective is to investigate the market efficiency and analysis price behavior related to the efficient market hypothesis and evaluate market anomalies. I will be using driver framework to structure my analysis. The primary objective of this assignment is to use the GameStop event case study to test the efficient market hypothesis. My analysis required to verify historical data, test the different forms of market efficiency, evaluate behavioral explanations and access the implications for investment theory. I have structured this entire process using the driver framework. The methodology of the driver framework. Consists of the define and discover where I state the problem and verify all initial data. Represent, acquire and structure the complete data set for analysis. Implement ex execute the technical analysis including the calculations and visualizations. Validate cross reference results with assignment data to ensure accuracy. evolve, analysis, analyze the implications of findings on investment strategy and then reflect where I synthesize the efficient market hypothesis theory with behavioral finance concepts. The driver framework provides a six step methodology. I will begin by defining the problem and discovering the facts. I will then show how I represented the data implemented the analysis. Finally, I will validate the results and involve the findings to conclude reflection on market theory. I will now proceed with step one with the define and discover. So for the define and discover I verifying the critical step it was clear we were testing the efficient market hypothesis. The discover stage began with a critical data ver verification test. The assignment provided a statement GameStop traded at 4 cents in August 2020. My first tech technical task was to verify this fact. So, I used the Python script Yahoo Finance library and download the actual historical trading data for GameStop in August 2020. You can see from the script the scripts outline the claim was found to be incorrect. the co's analysis of the historical data showed the lowest split adjusted price in August 2020 was $1.39. While the price was indeed very low, it was not 4 cents. This finding was significant as it underscores the importance of validating all given information before an in analyzing. I proceeded using the verified historical data and step two was represent acquiring and summarizing the event data set. Here I moved from a single data point to acquire the complete data set for the entire event using the script. I downloaded GameStop price history from January 1st, 2020 to December 31st, 2021. The code then generate a high level of statistical summary of this data. which is right here. This summary table provides our first look at the anonymity. The maximum price exceeded 480 while the mean or average price was only 22 most importantly the standard deviation a measure of voluntary was 22. Most importantly, a standard deviation of this magnitude which is larger than mean itself is a stronger statistical indicator of extreme instability and a significant deviation from the normal market behavior. next was calculating the daily returns for volatility analysis. Step where the main analysis occurs as a proxy for an event study. I implemented a calculation for a simple daily returns. This measures day-to-day price changes as a key indicator of volatility. My script calculated this for the entire data set and then generated statistical summary of these daily returns which is right here. So we have the table is highly revealing the max value being 1.35 indicates that on the best day the stock prices increased by 135% in a single trading session. this level of return is a clear anomaly. but the most powerful part of the implementation is the visual analysis. As you can see the visual analysis has an event timeline and market anomaly. this chart generated by my script is a the central piece of evidence of this analysis. The blue line is the GameStop price. The gray band represents the 10 to to 40 fundamental value range provided by analysis for the most of 2020. You can see the price trades with within a near fundamental value. The green dotted line marks the news of Ryan Cohan's investment in September 2020. The market reacts to this new public information and the price begins to drift up. This is a const constant with a efficient market. Then in January 2021, the price completely disconnects from the fundamental reality. It explodes over $400 dri driven not by new comp company information but by social media statement in this short squeeze. This visual demonstrates a clear violation of the semi- strong form market efficiency. This states that prices should reflect all public available information. Here the price is clearly reflecting the hard behavior and and behavioral factors not from public fundamentals. Validate. Step four is validate. It is a cross check to ensure my NASIS is sound. The assignment material noted a peak price of $483. I used my code to find the maximum price and downloaded a data set to verify this. As the output shows my data set identified the peak high of of $483. this figure aligns directly with the assignment data. This validation confirms my data set is correct and the analysis performed is the implement phase is based on accurate relevant data. Step five is evolve where we analyze the strategic implementation of these findings. The event might suggest that active trading is superior as some traders won big. However, this is a dangerous conclusion. For every small trader who profited, many others brought bought at the peak and suffered massive losses. Furthermore, a highly sophisticated active investor, the hedge fund Melvin Capital, lost billions by betting against the anomaly. Therefore, this event does not prove that superior of active management. Instead, it highlights the extreme risk of departing from a fundamental based strategy. For the average investor, this event reforces the principles of passive long-term diversified investing as a means to avoid such sculpticated risk. Finally, step six, reflection on the theoretical implications. This event does not by itself disprove the efficient market hypothesis. Markets are on average and over the long term largely efficient. What the GameStop event demonstrates is the critical interplay between the market efficiency and the behavioral finance. The efficient the efficient market hypothesis can be seen as the physics of the market. The rules of value and information it strives to follow. Behavioral finance is the psychology. Human bias like hurting, overconfidence, and loss aversions can that can under specific conditions overwhelm the system. In January 2021, a perfect storm of social media market structure issues like high short interest in human psychology created a temporary violent break from the physics of the market. The event shows that the a complete understanding of the market requires a sensics of both theories. In conclusion, by following the driver framework, I was able to systematically move from an initial data cury to a full scale analysis. I verified the initial data by implementing a visual analysis that clearly demonstrated the anomaly by validating my results in conclusion that the event is a powerful real world example of behavioral finance and action. It shows that while markets strive for efficiency, they are ultimately driven by human participants. And that's all. Thank you.",
  "video_url": "https://youtu.be/ErtAz7htxEo"
}