{
  "student_name": "Daniel Verachtert",
  "org_defined_id": "037038927",
  "username": "dveracht",
  "video_url": "https://youtu.be/jBfvmB4M-j8",
  "transcript": "Hi, my name is Daniel Verachtert and this is the session 11 assignment corporate financial decision analysis. Uh so on my first slide I have uh the capital allocation decision. So Apple's evaluating a $90 billion share uh repurchase. Uh this represents 10% of the market capitalization. Goal is to maximize long-term shareholder value by uh the all of this must balance owners, management, employees, and bond holders. Uh the alternative uses of capital can go towards special dividends, AI/VR acquisition, debt reduction, and R&D expansion. uh Apple's cash and investments of $165 billion of liquidity. Uh and then uh $90 billion buyback repurchase repurchases shares. Uh so on this first slide we can see right here I have the ownership. Obviously the majority is retail and other institutional investors. Um I mean you can't even see the CEO employee stock shares. Uh Birkshshire Hathaway has 6%. Uh but you could see the majority is retail and others. Uh these are the metrics or yeah but uh so the cash investments the I'll just go over the main points because there's a lot here but a $90 billion buyback would use over 54% of the total liquidity that the that Apple has uh because Apple has 165 billion in liquid resources. They do have a lot of flexibility, but putting 90 billion into a buyback would like waste tons of that. Um, the uh annual free cash flow. So, Apple generates hundred billion dollars per year after operations and capital spending. This is the engine that replenishes cash. This means that Apple could make back the 90 billion in about 11 months. Um down here the debt Apple isn't debt free. It already has a lot of debt. So if Apple does spend cash instead of reducing debt, bond holder risks increase and balance sheet flexibility ranks. Um and then the buyback size, it's not a small program. It represents 10% of the market capitalization over half the cash reserve. The scale guarantees EPS impacts ownership shifts and stakeholder consequences. So this is the earnings and EPS. So the base EPS would be 6.7 and the base net income would be or sorry 6.17 and then base net income would be 95.6 billion and then after the buyback the shares we purchased would be 486 million. um the new shares would be 15.014 billion. So a decrease um of the 486 million. So this decrease uh this is a decrease in total number of shares meaning the previous shareholders now in a bigger slice. Uh and then the new EPS uh grows to 6.37%. uh and the EPS increases even without a profit growth it increases by 3.2%.\n\nUm ownership and leverage impacts so the ownership shifts Birkshshire increases its uh from 6% to 6.2 too. So, it increases in control without buying shares. The CEO and long-term holders automatically increase uh managers benefit even if long-term value doesn't increase. And then retail and other institutional investors, the ownership increases, but they only benefit if they hold. Short-term sellers uh become long-term holders. So the leverage effect post buy out or sorry post buyback cash would become 75 billion. Uh the debt remains at 110 billion. So Apple now has more debt than cash. Uh that shrinks its liquidity buffer to 45%. Um uh there's increases in shareholder EPS, increases in risk for bond holders and decreases the company's uh crisis flexibility.\n\nSo these are the alternatives. So the alternatives it's obviously we're doing the buyback but the alternatives would be the special dividend acquisition debt reduction or um R&D and this shows that a buyback has a positive effect on EPS. These have no or no effect or a negative effect. Um the buyback has an increase in risk and then uh dividend decreases risk, acquisition increases risk a lot and then debt reduction uh substantially lowers risk and then uh R&D just somewhat lowers risk. Um buyback has no effect on uh innovation. Dividend has no effect on innovation. Acquisition uh seriously increases innovation. Debt reduction has no effect. And then R&D has a serious effect on innovation. Ownership. Uh buyback obviously it has a positive impact on ownership. Uh these have no effect. Um yeah so valuation versus uh sorry value creation versus value transfer and signaling. So um the buyback EPS grows without profit growth signal uh undervaluation despite PE or uh the E equaling 30 agency benefits to managers the value showing it's a value transfer uh dividend pure cash transfer the value transfer no EPS manipulation acquisition and R&D our actual creation or value creation possibilities and have high variance. You can see down here I have a graph or not a graph like a lot a chart showing that the value transfers and value creation like the scale on which they're at. So, a hybrid strategy uh $50 billion buyback, $20 billion debt reduction, and $20 billion R&D and AI infrastructure. Uh I have this on the bar graph here as well. The benefits would be EPS still rises, leverage falls, innovation is protected, and stakeholder conflicts are reduced. My final recommendations and takeaways. Do not execute a full $90 billion buyback due to EPS inflation without intrinsic growth. Increases in bond holder risk. Uh reduced strategic flexibility. Key lesson buyback uh buybacks reshape power not just pride. Capital allocation is a governance decision and hybrid strategies outperform extremes. Uh, now I'm going to share my code.\n\nOkay, here's my code. Um, I'll run it here.\nOkay. Um, yeah. So, this shows the Sorry, here we go. uh this shows the different scenarios and their uh like values. So we could see the baseline and then this is uh the buyback and these are just the other alternatives and it has a graph for all of them. Obviously, most of these graphs aren't that noticeable. They're minute differences in EPS, but um yeah, thank you."
}