{
  "student_name": "Carter Perez",
  "org_defined_id": "034075354",
  "username": "perezcj",
  "email": "",
  "transcript": "Hello, my name is Carter Press. Today I'm presenting a capital structure analysis for Netflix regarding a hypothetical $5 billion content innovation. To ensure this uh analysis, I follow the driver framework, define, review, identify, verify, execute, report. My goal was to calculate um the current weighted average of capital or the WACC and assess the impact of adding 3 billion in debt and compare Netflix to its rival Disney. So first stage in the define and discovery phase um we gather our inputs and givens. So we know Netflix is equityheavy with a $200 billion market cap and only 13 billion in debt. Current market conditions give us a risk-free rate of 4.5% and a market risk premium of 5.5%. Netflix beta is 1.3 identicating it is 30% more volatile than the market code explanation. So little explanation of code here. So to execute this I built Python model to ensure precision and scalability. So let me walk you through it. Starting off at um the cost of equity. Going to use the CAPM function here. Well, I guess these are just defining it up here, but okay. So, we're going to use the um CAM function here. I calculated I used the this function in Python with a beta of 1.3 and the cost of equity. It comes out to 11.65. This is the return risk. um uh that they're taking. And then cost of debt calculated the cost of debt by uh because interest payments are taxdeductible, the government effectively subsidizes our debt. And there's a 5.8% bond yield that becomes effective just the cost of 4.58%. And then we're going to go here to the I function the WACCC calculation. So this uh Python then weighs that these two costs based on Netflix capital structure. Currently Netflix is 94% equity. This heavy reliance on expensive equity drives up our WHCC to 11.22. Then I ran this scenario again where Netflix issues 3 billion in new debt. And this model uh recalculates in ways and then shows that our WACC drops to 11.3%. Then we're going down to the graph. Some of the visualization here. Uh I also use this Python's map map uh plot library to visualize our sensitivity to leverage. As you see on this chart, the red line represents Netflix's WACC. As we add more debt, um the it decreases. Currently, we're here at the top left. Down here is Disney. this thin blue line and this visual proves that Netflix is underleveraged and that we are paying a premium premium for safety. So my recommendation is to approve the $3 billion debt issue. It lowers our hurdle rate to 11.13% and takes advantage of tax shield without threatening our investment grade rating. However, for the 5 billion investment itself, we must be careful. Um, it might add risk a risk premium. And in conclusion, Netflix has a significant opportunity to optimize its capital structure by slowly increasing debt.",
  "video_url": "https://youtu.be/br160ARZ1Qc"
}