{
  "student_name": "Connor Bakota",
  "org_defined_id": "035716300",
  "username": "cbakota",
  "video_url": "https://youtu.be/eDEni-zZrRk",
  "transcript": "Hello and welcome back to Managing 310.\n0:04\nUm today we're going to be doing session\n0:05\n13 um our capstone project. Um today um\n0:10\nwe're just going to go over um what this\n0:12\nsession implies. Um as you see we spent\n0:14\nour 12 last sessions learning about\n0:16\nfinancial analysis. Um just give us a\n0:18\nlittle overview of what this project is.\n0:20\nUm it is not a research paper, not a\n0:22\ncase study analysis, not a traditional\n0:24\npresentation, not something AI could do\n0:26\nalone. Um uh and then we're going to do\n0:29\nproof. Um you can build solutions,\n0:31\nevidence you understand AI plus finance.\n0:33\nUm your first portfolio piece and our\n0:35\npractice for your actual career. Um some\n0:37\nrequirements that must be interactive,\n0:38\nnot a report, something people use. Um\n0:41\nmust use AI language models like OpenAI,\n0:43\nClaw, Gemini or whatever works. Must\n0:45\nsolve a real financial problem. If no\n0:47\none needs this, start over. Um and must\n0:50\nactually work. Live demo is required\n0:52\nobviously.\n0:53\nUm so uh some of the ideas I came across\n0:56\nwere bots that explain market moves in\n0:58\nplain English. I thought that was be\n1:01\nuseful. Um I also thought AI that\n1:02\ndetects unusual stocks or options\n1:04\nactivity would be useful. Um however the\n1:06\none that I found the most um useful\n1:08\nafter you know you know picking my brain\n1:10\nand figuring out um numerous tries and\n1:12\ndifferent demos of different things. Um\n1:14\nthe one that I found that was most\n1:15\nuseful um was the tool that translate\n1:17\nFedSpeak to trading signals. Um, I feel\n1:19\nlike that is the most impact and I think\n1:21\nthat's something where I struggle is um,\n1:22\nbeing able to read these Fed statements\n1:24\nand understand what they're saying\n1:26\nthrough just what they're saying. Um,\n1:27\nit's hard to understand and predict um,\n1:29\nand it takes a lot more time um, than if\n1:31\nI'm just able to, you know, translate it\n1:34\num, live.\n1:36\nUm, so something that I did was I looked\n1:39\nup a um, recent um, Fed statement. Um\n1:42\nand right here you see um available\n1:44\nindicators suggest that economic\n1:46\nactivity has been expanding at a\n1:48\nmoderate pace. Job gains have slowed\n1:49\nthis year and the employment rate has\n1:51\nedged through September. Um more recent\n1:53\nindicators are consistent with these\n1:54\ndevelopments. Inflation has moved up\n1:56\nsince early in the year and remains\n1:57\nsomewhat elevated. We're going to skip\n1:59\nthrough. Um the committee judges that\n2:02\nreserve balances have declined to ample\n2:04\nlevels and will initiate purchases of\n2:05\nshorter term treasury securities as\n2:07\nneeded to maintain an ample supply of uh\n2:10\nreserves on an ongoing base basis. Uh I\n2:13\njust pulled two paragraphs from that but\n2:15\num you know realistically I didn't pull\n2:17\nmuch from that. I wasn't fully\n2:19\nunderstanding what was going on. Um and\n2:21\nit's a lot of you know cushion talk and\n2:23\na lot of things that um they have to say\n2:25\nbut doesn't make sense to the normal\n2:27\nperson. So that's why I wanted to make a\n2:29\nFed translator. Um so through this um I\n2:32\nasked if can you create a chatbot that\n2:33\nallows you to translate um what the Fed\n2:35\nsays into possible market trends and\n2:36\nmovements.\n2:38\nUm and this basically going to translate\n2:40\num how we should be reacting to these\n2:42\nFed statements. You can see on our left\n2:44\nterminal right here is going to be our\n2:45\nchatbot. And then our right terminal um\n2:47\nover here um is going to be our our\n2:49\ndashboard for all that. Um\n2:52\nand then our interactive uh simulations\n2:55\nare going to be about soft landing uh\n2:57\ntransitory and higher for longer to see\n2:59\nthe dashboard react. Um and then mobile\n3:02\nresponsive on small screens. Um overall\n3:05\nthis is going to be where we're going to\n3:06\nplug in these you know fed statements.\n3:08\nUm so going to that one fed statement\n3:09\nthat we just read. We didn't pull much\n3:11\ntoo too much from it. Um but we're going\n3:13\nto take this and copy it.\n3:17\nCopy this and put it over here. and\n3:19\nwe're going to see what it shoots out\n3:20\nfor us um in our fed decoder.\n3:24\nAll right. So, I mean it makes it really\n3:26\nsimple for us. We obviously have um a we\n3:30\nhave the understanding of you know a\n3:32\ntranslation right there. Um and you can\n3:36\nsee that we have um a translation we\n3:38\nhave a Hawin dove meter right here. Um\n3:40\nwe have a rate hike um probability right\n3:43\nhere. And then we have sector imp impact\n3:45\npills right here um that kind of give us\n3:47\nour understanding. And then we have our\n3:49\nkey takeaways at the bottom, but we're\n3:51\ngoing to go through this. Um, so the\n3:53translation says, \"We are prepared to\n3:54\nraise rates further if appropriate and\n3:56\nintend to hold policy at a restrictive\n3:57\nlevel until we are confident that\n3:59\ninflation is moving sustainably down\n4:01toward our objective.\" This is basically\n4:03\nsaying don't expect the cuts anytime\n4:05\nsoon. Um, we're scared of inflation\n4:06\nresurging and we'll accept some economic\n4:08\npain um a recession risk um to kill it\n4:11\ndead. And then our sentiment gauge, you\n4:12\ncan see um we're very high. We're at a\n4:14\nhawk and titan. Um the current bias is\n4:16\nhawkish. um a rate height probability.\n4:19\nUm we have a hold of 60, we have a cut\n4:21\nof zero, and we have a hike of about 40.\n4:24\nUm so we're, you know, we're kind of\n4:27\nwe're pushing a little bit towards hike,\n4:28\nbut you know, for the most part, we're\n4:29\nprobably going to be holding where we're\n4:30\nat on our rate hike. And then our sector\n4:33\nimpacts, you see our grow, our tech\n4:35\ngrowth is um down, declining. Discount\n4:38\nrates remain high um and uh hurting\n4:40\nvaluations. Our utilities are down.\n4:42\nHigh-risisk free rates make dividend\n4:44\nyields less attractive. Um then our cash\n4:46\nand treasuries um yields remain elevated\n4:48\nand attractive. Um and you can see in\n4:50\nour key takeaways, no pivot in sight. Um\n4:53\ncost of capital remain high. Um and cash\n4:55\nis still king. Um so that's our first\n4:57\none. Now we're going to go to the second\n4:59\nFederal Reserve statement from March\n5:01\n16th, 2016. We're going to read this\n5:04\nfirst one. Information received since\n5:05\nthe Federal Open Market Committee met in\n5:07\nJanuary suggests that economic activity\n5:09\nhas been expanding at a moderate pace\n5:10\ndespite the global economic and\n5:12\nfinancial developments of recent month.\n5:14\nUm, household spending has been\n5:16\nincreasing at a moderate rate in the\n5:17\nhouse sector has improved further.\n5:19\nHowever, businesses fixed investment and\n5:21\nnet exports have been soft. A range of\n5:23\nrecent indicators, including strong job\n5:25\ngains, points to additional\n5:26\nstrengthening of the labor market.\n5:27\nInflation picked up in recent months.\n5:29\nHowever, it continued to run below the\n5:31\ncommittee's 2% longer run objective,\n5:33\npartly reflecting declines in energy\n5:35\nprices and in prices of non- energy\n5:36\nimports. Market-based measures of\n5:38\ninflation com compensation remain low.\n5:41\nsurvey based measures of longerterm\n5:43\ninflation expectations are little\n5:45\nchanged on balance in recent months. Um\n5:48\nso I didn't really get much from that.\n5:49\nUm maybe some people did. I mean I heard\n5:52\num job growth and a few other things\n5:54\nwhich sounded good, but what does that\n5:56\nreally mean? Um we're going to throw\n5:57\nthis into our decoder and see what it\n6:00\ngives us um for our understanding. And\n6:03\nas you can see pretty quickly it gives\n6:04\nus our answer. Um our translation says\n6:07\ninflation is likely to be transitory. Um\n6:09\nwe believe the current price increases\n6:11\nare temporary anomalies caused by supply\n6:13\nchain bottlenecks and reopening friction\n6:15\nnot structural economic overheating\n6:17\nwhich is good. Um and then we can see um\n6:19\nit just reinforces our you know\n6:21\nunderstanding of that it is good. Um\n6:22\nwe're in dove. We're really low and\n6:24\ncompared to what we were at last time we\n6:25\nwere hawk and really tighten um we're um\n6:28\ndovish in our current base um bias. Um\n6:31\nand then our uh rate hike probability uh\n6:34\nwe have a cut of about five. Not very\n6:36\nlikely but our hold is at 90% which is\n6:39\nreally high and kind of gives you a good\n6:40\num feeling about it. And then you see\n6:42\nour hike is at only five value which is\n6:44\nmuch different than our last one. Then\n6:46\nyou can see our sector impacts. Our tech\n6:48\ngrowth is rising um low rates for longer\n6:51\nfavors high uh with high duration\n6:53\nassets. Our real estate is growing.\n6:56\nMortgage rates remain suppressed. But\n6:57\nyou can see our financials are going\n6:59\ndown. flatter healed curves um squeezes\n7:01\nthe margins. Um and our key takeaway is\n7:03\nFed is prioritizing employment over\n7:04\ninflation control for now. Liquidity\n7:07\nwill remain abundant and risk on\n7:09\nenvironment for speculative assets. Um\n7:12\nthat's our second one. Um once again,\n7:14\nvery quick and very easy to understand\n7:17\nafter putting into our Fed decoder.\n7:19\nFinal one, we'll go over the first um uh\n7:22\nparagraph and then we'll just throw it\n7:23\nin our Fed um decoder um and realize\n7:26\nwhat's going on. So um information\n7:28\nreceived this is also from March 13th\n7:30\n2020 uh 2012. Uh the information\n7:32\nreceived since the federal open market\n7:34\ncommittee met in January suggests that\n7:35\nthe economy has been expanding\n7:37\nmoderately. Labor market conditions have\n7:39\nimproved further. The unemployment rate\n7:41\nhas declined notably in recent months\n7:42\nbut remained elevated. Household\n7:44\nspending and businesses fixed investment\n7:46\nhave continued to advance. The housing\n7:48\nsector remains depressed. Uh inflation\n7:50\nhas been subdued um in recent years. All\n7:53\nthe prices of crude oil and gasoline\n7:55\nhave increased lately. longer term\n7:57\ninflation expectations have remained\n7:59\nstable. Okay, so we have that\n8:00\nunderstanding right there. Once again,\n8:02\ndidn't get too much out of it. It's only\n8:04\none paragraph out of the six that they\n8:06\nhave there, but if we just throw this in\n8:08\nour um decoder right here, should get a\n8:11\npretty good answer and a good\n8:12\nunderstanding of what we're dealing with\n8:13\nhere. And as you can see, prints out our\n8:15\nmarket implications. translation. We are\n8:17\nprepared to raise rates further and if\n8:19\nappropriate and intend to hold policy at\n8:21\na restrictive level until we are\n8:22\nconfident that inflation is moving uh\n8:24\nsustainably down toward our objective.\n8:26\nDon't expect rate cuts anytime soon. We\n8:28\nare scared of inflation resurging and\n8:30\nwe'll accept some economic pain\n8:31\nrecession risk to kill it dead. Um\n8:33\nthat's basically our understanding. You\n8:34\nsee we're at a hawk and we're\n8:36\ntightening. Um we see our hold is about\n8:38\na 60 with our hike about 40. You can see\n8:41\nour tech growth is down. Discount rates\n8:43\nremain high. hurting valuations,\n8:45\nutilities, high risk-f free rates make\n8:47\ndividend yield holds less attractive,\n8:49\nand our cash and treasury yields remain\n8:51\nelevated and attractive. Key takeaways,\n8:53\nno pivot in sight, cost capital remain\n8:55\nhigh, and cashes still king. As you can\n8:58\nsee, we have a better understanding of\n8:59\neach Fed um reserve um Federal Reserve\n9:04\num statement after just putting into our\n9:06\nFed translator.\n9:08\nUm as you can see, um it continually\n9:11\ngave us good answers. gives gave us\n9:14\nvisuals to understand better um and it\n9:17\nmade it a lot easier um to make these\n9:19\ndecisions on what I would rather do and\n9:21\nwhere I should um be realizing the\n9:23\nsector impact um for anything and to\n9:26\nkeep an eye out. Um overall I think we\n9:28\nhave created something that um will help\n9:31\npeople there's no doubt about it. Um the\n9:34\nFed is a huge impact on many finances\n9:36\nand rates. Um and this you know affects\n9:39\nnot only the housing market um business\n9:41\nmarket um but also just day-to-day you\n9:43\nknow um things that happen. Um so uh\n9:47\noverall I think this is really helpful.\n9:49\nI think this is something that will be\n9:50\nused by many people um and I think it\n9:52\ncan be continued um to be upgraded and\n9:55\nupdated um to become even more reliable\n9:58\num and even more um predictive.\n10:01\nUh once again, thank you so much for\n10:03\ntuning in to section 13. Um this is our\n10:05\nfinal um project together. Uh it's been\n10:08\na great semester. I think we've learned\n10:10\na lot. Um we have a better understanding\n10:11\nof numerous financial um implications\n10:14\nand um understanding of how the market\n10:17\nmoves and what happens. Um and I think\n10:19\nthis um goes to show um everything that\n10:22\nwe have figured out and different\n10:24\nwebsites that we can use like replet um\n10:26\nwe can use AI. Um, we've also learned uh\n10:29\nabout different um servers. Um, I think\n10:32\nusing AI and finance is important and\n10:34\nmoving forward um utilizing these tools\n10:37\num to help me in my career. Uh, thank\n10:39\nyou so much for tuning in and have a\n10:41\ngreat rest of your semester um and a\n10:43great night. Thank you."
}