{
  "student_name": "Ronak Badam",
  "org_defined_id": "036108316",
  "username": "rbadam",
  "email": "",
  "transcript": "Hi, my name is Ronaksai. Uh, today I'm going over my session eight assignment. So, first, uh, let me go through the first code block um, and really explain what it does. So, our first example tests the semi- strong form of the efficient market hypothesis, the EMH, which this states that prices should immediately incorporate all public information such as earning announcements. So, here we're going to simulate an event by Calculating cumulative abnormal returns C A R car. If the market is ei plot should jump sharply on day zero and then remain flat. However, our simulated data um let me show you this. Our simulated data here shows that um shows a continued upward curve for several days post the announcement known as the post earnings announcement drift. This drift represents a persistent market in inefficiency where the market process public information slowly suggesting a violation of semi strong EMH and potential create and potentially creating a lowrisk momentum strategy opportunity. So using um uh Gemini I was able to create this code block and so this code block actually shows us the simulation that I just talked through where we have our days relative to announcement. And so normally it should so show like a flat line if um if it was um if it was efficient. But since we don't have the flat line, we have the the jump um our chart here is inefficient. Now moving on to my second example. So this is going to be modeling the hurting bias in simulated market. So this code block shifts our focus to the behavioral finance specifically demonstrating the impact of the hurting bias. Hurting occurs when investors abandon independent analysis and simply follow the crowd often amplified by social media. We modeled this the stock's price as a function of its stable fundamental value and a non and temporary non-fund fundamental behavior component as you can see that on the plot. So we have our observed market price with hurting our fundamental value and our hurting base period. So we can we can see that on the plot as uh the market price the red line significantly deviates from the intrinsic fundamental value. We can see that right around this 45day period mark where it there's an insane spike um and during this behavioral period forming a temporary bubble. So as we can see that the spike really starts peaking right in the middle of this hurting bias period but it starts and ends at at that period. So it creates this temporary bottle. This illustrates how predictable and systematic psychological biases are rather than rational information processing can create substantial and temporary market mispricings. So I utilized AI in this case to help me again create this code block. But AI also in this case explain how the bubble is created um with the hurting bias. Okay. And then now lastly I'll move on to my third example my final code block which is assesses the risk versus inefficiency of the value anomaly. So our final example that I just started with uh uses the simplest form of risk adjusted analysis to determine if a docu documented market anal an anomaly such as the historical outperformance of value stocks represents genuine inefficiency or merely compensation for extra risk. We apply the capital area pricing model CAPM to calculate the stock's alpha. The CAPM tells us the expected return based on the stock market's risk on the stock's market risk. When we subtract the expected return from actual return, the remaining positive um the remaining the remaining positive return is alpha. A large positive alpha as calculated here signifies an um so when it says as calculated here we can see that our alpha here is um 4.6% which is relatively high. So this signifies that uh an uncompensated return that is not explained by market risk suggesting that the value effect is indeed a p persistent market inefficiency exploited by skilled investors. So since the al alpha is large and positive the value stock excess return is not fully explained by it market risk the beta in this case um which is 1.05 5. This suggests that the value effect is likely a market anomaly as I just stated at least by the CA capm test. So again using AI I had it explain to me exactly what anomaly risk is versus inefficiency test and then it created this um code block that kind of walked me through it. Um so that's my session eight. Thank you.",
  "video_url": "https://youtu.be/oHtaRkl2TWk"
}