{
  "student_name": "Michael Powell",
  "org_defined_id": "037117204",
  "username": "powel281",
  "email": "",
  "transcript": "Hi, this is my session 8 assignment for financial management and our assignment was focused on market efficiency investigation. So our assignment overview is that investigate market efficiency using the GameStop short squeeze event of 2020 to 2021 as a case study. Verify the accuracy of stated facts. Analyze price behavior relative to efficient market hypothesis predictions and evaluate whether market anomalies constitute evidence against market efficiency or can be explained within existing frameworks. So uh kind of before I get into the event timeline, we have a critical first step and that is to verify if GameStop traded at 4 cents a share back in 2020 August uh against actual historical data and if it's incorrect document the accurate figures and determine appropriate communication approach for correcting professor. So for event timeline back in August kind of uh we get to GameStop nearly bankruptcy levels and then Ryan Cohen uh acquires 13% stake. Uh we get into a little bit later back into February congressional hearings on market manipulation and then now we're in postvent price stabilization. Some key data points is that the short interest peaked at 140% a float. Retail trading volume increased 10fold during squeeze. trading restrictions implemented at peak coin Robin Hood uh hedge fund Melvin Capital sustained 53% loss requiring bailout and analyst fundamental value estimates $10 to $40 per share and then I have some required analysis that I kind of go uh discuss within the driver framework. So, kind of before I go into everything, uh kind of just easily put the assignment into uh Gemini, just gonna get a little idea of what I'm working on to give me a little uh advice and give me a little background information more. Uh I'll get further into that with my code. And I guess the first step we would be uh working on is critical first step, the data verification. if GameStop did trade at $4 a share or 4 cents a share, sorry, back in August 2020. And this is incorrect based on his historical data. GameStop uh was selling at uh $14 per share according to a split adjusted low uh back in August 2020. And then you also had your actual low, which is nonadjusted, which is selling at approximately $416 a share. And kind of the context behind this is that the discrepancy often arises from the 4 for one stock split that GameStop executed back in July of 2022. And the $14 price is adjusted for the split, but the actual price a person would have paid for in August 2020 was $46. So basically in conclusion is that the statement that they traded at 4 cents a share was incorre correct and uh it was more uh $416 what the person would have had paid back then and kind of recommendation to my professor just be like hey professor chang uh kind of preparing this assignment I conducted the data verification for August 2020 price and I found that historical data uh shows a different amount uh than what he had provided and that people would have actually paid $4.16 a share rather than $4 or sorry4 cents a share and this is uh where I'll gone for my analysis where I'll proceed using the correct historical range data um that did occur not the 4 cents so that's where we kind of get into the driver framework which is to find and discover and for the define uh the core problem is to test the validility of the uh efficiency marker hypothesis using the 2020 2021 GameStop shorts squeeze as a case study. This event saw GameStop stock price detach from a fundamental value driven by retail investor collision against institutional short sell shellers and then discover the analysis will be a qualitative event study. The event is the period of coordinated retail buying primarily 2021 January uh and we will establish the normal value range analyze incorporation of public information to the piece price compare the observed price action against the three forms of the image and lastly use behavioral finance concepts to explain anomalies that the EMH cannot and then that's where we get to represent and for uh analytical framework we will use two competing uh but complimentary frameworks for the represent which is the EMH and then behavioral finance uh efficiency market hypothesis your weak form semi-form and strong form your weak form uh prices reflect all past training data Semi- strong prices instantly reflect all publicly available information. Um strong form prices reflect all information. No, no one can consistently achieve abnormal returns. And in your behavioral finance, uh this framework argues that psychological biases and limits to arbitrage allow prices to deviate from val fundamental value. And furthermore, we will look for biases and the limits to arbitrage. Um you have your implement and uh this section executes the required financial analysis. So market efficiency testing um your classification of violation. The GameStop event event represents a clear and profound violation of both the weak along with semi-strong forms of market efficiency. The weak form analysis is that the entire retail strategy was based on weak form data. traders on the Reddit uh Wall Street Bets identified stocks with high short interest uh from past data and high buying momentum uh to predict future price squeezes. The fact that this strategy produced temporary explosive return does violate the weak form EMH and you have your semi- strong form analysis and this is the most significant uh violation. All the information used by retail traders was uh public. So you have your short interest uh in Ryan Cohen stake and the fundamental value uh it was 140% short interest data that was publicly knowledged and Ryan Cohen did uh acquire 13% uh as a public SEC file and then you have your abnormal returns and predictability and the returns were clearly abnormal uh rising from about $4 to 483. uh more importantly the event was predictable. If one could predict the hurting event uh predictability was not based on fundamentals but on settlement and then you have your behavioral finance analysis uh the behavioral biases the hurting uh this was the primary driver. millions of retail investors coordinated uh through social media act as a single entity creating buying pressure no single institution could match confirmation bias the Reddit of Wall Street Bets uh form became an echo chamber diamond hands uh that reinforced the belief in the squeeze uh filtered out dissenting opinions and then of overconfidence retailer traders believe that they had found a glitch in the market the 140% sh uh short interest and could collectively bankrupt hedge funds and you have your limits to arbitrage. Um this is the most uh critical concept the GameStop was obviously overpriced at $400. Why didn't investors short it down short it back down? Uh the fundamental risk is that the short sellers uh like Map Capital were the rational arbiters and they were bankrupt. uh synchronized risk. Arbitrage is risky if you don't know when the bubble pop. A short seller can be forced to cover at a massive loss before the price eventually corrects. Market microructure issues trading restrictions uh like Robin Hood and the inability to borrow shares due to their high short interest made it physically impossible or prohibitively expensive to execute the rational short trade. And we get into our last one, the rational uh investor probability analysis and the systematic profit. Um we know a rational investor could not have profited systematically. This event was an anomaly, not a repeatable strategy. Any of your risk adjusted returns. Uh the returns were astronomical, but the risk was infinite. A short position has unlimited risk and a long position you're buying at $300 a share. uh risk 90% along with a loss. The sharp ratio uh the risk adjusted return of the strategy is arguably terrible as the uh volatility was just as an extreme turn. It was just as extreme as a return. Then you have information advantages and then you also have your X anti X post. X post is after the fact. Uh it looked like it was an obvious one and your Xanti counter was your before it happened. Um, betting your life savings on uh GameStop at $20 a share was a gamble, not a real rational investment. Um, that's kind of we'll get into my code now. Uh, just kind of make sure it works. Yep, it works. Um, yes, this is where I just kind of had put all that information through chat. Uh, it kind of provided the timeline of what GameStop was looking at since not uh since 2020 of August. provided the key data points of the short interest rate, the uh acquisition of the 13% and then the required analysis. Um also provided the financial analysis requirements um just to get a better and stronger analysis on the entire project. Um a little further I this is the find and discover uh this is the driver framework. Um and now this is where I had some like uh help with calculations. Yeah. Uh the calculations are all up here. Yep. Price. Uh and now I'll kind of have like some graphs to help reflect it. Um yeah, I have some graphs that I'll show shortly. I have the um I have a GameStop price and volume short squeeze peak and then the GameStop versus S&P 500 anomaly compared to the market. I'll kind of go deeper into that after uh I go through the validate and that is uh statistical significance. The abnormal return from a fundamental value of about $15 to a peak of $483 is a stra statistically significant by any measure or represents a 3,000% and uh plus deviation from its baseline. robustness checks. Uh the inefficiency observed was not a stable uh arbitrageable market feature. It was a temporary sentiment-driven bubble caused by a unique confluence of factors. Uh the extreme 140% short interest, a new technology commission, uh pre- like Robin Hood, uh new communication platform, for example, the Reddit, Wall Street Bets, uh CO 19 lockdown stimulus checks and boredom. Um so kind of little conclusion on that part is that this combination is not easily repeatable. So we cannot validate this as a p persistent failure of the EMH or rather it was a black uh swan event that exposed the EMH's underlying assumptions. So that's where we got uh the evolve which is application to investment strategy and that is active verse management. Uh the GME event is like a double-edged sword. It supports passive management uh and it also supports some active management. The evolution of the image um the hypothesis must evolve to include sentiment as a tangible risk factor. Markets are not just equations, they are collections of people. This event suggests that markets are efficient uh most of the time but are highly val vulnerable to behavioral uh contingent. Um and that's where you kind of get to the reflect part. um synthesis uh image first behavioral. The GME event does not kill the efficient market hypothesis but it does deal uh as a sever severe blow. It provides that behavioral finance is not a niche sub field but a necessary component for understanding market reality. Uh the EMH provides the rational baseline uh $10 to $40 fundamental value uh behavioral finance and limits to RHI to explain why and how the price was able to deviate so catastrophically from that baseline. Um so you get your policy implications. Uh this event directly led to congressional hearings and investigations into the gamification of trading on apps like Robin Hood, the ethics of paying for order flow, uh the transparency and tag and short interest reporting and the centralized power of clearing houses to all trade. And this is where now I kind of get into those graphs that I kind of had on uh my kind of related back to my code um to the model that kind of helped give us a better understanding of everything. Um let's see. No, this is just Yeah. Okay. This is where all my math was for the what it was back in the day. Uh what we were trading at. Um, but yeah, as you can see, the GameStop price involved in the short squeeze peak. We can see back in December of 2020, he was at $100, but in between it got up to almost 500, that $484. Um, and then quickly just sank shortly after. And it's just kind of talking about that short squeeze peak that is kind of whole Simon's going over about. And then we have our GameStop versus the S&P and how uh the anomaly compared to the market. And as you can see, the blue line is GameStop um Game uh GameStop and then the red is what we saw in the short squeeze peak, how it slowly went up, went up drastically and then just tanked right after. while the blue version of the GameStop uh was on a consistent uh growth a after uh in 2020 it's consistently been going up a little bit more. But but yeah, I would definitely say um going back to uh my critical first step just uh indicating that the statement that GameStop trade at 4 cents back in August 2020 is incorrect and it was trading at approximately $416 a share. So yeah, that is about everything. Um and yeah, thank you",
  "video_url": "https://www.youtube.com/watch?v=Aj9YhfCcZAs"
}