{
  "student_name": "Jon Parrett",
  "org_defined_id": "037141383",
  "username": "parrettj",
  "email": "",
  "transcript": "Okay, so our goal is to um show the relationship between um walk and leverage um considering a hypothetical scenario with Netflix. So the first thing I want to show you is this graph that it made and it took me a while to understand it cuz I didn't understand why it was dropping but as you can see here the less le okay let's define. So walk is basically um like the minimal return rate you would need if you're before um you do something. So you would look at I want to invest in three I want to buy three apartments. So you would calculate a walk to see what your minimal return rate needs to be for you to make some sort of profit. That's what walk is. And then the leverage is debt leverage. So taking debt in investing. So um and you can leverage debt cuz you can make money by taking out loans. Okay. And so in this graph so the bottom is leverage, the top is or the x axis is leverage, the y- axis is walk. So as you see the less leverage you have, the higher the walk is and it steadily decreases. And I was trying to understand this, but how I understood it was that um debt is debt is technically cheaper than um equity. Um and so if you're using more of your own money, then it's going to be a higher walk, a higher return rate. But if you're borrowing more money, then you're going to um require less of a return rate. And um to understand this even further, we kind of understand that the scenario we built wasn't perfect. So um scroll to the bottom. Okay. So we kind understand that um oh here. So um things that could make this graph more realistic cuz the more typical walk and leverage graph would be more of a U shape like this. And the reason this one wasn't is because it doesn't consider like the financial distress cost, which would be like things such as like the bankruptcy cost or um loss of customers and suppliers or other things such as the market conditions. So of what market you're in and how much it varies. So just a few things to look at just to further define like the terms we used. Um so b is defined here as e / v times the um cost of equity and so on and defines the terms here is the market um market value of the company equity d is debt v is total value of company yeah it's right here so um that is where we get walk oh shoot okay and then to further define this is equity Um, and the cap formula is equity equals risk-free rate plus beta. Um, and then times the market risk premium. Um, I don't know if I'm leaving anything out. I don't think I am. Okay. I also in my code had it just simply just write out the driver framework. So define I've already defined it. um debt to capital ratio and so on and then represent we made that graph and here's all the formulas I just went over and then the impact it would have so impact on cost of equity as a company increases debt its financial risk increases true and then equity holders who bear the residual risk demand a higher return true um impact on cost of debt initially a company takes on more debt and might remain relatively stable or increase slightly higher lending perceivers slightly higher risk. And then the tax shield effect, the tax deductibility of the interest payments means that the after tax cost of a debt is always lower than the pre-tax cost of debt. Okay. Um uh so evaluate to evaluate it. I didn't think that graph was right at first, but after doing further research, I found out that like our conditions weren't perfect and so why the graph was only um downward sloping and not more of a U-shape. Um it kind of says that here too. So the plot clearly shows a downward sloping curve for walk debt to capital ratio. This confirms that starting at 10% of walk for 0% leverage and decreasing to 5.25 walk at 0% leverage is a decreasing slope. The impact of leverage cost on capital increasing leverage under these specific conditions um reduces the overall cost of capital. This is because debt is this is what I was reading earlier debt is genu generally cheaper than equity um because you can't tax debt and then capital structure based on this model implications of tracker decision is that a company should maximize its financial debt minimize its walk and then I already went over the model um model um model limit limitation ations. Okay. In summary, we found was a downward sloping and then um we already went over this and this model is in its simplest form and it can be misleading in real world real world capital structure decisions. um something to do for the future if we did this again was to have more uh more conditions outlined in more um more realistic conditions. Thank you.",
  "video_url": "https://youtu.be/SNDrKFKSArk"
}