{
  "student_name": "Ryan Cairo",
  "org_defined_id": "036112967",
  "username": "rcairo",
  "email": "",
  "transcript": "Right. So for my session 10 assignment, um the first thing I had to do was define and discover. So I have all of the givens here. So the initial uh investment of $12 million depreciated straight line over 10 years. Working capital is 550 or $500,000 deployed at launch and recovered in year 10. Revenues is $8 million in year 1, $11 million in years 2 through five, and $9 million in years 6 through 10. Operating cost, uh cost of goods sold, 40% of revenue, labor is 2.5 million, rent and utilities is 800,000. Marketing is 300,000 in year one, and then 100,000 uh thereafter. taxes is uh 25% corporate rate, terminal value of $3 million at the end of year 10. Uh and then what I must do, I must build a 0 to 10year incremental cash flow schedule. uh that includes revenue, operating cost, depreciation, tax shields, taxes, working capital changes, terminal value, and then I must calculate the NPV, IRR, discounted payback period, simple payback period, profitability index using Starbucks is uh whack. Uh I must run a sensitivity analyst for two scenarios. The first scenario being revenue is reduced by 20% and the second is the whack is plus or two plus or minus 2%. And then I have to summarize the impact on uh NPV IRR. Uh and then finally I must provide a recommendation that weighs uh financial results, strategic fit, brand implications and key project risks. That define and discover stage. I put in all of the variables here and gave them names. Um so that way all all the project parameters uh are initialized and then I calculated annual uh depreciation which is just the initial investment divided by the project life. Uh and then for the cash flows data uh current revenue equals initial revenue and then I have some if statements if else's um to follow uh these here with the after year 1 after year five etc. uh revenue equals current revenue. Cost of goods sold is revenue times cost of goods sold percentage. And the EBIT, which is earnings before interest and taxes, is revenue minus cost of goods sold minus labor costs minus uh rent utilities minus marketing expenses minus annual depreciation. Um and taxes is this times tax rate. And then the NOAT variable is net operating profit after taxes which is EBIT minus taxes. And then of OCF is operating cash flows which is NOAD minus or NOAD plus annual depreciation. Um and given all these here is my zero uh year 0 to 10 incremental cash flow schedule uh which shows revenue over the years. The cost of goods sold over the years which goes up as revenue goes up. The labor cost is consistent. The rent utilities is consistent. Then the marketing expenses um and depreciation is also consistent. uh the EBIT taxes and notepad all increase year-over-year and then the operating cash flows also increases. Following this, I have the uh free cash flows uh list here which shows the from year zero the initial investment and working capital outflow from years 1 to nine the operating cash flows and from in year 10 the operating cash flow plus the terminal value plus the working capital recovery uh and that's shown here but I decided to visualize it because these numbers are quite hard to read um or you know to put into uh numbers I suppose. And here is the the graph for that. So as you can see um free cash flows is negative from years uh one to or 0 to one and then following it it slowly goes up year-over-year and then at year 10 um since you're including the terminal value in the working capital recovery it is uh much higher. Uh so this graph shows the free cash flows over project life. Following this graph uh I calculated the net present value uh which is for every year the net present value plus or minus cash flow uh divided by 1 plus whack times the year which comes out to 62,684,539.98. After calculating the NP uh the NPV, I calculated the IRRa which is the internal rate of return to be 15.62%. Following that I calculated the simple payback period um which is done by uh calculating the FCF and in the year before the payback period uh and the year itself which is not cumulative and then calculating the fractional part of the payback and the simple payback period is payback year minus one plus fractional payback back which came out to 7.43 years. After doing that, I calculated the discounted uh payback period which is done using the cumulative discounted FCF in the year before the payback year. the discounted FCF of the payback year itself which is not cumulative and then the the fractional part which so the discounted payback period is the discounted payback year minus one plus the discounted payback the fractional discounted payback which that I ended up calculating was 9.22 years. Um following that I calculate the profitability index uh which is done by taking the NPV plus initial investment outflow divided by initial investment outflow which was 1.59 index of 1.59 uh says that because it's above one that means that the future value of all the present cash flows um makes the investment profitable in the long term. anything above one. Following that, um here is the the summary which basically shows all of these values and the project it it's recommended that the project should be accepted. Um this is because the NPV of nearly 63 million um indicates that it's expected to generate more value than its cost. And considering the time value of money, this means the project will increase shareholder wealth. The internal rate of return IRRa exceeds the whack um which means that the project is expected to generate returns well above the cost of financing making it uh an attractive investment. Additionally, as stated previously, the PI is greater than one which indicates the present value of future cash inflows is greater than the initial investment. which confirms the project's profitability and value creation. And finally, um while the payback periods are uh relatively long, the positive NPV and high R are strong indicators of long-term value creation. Um the discounted payback period is also less than the project life, meaning the additional investment is recovered in present value terms within the project's operational span. So considering all these metrics um it is it is financially sound and uh should be accepted to invest in this. Um following that I have to run through two scenarios. One in which revenue is reduced by 20% and the other is which the WACCC plus or minus 2%. I have to summarize the impact on NPV IRR. So I put all these numbers into here. Uh and the function, this is the functional NPV and IRR. It's the same thing as what was previously equated. and the base case. So this is just for the base um before the two um sensitivity analysises are ran um and in which scenario one is run the reduction in initial value or revenue is reduced the NPV gets decreased from 62 a.5 million roughly to 31 or 35 million and the IRRa gets reduced from 15.767 7 to uh 12.52. Uh and then in the second scenario where the WACCC is incre um increased by 2%. The um NPV is 41 million and the IR is the same and in which it's subtracted or um in which it's decreased by 2% IRR is still the same but the NPV is 88 million. So crunching these numbers in the first scenario the uh NPV is represents uh or the NP NPV drops 43.87% and the IRRa is reduced by 3.15%. Um and this suggests that the revenue forecasts are a critical assumption that need to be carefully managed and validated. uh due to this 20% reduction in revenue. The second scenario in which it is increased the WAC is increased from 8 and a half to 10 and a half. The drop in NPV is 34.3% and the IRRa is the same because it's independent of the discount rate. And um the the implication of this is that an increase in the cost of capital significantly erodess the project's NPV indicating its sensitivity to financing costs. Um while the NPV remains positive, the project becomes less attractive um to invest in. The IRRa still comfortably exceeds the new higher WACCC of 10 and a half% um which reinforces the project's intrinsic return potential. Um and in the scenario where it decreases from 8 1/2 to 6 1/2 the NPV is increased by 40.98% and the IRS is also um remains unchanged. So a decrease in the cost of capital substantially enhances the project's NPV making it even more appealing. Um this scenario demonstrates that favorable financing conditions can significantly boost the project's value. Overall the project should be accepted. Um and this is for a multitude of we of reasons. Um robust financial performance being one of them. The uh significant positive value confirms that the project is expected to generate a substantial uh substantial wealth for shareholders. Um the internal rate of return is double essentially double um the weighted uh average cost of capital um which indicates that the project's expected rate of return s far surpasses the cost of financing and the profitability index is above one which also helps this case. Um and in the end the confluence of strong financial returns, strategic imperative position or positive brand implications and manageable risks unequivocally support the adoption of this project. It represents a strategic investment that promises to deliver significant shareholder value um and advance the company's market leadership.",
  "video_url": "https://youtu.be/CNSdtdzZgBw"
}