{
  "student_name": "Shree Bavana",
  "org_defined_id": "034904788",
  "username": "sbavana",
  "email": "",
  "transcript": "session 8, our objective is to rigorously test the efficient market hypothesis, the EMA using the GameStop short squeeze of 2020 to 2021 as a distinctive case study. This analysis is guided entirely by our driver framework ensuring a structured datadriven investigation. We begin with the most critical step of back verification. The assigned uh stated GM uh traded at 0.04 in August 2020, which is incorrect. Our data confirms the actual closing price in August 2020 was approximately 6.68 or 1.67 adjusted for the subsequent stock split. We must use the split adjusted price of 1.67 for academic rigor in our time series analysis. Uh this sets the foundation for professional correction. The research problem. The GME event uh presents an unparallel challenge to EMH. Here was a declining retailer at its stock price surge from 17 to over 500 per share. Pre-squeeze analyst estimates uh valued the company between $10 to $40. Uh we must uh determine if this price divergence constitutes a systemic systematic failure of market efficiency. We will test the three forms of EMH weak, semi- strong and strong. To isolate the abnormal performance caused by the squeeze, we are going to deploy the event study method meth methodology. the gold standard in empirical finance. Our benchmark for normal return is the market model. A practical application of uh CPM that which we did in the previous session. We use daily returns against S&P 500 index over a robust 250day estimation window prior the event. We define the event initiation as T0 as January 13, 2021, the first day that GME experienced a uh significant um unexplained surge following the news events. Uh we segment the analysis into three cry windows. Uh pre-squeeze momentum, the squeeze peak and the restrictions aftermath. The core test revolves around the cumulative abnormal return or car during the squeak uh squeeze peak. Following the represent stage, we move on to the implementation using Python in Google Collab. First, we ingest the historical GME and SNP data. Calculate return and segment the estimation window. We run the O. We run the OS uh regression to estimate the market model parameters to the resulting alpha and beta. Uh define the stock's normal risk relationship with the market prior to the anomaly. These parameters are then used to calculate the abnormal returns. The difference between the actual return and our expected return across the entire period uh event period. Uh the validation stage confirms our hypothesis regarding market inefficiency semi- strong EMH test public information by aggregating theor abnormal returns. We calculate the cumulative abnormal return or the car the car for peak quiz uh period was astronomically positive and decisively statistically significant. T statistic uh well about the critical values this confirms a severe violation of the semi- strong EMH. Why is this? Because the market fails to instantaneously and rationally price the publicly available information. Uh I apologize for the pause. I was extremely sick. Uh well getting back to our analysis. uh we were doing the semi- strong em test uh so by aggregating the abnormal returns we calculate uh the cumulative abnormal return uh so forth like once we have a confirmation of a severe violation of semi- strong EMH uh we can know that the market failed to instantaneously and rationally price the publicly available information the fundamental decay of the company and the structural risk of 140 30% short interest. The price was driven by friction and not the fundamentals. Uh weak form EMH test uh based on the historical price data. Um the test the returns during the volatile period were not randomly distributed indicating the presence of a short-term predictability and momentum patterns. Furthermore, econometric analysis confirmed an anti-leverage effect uh which is basically volatality increased when GME prices went up and a highly regular irregular phenomenon confirming speculative trend following uh flows. Uh coming to the behavioral validations and limits to the arbitrage. The failure of arbitrage to correct this mispricing is the key. The anomaly persisted because of the limits to arbitrage. As GME's price soared, short sellers like Melvin Capital, which lost 53% faced unsustainable sorting of margin calls. This forced liquidation or the asset substitution problem mechanically pushed the price higher, preventing rational investors from closing the gap. The event was fueled by hurting mentality and conformity bias on social media uh where investors mimicked group behaviors disregarding their own analysis and creating a self-fulfilling price bubble. Uh while massive profits were generated uh exposed after the fact, the extreme nonlinear and unpredictable nature of the behavioral coordination meant that no rational investor would have systematically exploited this mispricing uh before the fact with a predictable risk adjusted strategy. Coming to the evolved part of our driver methodology which is a theoretical shift in strategy. Um the GME event requires an evolution in our theoretical understanding. It supports the adaptations markets hypothesis the AMH uh which is efficiency is not constant but temporary. The market's ecology shifted when coordinated. Retail traders enabled by technology, amplified behavioral biases, creating fleeting but extreme arbitrage opportunities that institutional funds can close due to leverage constraints. Uh what are the strategic implications here? Activ active managers must now integrate social coordination risk into their shortselling models. the old assumption that liquidity and capital are sufficient to close um uh any mispricing before margin calls by it is fundamentally flawed. This also reaffirms the difficulty of actor management for majority of investors underscoring the shift towards passive index space strategies. Uh reflecting on of on this policy implications and conclusions uh the event exposed significant flaws in market infrastructure particularly clearing so and settlement process. The SE SEC subsequent report identified critical areas to review specifically the impact of digital engagement practices or the gamification of investing and the transparency issues surrounding the payment of order flow PFO. In conclusion, the GME short squeeze conclusively demonstrated that the weak and semi- strong forms of efficient market hypothesis failed under structural and behavioral stress. It was not a failure of information availability but a failure of information incorporation due to collective irrationality and a severe limit to the arbitrage. Uh this event underscores the need for robust risk models and regulatory modernization to safeguard market stability in the age of social media driven finance. And that would be it. And this is what we got from our code here. Uh so yeah that is all for session 8. Thank you.",
  "video_url": "https://youtu.be/Y5AhVmKwA5I"
}