{
  "student_name": "Isaac Timmer",
  "org_defined_id": "033105612",
  "username": "irtimmer",
  "video_url": "https://youtu.be/q0WFJZqgnfE",
  "transcript": "Hello, my name is Isaac. Today I'm presenting a corporate capital allocation analysis for Apple Incorporation. I'll be using the driver framework to evaluate a proposed $90 billion share repurchase. My goal is to not just give a recommendation, but to walk you through the specific Python modeling and financial calculations that I used to arrive at the conclusion.\n\nWe start with discover of the driver framework. The core issue here is a conflict between liquidity and efficiency. Apple holds $165 billion in cash and generates $100 billion in annual free cash flow. While safety is good, excess cash creates agency costs. It tempts management to p pursue empire building, which is wasteful spending just to grow the size of the firm. The proposal is to return $90 billion to shareholders. My objective is to calculate whether a buyback is the most efficient mathematical and strategic way to do this compared to paying down debt or issuing dividends.\n\nIn the represent stage, I mapped the math to the stakeholders. First of all, we have shareholders and CEO. They prioritize earnings per share or EPS. A buyback mechanically reduces the share count which all else being equal should increase the EPS. Thirdly, we have employees. They hold stock options. Um, they need to sorry, they need the share price to stay high. A dividend drops the share price by the payout amount hurting them. A buyback supports the price. Lastly, we have bond holders. They prioritize solveny and preferred debt reduction. This mapping tells us we need to solve the option that maximizes EPS while satisfying these incentives.\n\nSo this is where I want to take you inside the implementation phase where I built the model in Python. To make this analysis reproducible, I defined my variables at the top of the script, which you can see here. First, I set the current share price to $185.\n\nNext, I defined the shares outstanding as 15.5 e to the 9, which is the Python notation for 15.5 billion shares, and I set the PE ratio at 30.\n\nUsing these inputs, I had Python calculate our baseline. If you look at the variable net income in the code, I calculated this by making the earnings per share derived from the PE ratio and multiplying it by the total shares. This establishes our status quo, the net income of roughly $95, $95 billion before we make any changes. You can see all this in the outputs.\n\nThis slide shows the output of my calculation engine. I want to explain exactly how Python calculated these numbers rowby row. As you can see, the output is in the lower right hand side of the screen. First, let's look at the buyback row. To get the new EPS of 6.37, the code performed two steps. First, they calculated the shares retired by dividing the $90 billion budget by the 185 share $185 share price. This retired roughly 486 million shares. It then took the original net income and divided it by this new lower share count. The result that we got is a mathematical increase in the EPS of 3.24%.\n\nwhich you can see in the bottom of the screen right here. Now look at the debt payown row which is right here.\n\nHere the share count stays the same at 15.5 billion. Instead the numerator or the net income increases. I assumed a 5% cost of debt. By paying down $90 billion, we save our interest expense. However, I had to adjust this for taxes. Using the formula interest saved times 1 minus the tax rate, I calculated the after tax profit boost. The result, adding those interest savings to the net income generates an EPS of $6.40.\n\nYou can see here\n\nin the validate stage, we visualize these outputs to verify our logic. Looking at the orange bar, you can see that the debt payown is the highest at $6.40. This makes sense mathematically because Apple's earnings yield which is the inverse of the PE ratio. So 1 divided by 30 is only 3.3%. Since the after tax cost of debt is higher than 3.3% paying down debt adds more to earnings than buyback stock than buying back stock. Now looking at the green bar, however, the buyback is right behind the 6.37. Sorry, the buyback, the green bar is right behind the the orange bar debt payown at $6.37.\n\nAs an analyst, I must validate if the highest number is the best decision. Paying down debt solves a leverage problem Apple does not have. Buying back stock solves the agency problem Apple does have. Therefore, I validate the buyback as the superior choice despite the small 3 cent difference in the calculation.\n\nWe evolve our understanding by looking beyond the spreadsheet. If we only looked at the math, we would pay down debt. But we chose we chose the buyback because of the signaling theory. At a $90 billion buyback signals to the sorry a9 billion buyback signals to the market that management is confident that the stock is undervalued. It also aligns with the employee incentive mapping that we did in the represent stage. Keeping the share count low helps maintain the stock price which protects the value of employee stock options. debt payown does not offer this benefit.\n\nSo reflecting on the analysis, I recommend approving the $90 billion share repurchase. We proved through our Python model that this strategy is accurative, increasing EPS by over 3%. while simultaneously solving the agency cost problem of holding excess cash.\n\nTo recap, my recommendation is to pro approve the buyback. As I said in the previous slide, my personal reflection from using the driver framework is that the financial calculation is only half the battle. I came into this assuming that the buyback would be the mathematical winner. The code taught me otherwise, showing that debt payown was mathemat was mathematically superior. However, the framework forced me to look at the strategic variables, teaching me that the optimal capital structure isn't just about maximizing EPS, but about aligning the math with human incentives.\nThank you for your time and thank you for watching."
}