{
  "student_name": "None None",
  "org_defined_id": "037218585",
  "username": "cpiekars",
  "video_url": "",
  "transcript": "00:00:03\nOkay, so today I'm going to be going over the M mini project 3. Um, just building an advanced AI finance tool. Um, starting out with uh looking at the driver framework. Um, I'm going to be looking at a risk assessment. Um, and here's the code for that. We're going to be going over how much you make uh in a month, how much you plan to spend, and then um what could go wrong if um certain things pop up. And this is what my model is supposed to help you with. So, just going over the code real\n\n00:00:43\nquick. Just going to import AI. Um defined variables are here. define uh these two input statements um with uh floats. So they can user can input numbers or values um defining the income variable and the spending variable. Uh remaining variable is equal to the income minus the spending and then another print statement right here just telling the user how much money they'll have left after their plan spending for the month. And then here are just some scenarios that'll pop up. And then using\n\n00:01:17\nthe random uh shuffle, it'll shuffle these scenarios and pop up for things that might happen during that month. And down here, it's going to give you AI advice. Um because up here, you're going to put in an API key. And then the AI will help the user determine what to do. So, I'm going to show an example here of the code working. I'm going to put in API key. uh monthly income. Let's say you make 5,000 a month, you want to spend 700. So looking down here immediately gives\n\n00:01:58\nyou these outputs came from the code. took a little sec for the AI to go through, but um looking at the output, 4,300 left in the account after the plan spending. And then after shuffling, um these and picking three of what could go wrong, uh the phone breaks and cost $300 to replace your car unexpectedly uh unexpectedly needs $600 repair and a surprise medical bill, $400 shows up. So down here using AI the um AI will just help you to um give some advice on what you should do. Uh so looking at what AI said number\n\n00:02:42\none uh create an emergency fund two prioritize spending three plan for repairs and four stay calm and flexible. So just some prompts that chat gave. So AI made this smarter by um giving you advice then implementing using uh Python here as my model and just verified with um these values and here I'll run it again just to show works with different values. Say this time you're making 10,000 spending 2,000 8,000 possible scenarios again and then once it's again different AI advice given\n\n00:03:47\num just making what could make the AI more useful. uh looking at this uh yeah I could give you more in-depth uh answers to this approach and um ask you could ask more and then yeah that is the"
}