{
  "student_name": "Lucas Velasquez",
  "org_defined_id": "037165853",
  "username": "velasqul",
  "email": "",
  "transcript": "Hello everyone. Speaker 1 Today we'll be talking about WACC, which is also known as the weighted cost of capital, and we'll be thinking about that in relation to how it will affect our investment decisions and the capital structure of the companies. Speaker 1 So for the problem that we'll be looking at, we'll be calculating a WACC for Netflix in context with the hypothetical $5 billion content investment decision. Speaker 1 So the first thing we're going to do is calculate Netflix's current WACC. Speaker 1 We're going to define it with the driver method, determine the WACC after a $3 billion debt issuance, evaluate the project-specific WACC, compare Netflix's WACC to Disney and explain the differences, and recommend the optimal capital structure strategy. Speaker 1 So the first thing we're going to do is calculate the WACC. Speaker 1 Here are some of our financial perimeters. Speaker 1 As you can see, market cap is $2 billion. Speaker 1 Share price times shares outstanding. Speaker 1 The total debt, the book value is $14 billion, but we won't be using that. Speaker 1 We'll be using the market value of the debt, which is $13 billion. Speaker 1 The equity beta, which kind of just represents the riskiness of a stock in relation to the market, which is 1.3. Speaker 1 The yield of the bonds, Speaker 1 of the debt is 5.8%. Speaker 1 And then the corporate tax rate is 21% and the current stock price is $450, which $450 doesn't really matter in this context since we know the market cap. Speaker 1 So here's the formula for WACC, as you can see here, as we represent the formula. Speaker 1 E is the market value of equity, which is the market cap of Netflix, divided by the Speaker 1 market value of the equity plus the debt. Speaker 1 So this is essentially, what the WACC formula essentially is, your proportion of equity to your debt. Speaker 1 So the proportion that you have in equity plus the proportion you have in debt. Speaker 1 So the E over D plus E is pretty simple, but the RE, which is the cost of equity, Speaker 1 is a little bit more difficult to determine, but the most common interpretation is to use the... Speaker 1 So the formula to get the cost of equity is the CAPN formula, and that's just kind of how a company determines Speaker 1 what investors rate of return, expected rate of return should be. Speaker 1 So that formula is given here, where the expected return on security is the risk-free rate, which is like bonds, due to time, this formula relates to time value of money. Speaker 1 So it's a risk-free rate from bonds plus the beta, which is the riskiness of the security relative to the market. Speaker 1 Netflix is 1.3, so it's higher. Speaker 1 minus the market risk premium, which is the risk-free rate subtracted from the expected return of the market. Speaker 1 So once you get that, you're the debt part that we talked about. Speaker 1 So you have the proportion of debt to equity. Speaker 1 And then you have the cost of the debt, which is just the yield of the bond that you have, the yield of your debts. Speaker 1 In some companies, you'll have to average them out if you have multiple debts, but here it's pretty simple. Speaker 1 We just have that one rate. Speaker 1 And then 1 minus T is interest is deducted from a company's taxes. Speaker 1 So it kind of operates as a tax shield. Speaker 1 So 1 minus T is 1 minus the corporate tax rate. Speaker 1 So this kind of provides a tax shield, if you will. Speaker 1 that will lower the cost of your debt because it's being deducted from your taxes. Speaker 1 So when we put that into practice, Netflix has $200 billion worth of market capitalization and $13 billion worth of debt. Speaker 1 So you have the 200 right here over the 13 because you add the debt and equity together. Speaker 1 And you multiply that Speaker 1 times 4.5%, which is the risk-free rate, plus 1.3, which is the beta, times the market risk premium, which is the CAPM formula, right? Speaker 1 So when you multiply those together, you get 93%. Speaker 1 Then you add that to the bond portion of the WACC formula. Speaker 1 So it's 13 divided by 213 times 5.8%, which is the yield times your tax shield, which is 0.79% to get rid of some of those interest payments off the taxes. Speaker 1 So when you do the calculation here, as you can see, and you add them together, the whack for Netflix is 11.22%. Speaker 1 So decently high. Speaker 1 And this kind of means that investors would expect a return above this number. Speaker 1 And when we add $3 billion worth of bonds, the only thing that changes Speaker 1 is this right here, the 200 becomes 213 divided by 216, and the other value over here becomes 16 divided by 216. Speaker 1 So with that slight difference, you'd expect the WACC to decrease because the bonds, the percent of the bonds, which is 5.8%, times 0.79, compared to the CAPM, which is 1.6, is much lower. Speaker 1 So if you're adding more bonds, you'd expect the CAPM to decrease, or the WACC to decrease, I'm sorry, and so it becomes 11.3%. Speaker 1 We will then go to evaluate the project-specific WACC. Speaker 1 So if you, since the WACC is the expected return of the investment, you'd expect if we use the 11.22% WACC, Speaker 1 a five, if we have our $5 billion investment here and we multiply that by 1.1122, you expect about like a $5.5 billion return. Speaker 1 And that's kind of what you'd hope for considering Netflix's weighted average cost of capital. Speaker 1 You're expecting to make a bit more for investors. Speaker 1 And so to compare Netflix's whack to Disney's, Speaker 1 As you can see here, the cost of Disney's WACC is 8.2%, which is better than Netflix because it's lower, so they don't have to make as big of a return. Speaker 1 This is probably due to Netflix having a larger beta, which is 1.3. Speaker 1 And they also have much more debt, as you can see, and debt is cheaper, which lowers the WACC. Speaker 1 That kind of segues into the recommending the optimal capital structure for Netflix, because since Netflix is severely under-levered, compared to Disney, we had almost 93% of Netflix's structure was in equity, which is safer, but a little bit more expensive. Speaker 1 So due to this, Speaker 1 Netflix could lower their WAC by adding more debt. Speaker 1 As we did when we added $3 billion of debt, it decreased our WAC by a little bit. Speaker 1 If you add more debt like Disney does, you can lower your WAC. Speaker 1 This obviously comes with downsides as well. Speaker 1 If you add more debt, it becomes more risky. Speaker 1 Your company becomes more risky because you have to pay that back. Speaker 1 If something doesn't work out, your company is not going to do well. Speaker 1 And equity is more flexible, but it costs a little bit more. Speaker 1 Obviously, with whack, you have to take into account industries and other factors and take into account, you know, the other different financials of a company. Speaker 1 But it kind of gives you an idea of the type of returns people should be looking, companies look for. Speaker 1 when they make investments. Speaker 1 Thank you for watching. Speaker 1 Lastly, I also made a Python code to calculate the WAC so it's a little bit more clear, and we want to confirm our prior values. Speaker 1 So when we run the code, we define our variables. Speaker 1 It has the same rates and ratios, and it'll calculate the cost of equity with the CAPM formula, as you can see here. Speaker 1 And then we'll calculate the capital structure weights. Speaker 1 and calculate the WAC, the WAC, sorry, and we'll have the cost of equity of 11.65% and the weights, which was 93.9% of equity and 6.1% of debt, which gives you a total WAC of 11.2%. Speaker 1 Thank you for watching and the video is officially over.",
  "video_url": "https://youtu.be/DK4ID0DqP78"
}