{
  "student_name": "Francisco Menendez-Quintanilla",
  "org_defined_id": "037704658",
  "username": "fmenende",
  "video_url": "https://youtu.be/6aSB6Rw97dE",
  "transcript": "00:03 Hello, so today we're going to be evaluating the potential leveraged buyout of Panera Bread by KKR. Our target is a high-performing asset, $6 billion in revenue, $900 million in EBITDA, and a digital sales mix that is already best in class at 50%. Our investment thesis relies on three growth levers. Expanding the footprint by 500 stores, 00:30 pushing digital to 70% and capitalizing on the evening day part. However, the challenge is valuation discipline for a financial buyer facing potential strategic barriers like Starbucks or McDonald's. They can pay for synergies, which we cannot. So my goal today is to recommend a bid range that clears the market clearing price without destroying our IRR. 01:02 So moving on to the analysis, I have made an evaluation model using Python to remove manual error and allow for real time scenario toggling. So as you can see the code, we have the parameters. We have 9% WACC and an 8% base growth rate. In the base case, 01:30 We assume that 15% of the EBITDA margins. In the upside case, which represents our operational improvements, we get some margins of 17% and an exit at 16 times multiple. By running this script, we generate a dynamic DCF that instantly reacts to these sensitivity adjustments, giving us a far more rigorous view than a spreadsheet. 01:59 So let's look at the results. So we have made the three valuation methods onto this football field chart. The visual tells us the most important story of this deal. So first we're gonna look at the bottom bar, which is a strategic buyer. If Starbucks buys Panera, 02:28 they can realize $180 million in supply chain synergies. This allows them to pay upwards of $16 billion while still making the numbers work. Now look at the minimum bars. The market is currently valuing similar assets between $10.8 billion and $13.5 billion. So our DCF 02:58 From these values we have, our DCF sits in roughly around 30.8 billion. There's a dangerous gap here because if a strategic buyer enters the process fully, they can outbid us by nearly 3 billion. And we cannot compete on price alone without leveraging the company to reckless levels. So based on this triangulation, I recommend we have a 03:28 to an opening bid of 11.5 billion, representing a 12.8 times a bit of multiple. Our room to negotiate goes up to 12.5 billion. So the recommended price we should like pay is around 12 billion. So why do I have 12.5 billion as the ceiling? 03:58 This keeps us within the bounds of transactions that have happened already and preserves our exit returns. Anything above $13 billion relies on having a perfect execution and multiple expansion plan, which we cannot bank on being perfect. We know we cannot beat Starbucks on price, so our winning strategy is speed and structure. 04:27 We offer net sellers certainty of close, no antitrust delays, and we offer management a 10% rollover to participate in the future upside, effectively aligning them with us rather than a strategic acquirer who might replace them. So that's why I propose. Thank you."
}