{
  "student_name": "Derek Seitz",
  "org_defined_id": "037482726",
  "username": "seitz23",
  "email": "",
  "transcript": "i, my name is Derek and this is my session 9 homework assignment submission. And our goal for this project is to estimate Netflix's weighted average cost of capital using market weights and see what happens if the company issues $3 billion more debt and use we'll just abbreviate it as wack as the hurdle rate for projects. So key inputs from the code run. Um these are all results. We'll go over them in a little bit. Um the for represent the formula we decided to use for this project was I ripped this straight from the textbook. This is the whack formula and here are all the inputs and what they mean. So and once we plug in our numbers from the run again over here like usual I like all my inputs at the default. I can just press enter a bunch of times. Um, our CAPM M ends up being 11.65%. Our pre-tax um pre-tax cost of debt or the bond yield is going to be 5.8% and the corporate tax rate 21% after tax is going to be 4.582% and here are the weights respectively. So, our current whack, and here, by the way, here's all the code where we get into the meat of all this. Our current whack or Netflix's current whack is 0.1121 or over here, we can see that there you multiply it by 100, you get 11.22%. And after $3 billion more debt, uh the weight is 0.926 and our component costs end up being unchanged. So after that, whack ends up going to 11.13% which over here we can see that after issuing the 3 billion debt, the whack turns into the 11.13%. So in plain English, a little more cheap debt lowers the average a bit, but not much because debt is still a small slice. So our project specific whack is uh US project use a project beta or firm beta in CAPM international project adjust beta andor add country risk premium to equity drop the project. Um let me cost of equity via CAPM into the same formula in our own run uh there's no country premium both US and international are about 11.22% adding say plus 2% country premium would raise the international project swack. So what this representation gives me is a clean recipe connecting each assumption beta the rates the yields tax and weights to one decision number one decision number which is the hurdle rate and a simple way to see how tweaks move the weighted average of the weighted average cost of capital. So implement, remember we just went over this. I feed the calculator calculator the basic ingredients and I have it all set to default. I just press enter a bunch of times. Um, which is pretty much just going over this again. I let the code compute today's whack or our hurdle rate. It calculates the cost of equity being 11.65% and after tax being 4.58%. And if we go over here, we can see that that's right here. and it builds weights from the market equity of 93.9% and the debt is at 6.1%. It plugs into the whack recipe from above and it should give us the the 11.22% that we see right here. So that's the bar projects must beat. So I test small leverage change. So adding that $3 billion more debt. Again, we already went over this. It gets it to 11.13%. And it will reweigh and recre amputate whack. So a bit more cheat debt helps a little, but not much since debt is still a small slice. Little typo there. So for step four of implement, I check project specific hurdle rates. For US and international, I enter project betas and a country risk premium for international if needed, which is all right. Here we can see that we add the 1.3 and we add the the default for the international extra risk cream is already set to zero. So the remember the current is 11.22 and the international is also going to be 11.22%. So I make the call with current 11.22%. 22% and then adding that 3 billion to get the 11.13% whack. I conclude there's no big whack win from minor leverage changes. Right now I use 11 to 11.5% as today's hurdle rate and only green light projects above that. So especially given peers are closer to 8 to 10%. So to validate uh few math checks all the way sum to one the debt is after tax and CAPM uses the input shown and direction check adding some cheap debt like we did before nudges whack down slightly or intuitively correct and peer check if we go over here we can we compare it to Disney's industry which is at 8.20% 20%. So with Netflix is around 11% being above Disney's uh indust or being just being above Disney is consistent with higher equity whis risk beta in its mix. So how can we evolve this? We can try sweeping leverage. So 0 to 20% debt to find where whack actually bottoms out. And we could add other things to this project like applying country risk and uh more project specific betas for more precise hurdle rates. Um we could do more sensitivity tests like testing RF. I don't remember these variables off the top of my head and see how fragile the current 11.22% is or the whack. And we refresh the inputs as market values and rates change. So we can take actual current data and try implementing into this and see if it gives us similar results and see and instead of maybe 3 billion we can try four or 5 billion and see how much more it chips away at the current whack. So reflection um Netflix's whack is about 11.22% today issuing 3 billion more debt barely changes it. So small leverage tweaks don't move the needle. Since whack is the hurdle rate, I'd approve only projects expected to clear 11 to 11.5% compared to peers. Disney's at 8.2 and the indust industry standard is around 8 to 10%. So Netflix faces a higher bar. So we need stronger project returns or risk adjustments. Next, I'd say whack verse leverage or or I would chart whack verse leverage and add country risk adjustments for international projects. So, what that means is I could go into here and something I guess this is also going back to evolve. We could add a part of the Python code that actually graphs um the whack verse leverage and maybe add a section to where country risk adjustments for international projects show up in the code and then see how that directly affects the current um weighted average cost of capital. And with that, that is my submission for session 9's homework assignment.",
  "video_url": "https://www.youtube.com/watch?v=bDSyYANYJRE"
}