{
  "student_name": "Jay Saini",
  "org_defined_id": "037907174",
  "username": "saini52",
  "email": "",
  "transcript": "[ 0m0s908ms - 0m32s958ms ] Okay, so, this is a Session 10 assignment. Um basically for this assignment we're supposed to perform a comprehensible comprehensive financial analysis of a project including defining the project parameters, constructing a 10-year annual cash flow model, calculating net present value (NPV) and internal rate of return using an 8.5 WACC, conducting sensitivity analysis on key variables, and finally formulating an accept or reject recommendation with supporting documentation and an executive summary. The first subtask is to establish all initial investments, depreciation schedule, working capital, revenue projections, operating costs, tax rate, WACC, and terminal value based on the provided project parameters. [ 0m46s938ms - 1m31s498ms ] So, here we have all those right here. So, our duration is 10 years, our initial investment is 500,000, depreciation useful life is 5, initial revenue is 200,000, revenue growth rate is 5%, the COGS percentage is 40, uh labor cost is 50,000, labor growth is 3%, rent utilities is 20,000, rent growth is 2%, marketing cost is 10,000, marketing growth is 1%. Initial working capital is 30,000 with a percent of revenue change a 10%. Tax rate is .25 or 25% and the WACC is .085 percent or .085 or 8.5%. Um and the terminal growth rate is 2%. [ 1m32s838ms - 2m33s928ms ] So, with all those project parameters defined, our next goal was going to be to develop a detailed annual cash flow model for a 10-year project, calculating revenues, operating expenses (COGS, labor, rent/utilities, marketing), depreciation, EBIT, taxes, net income, operating cash flow, and finally free cash flow by incorporating initial investment, working capital changes, and terminal value. So, right here we basically initialize a list using Python's um, this was all done by Gemini. Uh, so, our previous revenue is zero. Previous working capital for change is year zero. So, the annual depreciation uh equals to the initial investment divided by the depreciation useful life. For year in range project duration plus one, so, this is a for loop right here. And inside that for loop is the if statement. So, if year equals to zero, the revenue equals zero, the COGS, uh labor, all these values basically here, EBIT equals zero, um, our working capital current year would equal our initial working capital year. There would be no change in the WACC for initial investment progress. [ 2m33s928ms - 3m20s598ms ] FCF would be the negative initial investment minus initial working capital. And if all that does not run, we also have an else statement. So, the second part of the if statement, which is revenue would equal initial revenue times uh parentheses 1 + revenue growth rate times year minus 1. Um to calculate the operating costs, it would be COGS, so that would be COGS percentage times revenue. To get the labor current year, labor cost times in parentheses 1 + labor growth times 1 parentheses year minus 1. Uh very similar, rent current year would also be rent utilities times in parentheses 1 + rent growth times in parentheses year minus 1. Um and the marketing current year also would be marketing cost times 1 + marketing growth times year minus 1. [ 3m21s978ms - 3m44s388ms ] So, to calculate the depreciation, it would be another if statement. So, if year is less than or equal to depreciation useful life, the depreciation would equal the annual depreciation. Otherwise, the depreciation would just be zero. So, to calculate the EBIT, it would be revenue minus COGS minus uh labor current year minus rent current year minus marketing current year minus depreciation. [ 3m45s338ms - 4m35s148ms ] And then to calculate our taxes, that would just be a max from zero to EBIT times the tax rate. Net income would be EBIT minus taxes, operating cash flow would be net income plus depreciation. If the year equals one, change in working capital would equal working capital current year based on revenue minus initial working capital. Otherwise, it would just be these three statements down here, uh which would be the initial revenue times in parentheses 1 plus revenue growth rate times year minus 2 for the previous and the change in working capital. Then we also have the working capital, which is the set years, so making sure the capital current year is set to the current year based on revenue. Our terminal value is zero. Our FCF, which is operating cash flow minus change in working capital. Uh and then we have another if statement which is going to be if year equals the project duration, um if WACC is less than or equal to terminal growth rate, it would print out a warning. [ 4m41s968ms - 5m2s828ms ] So, this is just again a prompt made by Gemini. Otherwise, the terminal value if the FCF for terminal value times 1 + terminal growth rate divided by WACC minus terminal growth rate, uh the FCF would be greater than or equal to or sorry, this would add terminal value to the last year's FCF. Not greater than or equal to. [ 5m3s18ms - 5m29s908ms ] And then we have a bunch of here things that would store our results for the current year, and it would print out a very nice looking cash flow model constructed very nicely actually. So, we can see from year 0 to 10 how our revenue, our COGS, labor cost, rent utilities and marketing cost um look for each year, along with depreciation, EBIT, taxes, net income, operating cash flow, working capital, changes in working capital, terminal value and free cash flow. [ 5m30s348ms - 5m47s648ms ] The next part was to calculate capital budgeting metrics. So, computing a core capital budgeting metric such as net present value (NPV) and internal rate of return using the firm's 8.5% um and how that would just basically affect it. [ 5m48s958ms - 6m3s588ms ] So, right here we have cash flows which equals financial model um which is going to be a two list, and this will calculate for us right here. Um, sorry that just repeated, I don't know why. [ 6m4s498ms - 7m17s338ms ] So, the next part right here would be the sensitivity analysis. So, to conduct a sensitivity analysis on key variables like revenue, operating costs, WACC, and to understand how the changes in these parameters are impacted um to basically to get the NPV and the IRR. So, to prepare for the sensitivity analysis, I need to encapsulate the cash flow model construction of NPV divided by IRR calculations into a reusable Python function. So, right here, this is a bunch of um just statements that you're going to see get printed out in a moment. But to calculate the annual depreciation, it would be initial investment divided by depreciation useful life. And we have another for and if statement, so these are nested statements right here, for year in range project duration plus 1. If the year equals 0, the revenue equals 0, COGS, all these values equals 0, um great. Otherwise the revenue would be the initial revenue times 1 + revenue growth rate times year minus 1. And then we have another if statement down here which is if year would be um less than or equal to depreciation useful life, the depreciation would equal to annual depreciation, otherwise it would equal 0. And we have a bunch of those similar statements down here that we're going to see in our um thing in a moment. But um we also have all our project data appended to this. So, as values get updated, so can the actual results as well. [ 7m26s938ms - 8m5s608ms ] And then, now that we've calculated the NPV function and it's defined, we're going to perform the actual sensitivity analysis on the revenue growth rate. So, based on the parameters that were given, um the sensitivity analysis on revenue growth rate, which is this equation right here, and prints out a nice little chart here for us. So, our scenario, revenue growth rate, NPV, and IRR. So, 0 to 4, our revenue growth would be 4, 4.5. It basically goes 0.5 every year. And then our rate goes by um I actually don't know the exact rate, but it does go like by a few points here and there, and our NPV, which looks nice. [ 8m6s508ms - 8m26s988ms ] Uh and then uh kind of basing off of our previous sensitivity analysis, the revenue growth rate, it will also perform a sensitivity analysis on COGS percentage. So, that equation would be right here, and it prints it out. So, 36, 38, 40, it goes basically by 2%, and um you have our NPV right there as well. [ 8m27s388ms - 8m44s388ms ] Same thing, they're going to do with the revenue growth rate, or they're going to do on the WACC value, same equation right here. And then here is the performing sensitivity analysis for that. So, this one is a little bit less consistent with its um growth, but very similar. It's still growing. [ 8m45s358ms - 9m14s388ms ] Um and then right there, okay. Um and so to kind of just recommend, so, based on the cash flow analysis, capital budgeting metrics, and sensitivity results, it's provided a clear accept/reject recommendation for it, which would be um that the project should be accepted from everything that we found out basically. Um and this is kind of a summary on the D the details of what we just found. [ 9m15s68ms - 10m20s588ms ] To quickly explain driver, um give me one moment right here. I wrote it down and then I okay. [ 10m22s718ms - 10m24s848ms ] All right, I'm just going to I can't pull it up, so I'm just going to kind of try to freehand it. [ 10m25s218ms - 11m11s658ms ] Um but basically, looking at the results and stuff as well, this might not be in order of the DRIVER framework, but very similar. Our results show that since there is a nice sensitivity analysis that has a consistent growth rate for all the values that we've checked, it's generally smart to accept the product. Um, a moderately sensitive changes in like a WACC, so the 10% decrease would rise the NPV from 362,000, while the 10% increase would lower it to 149,000. So, kind of looking into that, uh the high sensitivity to the revenue growth rate and the COGS percentage definitely suggests that the efforts should be more focused on a robust marketing analysis to ensure revenue targets are achievable and on the cost control strategies. [ 11m11s658ms - 11m37s198ms ] Um, and overall just kind of understanding all that. We implemented it from Gemini. So, Gemini was able to create all these equations, and to make sure that we were getting the right equations, or the right uh statistics, I did go um and did some research on the equations and did a few examples myself to make sure that Gemini's uh algorithm was actually giving right results. So, that if someone ever wanted to actually use it, they would get the correct results. But yeah, that is my project. I hope you",
  "video_url": "https://www.youtube.com/watch?v=mx_lIpLEprU"
}