{
  "student_name": "Vincent Craw",
  "org_defined_id": "035627160",
  "username": "vcraw",
  "email": "",
  "transcript": "All right. Hello everyone. My name is Vincent Crawl. Um this is my session nine assignment for management 310. Um in this project we're focused on calculating the weighted average cost of capital or the whack for Netflix. Uh specifically evaluating the hypothetical $5 billion content investment along with the related $3 billion debt issuance. The weighted average cost capital represents the minimum return a company needs to earn on investments in order to satisfy investors. Essentially, it's the hurdle rate a company uh uses when deciding whether to approve or reject a problem or a project. So after running my code uh which you can see on the screen, we began to review uh the core financial calculations um the problem successfully the program successfully computed Netflix's cost of equity using the capital asset pricing model with a risk-free rate of 4.5% a beta of 1.3 and a market risk premium of 5.5%. The resulting cost of equity came out to 11.6. 65% as you can see right here. Um, this reflects Netflix's high uh relatively high level of systematic risk compared to overall compared to the overall market. So then I went ahead and I did the same uh inputs on paper just to verify that the calculations were correct. So I have for the cost of equity it equals the risk-free rate plus the beta time the market risk premium. So we have 4.5% plus 1.3 * 5.5% and that equal 11.65. So that is confirmed. Um and then from there uh we evaluated Netflix's current capital structure. At present uh the company has risk roughly 200 billion in equity and 13 billion in debt giving a total firm value of $213 billion. And then this results in a capital structure that is 93.9% equity and 6.1% debt. The way you find those is you just divide the 200 by the 213 you get the 93.9 and then you do the same doing 213 divided by 13 billion and you get the 6.1%. Um and then Netflix's prec cost uh pre-tax cost of debt is 5.8%. 8% and after applying the 21% corporate tax rate, the after tax cost of debt becomes 4.58%. And then using these inputs, uh Netflix's current weighted average cost of capital was calculated at 11.22%, which you can see down here. And then going over the pre-tax cost of debt um equation just so we know how it works. So, it's the pre-tax cost of debt, which is that 5.8%. And then and it's 1 minus the corporate tax rate, which is 21%. So, you do 5.8% time 1 minus 0.21 or 21%. And that gives you 4.58% which is what it has in um the after tax co after tax cost of debt. And then we find the new weighted average cost of capital when the prices go up or when the debt goes up from 13 to 16 billion. Um, so we do the new tax rate. You just uh basically instead of 16, you're doing so it's 216 instead of 213. It's like the same thing. And then you get 92.6% of equity and 7.4% of debt. So for the new weighted average cost of capital, you're doing that uh 0.926 or the 92.6% equity times that 11.66 or 11.65 and then plus 0.074 which is the debt percentage. And then you get um 4.58% and that equals the weighted average cost capital of 11.13% which is correct in there. And then um pretty much um seeing the drop of 0.9% um suggests that Netflix is currently underleveraged and can safely take on additional debt without dramatically increasing risk pro risk profile because debt is cheaper than equity and because interest payments are taxdeductible. So this new borrowing is financially beneficial for the firm. Uh one key takeaway from the assignment is that Netflix should not rely on a single firmwide weighted average cost of capital for all project evaluations using um when using 11.13% hurdle rate across every type of investment. uh it can lead to poor decision making. Um low-risk projects such as m mature US streaming content might get rejected even if they create value. Uh meanwhile the high-risk projects such as expansion into emerging markets could get approved even if ultimately they destroy value. So to avoid this, Netflix should apply the risk adjusted hurdle rates essentially a different weighted average cost cost of capital for each project category and then based on the risk of the risk level of the competitors in that particular market um they can lower lower risk uh the lower risk US content might want might warrant a hurdle rate in the range of 9% to 9.5%. uh while the higher risk international projects may require rates closer to 10.5 or 11.5%. So then we did the um gear comparison with Disney. So we see uh Netflix's competitive disadvantage because their weighted average cost capital sits at 11.22% while the general media and streaming industry typically ranges from 8 to 10%. Uh we see Disney's weighted average cost of capital is around 8.2%. And Amazon Prime Video is like 9.5%. So this gives companies like Disney a major financial advantage um because a project that's going to return 9% would be acceptable for Disney, but it would have to be rejected by Netflix because it falls below the 11.22 hurdle rate. Um Disney benefits from lower systematic risk due to its diverse diversified business lines uh like the theme parks, the Disney networks and all the merch merchandising they do. And then this stabilizes earnings and reduces its beta so they have less risk. Uh Disney also uses about 30% debt in its capital structure instead of Netflix's 6 to 7% uh modest debt. Um because debt is cheaper than equity, the higher leverage helps pull Disney's weighted average cost capital down significantly. So pretty much based on this, the strategic recommendations are pretty clear. Netflix should approve the $3 billion debt issuance since it lowers the weighted average cost of capital from 11.22% to 113% um and it takes advantage of relatively inexpensive borrowing for the remaining $2 billion needed for the content investment. Uh Netflix should use whichever source equity or capital or I mean equity or cash is cheaper at the time. Um, since the major financial benefit comes from the initial debt adjustment over the long term, Netflix should work toward more optimal capital structure, gradually increasing its debt ratio to the 15 to 20% range. Uh, this level would still be well below the risky thresholds, but would meaningfully reduce the weighted average cost of capital and help narrow the competitive gap with Disney. And then Netflix must remain mindful of trade-offs between lowering weighted average cost of capital and increasing their bankruptcy risk. But since their company is so big, I don't think they're uh anywhere near dangerous levels of leverage. Uh ultimately lowering the weighted average cost of capital would expand Netflix's ability to take on more profitable projects. uh they'd be able to increase uh net present values and boost overall shareholder value. And that is it for my session 9 assignment. Thank you for listening.",
  "video_url": "https://youtu.be/Bc6QqLT3P2E"
}