{
  "student_name": "Lahari Bikkavilli",
  "org_defined_id": "035990933",
  "username": "lbikkavi",
  "email": "",
  "transcript": "Hi, how are you? My name is Lahari Bikavili, and this is my session 10 assignment. As always, I have my code here, but I am planning on maybe focusing a lot less on the code this time, so I think I'll maybe spend just maybe a minute or two total kind of going through it. But as always, I also do have my notes on the left-hand side here that explain how I understand the code in general and kind of what that really means in context of the assignment. So starting off, I think I'm going to start actually with my notes. And so starting off with what's the task, right? That's the most important way that I've been trying to start these assignments is breaking down and understanding what I'm actually tasked with doing and how I can make that happen. Starting off, the goal of my assignment is we're taking a company, Starbucks, which is very well known, and we're considering a $12 million flagship roastery that runs for 10 years, right? So this is like the business that we're currently evaluating. We're asked to evaluate the project using capital budgeting, and then we're going to build a year 0 through 10. So starting from their first year all the way through 10 years of their business, incremental cash flows. And we're going to use Starbucks WAC as 8 .5%, which is going to be our hurdle rate. Then we're going to compute NPV, IRR, payback, discounted payback, NPI, and then run sensitivity tests. So revenue is 20%, WAC plus or minus 2. So that would be 6.5 and 10.5. And finally, we're going to make a recommendation that considers both financial results and strategic brand fit, right? So again, essentially, most of these calculations are stuff that we've already done in the past, but it's more about doing all of them on one business, putting it all together, and then using that to make a recommendation. Moving forward, our key assumptions from the problem is using our initial investment, the $12 million, we know that we have building equipment and training included in that. And then we have a depreciated straight line over 10 years. So working capital is going to be $500K out in year zero, recovered in year 10. And then our revenues that we're assuming, as you can see, are listed here. Maybe I can make this a touch bigger. Actually, I cannot. But year one is going to be $8 million. Year two to five is going to be $11 million. And then the rest of the year is going to be $9 million. operating expenses so cogs is going to be 40 of revenue labor is 2.5 million per year rent utilities is 800 000 per year or 0.8 of a million per year marketing is going to be 300 000 in year one 100 000 per year in years two through ten and then tax rate 200 percent terminal value at end of year 10 is going to be three million and so right here i have um just a base here that says the task is to decide if starbucks should build 12 million rosary a 12 million dollar rosary by modeling its cash flows over 10 years, discounting them at the WAC of 8.5, and then interpreting the capital budgeting metrics and sensitivity scenarios. So jumping into my code here again, I think that I'm going to keep it a little bit brief on the code because in the past, I have gone a little bit more in depth here. But of course, we have our print statements. I always try to outline them with the driver stage. This is going to be the first to define and discover and represent. And it's going to be a bunch of our print statements. So all of this, this is going to say exactly what we're doing. What I just read previously is going to be the same thing that's in the code. Then two is going to be represent model setup and parameterization. So again, our initial investment, project life is the 10 years, tax rate, WAC base rate. Essentially, look, all of these numbers here are the numbers that we just discussed, right? Making sure I put them in because for me, it's something that I do need to prompt Python or sorry, not Python, Gemini for a few times is making sure that these comments are added because it's something that's important to me when I look back at the code. Then we have our depreciation, which is going to be initial investment over project life, revenue schedule. So this is going to be the revenue schedule and then again more of our numbers that we did talk about before so this is the 0.8 of the million the 0.3 and the 0.1 of the million moving forward here's where we're using our actual formulas and these are different functions calculating NPV we're calculating the IRR and then it says what the what it is in each of the things in each of the function description there then we have the calculate cash flow that we're doing operating cash flow depreciation schedule earnings before interest essentially all the different um things that we decided that needed to calculate earlier when we were discussing the project when I said what is the outline so moving into we have our initial investment which is going to be zero terminal value which is year 10 and then total incremental cash flow continuing through all of these will be further spoken about later in the code as well but I think I just glancing over the code here looks fairly standard then we're going to go into something like profitability index and we're going to return these values that we're looking for stage three of drivers can be implement right so this is the base case execution so using our base case which is what the information that we have currently we're gonna figure out and we're gonna implement the base case cash flow construction in the metrics to see how Starbucks is doing so again we're gonna use all these different values and different parameters that we had discussed and defined earlier in the code keep going and then here you're gonna have some print statements as well we're going to do like the simple payback period discounted payback period and later we'll look and discuss what those values actually mean then finally we have stage four which is the validate it and evolve so um sensitivity and scenario testing so here we're going to go through we're into the wax scenario wax scenario um with the plus two percent minus two percent which is going to be discussed earlier then our summary data here which is going to be a summary table as always I tried to at least in the last few weeks put in some sort of a display or like a data metric to be able to see the information a little bit better and I do think that for this one I ended up going with um yeah you can tell by the x and y's here I ended up going with different graphs and I do also have explanations for what those graphs mean finally five and six reflect visualization recommendation so as you can see I have my title my bar my grid my sorry like labels things like that as well so same things which all of these I think are at least a little bit more clear for me looking at the actual graph and understanding in that sense and finally we have our recommendation text that we will also go into so here we have our define and discover project scope and drivers again same thing we're just got we're describing this going through it so we're representing model setup and parameterization implement this is our base case that we're implementing right so these are all the values that we have here if you understand it so on the left hand side we're going to have zero through ten so going through each of the years so starting with zero we're going to say our revenue total is zero which makes sense right because in the sense you're saying that you haven't done anything yet it's the first year operating expenses are going to be um 3.3 million here depreciation is going to be zero because it's the first year right nothing can depreciate yet no time has passed and most of these numbers here are going to also be zero because not much has happened then as we move into later years we can see that revenue has increased slowly and ideally revenue would be increasing consistently but as we can tell in between the fifth and the sixth year here we can see that revenue has slowly decreased and that also can be part of the different costs that we're measuring and having to deal with here as well right so I think those are all valuable things as we can see depreciation stays consistent is going to be 1.2 million consistency tax shield is also going to be fairly consistent and then we're going to have our EBIT and our tax expense that change a little bit between the fifth and sixth year as well. So let's jump back over to my notes and kind of see what this actually means in terms of the assignment. So if I make this a little bit more full screen here, right? So we went through this already, right? What is the task for? So we're evaluating the 12 million dollar flagship grocery over 10 years. We already know this information, right? So we're going to do revenue at 20%, WAC plus or minus two, give a recommendation, right? What does the code do? So this is where I break down kind of a little bit of my driver, but I do have a little bit more of a specific that I do at the end here where I actually implement where I do a driver in particular so identify project scope drivers and assumptions this is the cogs labor rent marketing depreciation etc and i'm going to convert this into a parameterized model so our all assumptions stored as variables so all of the things that we assumed earlier which would be all these numbers up here we're going to store this into variables to be able to use for calculations um moving forward um down here we're going to see okay so set up revenue schedule and cost structure so implement we're going to build the 0 to 10 cash flow schedule and that is what this entire thing is here, which we'll go in through a little bit more depth. And so we see depreciation tax yield, all these different values. So we have our NPV is approximately 3 million, IRR is approximately 13.3%, and the PI is going to be 1.24. Simple payback is going to be 5.3 years. Discounted payback is going to be 8.2 years. So validate and evolve, this is where we're changing those numbers, right? So it's reducing a little bit different. So if I scroll down here a little bit to the validate and evolve, and we'll get through what these numbers mean. I think it goes over a little bit better in um final recommendations and what that really means in general but um about it involves sensitivity analysis and scenario testing summary of sensitivity analysis of npr so our base case npv is going to be this ir is going to be 13.25 so we're saying when the revenue is 20 percent or is minus 20 excuse me npv is gonna be 150 uh 3157 so 3.16 million and minus 3.16 and then NPV change is going to be minus 6.1 and then when we do whack minus 2% which is the 6.5 value we can see NPV is 4.6 and NPV change is 1.6 but when we do plus 2 we can see that this NPV value has shrunk by a lot by around 3 million honestly it's shrunk a lot and here we can see that it's also shrunk by 2 million here so reflect so we're going to use those to risk and impact. So what's happening in each of these graphs, I think if we could pause here and talk about what's going on in each of these graphs here, first graph is going to be the base case cash flows, and this is going to show a million, right? So in year zero, we can see that there's going to be a large negative initial investment. Makes sense, right? Because in terms of real world context, this is the first time that they're opening this store. There's obviously going to be a lot of investment early terms, so you're going to have a negative cash flow. They're not earning anything yet then years one and nine positive operating cash flow so we can see through here we can see they're slowly operating positively i think this is their golden range right here which would be around years two through five like we discussed before between five and six we see a little bit drop then year 10 biggest inflow ocf and wc recovery and terminal value shows that the long-term payoff structure does work right we can see that say they stayed fairly consistent until it dropped here and then it remained dropping for the few the remaining years we can see that this is probably where their sweet spot is in the next five years, but because it has eventually shot back up again, we know that this is overall going to be something that's a good idea or an investment at least for now. Graph 2 is going to show NPV sensitivity to WAC, which is our hurdle rate. So NPV falls as WAC rises. So we can see if NPV is going to be zero here and the IRR is going to be here as 13.25, as you can tell, as the WAC increases. So as we get done this way, the NPV value is going to decrease which is why we have a negative slope line here it's still positive between 6.5 and 0 .10 so between here and here we know that it's still positive still above the one value which is still a good sign orange line marks RRR where NPV is equal to zero and then shows cost of capital risk is mild right so the the cost of this risk is it's honestly very like middle ground then finally for graph three we're going to have the base case versus revenue right which is a 20 scenario that we discussed last so downside cash flows are smaller every year in the revenue shock scenario accumulative inflows are not large enough are not enough to recover the investment explains negative npv right so that's what it's explaining here and then it shows that revenue sensitivity is the main risk so the amount of revenue is very sensitive to our um in our base case scenario and we're able to at least see that here in general right um will you excuse me for one second i think my wi-fi is bugging out sorry about that i'm at home so i think my wi-fi was messing up i didn't want to lose the progress that i made in the video but um continuing forward i think we were on this last graph here that we're kind of going through a little bit and so then we see our financial justification at the end but continuing through we see that it shows revenue sensitivity is the main risk now going into our final recommendation and then the last thing that we do need to go over is kind of what these numbers mean in the cash flow schedule final recommendation base case is value creating we have npv is approximately 3 million. IRR is 13.3%, which is greater than the 8.5% WAC. And then strategic, this supports Starbucks premiumization slash reserve brand, which enhances brand experience and pricing power, which is something that's very good for the company as a whole. Obviously, there's going to be risk to any investment. This is also assuming a fairly decently stable market, which does not take into account all these other factors that could be at play. But revenue downside is the business biggest threat. So shifts NPV negative. WAC risk is small. Project stays positive between the 6.5 to 10.5 so here we recommend accept but monitor demand such traffic risk carefully now for the actual driver framework i think i did go through this pretty decently but i'll just quickly skim through it here but um again define i state that very clearly at the beginning identify what the required outputs are discover i do gather all the information that i need so all the project assumptions we saw that we do at the beginning when we define all the different numbers as well so we can move forward with our math then we have um i also think that these are off so this should say as always this should be define and discover this should be represent this should be um it's a little bit off in that sense but I think it's fairly clear what that means at least but moving forward um gather all the assumptions which I did then for I um convert assumptions into a parameterized model this is kind of where we see like the um where we kind of see our cash flow uh cash flow schedule come out and that's really where that like the implement goes from as you can see the naming is correct here then for V we have validate this is actual python functions and we have numbers to back this math up and then we have e here which is going to do the evolve section right so how can we change it this is where we do the plus two and minus two for the whack percentage and finally we have reflect where we're going to interpret the results so moving into r which is the last part left the final recommendations what it means and what's it like how to say it what's important overall the recommendation that i would say is to accept the project the flagship grocery creates value in the base case and it's strategically aligned with starbucks's brand direction and remains financially viable under moderate whack changes so we're assuming that there's a plus two minus two whack change which means that and under those conditions that starbucks would still be able to survive so i think that this is something that should be accepted but i think the more important part of the statement is that it continues moving in the direction of starbucks's brand because it's something that's very important for a company such as this financial basis for acceptance so this is where we're going to kind of go through the the cash flow schedule and here there are a lot of numbers which we briefly went through but i think i'll describe them a little bit more simply here project generates three million more value than the required return than 8 .5 good positive npv so project increases shareholder wealth great moving on ira 13.3 is greater than 8.5 wax the project earns a return significantly above starbucks's cost of capital also amazing pi is 1.24 so every one dollar invested produces 1.24 in present value really good there's a 24 increase there a pi above one is a clear acceptance signal simple payback 5.3 years discounted payback 8 .2 cash flows take time to recover the initial outlay but this is normal for large experiential stores essentially for me i think yes 5.3 to 8.2 years is a long time but overall for something that's this big of a expenditure for a company especially something with starbucks's level of reputability i think this is definitely worth it um moving forward strategic basis for acceptance this strengthens their premium pre uh i'm not gonna be able to say that but it strengthens their strategy so it reserves their brand right it sticks with that very quick um very authentic high-end but also affordable starbucks brand that they've been building for the last few years it creates a destination store that has global branding impact enhances customer experience and pricing power expands high margin of their segment of starbucks portfolio risk insights as we said all of these need to have risk insights revenue risk is the main vulnerability 20 drop in revenue returns npv negative project becomes value destroying this is what i said that i should mention at least is that the project is financially strong but sensitive to different demand and traffic volatility which i didn't mention a little bit earlier the whack risk is mild so from 6.5 to 10.5 project stays value creating so no issues there so what this means simple explanations of the years year zero two big cash outflows which is a 12 million initial investment and 0.5 working capital these are the startup costs that are required. They're one-time costs that we know that we're going to be spending and we can find them here in our schedule here. Years 1 to 10 operating cash flows each year includes revenue so follows the project assumptions that year 1 is 8 million, year 2.5 is 11 million, year 6 to 10 is 9 million. These are numbers that we provided. Then COGS and operating costs. COGS are 40% of revenue. Operating costs includes labor, rent, marketing are deducted to arrive at earnings. Depreciation is going to be 1.2 million per year non-cash expense so there's a straight line over 10 years this reduces ebit and taxes but not cash ebit taxes and no pat ebit revenue minus all operating costs minus appreciation taxes applied only if ebit is greater than zero then there's a depreciation tax shield to discuss which is the tax savings created by depreciation important which is important because it increases real cash flow even though depreciation is non-cash then you have our operating cash flow this is true annual cash generated by the groceries operations working capital terminal year in year 10 the project receives 500k recovery for their working cap the initial working capital they put in is going to be returned and also they receive an additional 3 million terminal value so um they're building such equipment salvage or estimated final value these boost their final year's cash flow sharply which we can see here as well we're going to see um that their incremental cash flow has a boost here as the 5 .3 million compared to the past year so obviously we see the 12 minus 12 500 or sorry minus $12.5 million is going to be their initial cost. Then it stays fairly consistent here. We see a drop in this five to six-year range where we know that they've made a little bit more profit, so their cash flow is a little bit different. And then we see that their cash flow has increased here for $5.3 million in their last year. Income to cash flow, this is the final number in each row. This is combining operations and investments and their recoveries. These are the values used to compete NPV, IRR, payback, and PI. Overall, this is my assignment. I think I definitely enjoyed this one. It's always fun learning about different companies and things that I also use in my day-to-day life. And I think final justification, again, all of this is pretty much what I said there. But I'll leave it up just for like if either of you would like to review it or read these numbers. But yeah, overall, that's my project. I hope you enjoyed. And yeah, thank you.",
  "video_url": "https://youtu.be/P8yCVPBOqtE"
}