{
  "student_name": "Galiena Colon",
  "org_defined_id": "037271356",
  "username": "colon34",
  "email": "",
  "transcript": "Hi everyone. Today we're going to be doing session eight and we're going to be using the driver framework to help us walk through the problem. So before we get into the driver framework, I just want to go through the event and timeline that we were given. And so the event that we're looking at today is the GameStop short squeeze. And so we were given the event timeline, but I created a little simpler one down here just so so people understand the situation. So hedge funds pretty much made bets that the stock of GME was going to fall. And then some people on Reddit were actually optimistic optimistic about GameStop stock. And then with this optimism outlook and the knowledge of the amounts of short interest, people coordinated massive buying a massive buying campaign for GME stock. And so with this buying campaign, the stock price increased and then the hedge funds were forced to buy back shares to cover their short positions and limit their losses. And in the end, the hedge funds had significant losses and the retailers made some huge profits. So just to understand some of these key data points that we were given, the short interest peaked at 140% of the float. So this means that there was more short sales than available trading stock in the market. And then for the retail trading volume, it increased 10fold during the squeeze. And this is was because of the movement that they created to buy GME stock and it drew more attention and more people started buying. And then there were trading restrictions implemented at the peak by the Robin Hood app. They basically allowed people to not buy GameStock, but they could only sell it. And then the hedge fund Melbourne Capital sustained 53% loss and they required bailout. And this was because they since they borrowed GME stock and short sold it um they had to buy stock back at a at a higher price later. And then analysts um fundamental value estimates that GME stock was only 10 to $40 per share and not that high price that these retail investors drove it up to. Onto the define and discovered part of the driver framework. First, we need to outline what our objective is and that is to calculate and analyze the abnormal returns during the event period to investigate whether GameStop short squeeze event proves that the market is inefficient or efficient. And in our scope and horizon, we are analyzing the GameStop short squeeze like I said and it occurred during 2020 and 2021. Our constraints are that we are only limited to the historic data that we have access to. And for data inventory, we need to validate that the following statement is accurate that we were given that was Gamestock traded at 0.04 cents. And then we were given a timeline of the event and key data points. And I did check everything and I watched a lot of YouTube videos to kind of understand this event and what actually went down. And then the key equation that we're going to be using is that abnormal returns our actual minus the return that's expected. And then the success metric is that if our statistical analysis on abnormal returns has a p value less than alpha, then we will know if the market is efficient or not. And then our benchmark and sanity check is that if we were able to explain the gap between the fundamental valuation of that $10 to $40 compared to the stock price high that we are going to find is that the result of our abnormal return calculations will make sense along with our verdict of whether the market is efficient or not. So first is this statement correct? Gamestock traded at 4 cents. So this is correct. I did find this. I looked on Yahoo And I actually found that during August it was in a range of $14 and $167. And here's what I would send to the professor to correct him. So for this define and discover stage, I think it would be really important to define what the efficient market hypothesis actually is. And that is that it the stock prices fully reflect all available information making it possible to consistently achieve make it impossible to consistently achieve abnormal returns through analysis of publicly available data. And so what EMH is basically saying is that it's virtually impossible to beat the market and achieve above average risk adjusted returns through active trading strategies. And some of the key predictions that EMH makes is that the stock price changes are essentially unpredictable. They the prediction is that it attempts to identify under attempting to identify undervalued or overvalued stocks is pointless because all relevant information is already incorporated into the price. The best strategy for that EM says is that passive investing is the better way to go and that for returns are risk adjusted. So any higher returns achieved are simply compensation for taking on for taking higher level of risk not the result of superior skill or information. So there's three forms of EMH. We have the weak form where price reflects all past price and volume data and this is where techn technical analysis does not work. The semi-rong form where price reflects all publicly available information. Neither technical or fundamental analysis can generate excess returns for this form. And then the strong form is that price reflects all public and private insider information. So no one can consistently achieve excess returns. Onto the represent stage, we need a quality framework for analyzing efficiency around specific events. And so we're going to be using the event study methodology, which is a common methodology used to test the semi- strong form of market efficiency by observing behavior of stocks returns around a specific event. And again, this does only test mainly semi-strong form of EMH, but we can make inferences about the other forms using the context of our calculations and other details about the situation. And so here I created a little timeline of or a little walk through of what we're going to be doing. First, we need to identify the event that we're looking at to find the event window. Normal, we need to do a normal return estimation. have a normal return estimation period, then calculate the abnormal return returns, and then we're going to be doing a statistical analysis. And so here I have my event study timeline. So the estimation period where we're going to be establishing what the normal return pattern actually is. I chose to be July 20th, 2020 to January 8th, 2021. And the event window is going to be from January 11th to January 27th, which day zero, the highest peak closing price happened on January 27th. And so then we're going to be looking for the postevent period. And this is going to be after January 27th, so January 28th to February 19th to see if there are still abnormal returns after the event window. I got these efficiency benchmarks for the book book. So for strong efficiency all abnormal returns would be on day zero. For semi- strong efficiency returns would be complete within 1 to two days. And then for weak efficiency drift may continue but only due to new information. And for our return analysis these are going to be the equations that we are going to be using to calculate them. So on to implement we need a systematic execution of the event study methodology. So let's go and look at my code. So to walk through the code pretty quickly here, it just outlines what the estimation start and end date for looking for those normal returns. And then it outlines what the estimation start and end date is and that peak event date that we discussed. And then it is going to be fetching the data from Yahoo Finance. And then here it's just estimating the market model parameters um alpha and beta. And then it goes into actually calculating the abnormal returns and the cumulative abnormal returns. Here are those equations for the expected return which they're going the the equation for calculating the normal return. Sorry. And then they're going to be finding the abnormal return and then calculating the cumulative abnormal return. And then I also did to make a graph for the cumulative abnormal returns. And then here's the output. You can see the output that it used and the beta that it used. And then it shows us the event timeline and gives us the stock return, the market return, the expected return, the abnormal return, and the cumulative abnormal return. So we can see that the abnormal return gets very high during the peak event period. And then the cumulative abnormal return gets increasingly high and stays pretty high throughout the whole event window. Down here it says that the cumulative abnormal return over the full event window was 234% which is very high and the abnormal return on the peak day was 137.97%. So here's a graph of the cumulative abnormal returns and you can see that they get increasingly high during the event period and they stay pretty high even after so and so this definitely shows that there's some type of violation to the EMH. If the EMH were true then there would not be so much abnormal returns happening throughout the event period and it would just really be on one day. But as you can see that is not the case here. So here's some conclusions from what we saw from the high ARS and the high C with the highly positive C. This means that over the entire event period, the stock's performance was vastly superior to what its fundamentals and risk factors would have predicted and then this would be a strong violation of EMH. The high C shows the asset was significantly mispriced and that investors were earning abnormal returns in the efficient market. Says that prices should instantly reflect all information but the high C means the price adjustment was not efficient and there was still abnormal returns after. So now coming back to those efficiency benchmarks. Um this is what the book says that for strong efficiency all abnormal returns on day would be on day zero but this did obviously did not happen and then for semi- strong returns complete within one to two days this definitely did not happen it was strung out way longer and then for weak efficiency the drift may contribute but only due to new information again the CR was for a much longer period and it the C was definitely higher after the new information came out So using more of the context of the situation to look over each of these forms for semi- strong form, it was definitely violated because of that existence of the cumulative returns that were up to 400%. This means that the stock price was detached dramatically from what its fundamental publicly verifiable value would suggest and that there were riskadjusted excess profits that were achievable with only using public information. And then for the weak form, it was definitely vi violated because the retail investors used publicly available statistic about the high short interest which led to the predictable short squeeze and massive profits and there was non-random return patterns definitely present there. And then for the strong form, it was definitely violated. Since the weak form and the semi- strong form um are strongly violated, it's highly likely that the strong form is also violent. But we also have the fact that We know that the trading platform Robin Hood suddenly restricted the ability of retail investors to buy GME shares and this action was based on internal non-public constraints. So all in all the GME price movement was not a rational efficient adjustment to public fundamental information but it was definitely an abnormal market reaction. So to quickly run through and validate um I did statistical significance testing and I used a robust t test because the data violated some of the assumptions for a regular t test. So this one was a little bit better. And so here you can see the hypothesis. The null is that the average of normal return over the event window is going to be zero. But the alternative is that the average abnormal return over the event window is going to not be zero. And so if it is an efficient market the average abnormal return will be zero and if it's inefficient it's not going to be zero. So let's take a look at my code for the sake of time I won't be running through the code but I will show you the output here and it does show that the robust t statistic was 7.8 And the p value was way below the alpha and it is way below zero also. Sorry, I meant to say that it is pretty much zero. And here we have a little bit of a conclusion. Since the robust p value is less than or equal to alpha, we reject ho. And this means that the semi- strong market efficiency is not true. Like the market appears inefficient. So from the code we know that we are going to be rejecting the null and this means that we can assume market inefficiency and that there was an anomaly taking place. So onto the evolve we're looking at the application of efficiency insights to investment strategy. So in general for an efficient market the passive strategy is better because it's impossible to beat the market. So the high fees for the active strategy wouldn't be worth it. And then for inefficient markets, the active strategy would be worth it because you can beat the market. And then for each of the EM forms, there's different investment strategies that you can use. For strong efficiency, it's better to use passive index investing. For semi- strong efficiency, you should focus on private information and superior analysis. And then for weak efficiency, fundamental analysis can work and te technical analysis cannot. In the real world, professionals don't look markets as being binary. So they're not just efficient or inefficient, but they assess market efficiency as a spectrum based on specific characteristics continually testing for pricing anomalies. So fund managers who practice that active strategy look for the inverse of what creates high efficiency and in an effective market it has a high number of participants high information availability slash transparency high liquidity and low transaction costs and low barriers to entry for arbitrage. So like I was saying there's a spectrum of efficiency that they have for developed markets like the US they think it's semi- strong but for emerging markets they think it's weak form for large cap stocks they think it's highly efficient for small cap stocks it's less efficient for highly liquid fixed income it's very high efficiency but for niche and alternative assets it's low effic efficiency there are arguments for active management even with the majority of markets being semi strong fund managers say that there are behavioral finance biases and anomalies that they can exploit. They also say that they argue that active management is the reason for efficient markets and through superior analytical frameworks they could create anformational advantage. So since we know that EMH was violated for this event for the GM short squeeze, what was at play here? What can explain why the price was driven so high? And so we can look into a few of those reasons. First, we have the micro structure issue which was that the short interest surpassed 140% of the publicly available float and this pretty much guaranteed a price spiral once those retail buying investors caught on to this. Then the price also continued to be mispriced because of these limits to arbitrage. First we have the noise trade risk which happened because thousands of individual retail investors were coordinating on Reddit. They were acting on a powerful narrative and momentum rather than the company's financial fundamentals and the squeeze those arbitrageers out. And then the second one is the implementation cost. Since GME was one of the most shorted stocks on the market, the high short interest meant the cost to borrow shares to short sell became extremely high and the stock itself was hard to borrow. So this limited new arbitrageers coming into the market and lowering down that price. The third one is fundamental risk. The risk that the company's fundamentals would change. In the beginning um the short sellers knew that GME was going down but now there's the risk of it going up since a lot of those retail investors are driving up the price. Another thing that can explain the anomaly is behavioral finance where we're looking at how psychological factors influence financial decision- making of individuals and the financial markets. And so here I've listed a few of the different behavioral finance um topics that were at play here. First is overconfidence bias. Many of the retail investors exhibited overconfidence believing that they had identified a surefire way to outsmart and defeat those hed funge and so this made them buy and hold on to GME stock. And then we have hurting which was caused through Reddit. We have a bunch of retail investors getting together to drive up the price of stock and then this made more investors want to join in on the profits. and then FOMO which is kind of the same thing because people saw the gains that other retail investors were having and they wanted to be involved in getting some of those gains. Then we have investor sentiment in social media. So Reddit was the primary engine for driving and coordinating the positive sentiment for GME. the post um in discussions created a strong narrative of David against Goliath and they wanted to beat the powerful hedge funds and so the this caused emotional investing and so on to emotional trading. The trading of GME was heavily influenced by anger against the hedge fund, excitement with their gains, and then they wanted to get revenge against the hedge funds. And so these emotions motivated investors to buy and hold the stock despite overwhelming financial logic, suggesting massive decline was going to be inevitable. And then lastly, the momentum effects. There was just a cycle of the price rising for short covering, new momentum buying, and then the price rising again. And so this definitely played a part why that price was so high from what the market would have expected. And so I want to do just some extra evaluation on this problem and to dive a little bit deeper into the situation. Let's assess the information advantages. So the hedge funds had the fundamental information advantage in the beginning because they were shorting the stock and they saw that J was going down. But the information about the short interest was definitely an advantage for those retail investors. And then the retail investors had the advantage because they could organize and disseminate info on social media. And then evaluate whether rational investors could have profited systematically. In the beginning, hedge funds were profiting systematically from shorting the GMA stock. But the short squeeze event was not a place where retail investors could profit systematically. So time after time would they do this? No. because this was a high-risk one-time event. So, yes, they did profit throughout the event, but could they do this over time? No, because eventually the price did go down. And then the asset substitution problem. This involves the hedge funds in the fact that they had unlimited liability associated with losing their short position in GME. So during the short squeeze, these hedge funds started to lose a lot of money and so this made them think that they had really nothing to lose and so they would hold on to the fact they would sorry. So since they had nothing little to lose at this point since they already lost a lot, they would take on more risk and try to save their capital instead of immediately buying back. Some of them, the really desperate ones who thought they had nothing to lose at this point, had an incentive to double down and wait in hopes that their capital could be saved. Lastly, onto the reflection. So, the image pretty much describes the ideal market. So, the investor is r rational and logical. The market price is just the intrinsic value. Anomalies don't exist. And the arbitrage is that instant correction of all mispricing. But behavioral finance, the perspective of behavioral finance is really the reality that investors do have bias and emotion that the market price does is the intrinsic value but also sentiment and bias that there are anomalies due to psychological bi biases and that there are limitations to arbitrageers. So if we were evaluating whether market anomalies constitute evidence against market efficiency um this situation proves against my strong form because the price showed the effects of her behavior and collective sentiment. I would say that market anomalies do constitute evidence against market efficiency because anomalies suggest that prices are occasionally mispriced due to factors not fully accounted for. They suggest that there is consistent exploitable patterns that allow for abnormal returns and they suggest that investor behavior like biases and irrationality and market frictions allow mispricing to persist. So, in conclusion, since I've already gone so long, sorry. In conclusion, the market is mostly efficient, but there is still imperfections that exist, such as market anomalies and mispricing, behavior, biases, and limits to arbitrage. The GME short space squeeze was a prime example of a challenge to EMH. Thank you so much for listening.",
  "video_url": "https://youtu.be/1OFwtELkrdI"
}