{
  "student_name": "Anamika Mitra",
  "org_defined_id": "037556874",
  "username": "mitra69",
  "video_url": "https://youtu.be/kiYlk9Zs0AE",
  "transcript": "\nAnamika Sankha Mitra started transcription\nAM\n\nAnamika Sankha Mitra\n0 minutes 5 seconds0:05\nAnamika Sankha Mitra 0 minutes 5 seconds\nOK, so today I'm going to be valuing Panera Bread for a potential KKR acquisition using stuff we've learned within session 12. So essentially, we need to, we need to figure out what Panera is worth to KKR as a financial buyer and how.\nAnamika Sankha Mitra 0 minutes 22 seconds\nThat valuation differs from strategic buyers from what, like strategic buyers may be willing to pay. Panera currently generates approximately $6 billion in revenue, growing at about 8% annually, with roughly 900 million of EBITDA.\nAnamika Sankha Mitra 0 minutes 37 seconds\nOr a 15% margin across 2100 stores, approximately 50% of sales were already digital with clear growth opportunities from new store openings, higher digital penetration catering and early international expansion.\nAnamika Sankha Mitra 0 minutes 53 seconds\nAt the same time, strategic buyers such as Starbucks and McDonald's are circling, which introduces the risk of synergies. Synergy driven overbidding, KKR must therefore anchor its valuation on a standalone cash on standalone cash flows, as opposed to synergies.\nAnamika Sankha Mitra 1 minute 12 seconds\nSo to address this, I structured my analysis in around like 3 specific components. First I looked at a multi scenario discounted cash flow model or DCF model to estimate the intrinsic value. Then I traded. I looked at trading comparables.\nAnamika Sankha Mitra 1 minute 28 seconds\nAnd president transactions to validate the valuation range. And then I looked at a buyer perspective to overlay a buyer perspective overlay to explain the differences between financial and strategic bidders. The discount cash flow model here or DCF serves as a valuation anchor while comps and precedents will provide.\nAnamika Sankha Mitra 1 minute 49 seconds\nThe external validation.\nAnamika Sankha Mitra 1 minute 52 seconds\nNow just I'm going to walk through this output. So I ran the code with the formulas given within the session as well as what we learned in the previous session, and I put that into Gemini and got my code and this is the output that I got. The model here projects Panera's financials over five years under three under the three scenarios I'm represented in.\nAnamika Sankha Mitra 2 minutes 12 seconds\nI represented revenue here begins at $6 billion in the downside case. As you can see, cash revenue grows at about 6% annually in the base case, revenue grows at about 8% annually and in the upside case, revenue grows at about 9.5% annually.\nAnamika Sankha Mitra 2 minutes 29 seconds\nThe EBITDA margins expand from 15 to 17% over the projection period, reflecting a digital leverage and operating efficiency. The EBIT is calculated as 85% of the EBITDA, assuming depreciation and amortisation equal to 15% of the EBITDA. After applying that 25% tax rate that we got the corporate.\nAnamika Sankha Mitra 2 minutes 48 seconds\nTax rate we arrive at the notepad, the free cash flow is calculated using the formula EBIT. It multiplied by 1 minus the tax rate bracket minus capital expenditures minus changes in networking capital.\nAnamika Sankha Mitra 3 minutes 4 seconds\nCapital expenditures are assumed to be 4% of the revenue and networking capital investment is is assumed to be about 1% of the revenue. Each year's free cash flow is discounted at 9% at a nine percent walk.\nAnamika Sankha Mitra 3 minutes 22 seconds\nOr weighted average cost of capital. The terminal value is then calculated using the Gordon growth model with 2.5% perpetual growth rate. The model produces enterprise values of approximately 6.27 billion 6.83 billion.\nAnamika Sankha Mitra 3 minutes 39 seconds\nAnd 7.27 billion 6.27 billion was in the up in the downside case. 6.83 was in the base case, and 7.27 billion was in the Upside case. Across all the three scenarios, the terminal value represents about 76% to 78% of the total enterprise value indicating.\nAnamika Sankha Mitra 3 minutes 59 seconds\nStable business, but also a valuation that's highly sensitive to long term assumptions. The key conclusion that I got from this implementation is that Panera stand alone, intrinsic value is consistently in the 6.5 to $7 billion range.\nAnamika Sankha Mitra 4 minutes 16 seconds\nNow to validate these intrinsic values, I'm going to be using a couple market based approaches. So we were given within this scenario that the industry trading multiples imply an average price to earnings ratio of approximately 22 X premium brands.\nAnamika Sankha Mitra 4 minutes 32 seconds\nTrade higher with Chipotle at approximately 35 X earnings in McDonald's and an approximate OF25X earnings. Applying these multiples implies that equity values materially above the DCF results, but public market valuations include liquidity premiums and do not and do not reflect the leverage.\nAnamika Sankha Mitra 4 minutes 51 seconds\nBuy out constraints. The president transactions in the restaurant industry traded in the EBITDA multiple between 12X to 15X. On applying these multiples to Panera's $900 million in of EBITDA implies that enterprise values between approximately 10.8 billion to 13.5 billion.\nAnamika Sankha Mitra 5 minutes 12 seconds\nThe gap between that $6.3 billion to the $7.3 billion intrinsic value range and the $10.8 billion to $13.5 billion precedent range confirms that the higher transaction prices require synergies unavailable to a financial buyer.\nAnamika Sankha Mitra 5 minutes 28 seconds\nTherefore, the DCF remains the appropriation of the appropriate valuation anchor for KKR in this scenario.\nAnamika Sankha Mitra 5 minutes 37 seconds\nNot to evolve this further, I'm going to interpret the valuation from like a more buyer specific perspective. So strategic buyers can justify paying about between 11 billion to $13 billion because they can capture synergies from procurement, scale, store overlap, digital platforms.\nAnamika Sankha Mitra 5 minutes 56 seconds\nAnd international expansion KKR as a financial buyer, cannot rely on those synergies. Its returns must come from acquiring the business at approximately between $6.5 billion and $7 billion, improving operations and exiting at a discipline multiple.\nAnamika Sankha Mitra 6 minutes 15 seconds\nAs a result, KKR walk, KKR walk away, price should be capped at about $7 billion to $7.2 billion if a strategic buyer buyers pushing if a strategic buyer is pushing.\nAnamika Sankha Mitra 6 minutes 30 seconds\nPrice above this range, KKR would be willing to exit the process rather than sacrifice return targets. Instead, KKR should emphasise certainty of close transaction speed and the management's 10% equity rollover.\nAnamika Sankha Mitra 6 minutes 46 seconds\nAs mentioned, the 10% rollover was given in the story. To conclude, I would say that Panera Bread is a high quality cash generative business, but its standalone intrinsic value is materially lower than prices implied by strategic synergies.\nAnamika Sankha Mitra 7 minutes 2 seconds\nBased on the DCF valuation range of between 6.27 billion to $7.27 billion, validated against market comparables and precedent transactions, I recommend that KKR target a bid around $6.8 billion.\nAnamika Sankha Mitra 7 minutes 18 seconds\nWith a firm walk away threshold near $7 billion, I feel like this recommendation reflects a disciplined financial buyer valuation and explains why strategic buyers may rationally may rationally pay more. But KKR in this case should not pay more.\nAnamika Sankha Mitra 7 minutes 34 seconds\nThank you.\nAnamika Sankha Mitra stopped transcription"
}