{
  "student_name": "Javier Patino-Jacuinde",
  "org_defined_id": "038237921",
  "username": "jpatinoj",
  "email": "",
  "transcript": "Hello everyone. My name is Javier Patino and uh this is a video where I'm going to be walking through um the weighted average cost of capital or I'm just going to call it walk because it's a lot easier. We're going to be walking through the walk analysis for Netflix using the driver framework. I'll connect the numbers of Netflix's 5 billion content investment decision and show how capital structure affects its cost uh of capital. So down on my define and discover section, um Netflix is considering a $5 billion uh dollar content investment. To know if this creates value, we need the right discount rate um which is the walk. Um the main questions are um what is Netflix current walk based on market values? How does walk change if Netflix issues three billion uh uh if Netflix issues three billion of new debt? Um, should the uh the US content and international content use the same discount rate or pro uh or project uh specific walks? Um, how does Netflix walk compared to Disney's 8.2% and Amazon's 9.5%. So, these are all important questions. So, I assume market values uh matter more than book values down in the assumptions area. Um uh I assume that uh cost of equity comes from uh CAPM with beta 1.3 um a 4.5% risk-free rate and a 5.5% market risk premium. Cost of debt is based on the 5.8% yield on Netflix uh tripleB plus debt uh and a 21% tax rate applies to the debt tax shield. So down in my represent section um just want to make sure everyone can see this. Next I represented the problem in a structured way. Um we have our R E uh equals RF uh plus beta times the market risk premium. Uh this is for cost equity. Then the after tax cost debt which is RD * 1 minus T. Um and then we have our walk um which is our E / E + D uh * R E plus D / E + D uh * RD * uh in parenthesis 1 minus T. So set up for these scenarios. To set up for these scenarios, um I not set up these scenarios. I set these scenarios up for uh current walk with 200 billion in equity and 13 billion in debt. Um and then uh walk after uh I I oh my gosh, can I speak? I set the scenario up for that and then I set the scenario up for walk after an extra three billion debt. Um then three you know uh project specific walk using a lower beta for US content and higher beta for international content. And finally um we set up the scenarios for a sensitivity graph of walk versus the debt ratio. So down on my implement section if let me scroll. There we go. that on my implement section I use Python and Collab um to to uh oh my so for my implementation I use Python and Collab um and from from these inputs cost of equity uh CAPM uh comes out to be about 11.65 and the after tax cost of debt is about 4.8% 8%. Um just just going down here. Um so using our current market values, equity weight is about about 90 94%. Uh and then our debt weight is about 6% and then our current Netflix walk is around 11.22%. When I add three billion to the new debt under the simple assumption uh that the component costs don't change uh debts weight uh rises slightly u the walk moves to about 11 uh 1% um because after tax debt is cheaper than equity um if I assume the new debt becomes riskier and the yield rises to around 8%. As you can see here, if you use the eight around 8%, the walk increases slightly above the original. Um, that shows that the trade-off that shows that shows the that shows the trade-off. So, more debt gives more tax benefit, but also higher required returns. So, for project specific walk, uh, if I used beta um of 1.2, right? If I use uh beta of 1.2 two for US content I get walk of about 10.7%. Um and then well 10 yeah 10.7%. And then uh if I use beta uh from international content with international content our walk rises to a 12.3%. So this supports the idea that riskier international projects should be higher use a higher discount rate than core US content. And I also plotted down here as you can see I also plotted um a walk against different debt ratios to visualize how leverage affects the overall cost of capital. As you can see it starts it starts uh decreasing um the further the more uh you get more debt percentage of total capital um with the higher the with the higher the walk and it and it goes not higher the walk the walk is higher the lower the debt. uh as percentage of total capital. Um and if we go down here uh we also have our validation section. I'll go validation section for both just so I can you can see my driver. So if we go over here we have our represent our validate section. Uh to validate I compare Netflix walk to the industry range of 8 uh to 10%. Um Disney's is at 8.2. Uh Amazon's at 9.5. Um Netflix walk is higher around 11 to 12%. Um which makes sense because Netflix is more concentrated in streaming. Um it has big ongoing content uh commitments and is considered riskier than Disney's diversified business. I also checked uh I also used market values not book values and did simple sensitivity checks by uh increasing the cost of debt. You can see down here. So download my evolve section. Um in my in in the evolve stage uh I connect this beyond a single point. Walk is walk is Netflix uh Netflix's hurdle rate. So projects expected uh expected to earn more than walk create value. Um projects below walk destroy value. So walk also uh walk also influences decisions about optimal mix of debt and equity and it is the discount rate used in valuation and capital budgeting more broadly. Um and for my reflect section um if we go down here the most uh sorry let me not let me scroll. I think it's as far as I can go. Okay, so finally in the reflect stage, uh the biggest learning for me was that walk isn't just a formula. It's a strategic number uh that moves with market conditions. Um capital structure choices and project risk. Um small changes and assumptions can change whether a project looks good or not. So companies need to think about walk as a range and combine it with judge judgment, not just a single exact uh point estimate. Um, thank you uh for watching my video.",
  "video_url": "https://www.youtube.com/watch?v=eeDPC_4YKOs"
}