{
  "student_name": "Andrew Jacobs",
  "org_defined_id": "036214646",
  "username": "jacob269",
  "email": "",
  "transcript": "Hello, my name is Andrew Jacobs and in this video I will be analyzing the GameStop Short Squeeze using a simple event style return model. I'll use the driver framework and I'll show how I calculated abnormal returns and cumulative abnormal returns using Python and Google Collab. For the, uh, AI use, I helped AI brainstorm and help me write the code and the outline for the assignment. So my first question is whether the GME short squeeze lines up with what semi-strong market efficiency would predict. And after checking the data, I confirmed the squeeze created huge return spikes. Which is extremely high volume and, uh, major deviations from normal market behavior. And in the project I used GME as a stock and SPY as the market benchmark. Next, I represent the problem using a simple CAPM style idea. Expected return is just beta times market return. Then abnormal return is the actual GME return minus the expected return. The CAR or cumulative abnormal return shows how abnormal performances builds up over time. So now I'll go through my code. In cell one, I downloaded the data. So in this cell, I didn't saw, uh, why finance import the libraries and download GME and SPY data from August, 2020 through June, 2021. Uh, I print the columns to see the structure since Yahoo finance uses a multi-dex format. Here's this code number one. Next, uh, cell number two, I extract closing prices. So here I pull out of, uh, out of the closing price for GME and SPY using the multi-dex keys. And this gives me clean daily price series for both Next, I compute the return. And cell three, um, I calculate simple daily percent returns for GME and for SPY, and then put them into one data frame. Uh, this creates the data set I'll use for abnormal return calculations. Next in cell four, um, in the cell, I set beta equal to one to keep the model simple. Uh, expected return is beta times the market return. Abnormal return is GMEs return minus the expected value. And CAR is just a cumulative sum of abnormal returns. Next, in cell 5, I plot abnormal returns. So this plot shows the abnormal returns day by day. Uh, the big spike around January, 2021 show the days when GME moved far beyond what the market alone would predict. And my last cell, I plot the CAR and this plot shows cumulative abnormal returns. The sharp rise during the squeeze period indicates a major deviation from normal risk-adjusted behavior. So in the validate stage, the results clearly show very abnormal, very large abnormal risk returns, and a strong upward CER trend during the squeeze. Uh, that behavior is hard to explain with a standard, uh, efficient market model, uh, for investors. This shows how extreme short interest social media coordination and trading constraints can create a huge project, huge price movements that don't match normal fundamentals. So, overall, the GME squeeze challenges semi-strong market efficiency because public information alone can't explain this extreme abnormal returns. The code and the charts help visualize the unusual. How unusual this event actually was. And that completes my analysis and code demo. So thank you everyone for watching.",
  "video_url": "https://youtu.be/JjWFr2UMkuI"
}