{
  "student_name": "Javier Patino-Jacuinde",
  "org_defined_id": "038237921",
  "username": "jpatinoj",
  "email": "",
  "transcript": "Hello everyone, my name is Javier Patino uh and this is my session 8 driver analysis on GameStop markets efficiency. Um so starting off with my define and discover um the question is whether GME's uh squeeze violated market efficiency uh or reflects behavioral forces in trading frictions. First I verified um the data the statement that GME traded at uh 4 cents at 0.04 04 dollar in August 2020. Um is incorrect. Uh split split adjusted it traded roughly uh for $1 and uh one cent uh to $1.79. The key events were uh Ryan Cohen's uh stake in September and December, um the January 2021 spike to 483, and the January 28 uh trading uh trading restrictions in the February hearings. So, uh down to my represent section. Um my test is, uh an event study using the the CAPM, uh normal returns. So a * r or like a r time equals r time minus um significance plus beta r uh m time. Um my analyze the windows around the coen filings uh the January uh squeeze cluster uh the January squeeze cluster and the restriction day. I'll evaluate semi- strong EMH uh and over and overlay behavioral mechanisms like hurting and overconfidence uh plus limits to uh uh to a bridge uh from halts uh and borrow constraints. So we go down to implement. We're going to skip verify. We'll go down to implement first. Um my implement. Sorry, I thought I had implement down there for some reason. But here's my regression right here. Show you down here. So after putting in some code, I was able to obtain a regression. I could just open it up. There we go. So I got my regression right here. Um so here's my regression on the pre-event window. um the output of uh significance or the constant uh the constant coefficient is 0 uh 0170 uh and then our beta is 1.580 and our p value is 0.042 uh and then the R squar uh is 0.049. So GME moved about 1.6 six times the market but most of its return variation was stock specific. Next, I computed abnormal returns and cumulative abnormal uh abnormal returns. Uh in the AR in the AR chart down here, this AR chart um as you can see uh there's spikes. I'm trying to hold on. There we go. So, as you can see right here, there are so as you can see in the AR chart, um the abnormal returns chart, you can see a large uh spikes around January 20, 2021. uh and and the car rises above uh plus three on early February. We go and look at February. There we go. That's why I thought it was weird. It was zoomed in. So, as you can see, um car rises plus three in early February. So, this confirms substantial abnormal performance. Um and then the price Oh, it's not supposed to do that. I just switched my There we go. And the price chart the price chart um shows the same story. Um so flat for months and then a sharp rise into late January. Um and to verify um the test on if we go down to my verify do our test on uh our uh AR. Sorry. Our AR Oh my gosh, this thing our AR so abnormal returns uh versus zero. So the p value is uh less than 0.05. So abnormal returns are statistically different from zero. All right. And then we have our window security not security sensitivity. So our window sensitivity a car within uh plus or minus 5 days uh and plus and minus 10 days around January 28th 2021 remains strongly positive. So the interference uh isn't window perfect. Um and I even uh compared it right here. You can see that it's not window perfect. Not window perfect window dependent. Um so it's not window dependent. Um and then I also uh the rolling the C uh so rolling the the cumulative uh abnormal returns uh 10day rolling uh C um rises steeply through late January confirming multi-day uh drift and then down to my evolve section. Um down to my evolve section I started with price uh slash abnormal return only then uh added uh short interest so okay so sorry um so I started with the the uh abnormal return only uh with price uh then I added short interest volume contacts uh and multiple windows. So I kept CAPM for clarity and course uh alignment. Uh then so like the refined approach better isolates a semi- strong uh efficiency question. As you can see here I'm trying to as you can see here um same with my validation section my mouse stopped working. Okay. So to reflect um my conclusion is that semi- strong EMH was stressed. Um prices didn't fully uh incorporate uh prices didn't really fully incorporate um didn't fully incorporate uh public information immediately. Instead, you know, behavioral hurting and market friction sustained the move. Um, Exante uh systemic profits uh were tough after halts uh collateral and borrowed costs. Um the professional the professional takeaway is a hybrid I'm sorry not a hybrid uh what's the word? That's my cat. Um is a hybrid philosophy. So the passive core exposure plus selective active strategies is clearly defined u behaviorally driven events. Um so yeah, thanks for uh watching my video. Um yep.",
  "video_url": "https://www.youtube.com/watch?v=jZTDNABp-dg"
}