{
  "student_name": "None None",
  "org_defined_id": "037075344",
  "username": "nicho307",
  "video_url": "",
  "transcript": "Hi, I'm Addison Nichols. I'm going to go\n0:07\nover my mini project brief today. So,\n0:09\nwhat I decided to build is basically a\n0:11\nCFO bot. So, it will act as a chief\n0:14\nfinancial officer for a company and look\n0:16\nat these projects that you input with a\n0:18\nchat trigger and determine whether or\n0:20\nnot they're suitable and any sorts of\n0:22\nred flags. So, just going through the\n0:24\nworkflow first. Um, what we have is a\n0:27\nchat trigger. So once you send a message\n0:30\nit will let it will trigger the bot. So\n0:33\nthen we go to the AI agent with the\n0:35\nGoogle Gemini chat API and it will parse\n0:38\nit. So we ultimately get this formatted\n0:40\noutput which looks pretty nice and is\n0:43\npretty readable. Um and then from there\n0:48\nthere is a\n0:50\nsystem message in it. So it acts as a\n0:53\nconservative CFO for a midsize\n0:54\nmanufacturing firm with a weighted\n0:56\naverage cost capital of 10%. So the goal\n0:59\nis to analyze capital budgeting\n1:00\nproposals provided by the user. And I\n1:03\nalso did include guardrails. So if the\n1:04\nNPV is negative, you must reject it. If\n1:07\nthe internal rate of return is over 50%\n1:09\nor the payback is super quick, this\n1:11\nshould be flagged as suspicious. Um, and\n1:14\nthen just for the sake of the person\n1:16\nusing it so they don't use this in a\n1:18\ndifferent manner, if the user asks a\n1:20\nnon- finance question, it should refuse\n1:22\nto answer politely. And then there are\n1:25\nguidelines for formatting the output.\n1:33\nSo from there, just going over the\n1:36\nparameters for the project. The two\n1:38\nadvanced capabilities that I chose are\n1:40\nthe structured output with validation\n1:42\nand clear rendering. So we can see that\n1:44\nin this HTML format, it is pretty easy\n1:48\nto look at and it looks pretty nice and\n1:51\nlays out all the information that the AI\n1:53\ncalculates to come to its decision. And\n1:56\nthen the guard rails and sanity checks,\n1:58\nwhich I did just go over in the um\n2:00\nprompt that I put into the agent. So, it\n2:02\nwill sanity check against an extremely\n2:04\nhigh internal rate of return and it will\n2:06\nwarn against positive net present value\n2:08\nwith a massive upfront risk or just\n2:10\nbasically anything that seems too good\n2:12\nto be true. It'll just do a sensibility\n2:14\ncheck. So, I have a couple prompts to\n2:17\ntest just to see this in action. This\n2:19\nfirst one is a pretty sensible one. So,\n2:21\nyou have a project to propose. You need\n2:22\nto buy a new packaging machine for\n2:24\n100,000. It will save us 35,000 a year\n2:26\nin labor cost for the next 5 years. Is\n2:28\nthis a good investment? So, this has\n2:30\nalready been run. Um, basically it'll go\n2:33\nthrough and we get this output where\n2:34\nthere's a positive net present value and\n2:37\nthe internal rate of return is also\n2:39\nstrong. So, we should approve this\n2:40\nproject and it doesn't look like there's\n2:42\nany red flags. Um, and then for this\n2:45\none, this is just a basic\n2:49\nexample as well just to show that it\n2:53\nwill reject it\n2:55\nwhen necessary. So, sorry I had to pause\n2:59\nthat because it did take a little bit.\n3:01\nUm so with this one it is a sensible\n3:04\nscenario but the net present value is\n3:07\nnegative so it would destroy shareholder\n3:08\nvalue and it is letting you know about\n3:11\nthat. And then moving on to this one\n3:13\nthat will give you a sensibility check.\n3:16\nYou have a project opportunity with a\n3:17\n50,000 upfront cost sorry but the\n3:21\npromoter says it will return 3 million\n3:23\nin 2 years should you invest. And then\n3:26\nobviously this is a very unrealistic\n3:28\nscenario that we would normally look at\n3:31\nand say that is too good to be true. So\n3:33\nthis will um exemplify the output where\n3:37\nit will give you an investigate. So it\n3:39\ndoes it acknowledges that you see a\n3:41\nsubstantial net present value but the\n3:43\nimplied internal rate of return would be\n3:45\nabout 675% which is too good to be true\n3:49\nand it's extraordinarily high. So we\n3:51\nhave suspicious data and that kind of\n3:53\njust shows those guardrails that I have\n3:55\nimplemented and then its capability to\n3:57\nmake a decision and provide reasoning\n3:59\nfor that based on the numbers that it\n4:00\nmay calculate. Um so going over my\n4:03\niterations my first version was a simple\n4:06\nchat box that worked but it was gullible\n4:08\nso it would confidently approve like\n4:10\nthat last scenario anything that might\n4:12\nhave been unrealistic or alarming\n4:13\nbecause it was more of like a yes man.\n4:16\num it would not do those sensibility\n4:20\nchecks which I think are very necessary\n4:21\nto have. And then in version two, I\n4:24\nengineered the prompt to have guardrails\n4:26\nand consider if things are too good to\n4:27\nbe true to get to that version that I\n4:30\njust showed you. So how does AI change\n4:32\nthe user experience? Instead of just\n4:35\nbeing like a calculator and telling you\n4:37\nthis is a net present value, the AI\n4:39\nturns it into more of a conversation. So\n4:41\nit explains the reasoning of why. So\n4:43\nit's creating value. That's why you\n4:45\nwould theoretically approve this one if\n4:47\nit wasn't too good to be true. And it\n4:50\nkind of just creates this discussion\n4:51\naround the numbers that someone may not\n4:53\nhave a deeper understanding of. The\n4:55\ndifficult thing about financial prompt\n4:57\nengineering is having those guard rails.\n4:59\nI think that's something that's really\n5:01\nimportant. There's a lot of scams out\n5:02\nthere. So, if you were to realistically\n5:04\nuse an AI chatbot or anything to make\n5:07\nthese kinds of huge decisions, that is\n5:09\nsomething you need to watch out for. And\n5:11\nso that's something you need to engineer\n5:13\nyour prompts for. Um, so the difficult\n5:16\npart was just again getting the AI to\n5:18\nnot be so much of a yes man and take\n5:21\nthose into consideration. So what\n5:22\nethical considerations did you face?\n5:26\nAgain, just being cautious with the\n5:28\nguard rails and not giving, you know,\n5:31\nthis is 100% true financial advice.\n5:33\nthere has to be that's why I have this\n5:35\nsection with the flag status of like\n5:38\nwhat may be wrong or off about this and\n5:40\nalso just the fact that um the AI needs\n5:44\nto take that into consideration so it's\n5:45\nnot blindly leading people into a scam\n5:48\nbecause it looks good on paper and then\n5:50\nwould you trust your own tool with real\n5:52\nmoney? I think that it should be more of\n5:55\na second opinion. I don't think there\n5:57\nshould ever not be a human in the loop.\n5:59\nI think that people should be the ones\n6:02\nmaking these decisions. I wouldn't want\n6:05\na bot as my financial advisor moving\n6:08\naround all my investments. I would\n6:10\nalways want a person involved, whether\n6:12\nthat's me with the AI making suggestions\n6:14\nor someone like a financial adviser\n6:17\nusing that as a tool for ideas. Um, but\n6:22\nusing my own tool with real money, I\n6:24\nthink as a second opinion, it does have\n6:26\nvalue, but I think on its own entirety,\n6:28\nI wouldn't trust any tool with my real\n6:30\nmoney. So, that was my project three um\n6:33\nwith my reflections, and I hope that was\n6:35a helpful tool. Thank you."
}