{
  "student_name": "Christopher Valencia",
  "org_defined_id": "032156780",
  "username": "valencc",
  "email": "",
  "transcript": "Okay, section nine, the cost of capital. Um, the question is, what's the hurdle rate a company must clear to make his investors happy? Section one, financial hook, the CFO's dilemma. You're the newly appointed CFO of Tech Forward Incorporated. The CEO presents three major strategic initiatives, each requiring $100 million investment. Project Alpha, AI research lab, promising 15% annual returns. Project Beta manufacturing expansion with 12% projected return. Project Gamma International expansion targeting 9% returns. Which project should we fund the COS? We can afford two of them. Our financing training screen compare returns to cost of capital. But what exactly is tech forward cost of capital? And so here's a challenge. Um here's a financing. So 40% equity stock demand, you know, x amount return, 60% debt. bonds currently yield 6% blended cost is X um his product valuation alpha 15% risk cost of capital beta 12% risk cost of capital and gamma 9% cost capital session 67 taught us how to mark market prices individual securities now determine what uh return to for must earn to satisfy both debt and equity investors simultaneously or otherwise known as the weighted average cost of capital. Um, and so our learning goal is master how the weighted average cost of capital synthesizes all previous financial concepts into unified corporate finance decision-m framework. Um, so here's a prompt we can use. And so here's our quick knowledge check. What does WACC represent? And that is the interest rate on the company's debt. Number two, why we use after tax cost of debt in WACC? Um, and that is interest payments are tax deductible. Number three, when calculating WACC, which value should you use for weights? Um, market values of debt and equity. And then if a company's WACCC is 10% mean for project evaluation um products returning less than 10% store value. So when we go to section two are concepts and formulas the WACC principle is a company's cost of capital equals the weighted average of his debts and equity costs reflecting the return requirement of all capital providers. And so our key concepts are cost of equity, return acquired by the shareholders, often calculated using the CAPM, um cost of debt, after tax, interest rate on company's debt, market value weights, proportional total capital from source, tax yield, interest payments, reduce taxes, lowering effective debt cost, and hurdle rate, minimum return required for positive MPV projects. Here's part two, the WACC formula. Um, and it gives us where E= the market value of equity, D market value of debt. B= E plus D is the total form value. R R sub E is cost of equity. R sub P is a pre-tax cost of debt. And T is the corporate tax rate. And so here's part three, our market value versus the book value weights. Here's the timeline for the capital structure analysis, historical book values, balance sheet, current decisions, WCC calculation, and the future financing. capital structure, market base, current stock price, equity market value, current bond prices, debt market value, market value, weight, true investor demands, and so market value calculation, equity value, shares outstanding times the current stock price, debt value, current market value of bonds, which may differ from the face value and preferred stock market value if applicable. Um, so we go to part four, integration with previous sessions. Session two TVM provided discount rate mechanics. Sessions three and four equity and debt valuation method. Session six risk return relationship and a month. Session seven CAPM for systematic cost of equity calculation. Session eight market efficiency ensures rates reflect true cost. And then session 9 WCC combines all the elements for corporate decision making. And so here's a timeline. So learn value individual securities, determine company's cost of capital and then use to evaluate corporate projects. And so here's round one. Here's what we just practice. Um, basic stuff. Company has $500 million equity. Um, so equals 1.2. $300 million debt, 6% need risk-free rate equals 8% market return equals 10% tax rate equals 25%. And so to calculate it, you know, here's a structure. We use all this. And then problem two, similar. And then how the weights change and we can use AI to uh use this prompt to uh plug in our numbers and come out with something and then round two and then round three. Excuse me. And then a debrief discussion why my companies prefer debt over equity financing despite um bankruptcy risk. We can just plug this in, you know, u so companies might choose debt over equity financing even though that increases bankruptcy risk because that has several big advantages. Um and we have five here. Debt is cheaper than equity. Interest is tax deductible. owners keep control and no dilution of profits and predictable payments. And then here's our driver learning guide. Um here's a case scenario for coaching retail expansion decision mega store core. Um here's a framework you know discover frame the corporate cost of capital and then with AI you know we plug this in and then we use represent so map the capital cost components um you know calculating all these numbers right here so with AI we just want to review using market values for weights does this correctly reflect how companies should calculate their cost of capital and so here's implementation so code the corporate W CC analysis and again like always starting point you know don't cut the page and so here we go through and then validate so verification so we just want to make sure um X% or X% cost Y% equity weight and Z% debt weight and so yeah this is basically you know, WCC application and uh financial decision making.",
  "video_url": "https://youtu.be/M1LkTd-CpOM"
}