{
  "student_name": "Sherry Zhao",
  "org_defined_id": "037659129",
  "username": "zhao1398",
  "email": "",
  "transcript": "Hi, I'm Sher John. This is my session 10 assignment. Uh, as always, we'll start with the scenario summary. So, project overview is that Starbucks is evaluating a new flagship grocery with a 10year operational horizon. The project is a capital intensive brand builder requiring significant upfront risk. Our investment would be 12 million in capital expenditures plus 500 million in working capital 500,000 working capital. Our returns will be variable revenue stream starting at 8 million peaking at 11 million and stabilizing at 9 million. Our cost will be 40% cost of goods. So fixed labor or rent of 3.3 million a year and a straight line depreciation. Our axle will be a terminal sale of the asset for 3 million year 10. And then our decision criterion is that the project must generate a return exceeding the firm's whack of 8.5%. Now we can move on to our define discover stage which goal is to isolate every variable and rule to prevent logic errors before modeling. So we define the rules of the game for this specific cash flow model. One is the tax trap. We discovered that a crit critical tax implication for the year 10 exit. Since the 12 million assets depreciated using straight line method over 10 years, it book value in year 10 is zero. Therefore, the entire 3 million savage value is a taxable gain. After applying the 25% tax rate, the net cash flow is 2.25 million instead of three. Also we have a depreciation shield which means that the since the annual depreciation is 1.2 million this provides an annual tax shield of 300,000 which is 20% of that and then our revenue phases the model must account for three distinct phases launch peak and mature. Now we go on to our represent. We have a timeline of the investment to ensure we capture the changing revenue phases. So we represent year zero as the only negative cash flow period where we deploy 12.5 million total. For years 1 to 10, we represent operating cash flows by calculating the net operating profit after tax and adding back the depreciation. We must pay careful attention to timeline shifts. Revenue jumps from 8 million in the launch phase to 11 million during peak years which is years 2 to five before settling at 9 million for the remainder of the lease. The final representation occurs in year 10 where we lay three distinct cash events. the operational cash flow from selling coffee, the recovery of our working capital, and the after tax proceeds from selling the building and equipment. So this is the timeline. As we can see, year zero is the down payment of 12.5 million. Then this is year 1, the launch phase. Year 22 to5 is the peak phase. 6010 is the mature phase. And at year 10 we exit for the implement stage. First we have to set up the code um for all of the uh proceeding well all of the all of the calculations after this. So as you can see we put um the given numbers like the 8.5 whack the 0.25 tax rate 10 years and so on so forth. So that's just a basic setup of um our calculation. And then for stage two um we have a discounted payback period chart which generates a line chart showing the cumulative discounted cash flow over time. It visually demonstrates the project's liquidity by pinpointing the exact year the line crosses the red break even axis. So this is essential for proving to management that the initial 12.5 million investment is recovered well before the 10-year lease expires. So as you can see um the line crosses the break even here a little bit after 8 which is well before 10 which means this can not only recover um our previous costs but can also generate some revenue. And then for the second one, we have our cash flow composition chart which creates a bar chart that breaks down the sources of cash flow coloring the operational year screen and the final access year goal. Um, this visualization addresses the transparency by proving that the majority of the project's value comes from daily coffee sales rather than speculative sale of the building year 10. As you can see, um although the the amount sold um the the amount we earned by selling the building which is in gold is the most uh amount of money we gain. But we can tell that um preceding that we also made a series of income which adds up more than that. So it proves that this business is um earning profit uh operational income instead of just fully relying on the investment of the property and the equipment. And then we have our wax sensitivity which also is the MPV profile. It basically plots the net present value against the range of cost capital rates from 4% to 14%. It highlights the project's margin of safety by showing the gap between the current whack and the IRRa. This graph is critical for showing executives how much interest rates can rise before the project becomes a bad investment. So as you can see um this is the back rate from 4% to 14%. basically conclude can conclude that um the current MAC is at 8.5% and it need to all the way get to around 13% for this investment to be not worthwhile. So 4% is a pretty big wiggle room which means that our um project is relatively safe. And then we have the revenue scenario stress test which um calculates the MPV if revenue drops by 20%. The sidebyside chart visually proves that the while the base case is profitable the downside scenario destroys value. This supports a conditional recommendation is that um we can accept the project provided we strictly manage marketing to avoid this revenue drop. So as you can see 20% of revenue drop really makes NPV from positive to negative which means we're losing money which makes the um project a bad choice to accept. Um for our validation stage we our goal is to confirm that the model's outputs align with financial theory and common sense before making a recommendation. So um our terminal value logic check is that we handle the asset tax correctly. So since the asset is depreciated to a book value of zero over 10 years the entire 3 million sale price is a taxable gain. Um the math is that uh we have the uh 3 million times 75% and adding the 500,000 working capital we have 2.75 which is what we got um in the previous stages. So that validates that and then our second validation is that is the payback period realistic. So with an initial outlay of 12.5% of 12.5 million and a rough annual operational cash flow about 3 million in peak years simple message suggest a payback around year four or five. So if you recall chart one aligns with the estimation. Um and then our last one is that why does the 20% revenue drop the entire MPV? Uh the reason for that is that the project has high fixed costs. So when revenue drops, those costs stay the same and disproportionately crushing the profit margin. And then for evolve, our goal is to connect the expression numbers to broader cooperative strategy. Um we can introduce two concepts. The first one is the flagship premium. Um with which this analysis treats the rosary as a standalone profit center. However, the flagship location functions as a marketing vehicle that builds brand equity, potentially lifting sales in standard Starbucks store nearby. So, the calculated MPV should be viewed as a financial floor. The true strategic MPV is likely higher due to this hollow effect. And the second one is risk profile assessment. The sensitivity analysis reveals that this project is a volume play not a margin play. So based on the break even point is because it is sensitive to revenue the project success relies less on cost cutting and more on customer acquisition. Um this shifts our strategy focus from efficiency to traffic generation. And if we reflect, our goal is to synthesize the analysis into a decisive go or not go for the video presentation. Um, which in this case based on the driver analysis, I recommend that we should um accept this flagship rosary project. And then our supporting evidence at for a recap is that um the base case generates a positive MPV and RR the liquidity looks good. The strategy fit is good and but we have a conditional warning that we have to maintain our revenue for the MPBT not um be hurt too much. And I think this project case provides a very interesting insight on how to approach things since we were um working as often as for like a single small company. But this is the first assessment or assignment that requires us to think in um in in the shoes of a big corporation that has a lot of franchise.",
  "video_url": "https://youtu.be/6JfI1JxAmME"
}