{
  "student_name": "Meher Vig",
  "org_defined_id": "037300863",
  "username": "vigm",
  "email": "",
  "transcript": "Hi, my name is Meher and today we will be going over the session 8 assignment market efficiency investigation. So we will use the driver method uh to organize our thoughts. So define is the first step of the driver framework and first we have to assess the problem and the problem is that um GameStop's extreme price action. So we have to assess the GameStop's extreme price action during 2020 to 2021 against the three forms of the efficient market hypothesis. And the first critical step of this is to verify the assignment claim which is GameStop traded at 4 cents in August of 2020 against actual historical data. So we have to determine if market anomalies occurred and whether they constitute evidence during market efficiency against market efficiency. So as we said we have to check if this claim is correct. So uh we did some I did some research and realized that the claim of the GameStop uh GME traded at 4 cents in August 2020 is factually incorrect. And our evidence here is that um according to Yahoo Finance, its prices were significantly higher, generally ranging from $11 to $1.40 per share split adjusted during that month. And this is important because the initial validation step is uh proves the necessity of verifying all given data before analysis. And this next graph that I'm going to show you in this picture shows um the evidence given by Yahoo Finance that it ranges from $11 to $1.40 of the month uh of August of 2020. So the next step of the driver framework is represent and um here we uh so data acquisition where do we get our data from? So we get uh the GME price and volume data from 2020 to 2021 from Yahoo Finance and um there's a test weak form test. So we analyze historical price charts for patterns. So can past momentum predict returns. That is the question. And for semi-strong test we see we map price jumps to public news. So the Cohen buying or Reddit posts 140% short interest. And then we look at behavioral analysis and identify biases at play. the hurting overconfidence and we analyze limits to arbitrage. So the next step uh of the driver framework is to implement. So we used a tool called Yahoo Finance as I said before to download the official stock data and then we use another another tool Matt plot lib to draw the chart that we planned. And now we used I used uh collab and gemini to help code um the findings. And so here uh we can also see and represent uh before I move on to implement that uh here are the formulas that we need. expected return which is C cap cap capm cost asset and price model and then abnormal return and then car which is cumulative abnormal return. So these are the formulas for each of the respective uh formulas that we need. And now we can move to implement. And here we see that this is the graph uh for the GME close price. So, as we can see here, the data shows a stable low price in 2020. As we can see in 2020, it's pretty stable. Um, especially in August of 2020, which is around this time, it's uh it's pretty stable. So this was followed by unprecedented non-fundamental spike in January 2021. So in January 2021, we can see that there's a huge spike where it increases by a lot as you can see on this yellow line shown on the graph. So validate is the next step of the driver framework and this is the most important step because we're trying to read the chart here and see what the chart tells us. So how a normal market works when good bad news comes out the price moves once to its new value and then it settles. But what we saw was the exact opposite. So finding one which is hurting is that the price kept going up just because it was already going up. People on Reddit bought in a herd not because not based on the company's value but because of what they heard. And then finding two is detach from reality. The stock price hit $483, but all experts agreed the real value of the company was somewhere between $10 to $40. So in conclusion, the price was not normal. It was completely disconnected from the reality which proves that market the market was not acting efficiently. So next step of the driver framework is evolve. So our analysis was simple just by looking at the chart. Um we're now we have to move on to the next step and see how we can evolve and make it more advanced. The next step is to um we can analyze social media. So using a program to read all the Wall Street bets Reddit posts and me measure um the hype level each day to see how it matches the stock price. So using social media is one step and then another step that we can take to analyze it further is we can use formulas like I mentioned CAPM to calculate exactly how abnormal the stock's return was compared to the rest of the market. So the last step of the framework is reflect. So the main lesson that we got from this is markets are run by people and people aren't always rational. So the key idea is uh so there's a famous saying that says the market can remain irrational longer than you can remain solvent. What this means is that even though the price, the high price was wrong, the professional investors who bet against it lost billions and they were right, but they went broke waiting for everyone else to realize it. And um the GameStop event is a perfect example of how human behavior like hurting and hype can sometimes be more powerful than financial theory. Thank you.",
  "video_url": "https://www.youtube.com/watch?v=i9A1AGRH-88"
}