{
  "student_name": "Ramon Randolph",
  "org_defined_id": "036002798",
  "username": "randol15",
  "video_url": "https://youtu.be/IpCxvCYAchU",
  "transcript": "All right. So for today my uh project is\nour capstone project and for that we are\nmaking an AI language model\nwhich allows us to\nwhich allows us to uh help understand\nthese finance profiles. um driver what's\nthe problem approach tools do I need\nbuild break fix repeat\nsolve the problem\nand how can it scale and then what did I\nlearn\num so\nfor the first part I will start\nthis is my AI it's called the market\nsense AI\num and I went through a lot of like\nprompt working with it. But here I'm\ngoing ask it to show its promise.\nSo, this is the original prompt that I\nhad.\nUm, you're a professional financial\nanalyst\nassistant that helps analyst, traders,\nand institutional researchers explain\nmarket moves, earnings, macroeffected\ncommunications, an unusual trading\nactivity in a clear, structured,\ndecision relevant language, choose the\nmost exp uh appropriate explanation\nmode. Um like so we went through a\ncouple iterations of this cuz the first\none was really just\nthis or this sentence up here. Um and\nthen it didn't exactly do what I wanted\nit to. So I had to get more clear. And\nso through using uh chat GBT to help me,\nwe got\na lot of what uh a lot of what comes in\ndown here, especially like these parts.\nUm, some of it I thought of myself, but\na lot of it I actually needed help to\ndo.\nUm,\nbut after that,\nI had it create,\nI used it. And so, we're going to take a\nlook at this\nhere. Um, so the main problem I wanted\nto solve with this was just that it's\npretty hard at least for me and I know\nsome other students to completely\nunderstand\nuh what like the sort of case study\naspect of the of the uh applications of\nthese concepts look like. And so I\nwanted that to be\nan easy problem to solve here. And so as\nI went at it, I thought more about how\ndo I make this clear who can use this?\nAnd so my uh my main sort of\nmy main goal was to have people like me\nlike students who are interested in this\nuh in finance concepts use this and have\nit be less of like\na a trading bot and more of like a\nlearning to trade bot.\nUm\nand so after that once again we we uh\nwe have this the break fix or build\nbreak fix repeat. There were a lot of\ntimes where it didn't actually do what I\nasked which is why you see like such a\nrobust prompt for this. Um and so here\nlike we have this Hulu. So our prompt\nwas how has Disney's move to buy changed\nthe market and how can I use trading\nsignals to take advantage of future\nopportunities like these? Um and so it's\na valuation flight risk and the\nstrategic logic\nis ex but there's an execution question.\nInvestors understand the bundle ad tech\nand churn rea reduction but worry about\nthe integration and conflicts of\nstreaming timelines. uncertainty\ncollapsed like what changed versus our\nprior expectations?\nIt collapsed uncertainty. It would pay\nadditional uh 438 million to complete uh\nclosing\nuh a clean end but not after the fiscal\nyear guidance and the integration got\nmore concrete. Um\nso timelines here and so after that we\nhave our implication clear valuation\nmath uh no more unknown extra bill\nsecond order bundle economics\num and so this is what we get into the\nquestion I really asked how to use this\ntraining for opportunity set setups uh\nand it's a framework not what what you\nshould actually do but this is how you\nwould do it\num but that's a pretty clear need\nbecause this is AI it's not a\nprofessional shouldn't be giving advice\nand so making sure that people know that\nclearly um so our options surface\nchanges the volatility spikes around key\ndates so look look for IV rising faster\nthan realized volume\nuh market pricing risk event volume plus\ngap behavior abnormal volume with a\ndirectional gap on definite news regime\nshift or rumor churn\nspread. In binary disputes, price often\nreverts in range. Breakout plus follow\nthrough here sympathy mapping signal\nnoise input checklist. Um, and then down\nhere we have the recent coverage to\nreference. So, you have all these\nyou have all these concepts what you\nshould look for. And then if you go to\nthese,\nit'll show you, you can now you know\nwhat you want to look for in these\narticles. Um, and so like like you said,\nit's basically for this part at least,\nit's basically just what uh what this\ndriver framework up here or not driver\nframework, but the headline driver is up\nhere. But\nuh if you want to you can try and look\ndeeper for uh these concepts in the\narticle. After that you can ask for\nuh\nafter that\nyou can have\nit create uh what's it visualizations\nfor you. So open this in a new tab and\nso like here you go the types of\nstrategies m arbitrage conver arbitrage\nuh this is the event driven investing\nwhich is what this is um taking\nadvantage of opportunities like this\ndeal closing post integration and then\nhere one thing I found pretty\ninteresting was this oversold and\noverbought. So really you want to you\nwant to get down here. It's a simple\nlike\na simple buy low sell high. But you\ncould understand you could understand it\neasily why\nthis buy low sell high works. Most\npeople are going to get in right here.\nBut where we want to get in is here. And\nthen where we want to sell is up here.\nAnd after and once it reaches up here,\neverybody sells and so it reaches this\nmarkdown.\nUm, and the problem I wanted to solve\nwith this was like these concepts, you\ncan explain them as much as you want.\nUm, you can listen about them as much as\nyou want, but having a real example to\nhaving a real example to look at and be\nlike like this whole thing like, oh, so\nthis is what happened. I can go back and\nsee what they actually did, like who was\nactually reporting on this. Um, and then\nafter that, if I really want to know\nmore about this, I can have it explained\nto me even clear even more clearly with\nvisualizations of, okay, what what is\nthis and how do I find it?\nUm, so yeah, we've gone through what the\nuh we've gone through the build break\nfix. I had um had my girlfriend actually\ntest this and she's an engineer so she\ndoesn't really use uh finance stuff and\nshe it helped her understand a lot of\nlike what I was talking about with\nmarket signals. Um so oh no\num but for scale\nwhat's next? Um, well, I've published\nthis GPT.\nI've published this GPT. And so, right\nnow, I can share it with anyone I wanted\nto. I I'm going to put it in the in the\nin the link for the\nI can put it in the link for uh the\nsubmission of this and but really it's\njust\nsharing with whoever I wanted to.\nScaling is less of a problem and it's\nmore of just a like how do I want to put\nit out?\nSo, that's pretty simple.\nUm, and then the main thing I learned\nwith this was that it's pretty simple to\nactually use stuff like chat dbt to make\nyour AI bots. What you need to worry\nabout is the prompt engineering. Like I\nsaid, like my prompt was super robust\nand without going back and changing that\noverall, it was\nit was hard to make it actually do what\nI wanted it to do. Um,\nand another thing I learned was that the\nthe simplicity of using AI, using AI is\nmore of like a tool to answer your\nquestions rather than the or a tool to\nfind answers to your questions rather\nthan using it to answer your question is\nlike so much better than the the the\nalternative cuz I get to actually\nunderstand what I'm learning rather than\njust having somebody spit it out to me.\nI can even use it to like create a\npractice problem for me. Oh,\nAnd so it's designed for analyst\nadvanced finance students and followed\nby a fully worked uh solution and\nintuition. So here we go. Calculate this\nweighted average cost of capital and\nthen calculate alpha codes\nuh or cost of equity using CAPM\ncalculate the after tax cost of debt.\nAnd then here we go down here and it's\nall all the formulas we need along with\nthe answers. And so,\nuh, explaining explains the the higher\nlevel leverage and why it's not a linear\nfunction.\nUm, and so the key takeaways,\nmarket beta determines a firm cost of\ncapital through asset risk, while\ncapital structure determines how that\nrisk is allocated. Rising equity beta\nwith leverage does not imply\nproportional increase because debt\nabsorbs part of the risk. Um, and we\ncould turn it into a multiple choice\nquestion, but really the goal of this AI\nis to help you understand uh finance\nconcepts that you don't get. Um, and\nallow you to show real world models of\nthat. And for the real world models, it\nallows you to understand what concepts\nwent behind them. Um, and that's the\nproblem this class has been asking me to\nsolve since day one. So, I figured I\nmight as well create a guy that didthat. Hey, give me back."
}