{
  "student_name": "Max Bradford",
  "org_defined_id": "036043612",
  "username": "bradfo27",
  "email": "",
  "transcript": "Hi, Dr. Zang. This is my session 8 assignment. Um, in this analysis, I'll be investigating market efficiency through the GameStop short squeeze of 2020 to 2021. Uh, my goal is to test how the event aligns with the with or challenges the efficient mic market hypothesis. Um specifically I want to determine which form of EMH um weak semi semi- strong or strong appears to be violated whether rational investors could could have systematically profited in real time and how behavioral forces uh and limits to arbitrage may explain what happened. My hypothesis are as follows. So under the weak form um past prices should not yield uh ab abnormal returns. Under the semi- strong form all publicly available information should be immediately um and correctly incorporated into prices. And then under the strong form even investors with private or insider information um should not consistently earn superior riskadjusted returns. Uh to test these I'll focus on three critical windows. Ryan Cohen's 13D filling on August 28th, 2020, the January 2021 runup from the 11th to the 29th, and the trading restrictions that occurred on January 28th and 29th. So that is my discover phase. So for represent, so to represent my analytical plan here, as you can see on my Python code, I use a market model comparing GameStop to the S&P 500 proxy from June 1st, 2020 through March 15, 2021. The estimation window from June to mid December captures normal market behaviors before the major surge. Uh and then using Yahoo Finance data, I measured abnormal returns um and computed cumulative abnormal returns um with within each event window. I also calculated volume Zcores um to detect significant deviations in trading activity relative to normal field relative to normal levels. Apologies. Um the main objective was to see whether the market reactions were immediate and rational or delayed in an and extreme in ways inconsistent with efficient pricing. So these outputs um that you'll see in a bit allow me to evaluate price price efficiency, behavioral in influences and whether any trading strategy could have produced reliable profits um once real world trading frictions are considered. So for the implement stage um in the implement in the implementation phase I began by downloading the adjusted GameStop and S&P data from Yahoo Finance using um what's it called? using uh Python's Y finance library. Um and then after flattening potential multi-index structures, I extracted closing prices and volumes, closing prices and volumes aligned with the data sets by date and calculated daily log returns. I use an OS regression to um to estimate the market model coefficients where GME's returns were regressed on uh the S&P returns. GameStop's returns were regressed on the S&P returns. Um and then during the estim estimation window yielding estimates for alpha and beta using those parameters. Uh I calculated daily abnormal returns. Create a new column for zcores to highlight period of unusually high trading activity. And then finally, I summarized the results across three event windows, producing statistics such as sample size, mean abnormal returns, t values, p values, and cumulative abnormal returns. These figures quantify how extreme GameStop's movements were uh relative to normal market expectations. So as you can see here um doing the daily returns and then the the market model based on the estimation window the zcores here and then um the functions to compute the window stats here there's some plots that I'll show you in a little bit and then here's whether or not you know abnormal returns are present and and the zcores as well. Um so to validate the model um and interpret the results I examined both summary statistics and plotted outputs the price chart which as you can see let's see um the price chart which is right over here um showed an extraordinary rise during January uh 2021. one as you can see here um with GameStop reaching an intraday high near $483 um and then followed by a rapid uh crash and then abnormal returns clustered heavily during the runup with multiple with multiple statistically significant positive days. the cumulative abnormal return uh chart which is here um confirmed this momentum pattern returns didn't simply reflect new information but appeared to snowball um as attention increased and then volume Z scores spiked dramatically during the same period reaching many standard deviations um above the baseline signaling an unpred unprecedented retail trading influx Um and then the uh t tests um showed strong g deviations from zero uh abnormal returns in certain windows. Um as you can see here and uh particularly in the runup this suggests that price cannot be fully explained by new information or fundamentals alone. So these results indicate tension with weak form um EMH as past momentum and investor attention created abnormal movements beyond what rational models would predict. So in the evolved stage I considered how these results might change investor or policymaker behavior. Even though the data showed large abnormal returns, these opportunities were not realistically exploitable by rational investors due to significant real world frictions, trading halts, um wide bid ask spreads, short sale restrictions, clearing house margin calls, uh and retail broker limitations such as those on Robin Hood made it nearly impossible to systematically profit from the mispricing. So therefore while the price patterns uh violate simple statistic statistical efficiency the broader market remain constrained by micro structure and operational realities. Um so for investors this suggests that chasing momentum during extreme attention-driven events is more likely to result in losses than sustainable gains. Um and for regulators the event highlighted weaknesses in settlement and liquidity systems. This motivated later change as the move towards um the as the move towards T+1 settlement um to reduce clearing risks. And then for reflect reflecting on the results, um my findings suggest that weak form EMH face significant strain during the GameStop episode. Um as strong momentum and clustered abnormal returns challenge the idea that past information is useless for prediction for p for predicting future returns. However, these patterns uh likely weren't exploitable once friction um and execution risk were considered. So the semi-rong form was also challenged since public information such as the 13D filing and the announcement of trading restrictions led to overreactions and delayed corrections rather than immediate accurate price incorporation. Um yet prices did um adjust quickly when restrictions were implemented showing that markets still process public data rapidly even if it's um imperfect. The strong form um meanwhile held firm no group um so not even in institutional investors consistently profited on a riskadjusted basis. In fact, hedge funds like Melvin Capital um sustained massive losses. um behavioral explanations such as hurting, overconfidence, attention cascades from um from websites like like Reddit and and Wall Street Bets and limits to the arbitrage best describe the episode's magnitude and persistence. Um so in conclusion, uh the GME the GameStop case shows that market efficiency is not binary, um but it's conditional. Um, while price movements clearly deviated from what rational models predict, the inability of most participants to exploit those deviations support the notion that markets remain broadly efficient once behavioral dynamics and frictions are recognized. Um, so weak form EMH was stressed, semi- strong EMH was strained uh under extreme social and liquidity pressure. Um, and but strong EMH ultimately survived. So behavioral finance um and structural constraints rather than irrational irrationality alone offer the most convincing offer the most convincing explanation of why GameStop behaved as it did. This GameStop um story reminds us that even in datadriven market, psychology and infrastructure can moment uh momentarily overpower efficiency, but rarely in a way that um rational investors can pro uh profit profitably anticipate. So that's my analysis for the GameStop. Um but yeah, thank you for listening.",
  "video_url": "https://youtu.be/WdvLCxJ46vc?si=4QgedK33-8MOMc9f"
}