{
  "student_name": "Katherine Schmelz",
  "org_defined_id": "035859682",
  "username": "kschmel",
  "email": "",
  "transcript": "Session 8 covered market efficiency and behavioral finance. Uh more specifically the efficient market hypothesis or EMH. Uh for the define and discover part uh we wanted to investigate the market efficiency using the GameStop and short squeeze event of 2020 to 2021 as a case study. Ultimately, we wanted to understand if market anomalies constitute evidence against market efficiency or if these anomalies could be better explained with other frameworks um or if the market anomalies could be explained within existing frameworks. Um so part of this what happened understanding um what even happened during this essentially Gamestock had a bunch of stockholders uh that would borrow stocks and then sell them to a third party for a higher price hoping to get a payout once they rebuy them and then sell them back to GameStop. Um, all this back and forth resulted in a drastic increase of price as well as um the the the more important thing the the selling of more stock than actually existed which is the concept of being shortstocked is not having enough stocks to actually go around. Um, and then the second part of the define and discover section was verifying the historical data. Um the first thing I noticed was that uh the GameStop traded at 4 cents in August, but according to uh Google Finance, um the stocks were actually about $14. Um, and then I did find that the short interest peaked at about 140% of float, which basically means that there was 140% of the stock was not actually associated to anybody. Um, and then retail trading volume increased 10fold. It was actually it increased 15fold. um it was just being overturned so quickly that it was actually uh 1500% what was originally there. So that's a increase of 15% 15 fold during the squeeze um trading restrictions implemented at peak for example Robin Hood. So yes, I did find a source that uh during all of this um although brokerage firms such as Robin Hood were really hesitant to uh help out and like lend money uh without like very substantial collateral. So with something like this happening, nobody knows where their money is really at because of all this back and forth and not really truly knowing the price. So brokerage firms like Robin Hood had really heavy restrictions. And then the hedge fund um sustained 53% required bailout 53% which required bailout was also true. um it was just a drastic shock in the market and they needed to be bailed out because of that because of the the shorts stock situation that I explained above. Um and then lastly, the analyst fundamental value estimates $10 to $40 per share. Um as of today, it's about $21 per share. The past week or so, it's been about $20 20 $21 per share. Um, so with all of that in mind, figuring out how to analyze the different uh market efficiencies, moving on to the represent section, I first wanted to make a timeline. Um, so in general, in August 2020, GameStop is near bankruptcy levels. Um and then September 2020, uh a different company founder acquires 13% stake. So he essentially buys 13% of this company of GameStop of GME. And then by January 2021, all of the Reddit chains, all of social media is um making some crazy claims and the price surges to $483. Um, and this was also fact checked in the the data here too. Um, so then by February 2021, the congressional hearings on market manipulation occurred and sort of reevaluated. They implemented some other things, got some brokerage firms into place. And so now we're postvent, everything is stabilized. Life's good now. Um, so just having that general timeline of nothing and then they had a little bit of money and then all of a sudden the stocks went crazy so it went really high up and then the congressional sort of started to bring it back down and now we're nice and stable for several years. Um and then things I wanted to look at for efficiency benchmarks comparing different types of efficiencies. For strong efficiency, um ignore ignore those words. For strong efficiency, you want to look at um if all of the prices reflected everything you know, including the things you don't know. um in practice it's ideal but in reality it's a lot more complex uh but we wanted to measure that anyways and then uh for semi strong efficiency um that incorporates all publicly available information um and that primarily uses technical analysis rather than fundamental or insider trading information. Um and then for the weak efficiency, the weak form uh of efficiency, we want to see um how prices we the week efficiency measures um all past data and volume information. Uh it's basically like the core business like the basic fundamental analysis that we've worked on in the first couple of sessions. Um using like company data and uh like the um using different financial statements, the balance sheet, income statement, cash flow statement uh and just looking at those. So if we can get a lot of information from that and understand that's like what the weak efficiency benchmark uses. Um and then to understand the return analysis of GameStop um we're using concepts from CAPM the capital asset pricing model as well as from this unit. So for normal return I used a formula from uh this section which was alpha plus beta times the market return. Um and alpha is just the excess return and then beta is the market sensitivity. Um so if that's positive that means you're getting extra money. You are it's a the market is returning more money than you put into it. If it's negative then you're losing money in the market. Uh and then the abnormal return would be the actual return minus the normal return um or the expected return. Those are sort of interchangeable in this situation. Um and the expected return jumping back to CAPM would be the uh the risk-free rate plus the beta times market risk premium. Um so that carries over into this section as well. And then the cumulative abnormal return is just the sum of all the abnormal returns. So that's a helpful tool to look at for if you're looking at like a portfolio of companies that you're looking to invest in. Moving on to the implement stage um to test the market efficiency and find which ones are violated and to evaluate if investors can actually be profitable in this system. Uh I built this code um with some AI assistance. Uh but this is my code. So here it's setting up to run simulations for different events. um because obviously we're not in 2020 anymore, but we do have that data. So, we're establishing the risk-free rate here and then the market rate, the market return here, and then the um GameStop returns here. And then we plug the variables in to our equations that I explained above. Um and then simulating the periods starting in January and going through February and March. Um it breaks down and calculates all the different betas. And um it also calculates our um risk our expected risk and our abnormal return um given the scenarios. So at first at the very beginning of January the abnormal return is relatively low. By mid January it is almost at four uh which is the peak of it. Um, and then by the end of January 2021, it is back down to under one, which is much better uh, as far as a company goes because this level at four basically means that um, GameStop is undervalued and they are losing money versus the uh, investors are um yeah, the investors are gaining a ridiculous amount of money for their investment, but this quick turnaround is also a sign that something's going on here. This isn't right. So over the course of the month, the mean abnormal return was 1.35. Um and from this data we can conclude that the market efficiency um we can conclude that there's a massive violation in the semi strong form of the EMH uh the efficient market hypothesis um because there's a lot of different stuff happening and it is not able to uh use all of the available information um in a positive way. So we can break down the violations here um to validate some of this data um we can see that um abnormal returns uh it there's a huge positive abnormal return but it can't really be explained by beta or fundamental public information. Um so that's sort of a red flag for us. And then the weak form of the EM is violated because the price movement uh is showing that it's highly profitable when it shouldn't be which is a violation for the weak form. Um you should be able to follow a pattern for market market trends and uh as GameStop since GameStop is just like a small it's it's a company that runs out of a strip mall. It shouldn't be a crazy profitable model. It it's it's a business that's been in place for a long time. Um, so the weak form is likely violated here. And then the semi- strong form as I previously mentioned is definitely violated um because of the price differences from the estimated like $20 from earlier versus the peak price of $483. Um that's suggesting that the prices are not being reflected by public knowledge and information. Um so then how does this apply to behavioral biases and behavioral finance? Um because of the situation of what it was uh there was definitely a lot of hurting happening in this situation. Um people started talking on Reddit a social media and then everybody started taking advantage of this situation that was being happened uh with GameStop. Um and then there was also some overconfidence happening. People were being investing in things when they maybe they shouldn't have. Um they were definitely anchoring and it's part of their uh they heard one thing and they just went with it. Um as well as there's also some market anomalies happening here too. we can see a calendar effect where there's just a peak in one just like one period of time, one week where there's this crazy high rate. Um, we're also seeing some momentum happening where one person starts doing it and makes money and so then a bunch of people start doing and make money. Uh, and that sort of comes back to the the hurting of everyone is doing it, everyone is playing the game and gambling a little bit. Um so to validate some of this stuff uh the abnormal returns are statistically different from zero. We can see that with the 1.35 it is much larger than zero. Um so we know that this is definitely something that is abnormal. Um profits are profits large enough to overcome transaction costs? Well, maybe at the start, but as time went on and people were taking a bigger and bigger risk, those profits that they were hoping to make were a lot less. So, economically speaking, this is probably not true. Um, and then persistence. How does the pattern continue after become after it becomes widely known? Well, if we look at the data, you can see the huge giant spike from before the incident, before the short squeeze happened, and then this tall spike right here is the short squeeze. Um, and after that, it slowly makes its way back down to recover and then it starts to settle back in and stabilize over the past couple years. Um, so to answer the question, no, the pattern does not continue. Um and then are abnormal rates compensation for additional risk to a certain extent? Yes. Um if alpha is positive then the uh abnormal return will be positive and you are gaining excess returns. However, if the abnormal return is negative that means you are losing money. So um you're it's another level of risk. It's not necessarily compensation for risk. And then to evolve this a little bit more um taking this and evolving it to another stage. Uh you can look at different markets public versus private thinking public stocks versus private investment funds like 401ks. um different measures of units and comparing the risk there. You can take the concepts of the EMH uh the efficient market hypothesis and seeing how that um comes into effect with different things like the banks versus stocks like this and comparing those risk levels. Um other implications will include um the behavioral finance framework. So comparing the EMH with uh like the the hurting and the overconfidence um and like how those play a role in this hypothesis testing. Uh as we can sort of see from earlier uh people will follow each other like the hurting. Uh however if you take into account loss aversion you don't want to um make as people are risk averse so they will run away from risk if they can so they're less likely to invest that's one possible implication of the EMH um and then acute versus or active versus passive management um the effect the efficient market hypothesis definitely uh takes a more active role. If you want to be a more passive, then you're going to be less risky and you probably won't be in stocks that this would happen. Um so it's definitely a mentality thing, behavioral thing. And then uh market efficiency policy. So um as previously mentioned after it went to Congress and they established higher um or they established some new boundaries for this um the actions of doing the the short squeezing and short stocking and borrowing stocks to then sell them and then resell them and reby them. That is now illegal. The insider trading is now illegal. Um, and then something else to continue evolving to evolve this a little bit more would be to use different measures of efficiency such as the adaptive market hypothesis. Um, that's even more active and it is a way of uh setting the grounds for the future rather than looking at past data. Finally, to reflect on this whole assignment, we can use existing frameworks to understand market anomalies compared to the ideal market efficiency. These frameworks allow us to identify situations that exhibit the asset substitution problem and limits to arbitrage such as the GameStop short squeeze. However, it is also important to take into account the use of other hypotheses and compare compare them to EMH for a well-rounded sense of the market. And that's all I have.",
  "video_url": "https://youtu.be/26SicMBGeEw"
}