{
  "student_name": "Caden Mainville",
  "org_defined_id": "037229244",
  "username": "cmainvil",
  "email": "",
  "transcript": "Hello, this is management 310 assignment 8. So our objective for this assignment is to investigate market efficiency using the GameStop short squeeze event. So to dive into our define and discover, let's go ahead and set our goal. So the goal of this study is to test EMH by analyzing whether the price movements during 20 to 2021 of GameStop reflected an informationational efficiency or displayed systematic inefficiencies. So the analysis will assume public available price data captures all the relevant information and it's also consistent with the EMH testing standards. We're also going to assume that any deviations from efficiency were interpreted as potential behavioral or market anomalies rather than permanent inefficiencies. As far as our benchmark plan, we're going to have to dive into some required analysis. We're going to have to verify that all stated price data is correct. We're going to have to test market efficiency and see if it was violated. We're going to have to evaluate whether rational investor investors could have profited. We're going to see if the EMH predictions compare those to the observed behavior and what actually happened. We're going to dive a little bit into the behavioral side and also see what market anomalies constitute evidence against EMH. So the data that we are given is shown here. So this is the original data that we are given. We are given an event timeline along with some key data points that we'll dive more into later. We are given the financial analysis requirements. So we have to do some market efficiency testing, some behavioral finance analysis, investor profitability analysis and also some theoretical implications of EMH. And then uh the last data we're given is some sources that we should refer to and um also just some other data that we need to look into. So let's go ahead and dive into our plan, our represent stage. So for our represent stage, this is our framework and the route that I am going to be taking. So first we have to verify that all the facts we are given are reliable and uh make sure that they are all accurate. From there, we're going to analyze the price behavior relative to EMH and also find any violations. We're going to test the weak form doing an OS regression and also showing an autocorrelation graph. From there, we're going to look into the semi-strong efficiency testing. We're going to look at abnormal returns car and other events that affected it. And then we're going to discuss the strong efficiency testing by just looking at the private information and how that affected anything. Not going to be anything uh crazy modelwise. Uh we're also going to see the CAPM abnormal abnormal returns. We're also going to look at the security market line to see where the return was in relative to the risk and then also look at some predictability patterns and where that falls into the efficiency testing. Uh thirdly, we're going to look at the event catalyst. So the timeline for that is given as follows. So I'll talk about that a little bit briefly right here. The GameStop was near bankruptcy um in August of 2020. um there was a lot of short interest within them. But later that year um the Chewy founder acquired 13% stake which kind of started everything. There was a Wall Street bets driven surge and from there there were some federal restrictions and also Robin Hood restrictions that um put limits on traders and what could be done during that time. After this whole event kind of settled down a little bit, there were uh Congress hearings, but volatility was still all over the place. previous GameStop was still going up and down and it's still well above the uh pre-squeeze price. And then as far as today goes, we are in a stabilization period for it, but it's still well above the pre-squeeze as I have said. So then from there, we're going to dive into the behavioral finance. So we're going to look into the biases and see if there are any behavioral patterns as far as the social media. We're going to look at the limits to arbitrage and also assess market microstructure issues. We're going to do that all within the model of Collab. Um, we're also going to look at a rational investor analysis. We're going to see if there are any profit opportunities. We are going to see um if there are any information advantages. We're also going to analyze the risk adjusted return and discuss the Xanti versus X post uh analysis types. Lastly, we're going to conclude everything by comparing the efficient market hypothesis to the behavioral finance framework. We're going to compare those and see how they differed to what actually played out to what we expected. We're then going to look at the implications of passive versus active investment strategies with the EMH and also look at what policies were implemented because of this event. So let's go ahead and dive into our implement stage. Firstly, we have to look at the uh quality of the data we are given. So the way I went about this is um collaborating with Gemini and chat GPT to uh make a educated decision and I also went back and checked with real data sources to make sure that it was correct as given. So uh most of the data is spot on. There are some mistakes. So the first statement that uh GameStop traded at 4 cents in August 2020 is correct. They were trading at a around um A14 cents at that time. There's also a small mistake in saying that Ryan Cohen acquired a 13% stake in September 2020. Technically, he acquired that stake in December and only require and only acquired a 10% stake in September. But um I would go about correcting my professor in a private setting where I could undeniably prove that the statements are wrong based on reliable sources and analysis. Um I would be very respectful going up to him and also address my findings in a forward but approachable manner to make sure I don't come off as disrespectful. and uh also just make sure we're on the same page because it's a possibility that I am wrong as well. So now let's actually dive into our model. We're going to start off by testing forms of market efficiency and seeing which one was violated and how this plays into um the short squeeze event. So my Gemini log was bugging but the prompt that I used for uh Gemini which I used inside collab uh went as follows um as shown here. So act as a tutor financial analyst and I gave it the goal that we need to do. We need to create a Python notebook and uh I gave it all the data that it needed that we already went through. So I'm not going to repeat myself. But this is where most of the important stuff comes in. So we're going to run an OS regression of the um the week form to see if it was in violation or not. What an OS regression actually is is it regresses today's return log over time. yesterday's return log and it basically asked the question does past returns predict future returns. So the second part kind of plays into that but then we are going to plot a 20day rolling autocorrelation of GME which um will test for short-term predictability and we are going to be able to tell whether weak form efficiency is violated because of that. So what week what weak form is going to show is um whether past returns can predict future ones and and if past returns do not show future returns then it would be in line with weak form efficiency. So moving on to the semi- strong form uh we're going to take a deeper look at the actual events that happened. Uh so it's going to look at the event windows for each dates to see how abnormal the returns were to see what actually happened. It's then going to plot that for um each window and show the timing and the magnitude of the market reaction. Um then to move on to strong form we are going to just briefly discuss whether inside activity or any other private information influence the price. Um so the difference between semi-trong would show us whether you can't it would basically say you can't consistently outperform the market by using public information. So if we are seeing that we can then that would be in violation of semi- strong and for strong even insiders with private information can't earn abnormal returns. So if we see that insiders were making abnormal returns then it would be in violation of that. So that's what we are going to be testing. Okay. So that was the prompt. Now let's dive into the actual model to answer um two and four mostly shown here. So it's going to set up the data. U nothing crazy just installing data. Let's go ahead and dive into the OS regression. So, as we can see here, it's going to calculate um it's going to sorry, it's going to calculate yesterday's returns so-called uh with those logs and then from there it's going to run the OS regression model within and then it's going to interpret the results based on the p value shown down here. So, systematically this is kind of what we're looking at. It's not even the behavioral side, but just based on the p values, the interpretation for this would be that it's consistent with week four mar market efficiency because people wouldn't be able to predict today's returns based on yesterday. But that's just what it says um systematically. So, we're going to have to look at the behavioral side of that to see if that changes our answer to if weak form was uh was violated. But from here, we can also compare the p value as I just said, but we can also look at R squared. So we can see that since it's virtually zero, no predictability is really seen and uh truthfully I need to do a little bit more work with OS regressions to get um a little bit better at them. But this is a first uh firsthand experience of me. So moving on, we're going to look at a rolling 20-day autocorrelation of the returns. So this chart was plotted as so with a rolling autocorrelation um code line given the um game log return for uh the dates during 2020. But we would expect this blue line to be closer to this red line kind of hugging randomly around zero. But instead we see it going from negative to positive uh constantly which is suggesting that some short-term predictability was possible um as there was momentum in the market and uh other social outside factors. So this is definitely interesting to see. So as we can see the interpretation here it would indicate short-term predictability and would be a violation of the weak form efficiency. So we have some conflicting uh data data points with the OS regression and the autocorrelation. But that's why we do these different tests and try to come down to what actually happened. Lastly, kind of as a benchmark, we're going to see the um GameStop versus the SPY to get an idea of the abnormal behavior during this time period. So, we can see that earlier in the year, GameStop was pretty close to bankruptcy, um, if not almost there. And during the short squeeze event, we can see how it just skyrocketed randomly. And when we take a look at the SPY at the uh, same point, it might have even gone down at that point. So, there's really not much correlation there. And it really just shows the abnormality of that event because there was no significant market event that caused all stocks to go up and uh have mass mass mass good breadth but instead we can see the abnormality um of this short squeeze event. So this was a cool visualization for me to see. Um the prices are obviously vastly different but that doesn't mean that the returns are um are the same. So from that analysis I would say there is a violation of weak form uh market efficiency. Um maybe not as much systematically but outside behaviors definitely caused um people to predict what the stock was going to do. Um so it mostly plays into the behavioral side not as much as the fundamental side but uh as momentum kept rising the stock also kept rising. So people were able to predict what it was going to do and they were also kind of collaborating all with each other. So I would say that this is a violation of weak form efficiency just based on that front. So now let's dive into the semi-strong efficiency. These are going to be more of the uh public events that happened. So most of the code is going to be the same for all of these. So I'm just going to go through one and um kind of just go through the general idea. So basically it's going to define the event dates and the windows of what happened. So as shown here, it's then going to filter the data for that exact time window. From there, it's going to calculate the abnormal returns by looking at the GameStop returns and comparing it to the spy returns. Um from there, it's going to calculate the cumulative abnormal returns uh through the car equation. And then um it's going to go ahead and plot that on a graph. So around the time that Cohen stake, the uh Chewy owner, bought the stock, we can see the abnormal returns pretty much skyrocket. It they went from a little under 5% to close to 40% and above given that date. So we can see after this point it kind of stabled out a tad bit, but it kept slowly climbing higher. The AI interpretation of this graph shows that there's a suggestion of violation of semi- strong form efficiency, but this one's a bit harder to say. Um, it is saying that a significant or sudden jump or decline around the event date. We can see that around the event date it's not insanely not an insane jump compared to you know what we were seeing here but it is definitely possible that um other people knew about this and were able to profit from it. So we'll leave it at that and dive into the next event which is the Reddit surge. So this one I would say is in a bit more of a violation because there is a sudden jump around the event date and a sudden decline. So we can kind of see before Wall Street's bets got involved, it was a bit bland and then there was some hype and some talk about it and then they got involved but from there it went um down a little bit and got a little bit more volatile. So up and down, up and down. people were making small profits and also losing lots if you bought high. But it's definitely interesting to see how the influx of retail trading was able to cause abnormal returns to skyrocket and kind of stay relatively in the same area for some time afterwards. Now let's go ahead and look at the congressional hearings which I think is the most the most interesting one. So the abnormal returns sharply declined um along these hearings. So I would say that it could suggest a violation of semi- strong form efficiency. Once they imposed some restrictions and some limits to it, um it definitely scared traders away and uh returns dropped as people were selling off and uh momentum started to die down a little bit. But even after the hearings, people were able to make some uh some money off it because um after the 19th, pretty much a day after the hearings, it skyrocketed back up. So volatility was definitely still all over the place and uh it continues from there. So I would say that this is in violation of semi- strong um efficiency because the markets were really reacting to sentiments and also a group of people were um allowing the stock price to change dramatically and it wasn't a fundamental aspect that caused that. So let's go ahead and dive into strong form efficiency. Um, as said before, this is going to kind of be more of a discussion about what happened. So, as stated here, several factors point to a violation of strong form uh a violation of strong form market efficiency. So, to start, we can see that there are we can see that there was a consistent buildup of short positions by hedge funds, which could have shown that there is some private information not being um shared. Maybe people were kind of banking that they would go that they would go bankrupt. that's what was happening. Um, and then as far as the analyst fundamentals go, um, it vastly exceeded the the estimates of 10 to 40 per share. You know, it went all the way close to 500. Um, I think it topped at 483 as showed here. But that definitely goes to show that it was influenced by some private knowledge or group trading strategies and behavioral factors that diverged it from its intrinsic value. And then um the retail trading increased by tfold during its squeeze. People were really trying to get in on the action. Um so there were restrictions which basically didn't let people trade and um other people didn't have those restrictions. So definitely a violation of strong form efficiency there. So I would say in all aspects there is a violation of all market efficiency when looking at GameStop case during the during the short squeeze. But that assumption wouldn't be correct without some sort of robustness check. So let's go ahead and dive into that. So what we're going to be showing here, I'll kind of keep it short and sweet as it's a validation step. We're basically going to be comparing the returns pre-squeeze and after squeeze. So kind of the same ideas. So we're going to be looking at um a comparison of the OS regressions and also be graphing the same autocorrelation um graphs to take a look at that. And it's going to uh print all of that as shown here. So we've already seen so we can see how the pre-queeze we are hovering more around zero and um this really goes to show that yesterday's returns don't really um fall in with uh today's returns and then for the post squeeze we saw this one earlier um the heavy volatility and the short momentum spans where people were able to predict what was going to happen um within the price of the market based on uh momentum and other outside factors. Now we can do a robustness check for the semi-rong efficiency. We can kind of look at the exact same graph we were looking at earlier. So the GameStop beforehand um not much abnormal return at all. You know people were getting the expected of what they wanted and then from there the Reddit surge happened and cumulative abnormal return just skyrocketed. um everyone was making return and it stayed at that point for a little bit while. So that's kind of the pre and post cool visualization to see. And then as far as a robustness check for the uh strong form, uh basically we did a quick analysis of the pre-queeze period um and the postqueeze period to look at how private information affected this. And in summary, we can see that it might have been vi violated pre-squeeze, but it was almost definitely uh violated in the squeeze period. So after the squeeze happened, we can see that it's not really just caused by typical insider information and people knowing what's going on. Instead, there is institutional private strategies and vulnerabilities. So all those short positions that happened, they all went horrible and uh their losses were were were miserable and then um there was also just extreme diversions from the fundamental value of what was actually happening with inside the company. So that definitely played a factor into it. And then uh as we talked about earlier, trading restrictions uh basically affected all retail investors and maybe not institutional ones um as aggressively. So based on our robustness check, I would still be on the same page with uh the conductive analysis that I had with our EA EMH. So now that answer two is fully answered, let's dive into four. So four is going to compare the predictions to the observed behavior. This is going to be a little bit shorter because we pretty much already talked about everything that already happened. But the weak form efficiency as we already said past return should not be able to predict future returns. Um and then we've already talked about these other ones. But let's go ahead and compare our predictions to what we actually saw. So what this code is going to do is basically just create a table and uh a summary of what we expect and what we actually saw and if it was violated or not. So we can see here weak form we can see the prediction no predictive power from past returns. What actually happened? Well, we can see that there is significant predictive power or power from the prior's day's return and it deviated significantly from zero when we are looking at a rolling autocorrelation. So, conclusion, we would say that it was efficient, but I do not agree with what the AI said here. I believe that um weak form was uh violated based on that. So, I'm going to have to go ahead and fix my analysis right after that. That was an error. I just caught it real quickly, but I don't really want to re-record the whole 20 minutes. So, sorry about that. Um, let's move on to the semi strong. So, the instant and rational adjustment to public information. That's what we should predict. But instead, what we saw was rapid price movements from public events happening and uh indicating that there was overreaction rather than a rational incorporation of this information. So, we would say that it was violated. strong form, no abnormal returns using private or uh public information, mostly private. But we can see that it significantly deviated from its fundamental values and um as institutional positions uh fell short and the trading restrictions that happened. You know, it all influenced the private information unequal access to uh trading accessibility. So, we would go ahead and say that it was violated. So in short, could a rational investor really have made money systematically during this short squeeze? Probably not. In short, uh the market environment was dominated by, you know, extreme biases, a lot of volatility, different risk from all over the place, trading frictions, and it's just some just some crazy stuff happening in the market that no rational investor would really want to ever be around. So, a lot of the um experimental investors and risky ones uh really magnetized to GameStop during this time. But let's dive a little bit into why. Firstly, uh if a rational investor wanted to calculate the sharp ratio because that's maybe what a rational investor would do, we could see that this number is favorable as it's above one. But it would be considered misleading because of its um unique nature of the event and the extreme price movements and not abnormal returns and the unquantifiable risk. So it really was not a sharp calculation for or just something that you should be basing a lot of your research off of. So that being said, you can kind of move into the weak form efficiency uh semi- strong and strong form efficiency uh arguments. a rational investor really could not have used the uh past price or um the volume alone or the or the data alone to um offer a uh systematic information advantage. Um, as far as semi strong goes, there were maybe some exploitable opportunities, but the speed and the magnitude and irrationality of everything around it probably would not have been very attractive to a rational investor. And as the AI put it, it was speculative gambling or gambling. Can't really talk today. Uh and then as far as the strong form efficiency goes um they obviously weren't accessible to all traders and um the overall conclusion is that a uh typical rational investor really could not have translated this into a practical investment strategy. So X anti versus X post is really just the before and after analysis. We can see that um we talk about how it was not generally predictable by an X anti- um analysis due to just the unprecedented nature of the event and the gains only became noticeable after um in an expost analysis. So in short, no. A rational investor could not have saw this coming and uh made good profit off of it based on um fundamental resources. Now let's dive into the fifth step of our required analysis. Let's dive into the behavioral finance explanations. So firstly um I imported some information into the AI and we had to identify the behavioral biases that were going on. So firstly there was a lot of overconfidence in the market. There were a lot of people who thought they would make a lot of money especially in uh Wall Street bets as they uh came together to um make this happen. But on the flip side, a lot of institutional investors were uh very confident that GameStop would go bankrupt and their short positions would be profitable. So there was a lot of overconfidence on both sides which uh kind of collided and clashed. Um this event is a prime example of hurting. Um everybody saw that it was happening and everyone just ran towards it and um definitely definitely amplified the momentum of the stock. there's a fear of missing out. Uh, you know, seeing that other people are making crazy returns, you might want to get in on that, too. So, that was definitely a behavioral aspect. Anchoring. Um, as far as that goes, investors often anchor their decisions to a specific piece of information. So if they trusted people in the Wall Street bets and what they were saying or on the flip side the institutional investors um there was a lot of anchoring going on and people didn't really know didn't I mean they they trusted what they knew but it wasn't exactly reliable in the long run in hindsight. So lossion this bias suggests that um investors feel the pain of losses more acutely than the pleasure for uh equivalent gains. So people don't want to lose at all, but if they make a ton, they probably don't really care as much, which is a it's a weird behavioral phenomenon. And then mental accounting is uh trying to treat money differently depending on its source or intended use. So people might have seen this as like a gamble or a play money. Um so that definitely played into it as well. So now that we have those behavioral biases identified, let's look at the social media patterns that happened. We can see that uh Wall Street Bets amplified the sentiment and the communication as they posted memes and discussed rapidly and uh rumors and trading strategies to um make all this money and collectively they did it and coordinated buying. Um in this effort we saw it skyrocket and um the action was explicitly aimed at squeezing the short sellers. This demonstrates the behavioral drive beyond the uh fundamental investment aspects. So behavioral finance definitely plays a huge part into the markets nowadays. And then as far as the actual price dynamics goes, we can see that in increased volatility and non-fundamental pricing within the stock and then also extreme trading restrictions as we've talked about earlier. Let's talk about the limits to arbitrage real quick. So limits to arbitrage refers to the factors that prevent rational investors from fully exploiting perceived mispricings in the market. So in a perfectly efficient market, any deviation would be immediately corrected. But in reality, there's a lot of practical barriers that make it even impossible for mispricings to persist. We can see that there's fundamental risk and uh you know, obviously people holding the short positions and it um there was a lot of mispricing already. So moving on to the noise trader risk. There's a lot of there's a lot of people who invested because of stuff they heard and rumors that they didn't even know if it was true. So that's um that's where the limits to arbitrage also plays into that. And then um there was also commission cost for um for the large influx of uh trading happening in the market. So there was a high cost of borrowing from people trying to get money to get in on this limited share availability, the market impact and obviously a trading restriction. So in summary, the uh price obviously fundament or deviated from its fundamental value. But um as far as the limits to arbitrage go uh this basically allowed for extreme mispricings to persist and people take advantage of those. So let's dive down into the market micro structure issues. Uh this is basically going to look at the specific issues of what happened to GameStop and the overall market during the uh short squeeze. So the first uh microructure issue was the liquidity fragmentation. It was basically really hard to see what was happening to all the trades because they were being spread across everywhere. Um secondly, there was order book imbalances meaning that uh meaning that there was sustained buying pressure from retail investors while overwhelming uh pressure in the sell side um created the imbalances for uh more buy orders than sell orders at various price levels which can uh lead to rapid price accelerations and that's what we saw. price discovery challenges. Um we see that the um extreme volatility and the technical dynamics meant that GameStop's price oftenly diverge from its fundamental value. So it made it difficult for participants to gauge the true underlying value of the stock. And then um as far as the impact of the settings train restrictions, you know, this obviously impacted investors itself, but it al also impacted the uh company because it uh limited the purchase of GameStop shares and um it took some of the buying pressure off from a significant segment of the market. And then after this there was um you know changes in margin requirements basically meaning that uh which basically means the minimum amount of equity that you have to have. uh it was changing within uh brokers and also within hedge funds holding positions in uh GameStop. So all these microructure issues transformed into transformed the stock into a a battleground as the AI put it where um vulnerabilities were uh seen definitely. But to summarize what we kind of talked about, we can see we can see how the GameStop event serves as a u a really cool case study kind of intertwining behavioral finance, social media, market microstructure weaknesses, and um a bunch of other factors that uh led to this uh short squeeze happening. So all in all, the biggest contributing factor to um GameStop rising was really just the behavioral finance. Obviously, there's the buy side and sell side imbalances, but in order to really start that, it all started with people coming together to uh mass buy the stock. So, that's definitely really cool just to see because it obviously doesn't happen often at all. And um obviously raised questions that uh the government had to look into because this couldn't keep happening if the markets wanted to try to stay efficient. Um, but to basically summarize the entire behavioral",
  "video_url": "https://www.youtube.com/watch?v=btAQMxDm0_M"
}