{
  "student_name": "Jonathan Hinds",
  "org_defined_id": "037200739",
  "username": "hindsj",
  "video_url": "https://youtu.be/CXU2NNhtfac",
  "transcript": "0:01\nHello, my name is John and today I'm\n0:03\ngoing to be demonstrating the capstone\n0:05\nproject. Uh I'm going to be showcasing\n0:07\nmy AI powered financial tool that I\n0:10\nbuilt. And so for starters, I based it\n0:13\noff of this uh AI uh that drafts\n0:17\ninvestment memos from financials for\n0:19\nfuture bankers. And um doing so,\n0:25\nit's it's it's going to be based on does\n0:26\nit work? Does anybody care? um and is it\n0:31\nhelpful basically and I think uh it is\n0:35\npretty helpful. Um people are going to\n0:38\ncare. It it simply just takes a ticker\n0:42\nand explains to anybody why to do the uh\n0:48\ninvestment option it recommends. So\n0:52\nfirst going into it, it's based on um a\n0:54\ntelegram bot. So I created a telegram\n0:56\nbot uh using uh just the free bot\n0:59\ncreator in inside of telegram and uh\n1:03\ndoing so I used active pieces to make a\n1:07\nworkflow and so it receives the message\n1:11\non the uh telegrambot chat when I send\n1:14\nit a message. Um, I'll be sending it\n1:17\njust a ticker\n1:19\nand it's going to take that ticker and\n1:21\nit's going to look up um the Yahoo\n1:23\nfinancial pages and some other financial\n1:26\npages uh to get info and information um\n1:31\nand the financials of uh that ticker.\n1:34\nSo, I'll do um\n1:38\nlet's find a good one. Oracle. There we\n1:39\ngo. I'll do I haven't done Oracle yet,\n1:42\nso I'll be doing that. Um,\n1:45\nand in my example, uh, to showcase it\n1:48\nrunning, so it'll it'll look up the\n1:52\nfinancials for Oracle. It's going to use\n1:54\nGoogle Gemini to generate that, uh,\n1:57\ninvestment memo for Oracle, and then\n1:59\nit's going to send it right back to the\n2:01\nbot. And so\n2:04\nI'm just going to send that right away.\n2:06\nSo it was OCL, I believe. Yep. Okay.\n2:12\nInvested. um interested in Oracle. I'll\n2:15\nsend the message and I'll look at this.\n2:17\nUm I've done lots of loops of this. Um\n2:23\nfirst couple of loops it wasn't reading\n2:26\nthe the message properly. It was\n2:29\nfabricating companies. So like here this\n2:33\ntech innovate incorporated it's\n2:36\nfabricating companies. It wasn't reading\n2:38\nwhat I was saying. Um\n2:41\nnow\n2:44\num and uh once I got the fix and like I\n2:48\nwould send Nvidia or Google and then it\n2:50\nwould give me Tesla which I hadn't sent\n2:52\nin the chat before so I wasn't reading\n2:54\nthem properly but then um it was also\n2:58\nlike giving them in like a letter format\n3:01\nand so like I don't need to know you\n3:03\nknow the date of when I sent the message\n3:06\num it's making up a deal team from\n3:08\ninvestment banking analyst list. Um, and\n3:11\nthis this is not really helpful. It's\n3:12\njust saying, oh, Nvidia announced its\n3:14\nthird quarter fiscal year and it has 57\n3:18\nbillion of revenue performance. Uh, that\n3:21\nto me doesn't tell me anything. And so I\n3:23\ndid several loops to make it useful. I\n3:25\njust got the text for Oracle. So here it\n3:28\nis, Oracle stock memo. I I have it\n3:31\nformatted so that it returns the same\n3:34\nformat every single time where it's\n3:37\ngoing to give me a very direct\n3:38\nrecommendation. It's going to tell me to\n3:40\nbuy, hold, or sell.\n3:43\nAnd so for Oracle, its recommendation is\n3:45\nbuy. Its explanation is going to explain\n3:49\nwhy it chose this recommendation of the\n3:52\nthree and it's going to use um the\n3:55\nfinancials that it hold. So, earnings\n3:57\nper share, its revenue,\n4:00\num, you know, what what it's looking\n4:02\nlike for, you know, it's its quarters,\n4:04\nand there's, uh, it's going to then go\n4:08\ninto it's going to give me a couple\n4:09\nbullets for each, uh, of the drivers\n4:11\nbehind the decision. Uh, so why why it's\n4:14\ngoing along with that decision. And then\n4:17\nit's also on the counterpart, it's going\n4:20\nto give the risks involved with that\n4:22\nfinancial decision. And um I can do this\n4:26\nwith any company.\n4:28\nUm so I'll just look at another real\n4:32\nquick. AMD. Perfect. I'm going to go\n4:36\nhere and I'm going to send an AMD\n4:38\nmessage. And it's not instant. It's\n4:42\ngoing to take a couple of seconds, but\n4:44\nit'll come back to me with a um pretty\n4:47\nwell sounded message. And I've\n4:50\ndefinitely done a lot of uh test runs on\n4:52\nit.\n4:53\nUh, yeah, plenty of test runs that came\n4:57\nback with, you know, okay results, no\n4:59\nresults at all. And right here, AMD,\n5:05\num, it'll tell me, um,\n5:09\nmy direct recommendation.\n5:11\nIt's going to give me my key drivers and\n5:13\nit's going to give me the key risks\n5:15\ninvolved and it's going to give um my\n5:21\nexplanation of um\n5:25\nwhat the uh financials look like. So\n5:28that's perfect. Thank you for tuning in."
}