{
  "student_name": "Lucas Velasquez",
  "org_defined_id": "037165853",
  "username": "velasqul",
  "email": "",
  "transcript": "Untitled video - Made with Clipchamp (9).mp4 Transcript Speaker 1 Hello, for today we'll be going through session 8. Speaker 1 We'll be talking about the efficiency market hypothesis and this AI slop problem that our professor made. Speaker 1 I'd be interested to see if the professor's actually grading or if the AI is, because I would like that to be included in my next feedback of my next low grade. Speaker 1 an AI, I think an AI grades this, but we'll see. Speaker 1 Speaker 1 First, we're going to define and discover. Speaker 1 We're going to analyze the GameStop short squeeze to evaluate the efficient market hypothesis. Speaker 1 We're going to discover and we're going to analyze the critical data verification and see if Speaker 1 GME traded at 0.04 cents, which is obviously false. Speaker 1 We'll have our core analysis. Speaker 1 We'll verify facts. Speaker 1 We'll test whether the efficient market hypothesis was violated. Speaker 1 And we're going to ask if a rational investor could systematically profit. Speaker 1 We're going to compare efficient market predictions to what actually happened. Speaker 1 We're going to use behavioral finance to explain the anomalies. Speaker 1 And some of the things we know from this problem is that GameStock was near bankruptcy. Speaker 1 And then they appointed a new CAO, Ryan Cohen, who bought some stock. Speaker 1 And then after that, there was a frenzy where GameStock peaked at $483. Speaker 1 And then in February 2021, Congress investigated if there's any wrongdoing. Speaker 1 Some key data, 140% Speaker 1 There was 140% short interest from institutional investors who believed that GameSock would go bankrupt and they would make money on the price of GameSock falling. Speaker 1 There was 10 times retail volume, probably higher honestly, which we'll prove later, which signified how big it became. Speaker 1 Rob Hood then restricted the stock of people buying it, which then caused it to fall. Speaker 1 Melvin Capital, who's one of the short sellers, had a 53% loss. Speaker 1 And analyst value for the stock was $10 to $40. Speaker 1 For stage two, we're going to represent and we're going to outline the step-by-step plan and execute the analysis. Speaker 1 So first, we're going to data, we're going to verify the data. Speaker 1 See there's stock price. Speaker 1 Communication, we're going to make this video. Speaker 1 Efficient market analysis, we're going to test all three efficient market hypothesis forms. Speaker 1 Semi-strong is the main violation that we'll see. Speaker 1 Systematic profit analysis, we're going to differentiate the money-making from systematic profit. Speaker 1 Comparative analysis, we're going to make a table. Speaker 1 Behavioral assessment, we're going to apply behavioral concepts like curve behavior and narrative to explain the event. Speaker 1 So obviously this had a lot to do with behavioral finance. Speaker 1 On stage 3, we're going to implement the analytical plan. Speaker 1 So now that we know what we're going to do, we're going to execute the data verification. Speaker 1 So the statement that GameStock traded at 0.04% is apparently incorrect. Speaker 1 They had a stock split, but the low, 2022 low, was 2.57 split adjusted. Speaker 1 And the price was around 3 to 4.50. Speaker 1 So that .04% figure is off by a lot. Speaker 1 If you go here, GME stock price, we'll go max. Speaker 1 Nothing around here was lower than 83 cents. Speaker 1 It looks like, you know, if you scroll through, Speaker 1 Obviously, there's the bump, but you can see if you just look at a chart that the stock price was not at.04, which would have been like 4 cents. Speaker 1 We're going to execute and test the market efficiency forms. Speaker 1 So the weak form was violated. Speaker 1 There was clear momentum, which allowed traders to profit. Speaker 1 And it violates the random walk idea that it was random. Speaker 1 there's a clear upward momentum, which is why people were buying it. Speaker 1 That was pretty much the only reason why they were buying it. Speaker 1 And if the weak form was violated, then the other ones are also violated. Speaker 1 So semi-strong form, public info was not known by most of the retail investors. Speaker 1 You know, they didn't know the revenues, the financials, and that kind of indicated that it wasn't Speaker 1 that people didn't have all the information or else they wouldn't have bought the stock, to be honest. Speaker 1 They're just going off the information they saw on Instagram. Speaker 1 Strong form violated. Speaker 1 Like we said, semi-strong is violated. Speaker 1 Strong forms violated. Speaker 1 For #4, we're going to evaluate the systematic profit and see if retail and rational investors can practice systematically. Speaker 1 Systematically. Speaker 1 The analysis is no. Speaker 1 Obviously, rationally, GameStock was not worth $480. Speaker 1 The real price of the stock was, I want to say, I want to say a rational investor could have profited a few dollars, but not to the same extent. Speaker 1 I think Hello Kitty's or whatever his name was, Tsis, made Speaker 1 was somewhat rational, but once the stock got a certain point, potentially over like $20, then it became irrational. Speaker 1 So I think people could profit a little bit at the beginning, but obviously once it got to a certain level, an investor can't systematically make money based on riding the wave. Speaker 1 They would have seen it as overvalued and as a black swan event. Speaker 1 So now we're going to execute, we're going to test the efficient market hypothesis predictions compared to the observed behavior. Speaker 1 So in the efficient market hypothesis, for all information is known, the fundamental value of the stock is around $10 to $40, but the price hit $483. Speaker 1 People know that 140% is short priced in. Speaker 1 but people didn't know or care, but then it became explosive fuel once people found out about it. Speaker 1 The efficient market prediction says it was random, but the price followed a massive coordinated trend from social media, so not true. Speaker 1 Investors are rational in the efficient market hypothesis, but Speaker 1 In this situation, they just said, they said, investors said they had diamond hands, which meant they were going to hold the stock regardless of the outcome. Speaker 1 This is irrational behavior because, you know, the rational thing to do is sell it at the most optimal price, but you're just holding it to make a point. Speaker 1 So it's not rational. Speaker 1 And in efficient market, shorters correct the price, but Speaker 1 They got bankrupt in the scenario, even though they were somewhat right that GameStop was a failed company. Speaker 1 In an efficient market, you have both sides kind of correcting each other, but in this scenario, the people buying the stock kind of beat the shorters and cause behavior that isn't normal. Speaker 1 And so now we're going to explain the behavioral finance applications. Speaker 1 So people act as a herd because other people are doing it. Speaker 1 They follow the same behavior. Speaker 1 once somebody sees somebody else having success, they try to copy them and the momentum just spreads because they don't want to get left out. Speaker 1 Narrative economics, I kind of fell into this category when I wanted to buy some stock. Speaker 1 It was kind of David Goliath story from the institutional versus retail investors. Speaker 1 People who are out just to make a buck versus people who actually like Speaker 1 profited like college savings versus just corporate corporate greed. Speaker 1 There's overconfidence and confirmation bias. Speaker 1 Hedge funds underestimated the herd and the herd ignored all the, you know, fundamentals. Speaker 1 Both were kind of entrenched in their own ways and, you know, were very rational and overcome. Speaker 1 and didn't really think of the different outcomes that were possible. Speaker 1 Prospect theory, shorters were in a loss spiral, which forced them to buy back at any price, stopped depleting. Speaker 1 It's not really an efficient market. Speaker 1 It's more of a behavioral financing because you can't lose money forever and bank up your company. Speaker 1 And stage four, we're going to validate our information. Speaker 1 So we check the stock price. Speaker 1 We talked about it. Speaker 1 We tested the efficient market hypothesis forms. Speaker 1 That's done. Speaker 1 The systematic prop analysis we did. Speaker 1 Efficient market versus reality, we did that. Speaker 1 Behavioral finance apply, we did that. Speaker 1 So we have successfully validated. Speaker 1 Now we're going to evolve. Speaker 1 And I have some code here. Speaker 1 I imported some of the... Speaker 1 stock prices and models. Speaker 1 And then we're going to calculate all these different kind of things, normal returns. Speaker 1 You have CAPM, things like that. Speaker 1 would kind of be more fundamentals. Speaker 1 And then as we go down, you can see the GameStock price, which we talked about earlier, but is now in a code form. Speaker 1 You can see that it doesn't go under.04. Speaker 1 The trading volume, it's over Speaker 1 You can see the rapid spike, which is not a normal occurrence. Speaker 1 You can see how people are just super interested in this one area. Speaker 1 And they just started rapidly buying. Speaker 1 So now for our final analysis. Speaker 1 The claim that GameStock trade at .04 is incorrect. Speaker 1 The actual price for that month was in the $3 to $4.50 range. Speaker 1 So that was correct. Speaker 1 We're going to talk the violations of market efficiency. Speaker 1 The weak form was violated. Speaker 1 There's no random walk theory. Speaker 1 Semi-strong form severely violated. Speaker 1 This is the core failure. Speaker 1 The market failed to price in public data like the 140% short interest. Speaker 1 And the strong form was violated because the semi-strong was violated. Speaker 1 Systematic profit. Speaker 1 No, this is a one-time event and it's not a repealable strategy. Speaker 1 Rational investors would not have held the stock as it approached 70, 100, 200. Speaker 1 People would have sold if they were rational because the price, the stock was not worth that based on every fundamental factor imaginable. Speaker 1 Efficient market hypothesis versus GME reality. Speaker 1 Price reflects fundamentals and in reality, Speaker 1 Price reflected a social narrative. Speaker 1 Obviously, you could see how more behavioral things affected the stock. Speaker 1 An efficient market hypothesis was kind of let down. Speaker 1 In theory, shortest correct price, but in reality, arbitrators were bankrupted by the price. Speaker 1 And in theory, markets are rational, but in reality, the market was driven by her behavior. Speaker 1 In the conclusion, Speaker 1 The efficient market hypothesis cannot explain the GME event. Speaker 1 The price action is, however, almost perfectly explained by behavioral finance. Speaker 1 Concepts like herd behavior, narrative economics, and prospect theory provide a more clear framework than the efficient market hypothesis. Speaker 1 It kind of proves that why markets are efficient, they're not always efficient, and behavioral factors can overwhelm fundamentals very often. Speaker 1 Thank you for watching the video. Speaker 1 I hope.",
  "video_url": "https://youtu.be/nX0QY-nIem4"
}