{
  "student_name": "Sherry Zhao",
  "org_defined_id": "037659129",
  "username": "zhao1398",
  "email": "",
  "transcript": "Hi, I'm Cherry J and this is my session A assignment. Sorry if I sound a little bit weird. Got a code. Anyways, let's start with the find and discover. Our objective is to investigate the market efficiency of GameStop short squeeze event. This analysis will test the event against the efficient March market hypothesis, evaluate behavioral explanations, and assess whether the observed anomalies constitute a true failure of market efficiency. A critical first step was to verify the Simon's claim that GameStop traded at 0.04 in August 2020. But a query of historical data found the claim to be incorrect after adjusting for the 2022 stock split. The actual low in August 2020 was 1.04 and the lowest price in 2020 was 0.64 in April. The squeeze pe in January 2021 was 10.75. Our analysis will precede this verified data. For the represent stage, we know that the analytical framework for this investigation begins with a quantitive data analysis using Python followed by a qualitative interpretation. The code plan involves four steps. Number one is fetching and verifying historical price data, which we just did. Number two is plotting price and volume on a linear scale to visualize the events magnitude. Three is to plotting price on a log logarithmic skill to analyze the percentage based buildup. And finally, four is plotting the 20 and 50-day move moving averages to empirically test the weak form uh EMH. The data will be used to test the three forms of EMH. The weak four will be assessed via the SMA momentum plot. The semi- strong forum be assessed by comparing the price action to publicly available information such as the 140% short interest and fundamental analysis estimates. The event's public nature makes the strong form test less relevant. Finally, the analysis will identify key behavioral biases and the specific limits to arbitrage that allow the anomaly to persist. So the implement stage will basically be the four steps we just described. Our first one like explained before such uh split adjusted data from Wi-Fi annex and prints the verification of the key price points confirming the discing the define stage. So after we rounding we can tell that um the 0.04 is not correct. It's actually supposed to be well 1.64 and um it peak is supposed to be 1 12.75. And then um we have a standard linear scale um to show its magnitude. The price action in January 2021 is so extreme that it renders all preceding history flat. Paling the events anomalous scale and the complete detachment from historical norms. So as we can see it's all um normal until this uh very abnormal peak. So from this we can conclude that the event in 2021 is just so abnormal that um it can be picked out. Same with the volume and the price. A logarithmic scale plot is required to analyze the percentage base buildup which is hidden in the linear chart. This view shows that the price appreciation begin steadily late 2020 corresponding with public news like Ryan Cohen stake. This is 2020 and this is the 2021 peak and it's logarithmic. So we can see that he made a pretty good option. And then finally the plot cirical test of the week for EMH shows a golden cross around October to November of 2020 well before the main spike. A strategy based on the past price data will have yield significant returns. Again this is like a very good investment choice because it just peaks off right after that. So as a conclusion of the implement stage, the analysis provides clear verdicts on the EMH. The weak four was violated as no momentum code block four shows that past price data has had predictive power. The semi strong form was massively violated. The market failed to incorporate public information like 140% short interest for months and then when it did react price completely detached from all public fundamental data. This failure is explained by behavioral factors including mass hurting via Wall Street BS and narrative driven investing. The anomaly was sustained by severe limits to arbitrage. the risk of ruin for short sellers such as Melman Capital, the astronomical cost to borrow shares and the structural failure of brokers restricting by orders at the peak. So now we can move on to the validate stage after we um presented our analysis. So we have verified our finding by several points. The sheer magnitude of the event is a 10,000% price rise. It's not it's not just a statistical noise, but a clear significant anomaly. Furthermore, the conclusions align with the broad consensus from regulatory bodies including the SE SEC and academic researchers. The event is widely accepted as a profound if temporary breakdown of market deficiency for the evolve stage. We talked about our implications of the analysis. It's very significant. The event provides powerful real world evidence for the behavioral finance framework demonstrating that sentiment and narrative can overwhelm fundamentals for investment management. It highlights the extreme risk of active strategies in meme stocks while simultaneously validating the risk mitigating benefits of passive diversified indexing. The event also served as a catalyst for policy triggering congressional hearings on market gamification payment for order flow and short sale transparency. In further reflect when I say that in synthesis the GameStop short squeeze demonstrated the boundaries of efficient market hypothesis. The EMH models built on the core assumptions of rational actors and near zero limits to arbitrage. The GME event show what happens when both of those assumptions fail simultaneously and spectacularly. was a perfect storm where behavioral dynamics amplified by social media collected with a fragile market structure. This allow price to detach from fundamental reality creating a def definitive case studying behavioral finance and the very real limits of arbitrage.",
  "video_url": "https://youtu.be/A3_RtPERQzs"
}