{
  "student_name": "Heidi Chen",
  "org_defined_id": "037430730",
  "username": "chen5063",
  "email": "",
  "transcript": "Hi, my name is Heidi and this is my session a homework. Um, so for this week the define is that the research goal we have a we have to design a systematic analysis to determine one which form of the efficient market hypothesis um were violated by the GameStop event, two if the event is better explained by behavioral finance concepts. Three, whether systematic risk adjusted profit opportunities existed for rational well- capitalized investors. Here's some critical data verifications. So, first upon verifying the historic data for the is for the critical first stop. So, Gamestocks sorry GameStop's stock did not trade at 0.04 in August 2020. The actual adjusted closing price range for August 2020 was approximately $1.04 to $1.67 according to Yahoo Finance. Here's the represent. Here is the event studied timeline. First, we have an estimation period between from August 2020 to December 2020 where the established where we establish the stocks beta and normal return pattern using capital asset pricing model. Um event period one is between September to December in 2020 where Ryan Cohen acquisition. It is to test for abnormal returns following the initial private information and public announcements. Event two event period 2 is January where the short squeeze peak happened. Um it is to test for massive abnormal returns during the Reddit driven mania. Number four is the postevent period from which is from February 2020 and onwards. It is to test for continued drift and return to a normal price. Here's the formula we'll be using. We'll be using the um abnormal rate return rate and the estimated return rate here where RT is actual return for GameStop and RMT is the market return. Here is the implement which is the code that asked that I asked Google Gemini to prompt for me and it calculates for the using capital using the two equations and we get the abnormal return analysis during event period from 2020 January 1st to January 10. And here's the like a pattern and for every day. And then here is the same period but with accumulated abnormal return. And according to the um efficient market hypothesis test during squeeze period which is January 2020 the average daily abnormal nor abnormal rate return is0.51%. And then the total accumulated um abnormal return is5.73%. So to validate or um calculation um the we have two methods. First one is statistical significance. Here I used it to here this is the t value that I used the data to cap to calculate with the hypo hypothetical mean of zero and a significant level of 0.05. So the statistic significance with the t value of 4.6 Six. This strong T value provides robust evidence against the no hypothesis and confirms the abnormal return observed during the GameStop event were not due to random market noise or expected fluctuation. So that there is a pattern during the event. Another one is economic significance which will be using cost benefit analysis which is to compare the calculated abnormal return against high transaction cost short selling cost borrowing fees and market impact that shows that the raw abnormal return is likely economically significant but the high cost and risk for the arbitrator limits its exploitability. So to sums up um the GameStop events of normal returns are overwhelmingly statistically significant and economically large. However, the limits to arbitrage are the key factors preventing these anomalies from being immediately corrected by rational investors. The persistent of the anomaly is therefore explained by these limits, not a failure of analytical models alone. Here's the evolve. In evolve we're going to see that the violations of efficient market hypothesis and the ex behavior behavioral explanations to the violations during weak form the um which um prices reflect all past price and volume data. So the violation to that is the enormous short interest and subsequent buying momentum created a pattern of predictable future returns. And the explanation to the behavior is the momentum trading and hurting which retail investors driven by social media followed a trend turning a technical pattern into a self-fulfilling prophecy. Semi strong form is that um prices reflect all publicly available informations. So that violation is the price of $483 widely diverged from the publicly known an analyst fundamental value estimates of $10 to $40. Um it is such a wide gap. So the behavior explanation to that is the anchoring and loss aversion. So investors anchored the to the stock director and experienced loss aversion on short position driven the price beyond rational limits. And the strong form is when prices reflect all information including private and insider informations. So that violation is that Ryan Cohen's acquisition of a 13% stake in December 2020, which is a nonpublicly known intent initially, leads to a significant price raise suggesting markets hadn't fully priced this insider activity immediately and that the explanation to this behavior is information asymmetry. Although Cohen's stake became public, the true long-term intent and the private information about the retail interest or short interest level were not perfectly reflected. And the here is another the strategic implications for per for portfolio management. So we're going to talk about the GameStop event reinforcing the most efficient view which are when markets are efficient enough that most active strategies fail after costs but ain't efficient enough that superior and analysis impatient capital can occasionally find opportunities. So first is the active versus passive strategy. So the GameStop invent argues for a hybrid approach where the core portfolio management should be passive indexing due to the difficulty of consistently beating the market. A small dedicated portion should be allocated to active strategies that specifically targets no market anomalies or exploit behavioral biases and limits to arbitrage in less efficient segments. And the next one is policy implications. The event highlighted significant market micro structure issues which includes trade settlements mechan settlements mechanics and margin requirements which suggests policy may need to evolve to manage risks introduced by high frequency high volume retail tradings. And to reflect I'm going to talk about the rational investor profitability analysis which is the differences between expose analysis and exonte analysis. Um expose analysis is where um people will see the events value the events after the historical factors which is after when event the event has happened. So in an expose analysis which is hindsight a rational investor could have profited profited handsomely by buying GameStop in August 2020 and selling near the peak in January 2021 but that is afterwards and we cannot travel back to time. So Xante analysis is before so we can predict how the future goes kind of. So for rational institutional investors, systematic profit opportunities were likely absent or too risky. So they don't see GameStop as a worthy um as something worthy to invest in because there's too much like risks happening. Um the initial runup post Cohen's announcement was a semi- strong violation, but the January squeeze was driven by non-fundamental factors and lacked information advantages. Irational arbiters aiming the short and stock to aiming to short the stock back to fundamental value would have been wiped out by the short squeeze demonstrating the severe unqualifi unquantifiable risks known as arbitric risk. So that just shows that before the event it is too risky to invest in, but after the event it is a good um deal to invest in to buy GameStop in August 2021 2020 and sell it during the peak in January 2021. But we cannot see the future and we cannot travel back in time. So beforehand it looks too risky and afterwards we lost a chance. Thank you.",
  "video_url": "https://youtu.be/9XBFei6eIpE"
}