{
  "student_name": "Isabella Wish",
  "org_defined_id": "037174968",
  "username": "iwish",
  "email": "",
  "transcript": "Hi, today I'm going to be talking about session 8 assignment market efficiency investigation and I'm just gonna take a deep dive right into it and hop right into the driver format. So first thing we're going to do is sort of go about our the given information that was given in the problem and all the context within that information. So the assignment asked for an investigation of the efficient efficient market hypothesis EMH using GameStop short GameStop short squeeze from 2020 to 2021 as a case study. Our timeline was in August 2020 GameStop GameStop neared bankruptcy. In September 2020, Ryan Cohen acquires 13% stake on the company. In January 2021, Reddit uh stated that Red Reddit said that wall in Wall Street bets drove a surge to $483. Uh and in February 2021, congestion, we get congestion hearings. The given data points, short interest is greater than 140% of float. Retail volume increased by 10%. Trading restrictions like Robin Hood were in place. Melvin Capital was at a 53% loss and analysis fundamental value was from 10 to $40. Next, we're throughout this in this assignment, we're going to have to verify the statement of GameStop having a trading value of 0.4 cents in August 2020. The financial object objectives of the video. So my primary goal is to use a driver framework to analyze GameStop event and its implications of the market efficiency. My video is going to include first the critical first step of the price point of 0.4 trading value uh test of which EMH weak semi strong or strong was violated. An analysis of behavioral basises hurting and overconfidence and their roles. An evaluation of limits of arbitr arbitrage arbitrage sorry. And a clear conclusion on whether the this event disproves EMH or can explain within a broader framework. Still in define and discover. So we're going to go over some understandings of financial terminology. Efficient market hypothesis. A weak form. Past prices don't predict future prices. A semi- strong form. All public information is already reflected in the prices. A strong form. All information public and private is reflected in the price. A short squeeze is a rapid increase in a stock's price triggered by a large number or of short sellers. Short sellers being forced to cover buy back or or buy back their positions. Float short interest or float is the percentage of a company's tradable shares the float that have been short sold. A value of greater of 100% like 100 like 140% is highly unusual and indicates extreme um bearish sentiment and high risk. Behavioral finance a field that argues the psychological basis like hurting uh affecting investor decisions. Limits of arbitrage real world factors like risk transaction co costs or game or in GameStop's case an inability to borrow shares to short that prevent rational traders from correcting mispricings. Now on to represent analytical our analytical plan and what we're going to find. So first is going to be the critical step. I need as I stated earlier I need to find out the actual historical stock prices of GameStop in August 2020. This is going to be the first implementation step a semi strong form test. So I need to find the dates for public information releases Ryan Co Cohen stake in September 2020 mounting a short interest data and compare them to the stock price. If the price didn't react immediately but rather slowly then and then explosively it's a strong violation of the semi- strong form. A weak form test. I'll look for the price chart which technically which while technical analysis is weak form couldn't predict the event the monumental driven runup in 2021 shows that past prices were being used by traders to make decisions which challenged the weak form behavioral biases hurting retailer traders coordinating on Reddit overconfidence uh belief that believe they could beat the hedge funds. So these are both different types of behavioral biases that will probably be seen in this case study. Limits of arbitrage. Why couldn't hedge funds just short it back down? Because it was too risky and costly. They faced margin calls. And this little insight right there is very important in the rest of the presentation. Now, still in represent, we're going to go over some formulas and concepts that may be used in this presentation. So abnormal return is going to be AR. Abnormal return equals the return of JME market and the return of the market where our market could where this part could just be the SPI 500 which is usually used as a baseline and that will quantify GameStop's return detached from the market. Short interest percent is short sold is shares short sorry sorry shares sold short overflow I'm not going to calculate this but I will use an 140% figure as stated in the key given points I previously said core concepts so the EMH forms limits of ar ar ar ar ar ar ar ar ar ar ar ar ar ar ar ar ar ar ar ar arbitrage and behavioral and behavioral biases are the main analytical tools that we'll probably be focusing on throughout this Now on to implement. I have two Python codes that I used to sort of back up all my statements. So my first impleation step as I said earlier is going to be the critical first step of verifying the trading cost of 0.4 cents in August 2020. And I'm going to go to that one. So up here we have the code. It's importing NES necessary libraries from Yahoo Finance and Pandas. So, first we're going to do the get GameStop data, get the historical data from 2020, and then they're going to filter out August 2020 to see that specific timeline. Display the data of August 2020. It's going to be open, high, low, and closed. find the absolute lowest price of that month, which will then see that'll kind of be what the trading value was. We're going to come down here to the run data. You can see everything throughout the month of August. And the critical finding is that the lowest price GameStop traded in August was 2020 in um in 2020 was a dollar, not 0.4 cents. I'm 04 cents. which so that invalidates the statement that we had to verify before. That was our first step. Now we're going to sort of widen that data range to visualize the entire squeeze event as outlined in my represent plan. This will be helpful to analyze the EMH and I'm going to go to my next collab. Okay, up here we have the data. We still have the importing information from YouTube Finance and Pamas. Um, we're going to define GameStop, sorry. Get data from the full event period. So, 2020 to 2021, that was stated as the squeeze period. Create a price chart. Um, we're going to have GME's closed prices that we saw in the previous collab and all prices from 20202 to 2021 price in USD dollars and dates. and we're going to have a label of the peak squeeze. The next then our second volume chart is gonna our second chart is going to be a volume chart. We're going to have the volume um GameStop's trading volume of 2020 to 2021, the dates, the share traded, the shares that were traded, which is the volume, and we're going to also have the peak squeeze event sort of highlighted. These are both of our uh charts. Sorry, let me scroll down. I would like to point out that in our first chart, the uh pricing is skewed to fit everything into the chart. It wasn't $80. As I previously said, prices went up to $483. That's sort of the skew of this chart, but it's you can still kind of see the trends. Um, and GameStop shows how many shades were shares were traded throughout the year of 2020 to 2021. And I'm going to go back to my implement to go into a deeper dive of the understandings standings of this chart these charts. So first as I said the chart is of for the first chart of price the chart was scaled and because prices reached $483 in 2021. Uh so this chart captures the famous short squeeze where traders betting against GameStop were forced to buy shares to cover their losses pushing the prices up dramatically and the volume spike uh below miring or beside mirroring the sudden surge is in trading activity. You can see price everything was low low. Then the squeeze hit and it shot up it and before you can see that prices for the tradings were at under $10. Um so the fact that it shot up to $483 is kind of insane and then it kind of went onto a big down and then it kind of started to go up and down again. But you can see the effect of the main like the main squeeze just kind of upping up prices basically permanently. Then we're going to go to our next chart which is the trading GameStop's trading volume. This chart shows the explosion of trading interest during GameStop short squeeze when retail investors flooded the market causing mass over turnover in shares. You can see all pretty low. There's a small spike right here, but nothing compared to the short squeeze. Um, and then it started to go back down again. That was my implement stage. And now we're going to go to validate. So the question that we have to ask ourselves, did it work? And what does it mean? That being our code and what did our code mean? So the code ran successfully. Now we're going to validate the output um that it gave us. So the validation number one, the claim of zero of 04 cents being traded. So the code output shows that the lowest price in August 2020 was a dollar not 04 cents. So that statement is incorrect. for the assignment. I will be then using the correction to sort of understand the real data of GameStop. Then the validation number two, the event charts price chart. So the price chart logically matches the assignment's timeline. We see low flat in 2020 following the truly um large vertical spike in January 2021. And then our volumes chart. The volume chart is just as important. It confirms the T-fold retail increase by showing a massive unprecedented spike in trading volumes that line up perfectly with price spike. Now to evolve the current state, we have a visual confirmation of the spike. We can see it in our two charts up here. there was a huge spike um for future evolution as suggested in the assignment. So we're going to calculate abnormal returns. Uh the next up would be to apply the KAPM framework. I would run an a regression of GameStop's returns against the S&P 500 which is the market proxy before the event to find its beta. And then I would do an event study. So I would then use the beta to calculate the expected returns during the squeeze and compare it to the actual returns. The difference between the abnormal returns which would be um statistically massive sorry and then a sentimental analysis. A more advanced step would then to be would be to then use the NLP which is the natural language processing to scrape the Reddit forum and qualifying market sentiments testing its correlation with its price onto our reflect. So was the market efficient? The weak form was violated. The entire event was a form of a form of mu momentum driven by social hurting. Past price action and Reddit post did influence the future buying and is a clear violation of the weak form. As for the semi- strong form, it was also clearly violated. This is the smoking gun. All information like the 140% short interest um in the Reddit plans was public. In an efficient market, the price should be insane should have insane in instantly reflected this. Instead, it built up slowly and then exploded by driven by behavior, not fundamentals. The $10 to $40 analyst estimates were completely ignored. Um the EMH um the EMH versus behavioral finance. So this event is a poster child for behavioral finance. It proves that markets can remain irrational longer than short sellers can remain solvent. Key factors hurting the social media and overconfidence real retail versus hurting funds and limits to arbitr arbitrage. The rational trade of shorting GameStop became impossible impossibly risky, allowing for irrational price to perish. Now, I'm going to sort of go over what each step had in the driver framework that I just went over. So, the power of define the driver for framework forced me to address the critical first step before doing any analysis. This saved me from using a flawed premise of a 0.04 04 trading value and immediately demonstrated a high level of diligence. Finance first co- second. The implement stage was not about writing a fancy code. It was about using simple code to answer specific financial questions from my represent plan. The charts I generated directly supported my financial conclusions. And for my conclusion, the GameStop event shows that while markets may be mostly efficient most of the time, they are not immune to behavioral biases. Social medias and structural flaws like limits to arbitrage can lead to profound and dramatic anomalies. Thank you so much for watching my video and I hope you learn from it.",
  "video_url": "https://www.youtube.com/watch?v=6kecsVsRfSQ"
}