{
  "student_name": "Andrew Kuper",
  "org_defined_id": "036275825",
  "username": "kuper",
  "video_url": "https://youtu.be/OwJ4GGBHKuE",
  "transcript": "0:00 Hello guys, this is, or I'm Andrew Cooper, and this is my project that I made for, uh, the Capstone Project, and it is a board-ready financial summary.\n0:12 For CFOs to give to, like, CEOs or other departments, so that they can understand the growth in their company. So, pretty much, It, like, the people that would want it would be, uh, CEOs, for example.\n0:30 They would love this. Other departments obviously would like this too. And CFOs would really like to use this because it pretty much puts the financial, like, numbers into words.\n0:40 So, for example, this is just one that I already created, but I'll, I'll generate it again. But if I generate this at these numbers, these are like the revenue.\n0:52 Here's the reporting period, the industry, the company, and then key drivers I didn't really exactly put because I thought it's not an actual company that I have, but people can find put that in and it'll type out.\n1:04 Now look, but yeah, so pretty much the revenue since it's negative from the last period, it's down 10% net income.\n1:11 Same thing. It's just like, if I update this to 1.2, 1.2 million and generate it, it'll show the. So it changes everything.\n1:24 Like, I could change it for all of them, pretty much. And then it has all the summaries listed here, and I can trash them.\n1:31 If I don't need them, and it gives you like a good example of, of like executive overview, key financial drivers, pretty much pretty much in like words, it puts the numbers into words, which this would be super helpful for a CFO.\n1:48 So yeah, pretty much. I think that this is a very good, uh, financial tool and that it would be used in companies because it makes it a lot easier to put financial numbers into words for, like, a CFO or the financial department.\n2:02 And that's pretty much my presentation. I can show you this. As well, the cash balance. Let's say we're at that much.\n2:09 Two million. Generate. It doesn't show up here, but it'll say down here. Something about, yeah, right here. I don't know.\n2:21 It, it, it definitely just says, like, this only has the, those six. It doesn't have cash balance because it, oh, no, it does have cash.\n2:29 I'm sorry. I'm wrong about that. But yeah, it has. And it shows the decrease. And then you can also change the reporting period.\n2:39 And it changes to July. Pretty much stuff like that. Generating, July now. Yeah, so pretty much this just creates, like, a pretty easy, like, understandable, in words, instead of numbers, uh, analysis of your financials for the month.\n3:00 I think that that is sort of it. You could also upload the numbers. It's easier to upload them if you have the actual sheet, but I didn't have an actual, like, financial sheet for a company.3:10 I just have, like, an app I created. So I just put an example there. But yeah, that's pretty much how it works."
}