{
  "student_name": "Charlie Garrison",
  "org_defined_id": "036207648",
  "username": "garris26",
  "email": "",
  "transcript": "Hello, welcome to session nine for management 310 financial management. And in today's uh assignment, we are going to be calculating the weighted average cost of capital specifically for Netflix in connection with hypothetical five $5 billion content investment decision. And my analysis is determining the current WA uh whack and evaluating the impact of additional debt financing as well as uh assessing project specific versus firmwide discount rates. And then finally comparing Netflix's cost of capital to industry peers uh like Disney as you'll see later on. Um, and here are this this is like the actual framework that we're looking at the steps uh in this assignment. So, first we want to calculate Netflix's current uh whack. And we're going to be doing this by we're going to define what whack is and its uh equation and then put in the given financial parameters here. And then next we want to calculate whack after the three uh dollar billion debt issuance for Netflix and we'll see how that changes in our formula. And then third we're going to evaluate the project specific whack. So this is the US content versus international content um and see how those compare to each other. And then four compare Netflix's whack to Disney's um and explain the differences and why that might be. And then finally recommend the optimal capital uh structure strategy. Um so for uh that's that's the first define and discover and next in our driver framework we want to represent. So before we look at any of oh I guess we I should look at uh here is the financial parameters that they gave us. So we can see this is for Netflix. uh its market capitalization is at $200 billion. Its total debt is at 14 billion. Um it's the market that's the book value and then the market value is 13 billion. Uh the beta is at 1.3. Uh the bond rating this is basically just saying it's a B+ at uh 5.8 yield rate. Um and then the corporate tax rate is 21% and the current stock price is 450% or 450. And this is all hypothetical. So Netflix's real numbers uh vary from this huge but this is just for the sake of the assignment. Um and we also want to take in consideration the market conditions. So for this specific market the risk-free rate which is if you're investing in a in this case 10-year treasury is at 4.5%. The market risk premium is at 5.5% and then the media industry whack range is from 8 to 10%. Um, so that's kind of just like the average whack in the industry if you will. Um, and we'll be using all these numbers in the whack and CAPM formulas that I'll show you in just a second. And then the strategic context. So this is when this is Disney's uh or like the industry I guess. So, Disney's capital structure is at 70% equity and 30% debt. Um, which gives it a a whack of 8.2. And then Amazon Prime Video uses Amazon corporate, its whack is at 9.5. And then Netflix is considering a $3 billion additional debt issuance for content investment. Um, so that's the hypothetical that we're going to be looking at. Um and so for our represent uh section we want to first define what is wax. So wax weighted average cost of capital which tells the company how much it costs them to use money uh both debt and equity to fund a project. Um and an important uh part of whack whack that we want to understand is the hurdle rate. So this is the minimum return a project must be. So for a company uh to use whack as a hurdle rate. So if if a project earns more than the whack, they want to accept the project and if it earns less than a whack, then they want to reject it. Um and this just tells you if the project will be successful or not given the whack rate or just given the whack. So if it doesn't beat the wax, why is this? because if it doesn't beat the whack then the project isn't guaranteeing enough return to justify the risk of taking on the project. Um and then some other important understandings capital structure is mix of debt and equity. More debt leads to a higher risk but cheaper financing and then more equity is safer but also more expensive for people putting in money to that company. Um, and then finally, interest is tax deductible. Um, we'll see this later with the tax shield. So, if you have uh more debt, you get uh a higher percentage off on your the tax, which is why it's called the tax shield because it lowers the effective cost of debt. Um, so it actually becomes cheaper, which I at first I didn't understand like having more debt be makes the debt cheaper, but I after looking at how the tax shield works, I actually made made a lot of sense. Um, and also when we talked about it in class, that helped as well. Um, so here is v a visual look at what the capm formula is or I guess first we want to look at the whack formula um because that's the main one that we're going to be using in Google collab. Um and so you can see that it basically takes the um cost of equity and then it takes the percentage. So it takes the cost of equity and then the percentage as well as the cost of debt and then the percentage um of of that. And you can see right here um the cost of debt or you can see that the tax rate which we'll use uh here and then well it it will it will show it all in Google Collab like I gave it a prompt telling it to uh put in all the financial uh parameters that it gave us and then you you'll see that it calculates all that by itself. Um so as you can see like all like the tax rate is given here. Um tax rate is 21%. So it plugs in all these numbers based on uh what it's given. Um and then the capital asset pricing model which we've worked on the past two sessions is actually in inside of uh the the WAC formula because it's the cost of equity. Um so the CA cap m is to get cost of equity and then cost of equity is in the whack formula. So a higher cost of equity I believe leads to a higher whack as well. So you can see how that correlates. Um and then this is also important because uh CAPM uses beta which is given to us here 1.3 beta um in all of these uh so that is a represent um framework and that now we're going to show uh how we actually implemented this um and so here is the prompt Uh, oh yeah, here's here's the prompt that I put into Google Collab for it to calculate or plug in those numbers. I said, \"Write simple Python code that calculates Netflix's whack using the following assumptions.\" Um, and so I gave I I pasted the or I copied and pasted the financial parameters it gave me. And then I said make sure uh that it answers the following questions which is calculate Netflix's current whack. Determine whack after the three billion dollar debt issuance. Evaluate project specific whack. So this is the US versus international content. Uh then compare whack uh from Netflix to Disney. And then finally uh recommend optimal capital structure strategy. And I I told it to put it all in one spot at the end. Um, and so this is what I ended up getting here. Uh, so this is the analysis. strategy and I I told it to put it all in one spot at the end. Um and so this is what I ended up getting here. Uh so this is the analysis. Um I got the cost of equity for Netflix is 11.65%. Um and then you can see that the after tax cost of debt is at 4.8 4.58. And so using these two numbers, we got the whack. So the whack after the new issuance of $3 billion debt is at 11 uh or before it was at 11.22. So that this is with like before the issuance of the debt and then after it you can see that it's 11.13 which is lower and it shows that we'll talk about this later on but it shows that like having more debt in this case for Netflix actually lowers the whack um because they get the tax shield and other benefits. Um and then we can see um next is the project pacific whack. So this is uh comparing US to international whack. And you can see that the US is lower at 11.22 um and the international one is a whole percentage above. And this shows that international uh markets or content is riskier to invest in uh than the US markets. Um and this could be for a multiple of reasons, but uh it really comes down to just the amount of money that that goes into uh funding the the company. And if it's at a higher whack, then it's not going to accept as many projects. So the company will doesn't have a high as high of a chance of growing. Um, and so you can see that the US's whack is lower. Um, so it's an easier hurdle or it's an easier um hurdle or you can accept more projects pretty much. Um, and then next is comparing Netflix's whack to Disney's. Um, and you can see that it does this here. So, you can see Disney's is at 8.2, which is way lower than Netflix is at 11. Um, and we c we concluded that Netflix's whack is higher than Disney's because uh Netflix uses less debt. Um because Disney's debt was at 30 billion which was or was 30% of its equity and Netflix's debt was at or debt percentage of its total equity was at 6% which is much lower. Um additionally uh Netflix has a higher beta which means that it's just a riskier company to invest in. It's a risk riskier stock. Um, and it also misses out like we were saying on the tax shield that Disney gets for having the higher tax. Um, so like the actual like whack like graph if you see it. Um, there's like a medium of debt to have. So it's not it's good not to have a low amount of debt, but it's not good to have too much debt. there's like a good median that we'll see later uh in our evolve stage um which is best for uh the tax shield benefits. Um and so the final recommendation that Google Collab came up with is Netflix should add a moderate leverage to move forward uh specifically a 20 to 50% debt ratio uh which is closer to like Disney's 30%. Um so this increases cheap tax advantaged debt will lower Netflix's whack towards the industry range which is around 8 to 10%. And expand the number of positive NPV content uh projects it can produce pursue. So this is just how many projects they can accept um having the lower this new lower rate uh with the NPV which is just how much it's worth like or like the value it's worth today how much the value of a project is worth today and if it will pay pay off pay off or not based on if it's high or not. Um and so those are our implement stage. So our next stage is to validate. And so uh we did this by first calculating Netflix's current walk or whack determining whack after the $3 debt insurance evaluating project specific whack. um comparing. So this is pretty much the validate stage was like the co like collab we cuz we we gave it the structure to make sure um that our data was reliable. Um so this is kind of just already like what I already showed this and explained it. Um so that that was our validate stage. Um and next is our evolve stage in our driver framework. Um and so this is where you can see how the sensitivity matrix a affects uh the wa the whack. Um and like we were saying earlier so h how does the whack change if interest rise or if Netflix's beta increases um and so you can see that based on the different betas that uh Netflix would hypothetically have. So if it had a a one beta, which is less risky, um at a certain RF percentage, you can see that it's much lower. And if it had a higher beta, say at 1.8 all the way here at the right, um that it would have a whack of 12.86. Um and so this really just shows, and here's the the collab that I ran for it. Um, and this just shows that it's directly uh having a higher beta is directly correlated with having a higher wh uh whack as well. Um, which shows they both kind of say the same thing. So they're they're both just telling how risky the company is. So if it has a higher beta and a higher whack, it's takes more to invest in um and it's riskier. So it may you can't accept as many projects and it may not pay off. Um and then the insight two was the optimal depth search. So this is loop through different depth levels to find uh mathematically the lowest whack. Um and so this is basically saying what like like I was saying earlier how you don't want to have too much debt but you don't want to have not enough. There's like a good middle ground. Um, and so this is just trying to optimize h what the lowest whack you can get for Netflix's case based on how much debt that they have. Um, and as you can see, the lowest whack here is all the way at the bottom at 10.38. And it also happens to be the highest um added debt, issued debt, and it also has the highest savings for investors. And the final um insight that we have is estimating the total amount of shareholder value when the whack decreases. Um so this is like we were saying earlier with like the savings. So a firm value at the current whack is at 53.4 billion. Um and then the firm value at the optimized whack is at uh a much higher 57.83. Um and this this shows that just having that uh additional debt uh created over $4 billion for shareholders, which just shows how important having a lower whack is for the company and for shareholders as well. Um, in our final stage of the drive framework is to reflect. Um, and what really surprised me is I didn't realize how sensitive whack was to changes in risk-free rates and beta as well. Um, I knew that having lower beta was a safer and uh situation, but I didn't realize how small of a change like a small increase can raise whack like insanely high. Um, and I also learned that the debt can be truly valuable tool. Uh like we were talking in class how Peter Lynch was saying how debt can be used uh to benefit a company rather than something to like be feared of because most people when they hear debt is like something negative but you can really turn it into something good like in this example um where you can get tax deductions um and overall increase your savings and shareholder value. Um, and then finally, Disney's use of debt makes sense because I can see how their higher leverage gives them a lower whack. Um, and it allows them to accept more projects at lower required returns. Um, and I believe that if Netflix were to incorporate something similar to Disney's um, approach that they would also have a lower whack as well. Um, that's it. Thank you for listening.",
  "video_url": "Part 1 https://youtu.be/yE4IlduhGXc\n\nPart 2 https://www.youtube.com/watch?v=2Esjgh_Gh5w"
}