{
  "student_name": "Kayla Lee",
  "org_defined_id": "037191790",
  "username": "lee4991",
  "email": "",
  "transcript": "I'm Lee and I'm going to do explain my cost of capital analysis with the hypothetical scenario with Netflix for this session. And I'm going to use the calculated weighted average cost of capital for Netflix in connection with the hypothetical $5 billion content investment. And so I'm going to first calculate the current walk. So I'm going to call it that, which is the weighted average cost of capital, evaluate the impact of additional debt financing, assessing project specific versus firm wide discount rates, and also just comparing Netflix's cost of capital to also industry peers. In my case, I'm going to use Disney. So here are the hypothetical financial parameters. the market capitalization is $200 billion. This is the total debt, $14 billion. The market value debt, which is $13 billion. The equity beta, the corporate tax rate. So all of these conditions I will explain using for my analysis. So it shows like the Netflix financial parameters, the market conditions, and then like strategic content and required analysis for that. Okay, since I defined it and discovered what we're doing with the cost analysis, I represented the data by using the Google Pro Gemini and uploading Python code into the Colab. um So here, there are three stages I used. The first one is before of how Netflix is like currently. The second stage is after the three billion dollar debt issuance and then the third I will do a comparison between them. So first here these are just again the financial parameters between and now here we do the calculations. So for example So with here... These are the general formulas used. So calculating the cost of equity, we use the capital asset pricing model formula, the CAPM formula. So that is the RF plus the beta lever times the MRP. So that was the calculation for finding the cost of equity. We use different analysis, like calculating the after-tax cost of debit here, which is using the pre-taxed rate and then subtracting one. minus what was given here. So this was 0.21 of the corporate tax rate. So using these formulas, we were able to, you know, for the other ones, like calculating the walk using, so here like we had to divide E, the equity. divided by V, multiplying that by the cost of equity and then adding D divided by V times the after the tax debt cost. So. I moved into the stage of like determining the capital structure weights, which must be calculated using the market values and not just the book values. So using the Netflix data, the first step was just to compute the total value of the firm, which is what I did here. So I first calculated the cost of equity and I also calculated the after-tax cost of debt as well, which was also just the sum of the market value. And then here we can see the firm's market capitalization and then representing that also with the outstanding debt. So we're using the $3 billion debt as our financial hypothesis scenario. So like I said before, which is simply just the sum of the market value of equity E and then the market value of debt D. So here we can see that this is E, so the market's firm capitalization, and D represents the total market value of its outstanding debt. Once the total firm value was actually established, I was able to calculate the proportioned weight. So here, these formulas, I was able to represent M. So I calculated the proportional weights of the equity weight um like E divided by V, and then also the debt weight of D divided by V, which we again use later on. And so next I also computed Netflix's cost of equity using the cap and model. using the provided inputs, we see. We see here, this is the risk free rate of 4.5%. We have the beta of 1.3 and then a 5.5 % market risk premium. So we use that CAPM formula. And then with that, after, you know, 0.045, addition to 0.055 times 1.3, we get 0.1165, which let me show right here. Here, this is 11.65. So this is the cost of equity. currently so we're currently looking at the current stages this corresponds to about like 12 % if we rounded but in the exact form it's 11.65 % I then calculated the after-tax cost of debt using this formula as well so remember it was like 1 minus of that 0.21 so 21 % with that value this equals to about 4.582 percent so about five percent when we round them. for also and then we also do the capital structured weight so this combined the market value of the firm which was around 213 billion that was from the given earlier with the parameters and then using that total the equity rate came out to be about 93.8997 percent so around 94 percent and the debt weight was around 6.103 percent so this is the equity capital weight equity rate and then the debt weight so that means so all these total it adds up to 100 which is the total value weight of the market and with these values i was also just able to compute the current walk using the formula I stated earlier between using all the cost analysis and that ended up being a total of 11.219%. Now implementing that, so now we have an understanding of the current weight, explaining it and understanding it as now an analysis of using the three billion afterwards. So in the earlier stages, I was able to build like a baseline using the Python script to compute Netflix's walk. But now I'm now going to explain how I was able to use the additional three billion with the debt financing and how that affects the market and also the company of Netflix as well. So using the update with weights, so I first increased the market value of a debt by $3 billion, raising the total debt to 16 billion and the total firm to 216 billion. Since now the total uh firm value is 216 billion, I then was able to recalculate the capital structure weights using the new capital structure. So under the updated scenario, so after. The equity rate became at 92.59 % and then the debt actually rose to 7.407 % So now this is the new calculations same formula, but now with the different numbers this ends up having the new walk being 11.201 % which is less a little bit less than the current Walk percentage so this revised walk fell slightly representing decline and this behavior aligns with the core corporate financial logic that the firm substituted a small share of its costly equity financing which was 11.65 % with the cheaper tax advance debt which was the 4.5 % that we calculated earlier. So as a result the weighted cost of the capital decreases which shows a direct demonstration between the debt cost shield benefit. So we see was it a good idea was it not a good idea and I will explain that more later on. you I also want to state that noted simplifying, we know that the beta is 1.3 and the pre-tax cost of the debt stayed at 5.8%, but in reality adding this leverage would likely increase financial risk and a more leverage firm would likely experience a higher beta and a higher borrowing cost. So this kind of evolves the stages of the financial market, which I will address later by re-leveraging the beta in our different analysis. and then reflecting how that leverage was increased. So now, to implement this model to be more dynamic and adding more to it, so my first attempts, I had... different errors because I didn't produce enough information involving the codes, but this one I made sure to add different ratios and then implementing the calculated ratios beforehand to have a better general idea of what we're trying to understand. So I was first able to, let me pull it up right. here using like the beta scenarios and also just visualizing it. I also made a graph that I will show later on just to show analysis of like before after and then just a comparison of the two as well. And so we also understand the different financial inputs like relating to market cap, beta and the cost of the debt. So the model we can use it and recalculating it with the 11.2 % and then the 3 billion debt for the scenario. So we can confirm that it's working. Here we see the difference between the two. So now as a result, the 0.1 increase in beta raises the walk by roughly 0.51%. Excuse me. And then a 0.5 increase in the market risk raises the premium walk by also 0.61%, which we calculated early on as well. I didn't mention before, but that was the sensitivity analysis using these formulas. And now we're going to compare the sensitive analysis comparing to the walk itself. So now to kind of validate like kind of everything we did with these calculations, because what do these calculations fully mean? If we look closer in between these two, we see that the cost of equity for the current is 11.6 and then the cost of equity for the one is 11.7 it increases barely if we subtract these we see how little of a difference the new leveraged beta we like well we already know it's like 1.3 but you know the after the after tax cost of debt here's 4.82 the capital weights the equity weight the debt weights they well, debt weight increases, but the equity weight decreases. And we see that because in the capital weights, we have 16 billion here with the equity of 200 billion. So if we see this change of 0.0176%, which is a negative value, and it's a marginal decrease indicating that there is room for more debt as well. And now we compare that. So I implemented Disney, Amazon, and also just media industry range. And we see that Netflix currently has the highest walk. um With this hypotheticals and then Disney like they're like hypotheticals But it's linear to how it currently is and so in conclusion Netflix's walk is higher due to the lower leverage So meaning a lower a less tax shield and then they also have a higher beta value, which is important Which is the depth value because it gives us more of a wiggle room So just kind of like validate my understanding I was able to compare them to like real-world scenarios in that case different companies and so you We can see that Netflix's higher walk is also consistent with its higher beta and more volatile performance profile compared to other diversified traditional media firms. So that's why 11.219 is higher than Amazon or Disney Walk as well. Also against Disney, whose walk is 8.2%, the major difference is the capital structure. So Disney's finances are about 30 % of its operations with debt, while Netflix uses only about 6%. So that was the data that I... to like hyperdently Google around. So this shows that Disney kind of relies more on the cheaper tax advance debt and it's lower than its walk. So this comparison supports that the financial logic behind this model, the fact that Netflix isn't a better boat. Now, how can this model evolve? So I explained earlier about how we got these calculations specifically. Looking more into also what happens with the ratio hypothetically. Assume that it increases here, it becomes more leverage. This stimulates the real-world effect where higher leverage leads to a higher credit risk. So we see that if the DV ratio is less than 0.1, it's only 0.0158, which is like the return that we calculated. earlier on if it's less than 0.25 there's it returns a little bit higher so there's less of that cushion of a wiggle room again that kind of sequence goes on here and then now I'm going to show just more of like advanced extensions to what I did so I did the first two between the current and after and now and then the peer comparison and so this is the model so Netflix should not apply as like a result Kind of like what does this mean looking at the data? What's our conclusion? Netflix should not apply its 11.22 percent walk uniformly across all the projects because different projects carry distinct levels of risk which we establish within the franchise and the continuation and it also may have low uncertainty as well while a completely new Different market might take the initiative and might be a little bit riskier or less riskier. We can't really predict that as well Netflix should therefore adjust its walk upward for risky projects so an additional 2 to 3 percent and also a little bit downward for like the safety ones just because it's safe there's not risk to it so it's less of expansion and growth for the money. Second, the three billion dollar debt scenario assume no change in beta or borrowing costs so there's also a more refined approach which would involve unlevering Netflix's current beta to find the asset beta and then re-leveraging it To use the debt to equity ratio to estimate the true cost of equity under the new leverage level so we see that because when we calculated the debt to equity ratio So also here are just like the general formulas I wanted to say that just so then there's an understanding of what happens after a tax So we use the pre-tax amount and then a complement of that and then also just a firm value of using the equity and the debt ratio Equity and debt values as well oh you So this adjusted walk would likely be slightly higher than a simplified estimate. And it also just reflect better with a realistic approach. now reflecting on kind of what we did and how they work together. So Netflix's current capital structure is fine. And financing 94 % of the firm through expensive equity results in a higher than necessary walk. So the walk is a little higher than It needs to be or how it should be and so my scenario kind of shows that like increasing the lever leverage so Now more of an exclamation on the model. So this is Amazon. This is Disney. This is the new rate the current so we see that it only increases a little bit with that billion change and then this is just Netflix's walk in general, so this shows the current that D divided by V and then the new one as well between these different percentages. So this suggests that Netflix is kind of operating on the wrong side of the optimal curvature structure of kind of what should happen between the debt to capital ratio. So I have two strong recommendations for that. For specific, the $5 billion content investment. So funding $3 billion of it with debt is valid and makes a lot of sense just because We uh see that change within the uh walk structure because we see that it decreases it. so adding three billion of that would be beneficial. And then also long term Netflix should deliberately increase its debt to capital ratio to closer align with like peer firms such as Disney. So we see that like Disney and Amazon, they're lower. We want to make it lower as well. So they should try to implement that as well. Doing so would also decrease the walk and then also lower the hurdle rate for like new content investments and ultimately also like shareholder value creations which will help the company's health in the long run. these two implementations will be beneficial so then the investment in return will have Netflix's walk be closer to like Disney or Amazon or the different industry ranges. looking back, I also forgot to mention that it's also just important to kind of address the specifics of the walk itself. It would be a mistake if Netflix just kind to put all 11.2 % of their walk into just one investment decision. And the risk associated with producing safe domestic SQL is also very different of using that risk in an international market, which would have an entirely new different series. And so I kind of recommend treating that 11.2 as a baseline understanding and adjusting it depending on the project risk level as well. So adding that premium of a different risk, risk initiative percentage and also applying a lower rate for stable projects will be better in the long run for predictable cash flows as well. And then this approach also aligns with the divisional cost of capital principle, which states that different business units or categories should use distinct discount rates that reflect their specific risk profiles as well. So having that uh baseline is better for us to understand. as well. That was my explanation and analysis using the walk sensitivity and debt to capital ratio comparing Netflix to different programs like Disney and Amazon as well. We see this graph analysis here and what my recommendations are for Netflix moving forward.",
  "video_url": "https://youtu.be/qiPA6lRUNYc"
}