{
  "student_name": "Jorge Navarro",
  "org_defined_id": "037062595",
  "username": "navarr87",
  "email": "",
  "transcript": "Hello, my name is Jorge Navarro, and in this presentation, I will be conducting a Capital Budgeting analysis for Starbucks' proposed flagship roastery. This project requires a significant upfront investment of $12 million, and my goal is to determine if this allocation of capital will create shareholder value. To ensure a disciplined and transparent analysis, I've utilized the DRIVER framework, Define, Represent, Implement, Validate, Evolve, and Reflect. I have implemented this entire workflow using Python to ensure the model is reproducible and capable of handling complex sensitivity scenarios. So let's begin with the first stage, which is Define and Discover. And in the Define and Discover stage, my objective was to translate the case study parameters into clear Python variables. So, um, as you can see here in the project_inputs dictionary, which is this right here, I have mapped out our core assumptions. So, the initial investment is $12 million. We have a project life of 10 years. We have a working capital of $500,000 outflow at year zero um fully recovered in year 10. Then, we have um our WACC of 8.5%, which is our hurdle rate. Then we have a structured revenue assumptions, which is $8 million in year 1, $11 million in years 2 through 5, and then $9 million in years 6 through 10. So by parameterizing everything here, the model can be updated instantly for sensitivity tests without rebuilding the logic. And at this stage, I also clarified the guiding questions. Does the project create value? What risks matter most? And how sensitive is evaluation to revenue or discount-rate changes? And these questions framed the rest of the analysis. So now, what we'll do is we'll move on to stage two of DRIVER which is Represent. And in this stage, I built the logical structure of the model using a Python class named RoasteryProject, which is this class right here. And um this object-orientated structure keeps all the assumptions and calculations organized and reproducible. So in the calculate_flows method, which is the engine of the analysis, I represent the core financial relationships. So we have Operating Expenses, which is COGS at 40% of revenue, fixed labor at $2.5 million, and rent/utilities and marketing. Then we have Depreciation, which is straight-line at $1.2 million per year. And this lowers taxable net income even though it's non-cash. Then we have Taxes, which is applied at 25% on EBIT. Then we have our Operating Cash Flow, which is uh NOPAT plus depreciation. Then we have our Working Capital, which is subtracted at year zero and then added back at year 10. So for the Terminal Value, the asset is fully depreciated by year 10. The $3 million assumed sales price becomes a taxable gain, and then I subtract the 25% tax and add the net inflow, along with the working capital recovery, to Year 10's cash flow. So this structure fully represents all accounting and cash flow relationships needed for capital budgeting. So now we're going to run the code and move on to the next stages of DRIVER, which is Implement and Validate. So we'll begin with Implement. And um in the Implement stage, I executed the code and generated the cash flow schedule. And in the schedule, which is right here in this output, at year zero, we have a net outflow of $12.5 million, CapEx plus working capital. Then we have years 2 through five, which is our highest cash flows driven by $11 million in revenue. Then we have year 10, which is a larger cash inflow due to OCF, plus working capital recovery, plus after tax terminal value. So after um doing the Implementation stage, we now have to move on to the Validate stage of DRIVER and Validation ensures correctness. So when doing the Validation check, we um ensure that the working-capital check confirms the inflow and outflow net to zero. And then I also validated that depreciation summed up to $12 million over the project's life and that year 10 appropriately includes the terminal gain, which I was able to validate that all of this is correct, and that allows us to pass the Validation stage of DRIVER. Next, what we'll do is we'll move on to the Evolve stage and um in the Evolve stage, I stress-tested the project. So our Base Case results have an NPV of $2.69 million, which is positive, and it means that it's value-creating. Then we have our Internal Rate of Revenue(IRR), which is 12.84%, which is well above the 8.5% hurdle rate we have, or the WACC. Then we have our Simple Payback, which is 5.28 years. Then we also want to include our uh Discount Payback Period, which is where we recover the present value of the initial investment, also shown in the output with discounting applied at 8.5%. And then recovery occurs at roughly 8.21 years using the Discounted Payback and this is expectedly longer than Simple Payback and confirms that the project returns capital well before its 10-year horizon. Then we also have our um Profitability Index, and I also computed the Profitability Index, which um gives us a resulting PI of 1.22. So this means that for every $1 of investment, generates $1.22 of present value benefits. So now we're going to move on to um our Scenario A. And this is where our revenue is negative 20%. So reducing revenue by 20% drops our NPV to um negative $3.08 million, and this shows the project is highly sensitive to volume risk and cannot absorb major demand shocks which is what we're learning here in the Evolve stage. Then we have our WACC sensitivity, which um sweeping discount rates from 6.5% to 10.5% shows that NPV remains positive even at the upper end, and this means that valuation is much more sensitive to revenue performance than to the cost of capital. Then we also created a visual here which um shows the visual of the sensitivity analysis, and this is a bar chart that I made, and it illustrates this clearly. The green for the base case, the red for the stress case, and this is the visual representation of what I just explained. So now what we're going to do is we're going to move on to our final stage of DRIVER which is Reflect and then I'm going to give a recommendation. So, finally in the Reflect stage, I assess both the modeling process and the results. So for our reflection, the DRIVER framework forced me to separate planning and structure from coding, and this prevented rework later. And then we represented the model in a class, which helped ensure transparency. And then we have a sensitivity analysis that highlighted that revenue assumptions, not discount rates drive project uncertainty. Then we have the structured approach also made it easy to audit, validate, and communicate results to non-technical stakeholders. And then for my recommendation, I would accept the project, and for the following reasons: Beginning with financial strength, our NPV of $2.69 million, we have an IRR more than double the hurdle rate. And then we also have a Profitability Index of 1.22, along with a Discounted Payback of 8.21 years. So for our strategic fit, a flagship roaster strengthens brand presence and likely generates additional marketing value beyond what's captured in the explicit cash flows. And then we have our Caution, which I just want to um, let it be known that because a 20% revenue drop destroys value, Starbucks must ensure that a strong location selection is chosen, that aggressive year one and year two marketing is uh put into place, and then tight labor and cost controls are also put into place. So with these into place, the project should create meaningful shareholder value, and I want to say thank you, and that concludes my DRIVER analysis of the Starbucks roaster project.",
  "video_url": "https://youtu.be/o2sG4tKLtTk\n\nor (if the first link does not work)\n\nhttps://youtu.be/o2sG4tKLtTk?si=KODqaKSlUlVfbiOY"
}