{
  "student_name": "Jorge Navarro",
  "org_defined_id": "037062595",
  "username": "navarr87",
  "email": "",
  "transcript": "Hello, my name is Jorge Navarro and this video presentation is a walkthrough of my Cost of Capital analysis for Netflix, structured using the DRIVER framework. The primary goal of this assignment was to analyze a hypothetical $5 billion content investment by Netflix. To do this, I was required to answer five key questions. First, what is Netflix's current Weighted Average Cost of Capital or WACC? Second, how would this WACC change if Netflix issued $3 billion in new debt to finance it? Third, should we use this firm-wide WACC for all projects, or do we need a project-specific WACC? Fourth, how does Netflix's WACC compare to its peers like Disney and Amazon? And then finally, what is the recommended financing strategy for this investment? So, my entire analysis is contained in this single Python script that I created. And what I'm going to do is I'm going to walk you through, stage by stage of DRIVER with my project. So, we're going to begin with Define and Discover. And um we're going to run the code and we're going to go to the output. Okay. So my process begins with stage one which is Define and Discover. In the Define phase, I identify the decision Netflix faces, evaluating a large long-term content investment by determining the correct cost of capital to use, analyzing capital structure impacts, and comparing Netflix to industry peers. I also define the underlying uncertainties, how sensitive WACC is to leverage, whether firm-wide WACC is appropriate for individual projects, and how Netflix's risk profile compares to Disney and Amazon. So, in the Discover phase, I gathered and organized all inputs into my script as variables. And this includes the given data with Market Cap of $200 billion, Market Value of Debt of $13 billion, Equity Beta of 1.3, a Bond Yield of 5.8%, Corporate Tax Rate of 21%, Risk-Free Rate of 4.5%, and a Market Risk Premium of 5.5%. Excuse me. I have also documented my modeling assumptions here. So for example, I use market values, not book values for capital structure weights. I assume the bond yield reflects Netflix's marginal cost of debt. I assume beta appropriately captures the business risk embedded in equity markets. I treat the new $3 billion debt as added at the same yield since no alternative yield was provided. And these assumptions ensure transparency before my modeling begins. So now what we're going to do is we're going to go to stage two of DRIVER which is Represent. And as you can see this right here is the model, or this is my code for Represent, and we're going to go to the output. So in stage two, I plan the structure of my analysis before writing the code. So I just implemented it (the structuring) into the code. So my objective was to make the model modular, transparent and repeatable. So to do that, my Representation stage lays out a set of Python functions that each handle one component of the capital structure. So as you can see here, the Represent stage includes a CAPM function to compute cost of equity. A function for after-tax cost of debt. Functions to unlever and relever beta so that I can test capital structure changes. A master WACC function that ties all components together, and then I also documented the analytical flow. So um we have compute current WACC(1), um unlever beta, add new debt, and then relever beta(2), compute new WACC(3), run sensitivity analysis(4), examine implications for project-specific discount rates(5), and then compare to industry benchmarks(6). So laying this out in Represent ensures I know exactly what the implementation should be um before producing anything. So next what we're going to do is we're going to go to stage three which is Implement and as you can see, this is my code for Implement and this is where I'm going to be doing the analysis itself. So um as you can see right here these are the actual function definitions that match the Represent plan and each function is cleanly separated, so the model is easy to validate, extend, and troubleshoot. So now we're going to go to the um output for my Implementation stage. So now we move here, where I perform the core calculations following the Represent blueprint. So to compute the current WACC um or Netflix's current WACC, we have the Cost of Equity = 4.5% + (1.3 x 5.5%) which equals 11.65% as you can see right here. Then we have the After-Tax Cost of Debt which = 5.8% x (1 - 21%) and that's our 4.58% right here. Then we have capital structure with Equity Weight of 93.9% and Debt Weight of 6.1%. And then this gives us their current WACC of 11.22%. And this already tells us something important. Netflix is relatively high- risk compared to the industry's 8 to 10% WACC range. So now what we're going to do is show our second analysis in the Implement stage. So this is WACC after $3 billion of new debt. So what I did was I analyzed the impact of the additional three billion in debt. So to Unlever the Beta or the Asset Beta equals um 1.2365. And then to Add the new debt, Debt rises to $16 billion. And then to Relever the beta, New Beta rises slightly to 1.3147. So the Cost of Equity increases to 11.73%. And then when we Recompute WACC, our new WACC is now 11.20%. So this is a critical finding because even with a meaningful debt increase, Netflix's WACC barely changes. So the tax benefit of debt almost fully offsets the increase in equity risk. And this suggests that Netflix may still be somewhat underleveraged. So now we're going to do is go to the sensitivity output that I created, which is the visual here. As you can see, the Netflix WACC versus the Total Debt Level. So my Implementation also includes the required sensitivity analysis. So here is the beta and the market risk premium sensitivity output, followed by the required WACC versus Debt visualization. So this plot shows that Netflix's WACC curve is very flat, confirming that moderate increases in debt do not meaningfully raise financing risk. This reinforces the conclusion that the firm has capacity for additional borrowing. So now what we're going to do is we're going to move to stage four of DRIVER, which is the Validate stage. And um we're going to go to the output of this stage. Okay. So in this stage I compared my results against industry peers to ensure they were reasonable. So the Netflix WACC that we calculated was 11.22%. And then we have a Disney WACC which is our given of 8.2%. And then we have our Amazon uh WACC which is also given of our 9.5%. So my analysis validates the differences. Disney benefits from diversified revenues, theme parks, merchandising, established franchises, and lower cash flow volatility, which means lower beta, which means lower WACC. Amazon blends a low-risk, high-margin AWS business with retail, resulting in a mid-range WACC. And then Netflix, by comparison, is a pure streaming platform in a highly competitive market with substantial content spending, which leads to the higher beta, which also then leads to the higher WACC. So the financial logic, industry structure, and beta levels all validate my calculated results. So now after that we're going to go to stage five and this is the code for stage five that I created, and we're going to go down to the output. So stage five, Evolve in DRIVER addresses the need for project-specific discount rates. So a single WACC of 11.22% should not be applied to all content projects because Netflix's content portfolio varies widely in risk. So for example, a well-established U.S. franchise reboot has predictive viewership and low country risk. So the correct hurdle rate is below 11.22%. And then a new international production in a high-risk emerging market carries currency, political, and market uncertainties. So the correct hurdle rate is above 11.22%. So my recommendation is to Evolve beyond a firm-wide WACC and adopt a um divisional or project-specific cost of capital framework, and this ensures that Netflix correctly accepts high-value, low-risk projects and avoids overinvesting in speculative ones. So that is my Evolve stage, and we're going to move to stage six, which here is the code, and this is going to be my final recommendation and here is the output. So in stage six, finally um which is Reflect, I integrate the findings into a strategic recommendation. So um for the first recommendation which is our Financing Strategy, the $3 billion debt insurance is financially sound. WACC barely decreases, and Netflix benefits from a larger tax shield. So the firm has capacity for modestly more leverage without major risk increases. Then we have our Investment Strategy, which is the $5 billion investment should not be evaluated using the firm-wide WACC. A risk-adjusted hurdle rate framework must be adopted to ensure the value creation across different project categories. So in summary, Netflix should issue the debt, use project-specific discount rates, and treat its content portfolio as a set of differentiated investments rather than a single homogeneous project. And that concludes my enhanced DRIVER analysis. Um, thank you for your time.",
  "video_url": "https://youtu.be/8XrTmbrgPgM\n\nor (if the first link does not work)\n\nhttps://youtu.be/8XrTmbrgPgM?si=Voet_8gBoiqSzw6R"
}