{
  "student_name": "Disha Rathod",
  "org_defined_id": "037279221",
  "username": "rathod3",
  "email": "",
  "transcript": "Hi, so this is my session 10 assignment. So for session 10, so for the assignment overview, so evaluate Starbucks proposed flagship roastery that requires a 12 million upfront outlay and is expected to operate for 10 years. use the firm's 8.5% WACCC as a hurdle rate to determine whether the project creates value and to recommend an accept or reject decision supported by the driver documentation for the parameters. Initial investment is $12 million dollar which includes building equipment training and depreciated straight line over 10 years. Working capital is 500,000 deployed at launch and recovered in year 10. revenues um $8 million in year 1, 11 million in years 2 to five and 9 million in years 6 to 10. Operating costs COGS 40% of revenue, labor 2.5 million, rent and utilities.8 million, marketing.3 million in year 1 then.1 million thereafter. Taxes 25% corporate rate terminal value 3 million at the end of year 10. So for the first step which is the of the J method which is define and discover. So this stage focuses on clearly understanding the capital budgeting decision, validating the project parameters and defining the strategic scope of the investment analysis. So, the problem is that Starbucks is evaluating a strategic flagship roaster project requiring a substantial $12 million upfront capital outlay and a $500,000 working capital injection. To assess the economic viability of the 10-year project, we must determine if the generated free cash flows FCF provides a return exceeding the firm's weighted average cost of capital, WACC, of 8.5%. The analysis must determine if the project creates shareholder value which is positive NPV or if the funds should be deployed elsewhere. So the goal the objective is to build a transparent dynamic Pythonbased cash flow model to calculate NPV IR and payback period providing a data backed accept or reject recommendation that accounts for both financial metrics and sensitivity to revenue volatality fact verification. So this is the important first step. So a common analytical error in capital budgeting is mismanaging the timing of cash flows particularly working capital and terminal value. We must explicitly explicitly verify that the 500,000 working capital is an outflow and at year zero and a recapture inflow at year 10. Additionally, we must confirm the $3 million terminal value is treated as a taxable cash inflow at the end of the project life distinct from the depreciation schedule hypothesis. Given that the high initial investment of $12 million relative to year one revenue of $8 million, the project will likely have a long payback period. However, the surge in revenue during years two to five1 million should drive the NPB positive, provided that operating costs do not erode the margin too heavily. The project will likely be highly sensitive to revenue fluctuations due to the high fixed cost structure um actions. So, confirm the tax treatment of the asset. Since $12 million is depreciated straight line over 10 years, the book value at year 10 will be $0. So the entire $3 million terminal value will be treated as a taxable gain plan. So if the net present value NPV is marginally positive but the internal rate of return IRR is close to the WACC 8.5% the recommendation must rely heavily on the strategic flagship branding benefits rather than pure financial um arbitrage. So key questions to answer. So, does the project generate a positive net present value using the 8.5 hurdle rate? How long does it take to recover the initial 12.5 million cash outlay? How does the projection of revenue in year 6 to 10 impact the total value creation? If revenue misses projections by 20%, does the project destroy value um turn NPV negative and is a project robust enough to survive a 2% increase in the cost of capital. So our second stage which is represent which is a plan. So this stage outlines the analytical and technical steps required to construct the cash flow model and compute the core capital budgeting metrics. So some core formulas and methodology. So this analysis will be centered on calculating the incremental free cash flow FCF for each year and discounting it back to the present value to find the net present value which is NPV. So first formula annual straight line depreciation. So depreciation equals initial investment divided by project life. Operating cash flow is um revenues minus COGS minus operating cost minus depreciation multiply um by 1 minus t plus depreciation. Free cash flow is equal to operating cash flow minus capital expenditure minus total networking capital plus terminal cash flow. And then NPV is um so you have summation symbol with t = 1 at the bottom and then the number of periods above the summation signal. So in this case number of periods is 10 um times 1 + weighted average cost of capital times free cash flow at time minus minus the initial outlay. So the steps so step one is to model setup in constant calculation which is depreciation. So define all project parameters like investment, WACC, the tax rate, um revenues, the cost um and then we have to calculate the constant annual depreciation. Then step two is the incremental cash flow schedule construction. So create a loop for years 1 to 10 and inside the loop calculate the revenues, cost of goods sold, the total operating cost, the depreciation, taxable income, taxes and free cash flow. Then your special cash flow. So in year zero, calculate the total initial outlay which is negative investment minus net working capital. Then in year 10 add the nonoperating terminal cash flows. So recover your net working capital and terminal value. And since the book value is $0, the entire $3 million is a taxable gain. Then you have step three, which is the core metric calculation, which is a base case. So use a free cash flow array and the base weighted average cost of capital, which is 8.5% to calculate the NPV, irrited, payback, and profitability index. Then for step four sensitivity analysis implementation create a parameterized functions to rerun step two and three for the two required scenarios. Scenario A revenue multiplier set to point A which is 20% reduction and scenario B is where WCC set to 6.5 and 10.5%. Then summarize the impact of MPV and IRR. So next we'll uh do the implement stage. So for this we'll build our code through Gemini. So in Gemini I gave it the prompt and it provided me with this code off to the side. Then I exported that code code into collab and so it gives you project parameters. So like the WCC is point8 was 85%. The I mean 8.5% the tax rate is 25% project life is 10 years. Then you have your investment terminal cash flow. Um so initial outlay is $12 million. um working capital is 500,000, working capital recovered is also 500,000 in year 10. Then your terminal value um is 3 million. Then you have um your formula for annual depreciation. So which is initial outlay divided by project life. Then you have um operating costs like the labor costs. Um then you have rent utilities which is 800,000 per year. Then your fixed operating cost which equals your labor cost plus rent utilities. Um then you have your um your cost of goods sold rate which is 40% of revenue. Then you have your incremental cash flow model. So over here it shows kind of like in years zero um how your year revenue, operating cost, depreciation, taxes, net income, um operating cash flow, those are all zero. And then from years 1 to 10 it shows um it shows formulas that we'll be using. So for revenue um so for years 1 to 10 and this it shows like different things we'll be calculating. like revenue, the operating cost um and then gives a formula for cost of goods sold, which is revenue times the cost of goods sold rate. Then it gives earnings before investment in taxes. It also includes earnings before tax. Um the taxes or the formula for taxes is earnings before tax times tax rate. Then you have operating cash flow which is net income plus depreciation. Then you have your nonoperating cash. then adjustment for year 10. Um then you have your total project cash flow. Um and then um and then as you go on in the code, it shows your capital budgeting metrics. So you have NPV, IRRa, initial investment. Um then you have your payback period calculations. So um you have discounted cash flow um your discounted payback um and here you also include your NPBI your RPI and other stuff and then um as you go down you for sensitivity analysis so um so if the revenues reduced by 20% like what what would happen um you would calculate the cash flows with the reduced revenue. Um then you have another sensitivity test. So if your WACCC is positive 2%. Um what happens if your WACCC is -2% what happens? Um then you have a summary table provide us with a table of everything in it. And then um step four it'll be final execution base case. So we'll run the base case cash flow model just to see if it makes sense and then we will run this code and once you run this code you can see how it gives the incremental cash flow um when your WACCC's is equal to 8.5%. So as you can see it gives year 0 to 10 gives revenue operating cost depreciations earnings before taxes taxes net income um OCF and then terminal value and weighted cost and then your project CF. Then it also gives you the core capital budgeting metrics. So your NPV value is um 3 million um and since the hurdle is greater than $0, you would accept it. Um irr is 13.25 and since that's greater than the 8.5, you would also accept it. Profitability index is 1.347 which is greater than 1.0. So you would accept it. simple payback period is 0.56 which is less than 10 years. Um so that doesn't really have anything and for discounted payback period is also 0.52 which is less than 10 years. So that also doesn't really have anything. Um then you have your sensitivity analysis over here you can see when WACC is equal to 8.5% how it is. Um here's another one. And then you have your summary sensitivity analysis which we'll be seeing um more in depth later on. I'll be explaining it more in depth. And then here's driver documentation. So um decision financial summary. So based on the base case financial model, the project is projected to create a value. Um so you have NPV of $3 million, IRRa of 13.25 25 and discount and payback period of 0.52. So some key project risk and sensitivity. So revenue and operating costs are the most critical drivers. Um this model is highly sensitive to a decline in sales. Um sensitivity findings is that a 20% decline in revenue results in a negative NPV leading to a reject decision. So the recommendation is that marketing and brand visibility must be prioritized to protect the revenue forecast for investment. Um $12.5 million total initial outlay um valuation. What is it worth? So the project's value is approximately um above the initial investment. What's the backup plan? So the recovery of $3 million in terminal value at the end of the year 10 is crucial. and then the result is to accept it but monitor the revenue closely. So strategic fit um the flagship uh roaster concept aligns perfectly with the Starbucks um strategy allowing it to capture the high-end coffee market and compete with uh specialtity roers. Um brand implications. So this is a high visibility experience location that reinforces the brand's innovative and luxury image potentially boosting perception and uh traffic at surrounding standard stores. Um so the final recommendation so this project should be accepted cuz the financial return um of 18.51 provides a strong buffer over the 8.5% WACC but given the project's high sensitivity to a 20% revenue reduction. The acceptance is contingent upon robust execution of the sales and marketing plan to ensure revenue targets are met. Now going back to our dog. So as I said I mention everything more in depth and tell you all the things. So the base case uses the weighted average cost of capital of 8.5% and 100% of the projected revenues. So in year zero uh your revenue is zero, operating cost is zero, depreciation is zero, tax is zero, net income zero, OCF is zero, and you have a.5 million working capital. So your project cash flow is -12.5 million. Then in year 1, you have a $8 million revenue. Operating costs are 6.8 million. Depreciation depreciation is 1.2 million. EBT taxes and net income are all zero. OCF is 1.2 million. There's no working capital or um terminal value and project cash flow is 1.2 million. Then in years 2 to 5 revenue is 11 million. Operating cost is 7.8 million. Depreciation is 1.2. Um earnings before taxes is 2 million. Taxes is 500,000. Net income is 1.5 million. OCF is 2.7 million. there's no working capital or anything and the project cash flow is 2.7 million. Then in year six to nine revenues is 9 million. Um operating cost is 7 million. Then depreciation is 1.2 million. Your earnings before taxes is 800,000. Your taxes is 200,000. Your net income is 600,000 and your um OCF is 1.8 million. Then there's no working capital or terminal value and your project cash flow is 1.8 million. Then in year 10, your revenue is 9 million. Your um operating cost is 7 million. Your depreciation is 1.2 million. Your earnings before taxes is 800,000. Then um your um taxes is 200,000. Your net income is 600,000. Your OCF is 1.8. 8 million um you have a.5 million working capital and a.3 million terminal value and then your total um project cash flow is 5.3 million. So then your base case capital budget metric so when your WACC your average cost of capital is equal to 8.5% how will it look like? So your net present value is um over 3 million which is greater than the $0. So your recommendation is to accept it. Um for your IRR internal rate of return it's 13.25 which is greater than the 8.5. So you should accept it. For your profitability index it's 1.347 which is greater than 1. So you should accept it. And then for simple payback period and discounted payback period they're both the both 5.56 and.52 are both less than 10 years. So there's really not really a recommendation for it. So conclusion, all three PI primary value metrics like your NPV, IRR, your profitability index, they indicate that the um roster project should be accepted as it is projected to create over $3 million in value for Starbucks. Then your fourth step which is validates just to make sure everything's accurate and makes sense. So at this stage verifies the computed results against established financial rules and tests um the valuation using the implemented scenarios. So this model was subjected to two required sensit sensitivity tests. So the base case is that you have a 8.5% WCC. So your revenue multiplier is 1. Your NPV impact is 3.02 million. IRR impact is 13.25. So your recommendation is to accept it. Then you have a um a scenario where your revenue is - 20%. So your WCC is 8.5%. Revenue multiplier would be8 um.8 your NPV impact is -2.75 and your IRRa is 3.88%. So you would reject this offer. Now for scenario B um if your WACCC increases by 2% um or negative 2%. So first we'll talk about if your WACCC increases by 2% that means your WACCC would be 10.5%. Revenue multiplier is 1. Um your NPV impact is 1.63. Your IRR impact is 13.25. So you would accept this project. Now in scenario B when your WACCC is negative um is 2% less than the original WACCC. So that means your new WACCC is 6.5%. Your revenue multiplier is 1. Your NPV impact would be 4.64. Your IRR impact would be 13.25. So you would accept um this project. So interpretation of risk. So revenue volatility it's critical risk. So this project is highly v vulnerable to underperforming sales due to high operating leverage. So high fixed cost relative to revenue and a 20% reduction in revenue causes the NPV to become significant significantly negative as we saw over here it becomes a -2.75 from a positive 3.02 and the IRR 3.88 is um to fall far below the 8.5 hurdle rate. So this finding suggests that the revenue forecast is the single greatest financial risk to project uh viability. For WCC robustness, it's a low risk. So the project's value is robust to changes in the cost of capital. So even if the WCC increases by 200 um increases by 2% or decreases by 2%, the NPV still remains positive at um $1.63 million. Then E for evolve for the critique and next steps. So this stage critiques the um static assumptions used in the implemented models and suggest technical and analytical improvements for more refined analysis. So critique payback period error. So a critical error was found in the model's computation of the payback period. So the cash flow schedule shows an initial outlay of2.5 million and a year 1 cash flow of $1.2 million and a payback period of 0.52 years is incorrect mathematically and the actual simple payback period should be closer to 5.2 years and this indicates a likely logic error in how the cumulative cash flow was tracked in the underlying code and the metric should be disregarded for the final recommendation. an analytical critique of assumptions of terminal value tax treatment. So this model correctly um assumes the entire $3 million terminal value is a taxable gain because the book value equals to zero. However, in this real scenario, the terminal value should reflect the after tax sale of the asset and the present value of continued operations which would likely add more value than a fixed $3 million sale price. For depreciation method, the model uses straight line depreciation. So the modified accelerated cost recovery system is typically used for tax purposes which accelerates depreciation and creates a larger tax shield for the early years and this will increase the earlier creek cash flow resulting in a higher NPV and a faster discount and payback. Then some next steps for deeper analysis. So the next step is to rig rigor rigorously stress test the project's viability around the critical risk identified. So revenue shortfall. So management should be deter determine the break even annual revenue level required to achieve NPV equals zero giving them a clear financial floor target for the first 5 years of operation. Then the sixth uh step which reflects the key takeaways. So this is core lessons that we've learned. Um so executive recommendations. So the Starbucks um roaster project is financially attractive and creates significant shareholder value in the base case and it is strategically essential for um brand premiumization. So the recommendation is to accept the investment. Key takeaways for management. So value creation and return buffer. So the project is sound with an irr of 13.25% that provides a strong 4.755% buffer over the 8.5% WCC and the profitability index of 1.347 confirms that the project is capital. And then for the second one revenue performance is the single greatest risk. So the project is dangerously susceptible to market underperformance. Um the sensitivity test showed that a 20% drop in revenue makes the project value destroying. Um so NPV would be less than zero and marketing and operating excellence must be executed like perfectly especially in the first 5 years in order to achieve that $11 million revenue target. Then the third takeaway is that strategic rational validates risk. So the investment is justified not only by the positive NPV but also by its role as a strategic brand asset. The grocery serves as a high visibility marketing platform that enforces Starbucks luxury segment justifying um premium pricing and driving traffic to its overall ecosystem. The strategic benefit further strengthens the acceptance decision despite the revenue sensitivity. So mitigation strategy. Starbucks must implement a robust monitoring system focusing on early year revenue and expense control. If sales trajectories indicate a potential 20% shortfall, management must be ready to quickly cut variable costs or deploy targeted marketing to pull the project back to the break even point. So this is my session 10 project.",
  "video_url": "https://youtu.be/6t_y60uGEtU"
}