{
  "student_name": "Anushka Wayse",
  "org_defined_id": "037494252",
  "username": "wayse",
  "email": "",
  "transcript": "Hello, this is my session 9 assignment for Management 310. So to go ahead and start, we start with the Define and Discover. And essentially, the stage focuses on clearly understanding the investment decision, validating all of the financial parameters, and also defining the strategic scope of the capital structure. So just to give a quick overview of the actual problem that we're looking to solve today. Okay, so Netflix is evaluating a hypothetical $5 billion content investment and considering funding a $3 billion of this through new debt. It assesses the viability of this investment and the efficiency of the funding strategy. So we must determine the company's weighted average cost of capital, the WACC. The analysis must determine if the returns justify the cost capital and how increasing leverage impacts shareholder value compared to peers like Disney. So our goal for this problem is to produce a rigorous quantitative calculation of Netflix's current pro-forma WACC providing a strategic recommendation on capital structure optimization based on the tradeoff between tax yields and financial distress costs. So, and a very important first step is the fact verification. So, a common analytical error is using the book value of debt instead of the market value when calculating WACC. We must explicitly verify and utilize the market value of debt, which is $13 billion, provided in hypothetical parameters, rather than the book value, which is $14 billion, to reflect the true opportunity for cost of capital. Our hypothesis is given a high equity beta 1.3, Netflix costs of equity will likely be high, driving the WACC upward. However, the addition of $3 billion in debt is a relatively low cost at 5.8%, compared to the overall WACC due to the tax yield effect, provided the added risk does not spike the beta or credit spread significantly. So the action we'll take is to confirm the risk-free rate, which is a 4.5%, and the market risk premium, which is 5.5%, align with the provided market context to ensure that the CAPM calculation is inherently, is internally consistent. Our communication plan is if the calculated weighted average cost of capital differs significantly from the media industry range, which is 8 to 10 percent, the variance must be explained by analyzing specific risk factors, like the beta 1.3, rather than assuming calculation error. And then some of the key questions that we're going to answer throughout the problem: what is Netflix's current cost of equity using the CAPM inputs? How does the inclusion of the tax yield 21% rate impact the cost of debt? How does the issuance of $3 billion in new debt lower the weighted average cost of capital enough to create a shareholder value or does it introduce excessive financial risk? Why does Netflix's WACC differ from Disney's and Amazon's? And is this difference justified by their business models? And lastly, should the $5 billion investment be evaluated against the firm-wide WACC or just a project-specific discount rate? For example, international versus domestic content. Now going on to the representation, which is the plan. So this stage essentially outlines the analytical and technical steps required to calculate the WACC components and evaluate the strategic implementations of the new debt issuance. So some of our core formulas and methodology is as follows. The analysis will be centered around the weighted average cost of capital, the WACC, formula to determine the hurdle rate, supported by the CAPM, the Capital Asset Pricing Model, for the equity component. So first we can see the cost of equity equals the risk-free rate plus the equity beta times the market risk premium. The after-tax cost of debt equals the pre-tax yield times one minus the tax rate, and then our weighted average cost of capital is calculated with E defined as the market value of equity, D defined as market value of debt, V is the total market value, the cost of debt is COD, and then T is our corporate tax rate. Now moving on to the analytical process. The process will be conducted in a sequential and calculated manner. Our step one, the component calculation and weighting is a critical gate. Cost of equity using the provided parameters 4.5% plus 1.3 times the 5.5. To calculate our after cost of debt and determine current capital structure weights using market capitalization to $200 billion and the market value of debt to $13 billion. And just as a quick note, as we mentioned before, we're not using the book value of $14 billion. Our second step is the baseline weighted average cost of capital, the WACC determination. So compute the firm-wide weighted average cost of capital and then compare this result against the industry range 8 to 10 percent to validate if Netflix is trading at a premium or discount to peers. Our third step is a sensitivity analysis, which is the $3 billion issuance. Adjust the total debt to reflect the new $3 billion issuance, so it's $13 billion plus the $3 billion, which is the new $16 billion. And then recalculate the weights based on the new capital structure. Calculate the new weighted average cost of capital, assuming that the cost of debt and beta remain constant for the marginal issuance. And then our analysis for this is to quantify the basis point reduction in the weighted average cost of capital resulting from the additional tax shield. Our fourth step is a comparative analysis between Netflix and Disney. We're going to compare the calculated Netflix weighted average cost of capital against Disney's 8.2%. We're going to deconstruct the difference by asking these questions. Is it driven by capital structure where Disney is 30% debt versus Netflix has lower leverage, or business risk, Disney's diversified revenue streams versus Netflix's pure play streaming model? Our fifth step is a project-specific risk assessment. So evaluate if the $5 billion content investment matches the firm's average risk profile. Differentiate between the domestic content, likely lower risk, potentially below the WACC, versus the international content, a higher risk due to currency/regulatory issues potentially requiring a premium above the WACC. Our sixth step is the strategic recommendation for the synthesized problems to recommend whether Netflix should proceed with a debt issuance and address the optimal capital structure, such as adding the more debt, that move Netflix closer to an optimal point, lowering the cost of capital, or push it forward to financial distress. Some of the technical requirements for our problem here is we're going to be using tools like Excel or Financial Calculator for the WACC, and then our deliverables are a calculation table showing inputs with pre-tax/after-tax costs, weights, and the final WACC for both current and pro forma scenarios. Our next step is the execution. The most crucial step in Proof is to execute step one to perform the CAPM calculation to lock in the cost of equity as it's the largest driver of WACC for tech/media company with Netflix valuation. Our third section here is the implementation, which is the analysis and the code. So our goal is to execute the WACC calculation for the current state in the pro forma debt issuance scenario and determine the appropriate hurdle rates for the investment decision. Our action is to create an integrated Python model that we utilize to compute the component cost, which is the cost of equity and cost of debt, capital structure weights, and the final WACC. So we went on ahead and asked Gemini the first three parts of our driver method and asked it to create code for us here using a python model so I went ahead and I exported it into CoLab, which we can see here. We have part one of it, which is defining our inputs. So here are different variables. We have the company data for Netflix, we have the market data, and we also have competitor data. So we have Disney's and Amazon's. Part two, we calculate the cost of equity and debt. So here we have the equations that we're using, and also the cost of debt, so the equations that we're using as well. Part three is to calculate the current WACC, so just some more equations, the total firm value to calculate the weight, to form the cost of equity here, the cost of debt here, and part four our scenario so it's additional debt issuance so a new debt amount. Generally I also utilize the KISS principle—keep it stupid simple—for simplistic model. Part five our project specific analysis and then finally part six our comparison and recommendation as well so it compares Netflix with Disney and Amazon and then also provides some recommendations with an analysis for why. So then when we went ahead and ran this we were able to receive this result our starting analysis for Netflix just some more definitions our current scenario and project specific and then our analysis. Netflix cost of capital is higher than Disney's and the reasoning for that is that Disney has a 30 percent debt while Netflix only has 6.1 percent debt. Since debt which is approximately 4.6 is cheaper than equity which is 11.6. Disney's higher leverage lowers their WACC. So the recommendation is to proceed with the $3 billion debt issuance and it lowers the WACC slightly because the debt is cheaper than equity. Our second recommendation is to use a project-specific WACC for the $5 billion dollar investment. If the content is for stable markets in the U.S., use 11.2%. If exploring new volatile markets, then we would use a higher rate. So now going back to our implementation, we have a quick financial analysis of the calculations as well. So first is component costs. Analysis first established the cost of equity and debt. So here we have the cost of equity and the cost of debt. So our interpretation of these after being calculated is that the significant spread between the cost of equity and the cost of debt indicates a strong potential for lowering the overall cost of capital by increasing the proportion of cheaper debt. Here we see the cost of equity is about 11.6% and the cost of debt is 4.6%. Our current WACC calculation using the cost of the market value of equity which is the 200 billion and the market value of debt which is the 13 billion. So you see here So our equities, $200 billion, our weight is 93.9%, our cost is 11.65%, and our contribution is 10.94%. For debt, it's the same thing with $13 billion in our amount, our weight is 6.1%, our cost is 4.58%, and our contribution is 0.28%. And then at the bottom here, we just totaled all of these up, and for cost, it's our WACC, and we can see our weight equals 100 as well. A third is the scenario analysis, $3 billion debt issuance. The model stimulated raising $3 billion new debt to fund content. Total new debt is the $16 billion, new WACC is the 11.13%, and the impact, the WACC decreased by 9.2 basis points. Now for a more strategic comparison, where we can compare Netflix with Disney and Amazon. So we see that for capital structure notes, Netflix is 6% debt, which is under leveraged. Disney, which has 30% debt, is optimized leverage. And then Amazon has a very diverse business model as well. So a quick analysis of these is that Netflix's WACC is significantly higher than Disney's, and this is primarily due to capital structure. Disney utilizes a 30% debt load, allowing them to replace expensive equity with tax advantage debt. Netflix's reliance on the 94% equity financing keeps their hurdle rate high. Now our fourth step is to validate, to actually check the accuracy and sense check. So this stage checks analysis for mathematical accuracy and also economic logic. So the economic logic check, ranking of all the costs. So we know the cost of equity should be higher than the cost of debt. So we can check that in the past. The WACC must fall between the cost of equity and the cost of debt. So the WACC here is 11.22%. The cost of equity is 4.58% and the cost of debt is 11.65% and this 11.22% is in between these two. So it did pass. A sensitivity logic check. So the logic adding debt, which is cheaper capital, should lower the WACC assuming that the beta and ratings don't deteriorate immediately. So to check the WACC dropped from 11.22% to 11.13%, so it confirms that the tax yield benefit is functioning correctly in the model. Some more external benchmarking, Netflix is a high growth media tech stock with a beta of 1.3. A WACC of 11.22% is consistent with high growth peers, Whereas Disney, which has an 8.2% WACC, represents a mature and diversified conglomerate, the spread makes intuitive sense given the risk profiles of step five, which is our evolve. This stage essentially critiques the analysis and suggests how it could be improved by using dynamic variables rather than systematic assumptions. The critique of the static assumptions. One critique is that a constant cost of debt. The current model assumes that the bond yield remains at 5.8% after issuing the $3 billion of new debt. In order to evolve from this, in reality, increasing leverage might jeopardize the BBB plus rating. A drop in these or a decrease would increase the yield, potentially erasing the WACC benefit. With a constant beta, the model assumes that beta stays at 1.3. The evolution of this, taking on debt, increases the financial risk for shareholders, and we should use the Hamada equation to un-lever the current beta and re-lever at the new capital structure to see if the cost of equity actually rises, offsetting the cheap debt. And then some project specific things, the model currently applies a flat international risk premium. Instead of this, instead of a flat 2% added, we should calculate a specific WACC for the international regions by using the country risk premiums for specific target markets. For example, South Korea versus India versus France. Lastly, our reflection. So what are some of the key takeaways that we took away that I took away from this problem and challenge? This stage essentially just synthesizes all the findings into core lessons learned. The first key takeaway I gained was that leverage is underutilized. Netflix is currently inefficient and efficiently capitalized with only six percent debt. It is paying a premium for its capital, which is 11.22%. And the analysis proves that increasing debt levels, even considerably by $3 billion, lowers the hurdle rate and creates shareholder value through the tax yield. My second key takeaway was that one rate does not fit all. The analysis highlights the danger of using a single corporate WACC for all decisions. If Netflix uses 11.22%, a firm-wide WACC would evaluate risky international projects. It may accept the value-destroying investments. So your recommendation for this is an adoption of a tiered hurdle rate, 11.22% for domestic content and 13.22% for national expansion. And then lastly, my last key takeaway was that the Disney gap is structural. Netflix cannot simply become Disney by borrowing money. Disney's lower WACC, 8.2%, is driven partially by leverage, but also by lower business risk, which is a lower beta. Netflix must accept a higher cost of capital as a price of being a pure play growth competitor, but should still optimize its debt mix to narrow the gap. Thank you.",
  "video_url": "https://youtu.be/ppQG8nMvmkI"
}