{
  "student_name": "Jarrett Evans",
  "org_defined_id": "037163659",
  "username": "evans596",
  "video_url": "https://youtu.be/ZmFpKNxqGa8",
  "transcript": "0:00 Alright, hello guys, so today we're going to evaluate a control bio of an arboret. So, I'm gonna kinda walk through here, uh, using, uh, evaluation logic.\n0:12 To kinda just go through this project. So, starting off, we see that Panera is a cash flow machine, generating about $900 million in earnings before interest, taxes, depreciation, amortization.\n0:28 And I'll just say that as a bit, uh, I guess it's a shorter way and easier way to just say it as we go.\n0:34 So, and they also have a 15% margin. So, the growth story kind of relies on expanding the digital mix currently at- at 50% and adding, uh, 500 stores.\n0:49 So, the core problem that we're kind of trying to solve is pricing, discipline versus competitive pressure. So, we kind of know some, like, strategic- buyers like McDonald's or Starbucks are circling.\n1:06 So, they have synergies that Panera Bread doesn't really have. So, in our evaluation, we kind of have to define the, uh, financial- actual buyers ceiling.\n1:18 Umm, the price where returns works for us. And versus, like, the strategic price, uh, where we simply just kind of walk away.\n1:28 So, we kind of move to what we have. And our represent stage of driver, which is, we kind of mapping, we are kind of mapping a, uh, analytical plan.\n1:41 So, we can't really rely on a single metric, uh, we're kind of using a football field approach. If you can't.\n1:48 You would to kind of triangulate the, the value. So, first the, the discounted cash flow kind of represents the initial value of Panera's future cash flows.\n1:59 So, we're kind of modeling three scenarios here. Uh, base case. Uh, we assume standard industry growth and a 9% WASCC.\n2:09 This is kind of what Panera is worth. Uhm, and upside case. This models what Starbucks might pay, assuming operational synergies and.\n2:20 A lower cost of capital. And downside is a recession, uh, scenario with compressed margins. So we kind of look at trading comps like Chipotle.\n2:34 Uhm, versus like the broader. For industry, we kind of look at also, um, uh, precedent transactions typically priced at 12 to 15 times, uh, a bit of this kind of represents current, uh, current market sentiment.\n2:52 So, let's kind of open the hood and kind of look in. Um, we, we used Python as usual, uh, using kind of Gemini to help us through that to kind of toggle WACC and, and growth rates instantly.\n3:08 So, we kind of look at, uh, some different functions that we have implemented, such as the, the Panera valuation. Um, so, we kind of see our inputs that are, uh, we kind of anchored our model.\n3:24 Umm, on the 900 million, uh, a bit, uh, an industry, WBCC of, of 9%. Uh, and then we kind of go to also the run scenarios that work.\n3:40 Yep, the run scenarios. And we see, firstly, the financial buyer. Uh, we're kind of being conservative here. Uh, we assume 5% revenue growth and zero margin, uh, improvement.\n3:56 So, this is kind of the, the discipline scenario. And we also have the strategic buyer. And this is kind of the upside case, which is, we first kind of look at the, uh, the synergy.\n4:11 A bit of, And we kind of see that parameter, and we injected a hundred million dollars here for the pure, pure synergy and improved margins by 200 basis points.\n4:25 This kind of mathematically proves why a strategic, buyer could outbid us at Pinner. And then, finally, we kind of have the, the plot football field.\n4:38 Let's do that, plot football field. And it kind of just takes these outputs and normalizes them into kind of a single visual range for the investment committee.\n4:55 So, we kind of validate and just kind of see everything in here, so. We kind of see after we kind of get rid of these parameters here.\n5:05 We look at our output. We can kind of see. Umm, so our, our bit, uh, base case DCF yields evaluation of.\n5:16 Approximately 13.5 billion. Umm, and our precedent, uh, transactions range from 10.8 to 13.5 billion. So this kind of validates our base case.\n5:28 Our intrinsic evaluation kind of aligns with historical deal. Uh, multiples. So, on the other hand though, we kind of see the strategic upside bar, uh, with synergies, the evaluation kind of spikes to, to nearly 18 million.\n5:46 Or, sorry, billion. And we also ran- and sensitivity on the WACC. So, if interest rates arise and the WACC hits 10%, our DCF value will drop, uh, by roughly 1.5 billion.\n6:00 So, this kind of highlights that our bid is highly sensitive to, kind of the cost of debt. So, we can kind of conclude from this, um, that we kind of have a clear divergence.\n6:16 So, our financial value is 12.5 billion to 14 billion. And then our strategic value is, uh, 16 billion to 18 billion.\n6:25 So, our recommendation is, we kind of recommend, to, uh, submit an opening bid of 12.5 billion. And this is kind of a defense.\n6:36 First of all, discipline entry point, uh, backed by some, some transactions that we have shown. And we kind of have room to negotiate up to 13.8 billion, uh, while kind of maintaining our targets.\n6:51 So, we have that one point. Three million, or billion dollar, uh, buffer. So, we kind of look at our walkway point also and our recommendations.\n7:01 So, if the bidding war pushes the price towards 15 billion, we kind of recommend walking away. So, at that price, we're kind of paying for synergies.\n7:08 That we, as the buyer, can't really kind of compete with. So, we kind of let a strategic buyer, like McDonald's, overpay rather than kind of destroying our own returns.\n7:19 So, overall, this kind of, uh, this kind of strategy ensures that we kind of . We kind of maintain price discipline, uh, while acknowledging the premium nature of Paneros, uh, digital growth.7:32 So, that'll kind of wrap everything up for us today and thank you for joining."
}