{
  "student_name": "Aryan Mangal",
  "org_defined_id": "037551940",
  "username": "mangal2",
  "email": "",
  "transcript": "Hi, my name is Arjen, and today I'm going to go over the Section 9 assignment and my work in Driver for it. S Speaker - So we can see that we want to calculate the weighted average cost of capital or WAC for Netflix in connection with a hypothetical $5 billion content investment decision. We want to determine the current WAC or cost of capital for Netflix, the impact of if we want to finance more debt, the project specific versus firm wide discount rates and the cost of Netflix's capital towards our industry peers and how we might use that. S Speaker - So the parameters you're given, and these are hypotheticals, that the market cap of Netflix is $200 billion. Their book value of debt is $14 billion. Their market value of debt is $13 billion, so $1 billion lower. $13 billion. S Speaker - Their equity beta is 1.3. Their bond rating is a triple B plus with a yield of 5.8%. Their corporate tax rate is 21% and their current stock price is about $450. Now in terms of the market, we're given the risk-free rate of 10-year treasury bonds is 4.5%. The market risk premium is 5.5%. And then the media industry whack range of 8% to 10%. Now we're given strategic context of Disney Capital structure being 70% equity, 30% debt with a WCC of 8.2%. S Speaker - And then we're given an Amazon Prime video that uses Amazon corporate WAC of 9.5%. And we're also seeing that Netflix was to consider $3 billion additional debt issuance for content investment. And we're tasked with calculating their current WAC, their WAC after this $3 billion initial debt issuance. S Speaker - their project specific WAC, so US content versus the international content to different projects. Then compare them to their competitors in a strategic context, as well as explain the differences between Netflix's WAC and the differences between their competitors. And then we're going to recommend the optimal capital structure strategy for Netflix. So I use Driver to conduct my analysis and I'll go over my Google Doc as well as the Google Colab notebook that I coded to kind of help me calculate all of this information. So if we start at Driver, S Speaker - The defining discover is that we obviously Netflix is evaluating the $5 billion content investment. We want to see if this creates shareholder value. We want to estimate a discount rate that reflects Netflix's true cost of capital. We're concerned with rising competition, pattern credit conditions, optimal financing mix for future content investment, whether we should try to finance more from debt or equity, and how the international projects will differ from the domestic projects in risk. S Speaker - So we're given these, this financial inputs, which we've already went over, but basically just the market cap debt of book and market tax rate and the equity beta. And I think one thing that already stands out is a pretty high corporate tax rate of 100%. And then the BBB bonds, BBB plus bonds. S Speaker - the market rates, the industry benchmarks and the strategic scenarios which are given of the $3 billion new debt and the impact of leverage on the WAC. We want to calculate the new WAC after $3 billion debt, the project specific WAC, and then the comparisons between competitors and then the optimal capital structure. S Speaker - So first we want to represent everything in the finance terms that we want to put it in. So first, obviously the cost of capital or the cap M, which we can see the formula here for under R equals R, F plus B, so on. After tax cost to that, which is already times one minus T, so on. Our capital structure weights presented by the equation here, and then our weighted average cost of capital or our WACC. S Speaker - So we're also going to be adjusting by project, which is international content, which we can already know that has higher political effects and regulatory regulatory risks. S Speaker - Our US content must have to use corporate beta. And after talking with some man, we found out that the international content actually uses local beta uplift of about plus point two zero. So slightly different. Now, comparing firms, differences arise from the business risks of the beta, the capital structure, the tax yield and their access to cheap debt, as well as their market perception of stability, which is a pretty big thing comparing the different businesses. S Speaker - So first, we'll talk about my thought process and how I went through it. And then I'll show the Python collab notebook where I actually calculated everything. And yeah. So for the Netflix Slack and the current, we want to compute the cost of equity, the after-tax cost of debt, the capital structure weights, and then the WAC. S Speaker - Then we wanted to calculate after adding 3 billion of new debt by adjusting the capital structure, recomputing the weights that we computed in A, and then recompute the WAC again. Then for project-specific WAC, we want to apply a base beta for US of 1.3 and then an international content 1.5, based on the 0.2 adjusting rate I talked about above. And then finally, for our sensitivity analysis, S Speaker - the WAC versus debt ratio chart, and then the optimal leverage. So as you can see in this Colab notebook, we imported some libraries to help us start. We obviously hard-coded the information that we were given, such as the market cap, debt market, and beta, et cetera. Then we hard-coded the equations that we went over in the representation phase. S Speaker - where we talked about the cost of equity, which is RF plus beta times MRP, the cost of WAC, the cost of equity, and the formulas that we use it for them. And here we can just see the hard-coded calculations for just calculating current WAC, WAC after debt, project-specific, and sensitivity. And then here we are printing the results, and then we're also going to plot them. So we can see that the current WAC is about 11.22%. S Speaker - The WAC after $3 billion new debt falls a little bit to 11.13%. In the US, it gets 11.22%. In international, it actually rises to 12.25%. And this is kind of the sensitivity to leverage. As you can see, our debt ratio goes up. Our WAC goes down. So our cumulative cost of capital does fall a little bit when our debt ratio goes up. S Speaker - Now let's talk about validating it. So we want to confirm that our cost of equity is greater than our cost of debt. We do ensure that our African tax cost of debt reflects InterShield. And our added leverage, we can see, does lower the WAC. And we also want to validate, we did validate that the international project risk reflects a higher discount rate. And what we did expect was that the more debt would increase financial risk, increases equity beta, and does increase WAC after a point. And content projects with global uncertainty, which requires higher discount rates. S Speaker - Now, for Evolve and how we improve our model, first, improvements that Netflix should incorporate, multi-factor models, so industry premium, for example, country risk premiums, you know, for international MAC, it could differ for a country or the region you're operating in, a discount factor for streaming revenue slash volatility, and a scenario analysis for changing interest rates, because we all know that interest rates are not going to stay constant all the time. S Speaker - Now to reflect on this analysis as well as answer the questions that we talked about at the end of running our code and understanding the situation. We know that the WAC matters because of the hurdle rate for evaluating their content investment. If we underestimate them, the bad investments will look profitable. And if we overestimate it, then we're going to reject the current profitable content projects. And the reason we change the WAC after new debt is because more debt is a stronger tax yield. S Speaker - but at the same time, it increases our financial risk. So it raises the amount of equity returns we have to have to make it justifiable. So the optimal structure will balance the tax benefits as well as the financial risk. Now, comparing Netflix versus Disney and the other competitors that we talked about right over here, such as Amazon Prime Video and Disney's capital structure. So Disney's more diversified, which means they have a lower beta or a lower risk, which is why they have a lower WACC. S Speaker - This means that Netflix is honestly viewed as a more stable business just because of this beta value compared to Netflix, because Netflix relies on subscription revenue, which makes them have a higher beta, which makes them have a higher whack. Because if you think about it, Netflix's one business model is their SaaS of their subscriptions. But Disney has so much. They have theme parks. They have movies. They have a lot more, which we can kind of balance their business out with. And Amazon Prime Video has a similar structure because they have a lot more S Speaker - I think balance, which is why you can also see that their WAC is slightly higher than Disney, but overall lower than the amount of WAC we calculated right over here, about 11.22%. So we can see that comparatively in shareholders' eyes to both Disney and Amazon, Netflix is viewed as a higher WAC company because of their higher beta. S Speaker - So overall, based on all this data that we've just collected, we've kind of refined. We find that Netflix should increase their debt moderately for avoid a sexist leverage. And they should target a whack of 8.0 to 8.8%, which is kind of the industry norm. S Speaker - Amazon offers a little high above it, which is why we put 8.8 in the range because 8.8 is slightly above the 8.2 of Disney, below the 9.5 and very below the 11.5 that we calculated for this current project. So overall, that's kind of our recommendations. That's our analysis and that's how we use Driver in this project to calculate. So thank you.",
  "video_url": "https://youtu.be/1ZyQ5iY2hQw"
}