{
  "student_name": "Christine Shong",
  "org_defined_id": "036250202",
  "username": "shongc",
  "video_url": "https://youtu.be/L3viasnH5Tc",
  "transcript": "Hello, my name is\nChristine Chong, and this is my\nsession 12 assignment. Today, I am\npresenting a valuation of Panera Bread\nfor a potential KKR takeover using the\ndriver framework. Starting with the\ndefine and discover phase, we are looking\nat a company with about $6 billion in\nrevenue and $900 million in EBITDA. The market\nis evolving. We have industry of price\nper equity ratios around 22x, but\nstrategic players like Chipotle are trading\nmuch higher at 35x. Our goal is to\ndetermine a bid range for KKR as a financial\nbuyer. We need to be disciplined\nabout cash flow, whereas strategic\nbuyers like McDonald's might pay a premium\nfor synergies. I have mapped out\nthese assumptions here, including\na 9% WACC and a plan to open 500\nnew stores, which you could see\nhere in the code. Now, we've got to\nexplain this logic. So switching over\nto this Python code, I've chosen to use\nPython to build this model because it allows\nme to run multiple scenarios, such as\nbase, upside, and downsides of the\nbusiness instantly rather than building three\nseparate Excel tabs. So our logic\nflow for this code is really simple. First is to input the financial assumptions. And then second is\nto project the free cash flow for\nfive years using a loop. And then number\nthree is to discount those flows back\nto today using our WACC to get the\nenterprise value. Now, moving on\nto the technical part of this assignment, we can see my\nparameterization here. I've defined WACC\nas a 9% discount rate and a tax\nrate at 25% of .25 estimated corporate\ntax rate, which we could find in the assumptions\ntab right here. now moving on we have\nthe scenarios equals we have the base case\nand the upside and downside that i mentioned\nearlier um in the this is the engine of the\nmodel i created a dictionary to hold\nthree scenarios which i mentioned the base case\ntold in eight percent growth upside is a 12\ngrowth assuming the digital strategy works\nand downside is a four percent growth assuming\nmarket saturation and by having these three\nscenarios um and writing the code this way\ni can change one number and the entire\nevaluation updates automatically um so once\nwe i already run the code but i'll rerun it again\num here we can see um see that dc evaluation\nresults and market multiples and a chart\nas well as the base case cash flows um\nnow we gotta check the numbers and performance\nsensitivity analysis. By looking at the\nbase case valuation, the code has\noutput a base case valuation of approximately\n$8.6 million. And now looking\nat the cash flow table generated\nby the code we see revenue grew from\nsix billion to over eight billion\nin year five as you can see um if\nthis aligns with the 500 store expansion\nplan now to evolve this model even further we\ncan test the sensitivity like as the question\nis like what if interest rates rise\nand our cost of capital increases and the action\nwe could do is like i mentioned we can\njust easily alter the code by replacing the\nnumbers. We can change the debut ACC to a\n10% discount rate rather than a 9% and\nthen run the code again. By running the code, the\nchart and the valuation results and multiples\nhave changed. As you can see, the\nvaluation instantly drops from 8.6 million\napproximately to approximately 7.4\nmillion in the base case valuation. This shows us\nthat Panera's value is highly sensitive to\nthe cost of debt which is a key risk for a\nleveraged buyout and so I'll just I'm gonna\nput it back to how it was originally\nbefore 0 and 9% discount rate it was just to\nprove that um there was going to be a key\nrisk for a leverage buyout if the discount\nrate were to go up now to reflect on that um this football field\num chart visualization visualizes our like\nposition um the blue bars represent our um\ndcf valuation uh range and um the bottom bar\nshows the strategic um buyers you can see\nthey are valuing the company much higher up\nto 14 million i went 14 billion this is\nbecause um they can realize synergies that\nwe as kkr cannot and my recommendation for\nthis is that we should not get into a bidding\nwar with strategic buyers and this is\nbecause kkr should submit a bid in the 11.5 to\n12.5 billion range which means that this\nimplies a roughly 13x ebitda multiple which\nis disciplined and um if the price were to\ngo above if the price goes above 13 billion\ndollars we should walk away as the\nreturns would no longer justify the risk without\nthe operational synergies a company like\nMcDonald's would have. So, thank you.That would be all."
}