{
  "student_name": "Andrew Kuper",
  "org_defined_id": "036275825",
  "username": "kuper",
  "email": "",
  "transcript": "So, I'm Andrew Cooper, and I'll be talking about cost of capital analysis. And, so, for this, uh, assignment, I had to, uh, calculate the weighted average cost of capital for Netflix in connection with a hypothetical $5 billion content investment decision. My analysis must determine the current, uh, average cost of capital, evaluate the impact of additional debt financing, assess project-specific versus firm-wide discount rates, and compare Netflix's cost of capital to industry peers. So, for the parameters that we have that are the hypothetical ones, so market capitalization is $200 billion, the total debt book value is $14 billion, the debt market value is $13 billion. The equity beta is 1.3, the bond rating is BBB plus at a yield of 5.8%, the corporate tax rate is 21%, the current stock price is $450. And the market conditions are that there is a risk-free rate of 10-year treasury at 4.5%, and there is a media industry weighted average, sorry, weighted average cost of capital range of 8-10%. And there's some strategic content. I need to know for this assignment, which is that Disney's capital structure is 70% equity, 30% debt, so that weighted average. Average cost capital is 8.2%. Amazon Prime Video uses Amazon corporate weighted average cost capital, which is 9.5%. So, Netflix is considering a 3.0.0 billion dollars additional debt issuance for content investment. So, for required, for some required, required analysis that I have, is that I need to calculate Netflix's- current weighted average cost capital. I need to determine the weighted average cost capital after the three billion dollar debt issuance. And I need to evaluate project specific weighted cost capital U.S. content versus international content. And then I need to compare Netflix's, Netflix's cost capital to Disney and explain the differences. And I need to recommend an optimal. most. Capital structure strategy. So for define, uh, pretty much as what I said above. So my objective is to evaluate Netflix's current cost capital. And see. How the additional debt impacts a $5 billion investment. So I need to compare Netflix's- weighted average cost capital to other competitors, such as Disney and Amazon. So for a represent, I need to use all the data above and implement it into equation on the next stage. Oh, whoop. Whoops. So. So, uh, above is all this. us. And, uh, pretty much I have to use all the other stuff for these equations to solve for cost of equity, effort, cost, tax, cost of debt. So, how I implemented it is, uh, first I would calculate the cost of equity, or the cap end, with using 4.5% plus 1.3 times 5.5%. Which is 4.5% is the risk free rate, uh, 1.3 is the beta, and 5.5% is the market risk premium. That's how I calculated the cap end. how I calculated the after tax cost of debt is 5.8% times 1 minus 21% or .21, which gives you 4.58%, which is right here. These two, that's how I calculated the after cost. So then I calculated the weighted average, uh, cost of, and, er, uhh, ehm, sorry, cost of equity, across the capital. And that would be, I'd first solve for the current equity way, which would be 200 divided by a 200 plus the diarrase of 200 billion divided by 213 billion. Which would be like, or 94% roughly. And then you'd do 13 million divided by 213 billion, which is around 6%. And then you solve it by using those numbers. And multiplying it by, like, these two numbers above. So, you'd multiply by this for the, uh, the data, and you multiply by, at this for the equity rate. And you get a lot of, like, 20%. And then, after $3 billion, so instead of these numbers being 94 and 6, it would be, 7.5 and 93ish. Because you do it out of 216 instead, and then you do 16 here. here. So, how I validated this is, I pretty much checked all of these numbers from above, make sure I use the right numbers, and make sure I use the right calculations for each equation. And so I checked all of these equations and made sure I use the right numbers for them. And they are all accurately calculated. I literally, I checked all the numbers. I checked to make sure all the equations were accurate. So, that's how I validated all of it. So, on my evolve step, so pretty much the current weighted average cost of capital is, for Netflix is 11.21% meeting. Netflix pays 11.21% to get money from my business. This means that Netflix's average cost is a bit higher than the rest because, Disney's is 8.2% and Amazon Drive is 9.5% so they have a little bit higher. Pretty much meaning that they, uh, use investors' money. More than bar right money. So after adding $3 billion of debt, the way the average cost actually goes down, because bar and money is usually- cheaper than investment money, but borrowing can- too much money can be a little bit dangerous. So the cost of equity is the amount of money that Netflix has to return to its investors, meaning that Netflix has to pay more because it's a little risk here to invest in Netflix because there's a lot of ups and downs, and- and- and pretty much investing in that- Netflix is, like, taking an equity, so if their whole, like, thing crashes, their whole company crashes, they don't lose money because you invested in it, but if you borrow money, they still have to pay it back, so that's why- that's a little bit more risky. After just, like, tax cost of debt in terms of Netflix means that they'll save more money if they borrow it rather than using investors' money. This means that- Netflix is paying more than Disney and Amazon because they use the most- they use mostly equity, so they give out equity to people investing in them. And then pretty much borrowing more money means there's going to be more tax savings. Pretty much you don't have to pay as much interest and stuff to people. So overall, the- in the reflection- The netflix has a current cost capital higher than competitors because it relies mainly on a equity. When adding- Are they? That much. So pretty much this time in his job, that bar money can be better than using invested money because of taxes and college capital. But, you need, you need to, that, be able You need to borrowing money and using invested money because if you borrow too much money and you can't pay it back, you're pretty much screwed. You're going to be in debt for a very, very long time. And if you're using too much money, you money. You start to make less profit out of the company. So pretty much it's basically debt versus equity, which how much debt you want to go into. Like, that you have to pay back versus how.",
  "video_url": "https://youtu.be/ILTqR_6SJiU"
}