{
  "student_name": "None None",
  "org_defined_id": "035790328",
  "username": "jmstaton",
  "video_url": "",
  "transcript": "Hi, my name is Jacob Staton and this is\nmy session three assignment.\nSo for this assignment, instead of just\nmaking like a basic savings calculator,\nI have decided that I wanted it to be a\nlittle more advanced and as per the\nrequirements for the assignment, I\nwanted it to answer I wanted to actually\nanalyze instead of just giving like a\nwhat answer. It actually analyzes what's\ngoing on and tries to change it. So this\nis an app I've developed using AI. It's\ncalled Aura.\nAnd over here it has some basic\nfinancial info.\nGives us our net worth.\nIt increases over time with some value\nnumbers.\nDown here we have a monthly spending\nlimit and it's divided into into three\ncategories at the moment. You've got\ndining and leisure, groceries, and\ntransport.\nTransport and groceries are fine because\nwe're under 100%.\nHowever,\nthat may be because our dining and\nleisure, as you can see by this little\nnotification down here, it says exceeded\nby $140 cuz it's 112%.\nSo, the app will basically notify us\nand it will give us this notificationsaying, \"I've noticed a 12% increase in\nyour discretionary spending this month.\nwould you like to explore why this is\nhappening and how it impacts your\nlong-term goals? And so I respond yes.\nAnd then it says based on your\ntransaction history.\nThe primary driver is dining out, which\nis correct. It says you visited upscale\nrestaurants four times more than your\naverage, which will do it. And that\naligns with your recent promotion.\nHowever, if you keep maintaining this\nbehavior, it will delay your home down\npayment by approximately 8 months, which\nis not good. And it asks, should we\nadjust your budget or your timeline? And\nit's not just letting you know, it's\ngiving you a choice between adjusting\nyour budget or your timeline. And that's\nwhat I meant by\num what I meant by instead of just\ngiving you a heads up, it'll actually\nanalyze it and give you options based on\nyour current situation."
}