{
  "student_name": "Riley Gross",
  "org_defined_id": "037145708",
  "username": "gross132",
  "email": "",
  "transcript": "Hello, my name is Riley Gross and today I will be talking about market efficiency and behavioral finance. Specifically, we will be looking at the GameStop uh short squeeze in 2020 2021. Um so going straight into that, we have our um assignment right here. So, um, for anyone that doesn't know, um, in 2021, um, 2020, 2021, um, people on a Reddit or subreddit called Wall Street Bets tried or figured out that they could mess with the GameStock price. Um, so ultimate ultimately a bunch of them invested in GameStop and it started rising and GameStop was trading very very low. it was um the market volatility was almost at one um and it it wasn't really having much returns. Wasn't a great stock to be invested in. Um but that's kind of the point of today is that how markets can shift by people's behavior. So first off, I will be utilizing the driver framework um to go along with this and I will also be utilizing Python um which we will get to in a second. But first, I used Gemini, put my prompt in to get the Python code. Um, and then I said, you know, I'm a finance studying this specific market efficiency and behavioral finance. I'm looking to make a video and I want you to make me a Python script that would allow me to better understand this case study of GameStop and the short squeeze that happened. Um, so next thing, um, going to this. So, the first kind of problem um we were given was that it said GameStop was trading at 4 cents in August of 2020. Now, just looking up the um GameStop price in August 31st of 2020, we can in all of August, we can see it was trading about a dollar. Um you can see it was um going up some every day at open of the market um and closing at a higher price pretty much or for the most part especially towards the end of the month. Um so kind of the start of this these people on the subreddit um influencing the market some when you you know when you get enough people um to factor into it. Um so the next thing um that I will go over is kind of our second stage. which we already went over the define the problem. Um then the the answer to this one um the the inaccurate data would be look look up the data. You know um we clearly saw the opening price and closing price and anything in between um of that GameStop data. It was around a dollar to I would say a dollar um 50 in um August of 2020. So a way to correct that would be you know show them the actual financial data to your professor. um that way they can kind of understand that. And then just more uh I already talked about this um but the Wall Street bets they they made the price surge all the way up to $483. And then this was ultimately market manipulation but you know it it shows how people um can affect these markets. Um so uh moving on to our um our represent stage. Um we're going to be uh going over our Python code. So I imported pandas, numpy, mapplot, lib, um stats to give us uh data for this and as well as for the graphs to show to show us some good visualizations of what actually happened with the market and how it was manipulated. Um so we have um the split adjusted um numerical here um at a dollar um for August 2020. And then um we have these ranges of dates that it's giving us to help show in the visualizations. um and then giving us numbers um for our specific um beta scores as well as the uh stock price. That way we have some uh some way to graph these um based off of um historical data. And then we're looking at our squeeze returns right here. Um, and then the the overall returns and what it was, um, also based on historical data of the GameStop stock price and how it increased and then eventually flattened out um, after they already kind of took advantage of the market. Um, you know, and some some people gain themselves a lot of money. Um, and then here are the prices calculating returns um, based on the split adjusted price. Um and then um more series um data um for specific dates. And then we're also additionally comparing this um to the S&P 500 um which is the market itself essentially and seeing how it was manipulated. Um and then all of these are just graphs. So going to the output here, we already discussed that the actual stock price was hovering somewhere around a dollar $150 for GameStop in August 2020. And then we will be calculating um abnormal returns um which is basically just the actual return return minus the expected return. Then we're going to sum all these up to get our cumulative abnormal returns. And our expected returns is just the um beta um of GameStop times the return of the S&P 500. All right. And then uh going to our first graph right here, we have the squeeze. So the adjusted close price of GameStop in 2020 was very very low. And you can see down here, um, so this is, uh, October, so it's it's hovering around $4 at that point. Um, and then it it's kind of staying steady until about, uh, somewhere in January. Then it starts to rise. Um, as well as the volume of people buying Gamestock. Uh, you can see it continually go up right here. Um, it's adjusted closing price. So um this is all due to this subreddit buying this stock and figuring out that they could manipulate the market. You can see here the volume um is very vast but in uh between uh or January and February. So scrolling down a little more we're going to this is what we just calculated or we're talking about the abnormal returns. So the cumulative abnormal returns the actual minus the uh expected. So it GameStop's hovering right around uh zero which means that its actual returns was very close to what it um the S&P was basically predicting that its expected returns were going to be. So it was pretty um and based on spa score it was um we can kind of um compute it almost ourselves or estimate what it would have been because it's hovering right around this market uh price what it's actually happened and what it was expected to but in the middle of January like the other graph we see a large rise in abnormal returns meaning that the actual return was much higher than what it was expected to be the market didn't understand this, right? So, we actually had a peak in uh January of 355% um cumulative abnormal return. So, this is all the days um combined in this um timeline here. So, um yeah, right here we even say the spike is proof of an anomaly. We that line should be right around zero or the market price. So the next one is the beta score um over time. So this one starts in January and compares it to January 2021. It had a fairly um uh moving with the market. Its beta score was close to one kind of fluctuating up and down but on an average it was close to one. Um now it you know spikes some in um um June um but then it kind of goes back to normal but you can see uh in in January of 2021 it dropped drastically point4 so it's moving against the market um completely almost at a zero beta and then um and then it spikes way high uh super super volatile Um, and that's because the market didn't really realize what was happening. It this isn't something this this squeeze, especially at this level, um, isn't something that happens a lot. Um, and then you can kind of see it die down, um, as the months go on further into 2021. Um, but the market wasn't expecting this short. So, while it had it had a normal beta of 1.07, 07. Um, and then this peak squeeze right here um right in uh January um was basically the the time that all these people invested in the stock and it completely messed up the company's or the stock prices volatility. The market um eventually adapted um but it didn't exactly know what to do at that point. So going back to um our driver framework, we have now implemented, we have validated, we looked at the um implementation was the Python code um and then the validation was these graphs we just looked at and then the evolution was looking a little further. Um, in that last one, looking at the the beta score, the how the systematic risk or the the volatility um changed due to this uh market anomaly in which people um raised the stock price um in its returns from only um about a dollar to all the way up to you know 483. Very very um large increase. So moving on to the reflection stage. In hindsight, um this analysis shows that markets aren't perfectly efficient. Um you can see that this is a great example um of this because there was a semi- strong form of the um efficient market hypothesis. Um, but it was broken due to this frenzy of people using publicly available information buying up this stock. Now, you might say, why might these are just individuals, why didn't maybe a a hedge fund um try and short this stock the other way? And it's because they couldn't. There was so much chaos within the market and um such a strong sense of hurting um with the people that invested in the in GameStop stock or GameStop stock um that they couldn't end up shorting this the opposite way to bring it back to market price. They knew it was completely off, but these people had manipulated the market given public information. Now, some things to ponder on now that we understand went through this case, went through the driver framework, is that when there's publicly available information and people utilizing um things like that to um short the market. Something to keep in mind is that is it ethical? Should should you give this information to others if you have certain information? maybe not necessarily insider information but information that could help you um in which it can also crash the market. So the the main idea here is that markets aren't just simple values of of money. They're very chaotic, complex. They're not perfect. They also take into account human behavior. As we can see here, many people um or people working in a group or a herd, they can control a lot more um than you think. And it it it shows that kind of like brings in risk into the factor. That is why there is risk because markets aren't perfect. If they were, it would be easy to calculate and everyone would be investing. Thank you for listening today. I hope you learned more about market efficiency and behavioral finance.",
  "video_url": "https://www.youtube.com/watch?v=HzObi5E4aso"
}