{
  "student_name": "Vladimir Cruz",
  "org_defined_id": "025515744",
  "username": "cruz22",
  "email": "",
  "transcript": "Hi professor. So this is my session and assignment for calculating the uh well in this case it's going to be the cost of capital analysis for the capital uh budget. Um, we are going to be evaluating uh Starbucks's uh roaster that requires a 10 mill, excuse me, a $12 million upfront uh that it's going to be required to operate for at least 10 years. We're going to use the discount rate of 8.5% to determine um excuse me, whether the project is going to create value, shareholder value, or it's going to destroy shareholder value. So, it's got a couple parameters here that we want to consider, which is going to be the initial investment of $12 million, uh, working capital, revenues, operating costs, uh, cost of goods sold, taxes. So, uh, the very first thing I did here was to go to, uh, Collab. Of course, I've already I I sort of debugged it already. got all the uh the small things out so that I can go ahead and just present all my data. Uh so the very first thing I did was to calculate the MPV uh just to see uh whether or not it's a project that should be um accepted or or rejected. So uh let's see here. when NPV for this project is positive and it's $4.34 million. So that is this is going to be a project that should be um it should be accepted um after uh after I included all of my project parameters here on the left hand side in Python, I was able to create um a table for it to provide me kind of the cash flow analysis just to see um what my cash flow is going to be looking like after the first couple years. So total cash flow um as expected between years two, three, four, and five, we are generating $2.7 million. And this of course comes from this line right here. So we are expecting to have a little bit of a drop in cash flow um after we're beginning the sixth year. Uh next uh after evaluating the NPV just which was uh 4.3 million at a rate of 8.5%. I was able to calculate I asked it to um calculate the internal rate of return which I got here 13.25 through5%. So what we have is a roaster that's going to be generating uh cash inflows. It is a project that should be accepted and at the rate of 8.25% or sorry 8.5%. uh it's going to generate $4.3 million which is going to be much uh it's going to be very beneficial compared to the minimum um or the maximum I should say percentage of 13.25 which is where we break even. So if our NPV uh discount rate was at 13.25% 25% we would break even meaning that it wouldn't make a difference if we did consider uh this project or not because you know part of the business uh model is to generate capital so since we uh since we are at a rate of 8.5%. Then we will be generating something I did want to try with you here was let's see here I would like to um I would like to see as part of my sensitivity uh test just to see what the cash flow is going to be doing after a little file just to see um if my NPV if the discount rate was um 10%. I want to see what the um net present value is going to do, which I know from reading your uh your session 10 uh module, it's going to drop because it's going to be getting closer and closer and closer. So, um let's go ahead and try right now. We go too late. PV if% and this is just one sensitivity test that we could do. I mean we could we could even um recalculate MPD. We could even uh lower the taxes or increase the cost of goods sold. We could increase rent. We could lower the revenue. All of these uh different type of tests to see what the revenue is going to be doing. So it went from 4.3 to 3.4. So just a 1 and 12% increase um got us closer to the 3.4% which I had something here. So what happens is by increasing the discount rate you're getting closer and closer and closer to that net present value of 13.2 or or sorry closer to the uh internal rate of return of 13.25%. Meaning that as you increase the discount rate, that quantity of your of of what you can generate is going to be getting lower and lower and lower. And this makes sense because by increasing that rate, that means that the company is going to um take on more risk, right? So by having that sort of uh that safety margin decrease so to speak uh that that MPV is now getting closer and closer to where your shareholders are going to want to still see uh income generated. And this is all because uh it's it's got to do a lot of that weighted average cost of capital where you want to generate a specific amount for this roster you want to generate obviously as much as possible but given the current the current financial climate of let's say 8.5%. The MPV needs to be as high as possible. But of course, given the project parameters, it's only going to be able to be so much. The the thing that we need to remember here, of course, is that as long as your NPV is positive, it's still a it's still a um uh as long as your cash flow, in other words, as long as your cash flow is still positive, it is a um project that should be considered. So, uh, overall I think this project could definitely create value as long as it continues to exceed that required rate of return. Um, or even stay strong in sort of market. Um, of course, it's going to depend heavily on like the foot traffic and how many people uh are constantly purchasing and purchasing to increase revenue as much as possible. Even if it's an extra $100,000, you know, all that, of course, is going to be going to your MPV.",
  "video_url": "https://youtu.be/tREN_CAKej4"
}