{
  "student_name": "Ethan Sleeth",
  "org_defined_id": "038097599",
  "username": "sleethe",
  "email": "",
  "transcript": "Hello everyone, my name is Ethan Sle and welcome to our session of portfolio risk and return analysis leveraging a structured approach we call a driver framework. Today we will explore how to analyze and optimize a hypothetical $10,000 investment portfolio. Um so we start with the define and discover. Um we selected six different uh diverse assets. The Tesla, Apple, Johnson and Johnson, Exon Mobile, a bond ETF and uh the S&P 500 ETF and the SPY. Um for each uh we needed to um define their average annual returns and their standard deviations um which measures their uh vality. So next we represent our data um focusing on the relationships between these assets. These correlation matrix shows how the asset move in relation to each other. Um so for example the Tesla and Apple stock um they have higher positive correlation um meaning they often and move in the same direction. Uh in contrast bonds B and D um they tend to have a negative correlation with stocks acting as a diversifier when we then will convert them into a convariance matrix which is crucial for calculating the portfolio risk. Um so now we will implement our analysis. Uh we have a function to calculate a portfolio's expected return and return and risk given a set of asset weights. Um so we've designed four example portfolios. An aggressive one with a high-tech exposure, a balanced one, a conservative portfolio focused on stability, and a simple SPY only portfolio as a benchmark. As you can see, the aggressive portfolio aims for um the higher aims for higher returns but comes with significantly higher risk with the conservative one. It offers lower returns with much uh less volatility. So then this is my chart. Um so to validate our findings, we will compare our custom portfolios to the S&P 500 and the S&P. uh our benchmark has an expected return of 12% and a risk of 18%. So notice how our balance portfolio for instance uh offers a higher return at 17.25% um with a slightly higher manageable risk of 20.12%. So suggesting the potential for the uh outperformance um so moving to evolve we stimulate thousands of random portfolios to generate the efficient frontier. Uh the plot shows that the optimal portfolios that offer the highest expected return for a given level of risk. Um any portfolio below this frontier is a suboptimal. Um so we've highlighted our four portfolios um showing where they sit in relation to this frontier. The goal is to where to be as close as possible to or on the efficient frontier as possible. So finally um I'm going to reflect uh based on our analysis the balance portfolio stands out. Um it shows roughly a 17 uh 25% offer expected return with a 20.12% risk. This is a higher return than the S&P 500 but with a moderate and acceptable level of volatility. um investors or I'm sorry making it an attractive option for many investors looking for a good balance between growth and stability. Thank you for watching.",
  "video_url": "https://www.youtube.com/watch?v=vZM0Kf2V0dU"
}