{
  "student_name": "Campbell Schmonsky",
  "org_defined_id": "037406837",
  "username": "cschmons",
  "video_url": "https://youtu.be/kLb7nfu47cg",
  "transcript": "All\n\nright, I'm going to share my screen\n\nand then we will go here. So, this is our mission. 28 years old, making $85,000 a year and tired of paying the $2,200 a month in rent. And I found a condo that I love. Um, the purchase price is 24 $425,000. HOA is $350 a month. Property tax 5,100. Insurance is 1,200. current mortgage rate is 6.8% just fixed for 30 years and I have $95,000 saved for the down payment and closing costs and then they're estimated to be $12,000 for closing costs. Um five years I'm I may not move in five years but may after five and I'll put 20% down on the down payment. So, the true cost here would be the buying cost, which is the HOA fee, um the property tax, the homeowner's insurance, um the maintenance and repairs, which isn't on here, but and then the renting costs, which is right here, would be the 2200 a month. Um and then the nonmonetary factors are the flexibility. Renting is more flexible. The control and lifestyle of owning gives more control for like renovations and stuff. If I do spend more than five years here, maintenance, owning requires more time for maintenance and inflation. Walked in rent protects against inflation for 5 years. Um, so the minimum questions here that we need to explore which will go step by step, but I'll go ahead and list them all out. So the for the true monthly costs, what's all what's the all-in monthly expense for owning versus renting? the equity buildup, how much wealth, principal paid and appreciation is built in five years. Um the decisional factors, how to compare and decide on buying versus renting and mortgage points, what are points that should what are points and should they be considered for the deal. So first we'll look at mapping out cash flow. Um so upfront a down payment is um the down payment times 20% is $85,000 which is saved. Outflow would be the down payment which is the $425,000 time 20% which is the $85,000 plus the $12,000 in closing costs. The entire down payment is available and requires dipping into the remaining 10,000 saved for closing the monthly owning. So, the tax savings for the inflow, the mortgage interest rate and property tax deduction, the rent income from similar condos is $2,600. The outflows where the principal and interest form mortgage calculator and the HOA insurance taxes monthly pro rates are still outflows. Um so to calculate um property and insurance first tax savings offset cash outflows and the then used as benchmark for comparison/ rental value. Um the annual owning appreciation is 4% of the property value annually. The maintenance is 1% of the property value annually and then the appreciation is a non-cash gain. Um then the monthly rent rent renting is rent is $2,500 which is an outflow but it's locked in for five years and it's simple predictable cost. The opportunity cost for inflow is the investment returns on the funds not used for down payment. And then um uh to use a conservative annual return on the $97,000 needed to buy. Um then we'll look at some of the questions that we've had. So the implement the comprehensive calculation the mortgage and affordability the down payment would be the $425,000 here which we see times the 20% equals $85,000. And we actually have this all down for these next few scenarios that I'll go ahead and put into Google Collab. Wait,\n\nlet's see. copy\n\ncode.\n\nOkay, we'll just\n\ncollab. Okay,\n\ngreat. Then we'll run this\n\nUm,\n\nI don't know where it's from.\n\nAll right. And then in here, we'll head code.\n\nNo. And then we'll go here and we can paste it. All right. And then we'll play the code.\n\nUm, okay, that's not working, but I can just talk through all of the scenarios. Um, okay, so the mortgage and affordability, we already went through that. Then the part B is the total monthly cost of owning versus renting. So for monthly cost for owning would be the um PNI base of 6.8% the HOA fee the property tax the home insurance and the maintenance and then for rent it would be the rent and then the true monthly cost outflow. So for a question the first question that we started talking about the base cash cash outflow for owning before tax benefits is approximately 30 $3,451 a month while the locked in renting cost is 2500 a month. Um and then we can talk about the equity buildup in five years. So equity buildup comes from two sources. Principal paid and then the appreciation. Um the principal paid after 5 years is using an amortization schedule. This is where your Python code could come in handy, but um so the total interest paid is $114,000. The total principal paid is $18,000 or $18,300, sorry. And then the property appreciation assuming a stable annual 4% appreciation. So the property value after 5 years would be around 5 thou $516,775.\n\nThe total appreciation gained would be about $91,000. So the um equity in five years for an for an initial down payment would be $85,000. Equity build from principles would be $18,300. Equity build from appreciation would be 91,775. and the total equity would be1 $195,75.\n\nUm, so the points here are that mortgage points or discount points are fees paid upfront to the lender in exchange for a lower interest rate. Um, the definition is that one point equals 1% of the loan principal and paying two points gets a rate down from 6.8 8 to 6.5% and the cost of points um would be $6,800 upfront cash. Um so calculating the savings from the lower rate to determine the break um the break even point here would be about 93ish months which would be about 7.8 years. Um so should you consider the points? Now, you should not pay the points. The um the break even point is about 7.8 years, but you're only sure you'll be in the condo for 5 years. Since the cost of points would be not recovered by the time you move, paying the extra 6,800 upfront is not financially advisable for this scenario. Um this decision is really sensitive to the appreciation rate though. So, if the appreciation is 0%, your equity gain drops by almost $92,000 and buying looks much worse. If appreciation is 6%, your appreciation gains is $119,000, which looks a lot better. So, the opportunity cost of your down payment is another major factor. And the $97,000 used to buy could be invested elsewhere. If a portfolio returned 10% annually, then a significant potential loss of returns. Um, so how do you think on deciding buying versus renting? This decision isn't really about the monthly cash flow, but about the total wealth impact over the 5-year period. Um, so the monthly cash outflow for a condo is 34 by for buying it would be the $3,451 versus the rent would be $2500. Um, the upfront cost would be $97,000 for buying and it would be about $5,000 for securing a deposit for renting. Um the wealth build in five years the net gain would be um the total equity of 195k which is offset by the 114k interest. And then for rent you would have a net loss total rent paid would be 150k. Um and then the flexibility would be low for buying high transaction cost to move. Rent would be um easier to leave after the lease. And then the risk is higher for buying because of market risk and maintenance risk and rent would be low because the risk is the landlords. Um so after seeing all of that from just these details that we see here, um\nour conclusion would be the immediate cash flow renting is $951 a month cheaper in cash outflow which is significantly improves your monthly budget and s savings rate. The long-term wealth is buying if the 4% appreciation holds is the clear wealth builder. Um the deciding factor since you're not moving since you are not moving in five years. Buying provides a mandatory savings um and a leveraged investment. The wealth creation outweighs the high monthly cash costs assuming that you can comfortably afford the 3,451 monthly outflow on your $85,000 salary. So the recommendation for myself in this scenario would be to buy um providing that I'm able to prioritize wealth building and that I'm comfortable with the higher monthly cash outflow and the commitment to stay for at least the fiveyear horizon. So thank you."
}