{
  "student_name": "Ronak Badam",
  "org_defined_id": "036108316",
  "username": "rbadam",
  "video_url": "https://youtu.be/AFzFkuOEB9I",
  "transcript": "there we go. Hi. Hi, my name is Reoxai\nand today I'm going over my final\nproject um or capstone project for\nmanagement 310. Um so I utilized Gemini\nas well as other uh AI softwares create\nan AI financial analyst that was uh that\nis currently being hosted on a GitHub\nrepository and is written in HTML. So\nthis homepage kind of is my index.html\nHTML page. Um, this like the dark info\nbox um that I chose to go looks clean.\nUm, so\nthe goal of this interface was\nsimplicity essentially. I just wanted to\nkind of give a box um and then allow\npeople to input what they want and get\nthe AI need that they uh get get the AI\nhelp they need. So um here uh we're\noften especially in finance overwhelmed\nby like terminals and dense excel sheets\nand then so this is kind of just a\ncommand line where you can input raw\ndata or complex questions and get uh\nstructure strategic answers. Um so\nbehind this HTML lies lines input box\nlies like a regular application of\nfinancial theories we covered in uh\nsection seven and 8. So\nlet me start with a demo that I uh wrote\nout earlier. So this is this is what I\nwrote out. Um so value Netflix beta is\n1.5, risk rate is 3.2, market premium is\n7.3 and then we calculate the cost of\nequity and explain the risk profile. So\nwe go analyze.\nOkay. And so in our result the tool\ncalculates a 13 12.3\num\nuh positive equity and then it correctly\nidentifies it with a beta of 1.25.\nNetflix sits above the market on the\nsecurity market line. It also\ninterpreted interprets this as high as a\nhigh volatility asset that requires a\nhigher return than the market average.\nthis 12.3 is the number I would now plug\ninto a discounted cash flow model. And\nthen so now we're going to type uh we're\ngoing to um\nwe're going to uh write in a new\nanalysis or a new question.\nSo um we can have it analyze on top of\nthat. So we can do that.\nAnd so\nas it said um\nthat based on like the financial data\nprovided the asset appears to be trading\nat a premium relative to its historical\nbeta. So the systematic risk is that the\nbeta is high and the market sentiment is\nbearish. And so\nthe tool doesn't stick to just formula.\nIt's it also flags behavior of anomalies\nwhich is really good. And then um as\nhere it it talks about the post earnings\nannouncement drift and the uh tendency\nfor stock to keep moving days after news\ncomes out because investing is slow.\nUm\nand yeah, that's kind of my whole uh\ncapstone project for management 310.\nThank you. My name is Shoxai and yeah,\nthank you for listening to me"
}