{
  "student_name": "None None",
  "org_defined_id": "035938460",
  "username": "wborows",
  "video_url": "",
  "transcript": "Hi, my name is Will Borowski, and today I'm going to be showing you my Mini Project Three that I created. So, essentially, this is a saving goal investment recommendation generator. You're going to put in a bunch of information, and it's going to generate recommendations for where you should invest your money to be able to hit those saving goals you have in the future. So, let's begin. As you can see, this is Version One. It's very simple. What's your saving goal amount? Let's say that's 300,000. What's your monthly income? Let's say that's around 6,000. What's your saving percentage? Around 30%. And we're going to go with a moderate risk. As you can see, we automate and generate recommendations. It gives us a pretty quick, pretty short, text based answer. It gives you a summary of your monthly savings, how long your time horizon is, and it gives you asset allocation suggestions. In this case, it would be 70% stocks, 20% bonds, and 10% treasuries, which makes this calculator very simple and very basic. And now we go to our V2, or our new and improved version. Essentially, in this one, we are using real time prices and real time rates in the stock market to be able to determine if we should put more into stocks, put more into ETFs, put more into bonds, all of that stuff. It also has a simple memory state, which keeps your options inside of a database to be able to look back on it person by person. And then, as you can see, we are going to execute our workflow. We are going to execute now. And this is the first prompt that it begins you with. What's your primary investment goal? Let's say that is buying a house. This is important because it allows you to look back at these forms and see why people are investing more and which goals are more common. And then what's your target amount? Let's say our down payment is around 300,000, like we used last time, and a 5-to-10-year span. We're going to have the same risk tolerance with this: moderate. And then we're going to go down to our current age. I'm currently 21. I don't have a monthly income currently, but let's just say it's 6,000. And we're going to invest around 2,600 a month. So, we generate this, and it takes a little bit because it needs to sift through a lot of data, sift through the markets, sift through the AI tool to be able to come up with the best recommendation for where you should put your money in general for this prompt. And it should be almost done. And there it is. As you can see, it gives you the prompts that you fed. It lists it all out. It lists your risk tolerance and timeline. And then it gets down to your personalized investment strategy. It gives you essentially your diversification. It tells you where it suggests you put your money, whether that's stocks, bonds, fixed incomes, real estate, cash, or tax-efficient accounts. As you can see, for our certain timeline and moderate conservatism while investing in the stock market, it says that we should put 50% in equities, and it gives you the breakdown: US large-cap, US mid-to-small-caps, and international stocks. And then it gives you bonds and fixed incomes, how much to put in both, how much to put in real estate, and how much to put in cash, essentially. And then down here, it gives you your average return estimation for each based on average market return. And then it gives you next steps and what it thinks you should do with your money. Essentially, it thinks that by having a moderate-risk portfolio over around 7 to 10 years, you're in a good position to meet that 300,000 home-buying goal while also managing risk appropriately. And then it gives you a few actionable steps to also take to make sure you hit these goals. And yeah, so then we get on to our reflection questions. AI changes user experience by enabling greater personalization, faster problem-solving through automation, and more intuitive interactions. It also allows systems to anticipate the user's needs and deliver context-aware, highly relevant information and services, while also moving the experience from reactive to proactive. Then financial prompt engineering was challenging; that was primarily due to the need for extreme accuracy and reliability while dealing with sensitive and real-world monetary decisions. Ensuring that the AI's output adhered to complex and evolving regulatory compliance and accurately interpreted nuanced financial terminology under various market conditions required rigorous testing and iterative refinement. And then we get down to the main ethical concerns, and that's going to be bias and fairness in financial recommendations, ensuring that the tool doesn't perpetuate and amplify existing economic inequalities. Also, there's the challenge of transparency and accountability, making sure that users understand how the AI arrived at specific financial suggestions and what the limitations of the tool in general were. And then while trusting the tool with real money, while the underlying models are designed for high reliability, I wouldn't trust any current AI tool, including my own, with complete autonomy over real money without human oversight. The tools are best utilized as powerful assistants for analysis and suggestions, but the final, high-stakes decision on the deployment of real capital must remain with humans to mitigate the risk of unseen model failure or black swan events in the case of those. And yeah, these are my Version One and Version Two of my investment recommendation calculators using this AI. Thank you."
}