{
  "student_name": "Ethan Sleeth",
  "org_defined_id": "038097599",
  "username": "sleethe",
  "email": "",
  "transcript": "0:00:06.320,0:00:11.680 Hello, my name is Ethan Sle. Um, this video I'm walking through my full driverbased capital 0:00:11.680,0:00:17.040 budgeting analysis for Starbucks proposed flagship grocery. Um, so I'm going to show 0:00:17.040,0:00:22.560 you how I defined the problem, represented it mathematically and imple implement it into my 0:00:22.560,0:00:30.480 Python that validated the results and involved it with the sensibil sensitivity testing and finally 0:00:30.480,0:00:39.840 reflected on what my recommendation was. So I started with um defining the financial 0:00:39.840,0:00:45.120 problem. Um, so Starbucks is considering a $12 million investment to build a flagship grocery 0:00:45.120,0:00:51.280 that will operate for 10 years. The project requires $500,000 of working capital at launch, 0:00:51.280,0:00:58.000 which will be recovered at the end of the year 10. Starbucks WACCC is 8.5% and that becomes 0:00:58.000,0:01:04.480 the hurdle rate for the evaluating project. So the decision question is does the project create 0:01:04.480,0:01:11.760 value after discounting all the future cash flows at Starbucks at an 8.5 cost of capital. To answer 0:01:11.760,0:01:19.680 that I need to build a year 0 to10 free cash flow statements. I need to uh compute the MPV, 0:01:19.680,0:01:27.120 the IRR, the simple and discounted payback and the profitability index. I need to run a sensitivity 0:01:27.120,0:01:33.360 um analysis on the revenue and the WACC and then I need to combine the financial results with the 0:01:33.360,0:01:43.840 strategic uh material recommendation. So before coding I structed the entire module. Um so the 0:01:43.840,0:01:53.200 revenues year 1 8 million year two through five um you have 11 million and then year 6 through 0:01:53.200,0:02:07.040 10 9 million and then the operating cost um you have 40% revenue of the cogs uh labor is 2.5% 0:02:07.040,0:02:13.040 or 2.5 million per year the rent and utilities is 0.8 8 million and then the marketing comes 0:02:13.040,0:02:21.280 out to 0.3 million in year 1 and 0.1 after. Um so the depreciation straight line of 12 0:02:21.280,0:02:28.320 million over 10 years is 1.2 million per year. Um and then you have 25% taxes with 0:02:28.320,0:02:35.440 that. So the terminal value 3 million at year 10 which becomes 2.25 million after tax because 0:02:35.440,0:02:43.840 the asset is fully depreciated. Um so then we have the terminal or the cash flow formula. So 0:02:43.840,0:02:53.600 uh year zero the FCF is -12 million minus 0.5 million and that equals -12.5 million. Years 0:02:53.600,0:03:02.400 1 through9 the FCF is the operating cash flow. Year 10 the FCF equals OCF plus 2.25 0:03:02.400,0:03:11.840 25 million terminal value plus 0.5 million working capital recovery and then I also plan the Python 0:03:11.840,0:03:18.960 uh architect. So one function to build the cash flow, one to calculate the metrics or the 0:03:18.960,0:03:25.040 metrics and then one to run the sensitivity scenarios. So this is planning that ensures 0:03:25.040,0:03:31.280 the code is clean, re reproductible and uh perimeter driven. So now that 0:03:32.160,0:03:42.480 I implement the code. Um so running the script generates the cash flow uh table automatically. 0:03:42.480,0:03:49.760 Uh year one the OCF is around 1.2 million. Years 2 through 5 is around 2.7 million. Years 0:03:49.760,0:03:59.040 6 through 10 is around 1.8 million. And then uh the final year 10 is around 4.55 million. 0:03:59.840,0:04:06.960 Um, so then after this I'm calculating the core capital budgeting metrics at Starbucks at an 8.5% 0:04:06.960,0:04:20.080 WACC. Um, so the MPV is 2.69 million. The IIR or the IRR is 12.8%. The profitability index is 0:04:20.080,0:04:29.120 around 1.22 22 and then the simp simple payback is around 5.3 and then the discounted payback 0:04:29.120,0:04:36.480 is around 8.2 years. Um so I also display the two uh visualizations. So I have a bar chart 0:04:36.480,0:04:43.600 and then I have the uh sensitivity chart MPVs under the baseline alternate scenarios which 0:04:43.600,0:04:52.080 you see right here. And then this is my bar chart. And then I got this one. So, 0:04:52.080,0:04:58.240 um, the total depreciation equals the original 12 million, confirming the straight line schedule. 0:04:58.240,0:05:04.960 Year two, the EBIT and the OCF match my hand calculations exactly. And then, 0:05:04.960,0:05:11.760 um, so plugging the IRR back into the MPV equation produces the MPV near zero, which confirms the 0:05:11.760,0:05:18.480 accuracy of the IRR solver. And then um our cash flows the signs and the discounting align with the 0:05:18.480,0:05:25.600 capital budgeting standards. So this confirms that the module functions properly. Um so now 0:05:25.600,0:05:33.440 I want to evolve the analysis with the sensitivity test. Uh so if the revenue is 20% all revenues are 0:05:33.440,0:05:43.840 uh scaled down by 20%. So the MPV drops to 3.08 million and the IRR falls to about 3.1%. 0:05:43.840,0:05:50.880 And this shows the project becomes destroying if revenue underperformed meaningly. 0:05:50.880,0:05:58.400 And then the baseline will stay at or I'm sorry the WACCC is now 2% scenario. So the 0:05:58.400,0:06:05.520 uh baseline cash flows are at 6.5% WACCC and then the MPV rises to 4.24 0:06:05.520,0:06:15.920 24 million and then at 10.5% WACCC you have a MPV remains positive at 1.35 million and this tells us 0:06:15.920,0:06:22.560 the project's very sensitive to the discount rate fluctuations but high sensitive to the revenue 0:06:22.560,0:06:31.040 performance. So reflecting on the analysis, the base cap MPV is positive. The irr exceeds the 8.5 0:06:31.040,0:06:39.360 hurdle rate and the um PI is less than one. So the project fits Starbucks brand, the strategy and the 0:06:39.360,0:06:45.280 experimental retail model. Um but the revenue risk is a dominant factor. I found the project 0:06:45.280,0:06:51.440 uh it only succeeds if the rotisserie hits its pro projected traffic and spending levels. So, 0:06:51.440,0:06:56.480 I would recommend that Starbucks accept the flagship grocery project, but it generates a 0:06:56.480,0:07:04.080 positive MPV in the IPR or the IRR under realistic assumptions and supports long-term brand strategy. 0:07:04.080,0:07:07.600 But, however, revenue performance must be carefully managed. The location, 0:07:07.600,0:07:11.680 the marketing, the pricing, and the customer experience are critical. Underperformance 0:07:11.680,0:07:17.040 is revenue and is the biggest threat to financial success. Thank you for watching.",
  "video_url": "https://www.youtube.com/watch?v=8VfGwoWbvlA"
}