{
  "student_name": "Hector Silen",
  "org_defined_id": "036247734",
  "username": "hsilenri",
  "video_url": "https://youtu.be/C8d-ejXhRbw",
  "transcript": "Hello, my name is Hector Selen and this is my video submission for the session 12 assignment. So for this assignment, I'm presenting evaluation of Panera Bread to advise KKR on a potential takeover. I'm using the driver framework uh to guide my analysis and a Python script to help me with my calculations. So moving on to the define step. Uh so my objective is to produce a defensible bid uh range for KKR a financial buyer. So the core conflict is avoiding overpayment in a market where strategic competitors like Starbucks may pay premiums for synergies that KKR cannot realize. So moving on to the discover step. Uh based on the deal snapshot snapshot I identified Panera's $6 $6 billion in revenue and $900 million IIDA and in this the market is trading high. So we have competitors like Chipotle at 35 times P& but president transactions for similar assets are lower around 12 to 15 times IBIDA. So now moving on to the represent step uh so for my I've made my Python model to triangulate value using three methods. So a multi- scenario DCF uh the a trading comps and a president transactions. So I have structured the code using an object-oriented approach uh creating a config class to store these uh assumptions and this allows me to toggle variables instantly for scenario analysis. So as you can see here uh my config uh function uh for the calculations with the all the values the uh six uh uh billion and the 900 million. And now moving on to the implement step. Uh here uh with the run DCF uh model function I calculate the free cash flow by bringing IBIDA to uh notepad and uh then adjusting for capex and networking capital changes. So if we run this code\n\nso uh as you see uh from the output uh you can see the intermediate calculations here in the base case schedule. So we project steady FCF growth over the uh 5year period and uh I utilize a standard uh per perpetuity uh growth method for the terminal value discounted back at 9% whack and this transparency insurance we aren't just relying on a blackbox number. So this can also be seen here. So uh next I need to validate and evolve my findings. So since valuations are uh sensitive to assumptions I built a sensitivity matrix or heat map using uh Python. So here is the heat map. uh this visualizes how enterprise value shifts with whack and terminal growth. So even if market conditions uh worsen and whack rises to 10% our valuation flow remains defensible around $12 billion. I also ran ran an upside and downside scenarios. So uh this is crucial\nuh this is crucial for distinguishing between uh us or KKR and a strategic buyer. So a strategic buyer like McDonald's might assume the upside case by default because they can realize cost synergies. So basically cutting overlapping supply chains which justifies a higher price point that we can pay. So uh finally onto my last step uh the reflect uh the reflect stage. So these uh football field uh chart synthesizes our analysis. So first of all, the DCFbased case suggests a value of roughly 13.8 billion dollars. Uh second of all, the president transactions uh which is the bottom bar suggests a range of 10.8 to 13.5 billion. And third, uh the trading comes very widely but generally skew lower than the DCF. So uh to conclude my final recommendation for KKR is uh to propose an opening bid of 11.5 billion so approximately uh 12.8 uh EBIDA and this anchors us within the president transaction range but offers a premium over public peers to inside management. So basically the strategy here is that we should highlight the 10% management rollover as a key differentiator and we offer them independence and a future IPO exit whereas a sale to Starbucks would likely result in uh management redundancy. So the walk away price so our ceiling is $13.5 billion. So beyond this uh the IRRa compresses below the 20% required for financial sponsor and we would be entering uh strategic buyer territory where we cannot uh compete on our synergies. So thank you for watching."
}