{
  "student_name": "Abbey Carroll",
  "org_defined_id": "035875419",
  "username": "carro146",
  "video_url": "https://youtu.be/vJTVSwwZc4E",
  "transcript": "Hello and welcome to my driver-based comprehensive business valuation of Panera Bread for a prospective KKR takeover. So in this walkthrough, I'm going to move step by step through each driver stage. Define, discover, represent, implement, validate, evolve, and reflect while showing the actual Python model outputs and the valuation logic that supports my final bid recommendation. So first we're going to do define the business question. So KKR is evaluating whether to acquire Panera Bread. So my goal is to determine one, should KKR pursue this acquisition, and two, if yes, what valuation range and bid strategy is financially justifiable? And then I also need to contrast a financial buyer's discipline with strategic buyer behavior, specifically Starbucks and McDonald's, who may justify higher prices due to synergies and brand adjacency. So next is the discover phase. So, gathering all the decision critical facts. So, here's the operating operating snapshot. There we go. Um, Panera generates $900 million in EBITDA at 15% margin, $400 million net income over 2100 stores. Digital sales are already 50% of the mix. management anticipates major growth growth levers. Um so around 500 new stores over the next five years, digital mix expanding to 70%, strengthening dinner and catering and early stage international roll out. So market valuation references um industry um\n\nPE is around two 22 times or 22x precedent um so EV divided by EV IT transactions um is 12 to 15 times Chipotle trades at 3 * P / So, McDonald's 25 times and then sector WACC is around 9%. Whoops. Whoops. Whoops. Whoops. Sorry. I don't know how I got there. There we go. Um, so now in the represent um in the represent stage, I mapped out a full plan for the model. So, one build an input block starting. So it's going to have starting revenue, EBI, TDA, tax rate, KFEX, DNA, D and A, working capital, WACC, terminal growth, and exit multiples. And then two, write a use a reusable DCF function. So projecting a 5year revenue, EB, ITGA, NOAT, FCF, and terminal value under two methods. Three model three scenarios. So base upside and the downside varying growth and margin expansion expansion assumptions. Four, construct trading comps and precedent transaction tables to benchmark valuation ranges. Five, build a strategic buyer framework that incorporates synergy um capture and control premiums. Then six, run sensitivity analysis on WACC in terminal growth. Seven, synthesize everything into a football field to clearly show overlapping valuation ranges and in and inform a bid recommendation. So after laying out this plan, I moved into implementation. Um so the implied starting revenue from Panera's EBITDA and 50% margin is $6 billion as shown right here. Um the scenario setup is the base 6% growth 16% EBITDA margin um upside so 8% growth and 18% margin and then downside so 3% growth and 15% margin the model automatically applies capeex DNA working capital needs terminal values and discounting so so here's the core DCF output when I get to\n\nThere you go. Um, so the enterprise value perpetual growth method. So the base case is $ 8.99 billion. The upside is 13.25 billion. And then the downside is 6.56. So then the exit multiple method the base is 12\n\noh yeah 12.7 billion and then 17.06 billion and the downside is 9.89 billion. So from these base scenarios the standalone EV is 8.99 billion. After subtracting net debt Panera's equity value is $7.49 49 billion or around $99.93 per share. So this gives it us a discipline anchor for KKR as a financial buyer. So next the comparative valuation outputs. So um\n\nas as we're looking at these numbers right here, so these numbers gives a trading comp's valuation range of 12.6 billion to $19.8 billion, notably higher than the standalone DCF due to stronger market multiples in the restaurant sector. Um\n\nso precedent restaurant deals using 12 to 15 times EVIT imply low so 10.8 billion and then high so $13.5 billion. So this range sits between the lower DCF and higher trading comps creating a solid midpoint bench. So now for the strategic acquire. Which one was this?\n\nOkay, there we go. Oh, sorry guys. I showed the wrong one last time. There we go. 10.8. And then there's the 13.5. Perfect. Um, so strategic acquirers and acquirers may capture digital scale benefits, store overlap efficiencies, and improved purchasing power. So I modeled 15 50% 75% and 100% synergy capture assuming a 10% EBITDI uplift capitalized at a 13.5 time strategic multiple. This results in strategic EVs of 50% capture of $9.6 billion, a 75% capture of $9.91 billion, and a 100% capture of $10.21 billion. So even with synergies, strategic EVs do not reach the 13 to20 billion range implied by comps unless the buyer is willing to stretch valuation significantly. So now for the sensitivity analysis. So DCF valuation is highly sensitive to WACC and terminal growth. So the heat map shows that at 8% WACC EV ranges from 9.92 billion to 11.53 billion. And then at 11% WACC EV compresses to 6.56 billion to 7.16 billion. So this reinforces that the base EV is about $9 billion is a reasonable anchor for financial buyers. Okay. So now for the football field synthesis in the summary DCF scenarios so 6.56 billion to 13.25 billion trading comps which is 12.6 6 billion to $19.8 billion. The precedence which is 10.8 billion to 13.5 billion. And then the strategic buyers which is 9.6 billion to 10.21 billion. So this gives us a very clear visual. Financial visualization cluster is around $9 to 13 billion while public market comps extend materially higher. So now, oh,\nand then here's this one. Awesome. Um, so using the overlapping valuation ranges, DCF base EV is $8.99 billion. For comps, it's 12.6 to 19.8 billion. The pre, yeah, the precedence is 10.8 to 13.5 billion. And then strategic is 9.6 to 10.2. 2 billion. So I recommend the KKR bid range of approximately 11.97 billion to 10.21 billion. So after subtracting net debt, this corresponds to equity value of around $8.7 billion to $10.47 billion and then price per share which is $116 to $139. So this range allows KKR to stay below the upper strategic valuations but high enough to remain competitive in an auction environment. And then to validate um the model revenue growth aligns with store expansion and digital mix increases. DCF outputs align well with marketbased multiples. Sensitivity analysis confirms the robustness of the base case and strategic valuations appropriately exceed financial buyer valuations but remain within the plausible synergy bounds. So now for evolve with more time I would evolve this model by breaking out new store economies versus same store sales separating digital versus instore margin impacts adding more granular capeex and working capital model and then pulling live market data to further refine peer multiples. So to conclude, DCF is extremely sensitive to WACC and terminal growth, which is why providing ranges, not just point estimates, is essential. A disciplined financial buyer like KKR should anchor its bid near the overlapping region of DCF and precedent transactions. Strategic buyers can pay more, but only if they have strong synergy con conviction and integration capacity. And then driver framework kept my work structured and helped me maintain a clean narrative from assumptions to final bid. So thank you for watching my driverbased Panario val Panera valuation. In summary, the model supports a competitive yet disciplined KKR bid in the 10 to12 billion enterprise value change range balancing financial returns with auction realities. I appreciate your time. Thank you for watching."
}