{
  "student_name": "John Gascho",
  "org_defined_id": "035820898",
  "username": "gascho",
  "email": "",
  "transcript": "Hi, everyone. My name is John Gashon. In this video, I'll be walking through my market efficiency investigation using the GameStop short squeeze of 2020 through 2021. As a case study, I use the DRIVER framework to structure my analysis: define, represent, implement, validate, evolve, and reflect. Through this notebook, I'll combine financial theory with Python-based empirical analysis to test whether the GameStop event violated market efficiency. The first critical step is to verify the statement that GameStop traded at $0.04 in August 2020 against actual historical data. If incorrect, document the accurate figures and determine the appropriate approach for communicating this correction to the professor. Next, here's our event timeline and some key points. Let's go to my Google Colab code. I started with some help from JGBT to set up the notebook. Here is my name and the code, along with the necessary imports for pulling financial data, and some helper functions. We begin with DRIVER stage one: define and discover. The first step is to define the problem and verify the basic facts before running any models. The prompt claimed that GameStop traded at $0.04 in August 2020, so I pulled real data from Yahoo Finance using the yfinance library. Looking at the price data for August 2020, the lowest price was around $1, and the highest was about $1.40. Clearly, the claim that GME traded at $0.04 is incorrect. The stock was low, near bankruptcy levels, but not at pennies. Right away, I verified the assumption and corrected the misinformation before moving forward. If this came up with the professor, I would politely correct it by citing verified Yahoo Finance data. Next is DRIVER stage two: represent. Now that I've defined the problem, the represent stage involves designing my analytical approach. Here, I outline how I'll test market efficiency using real data. In this block, I downloaded full-year data for both GameStop and the S&P 500 regression, which estimates what GME's normal return should have been given market movements. You can see a sample of the merged dataset, with columns for GME returns and market returns. I compare GME's actual returns to its expected returns to identify abnormal returns and then analyze the spikes during the short squeeze in January 2021. Stage three is implement. This is where the modeling happens. Here are my models and numbers, imported from Google Finance. Using CAPM, alpha is approximately 0.08 and beta is 1.74. I applied ordinary least squares regression from the statsmodels library to estimate the CAPM equation: expected return = alpha + beta × market return. This means GameStop was about 74% more volatile than the market. During the estimation period, the stock was very risky, but not surprising for a heavily shorted small-cap stock. With these parameters, we can calculate expected returns around the event window and compute abnormal returns, which are the difference between what CAPM predicted and what actually occurred. Abnormal returns were massive, especially from January 26th through January 29th, with daily returns exceeding 100% at one point. Cumulative abnormal returns peaked above 300%, far beyond what fundamentals could justify. These are clear outliers relative to normal market behavior. The plots show this visually: the abnormal return line spikes dramatically during the short squeeze, then collapses just as quickly—a perfect example of extreme short-term inefficiency. Stage four is validate. The validate stage tests the reliability of these results. I conducted a simple t-test on the average abnormal return to see if it was significantly different from zero. The t-statistic came out to 0.96, which technically isn't significant at the 5% level. Formally, this suggests the market appears statistically efficient. However, the magnitude of the abnormal returns indicates that something unusual occurred. Numbers alone can't capture the chaotic behavior of that week. In validation, I acknowledge that while traditional hypothesis tests might not reject the EMH, the economic reality clearly showed abnormal behavior. Stage five is evolve. I expanded the analysis to include trading volume and behavioral factors. Here, I compare average trading volume before the squeeze to the week of the squeeze. Between August 2020 and December 2020, GME's average daily volume was about 43 million shares. During the squeeze week, it exploded to over 447 million shares per day—a roughly tenfold increase. This aligns with behavioral finance principles. It shows massive herd behavior, overconfidence, and FOMO, implied by social media platforms like Reddit. Retail traders coordinated—or at least followed each other—creating feedback loops that detached prices from fundamentals. Even though it looked like free money, rational investors faced limits—they couldn't safely short the stock because of trading halts and margin requirements. This allowed inefficiency to persist longer than usual. Stage six is reflect. In the reflect stage, I step back and connect everything to the efficient market hypothesis and behavioral finance. Summary: During the short squeeze, weak and semi-strong forms of market efficiency were violated. Prices didn't reflect historical data or new public information rationally. However, the strong form still held because insiders didn't consistently profit; gains were random and unstable. Over time, the market corrected itself. Prices stabilized near estimates between $10 and $40 per share. This classic EMH reversion shows temporary mispricing followed by correction once rational traders returned. From a policy and investor standpoint, this event reinforces the balance between behavioral and traditional efficient repricing. Even when markets look chaotic, they tend to restore equilibrium over time, supporting passive investing strategies and risk-based valuation models. Through the DRIVER framework, I combined theory and data to test how real markets handle extreme events. The GameStop case shows that short-term inefficiencies can arise due to behavioral biases and coordination effects, but long-term efficiency generally prevails. While EMH may not perfectly explain the chaos of January 2021, it still holds strong as a foundation of modern finance.",
  "video_url": "https://youtu.be/UW-JGWm-aI8"
}