{
  "student_name": "None None",
  "org_defined_id": "038231480",
  "username": "liu4186",
  "video_url": "",
  "transcript": "Hi, I'm Yanxi Liu. This is my mini project three, financial scenario generator. I also follow the driver framework. In the Define step, I begin with the core purpose of the project. The Financial Scenario Generator is designed to help users explore how a wide range of financial uncertainties can impact the success or failure of a project. Instead of giving people fixed, rigid outputs, the tool allows users to adjust key financial assumptions using sliders and immediately see how those changes ripple through the model. The fundamental goal is to answer one question: What could go wrong? Whether the user is evaluating a new product, a real estate investment, or a business expansion, the tool should provide clear insight into cash flows, NPV, IRR, payback period, and overall risk exposure. This definition anchors the rest of the framework.In the Represent stage, after defining the problem, I represent it using a structured set of inputs and outputs. The main idea is that any financial project can be reduced to a handful of critical drivers: investment cost, revenue growth, margin, tax rate, cost inflation, discount rate, and so on. Each of these becomes a slider in the interface. By adjusting these values, the user effectively constructs different financial \"worlds\" or scenarios. On the output side, each scenario generates a timeline of annual revenue, operating profit, taxes, and free cash flow. These cash flows can then be used to compute NPV and IRR, enabling comparison between different risk environments. In the advanced version, the model also produces JSON structures for charts, allowing revenue paths, cash flow lines, and NPV bars to be visualized. This representation step converts abstract financial uncertainty into a manageable, systematic model. At the Implementation step, I translate the design into actual behavior within Google AI Studio. The app should first ask the user what type of project they are evaluating so that the later explanations sound personalized and relevant. Next, it needs to read the slider settings for all financial inputs. Using these settings, the system constructs at least two scenarios—Base Case and Downside Case. In the enhanced version, it also builds a Severe Downside scenario. For each scenario, the model computes yearly cash flows, applies the tax rules, and derives NPV, IRR, and the payback period. The output must be clean, readable, and structured, with separate sections for explanation, tables, metrics, and visualization data. Overall, implementation is the transformation of the abstract model into a predictable, user-friendly interaction.\nOkay, let's run this app here. I got two versions. One is a simple one, the other is a visual one. So if you plan to open a new coffee shop in downtown and your initial investment is $3 million and time horizon is 5 years and base revenue growth is 10% operating margin is 20% cost inflation 5% corporate tax rate is 21% And the interest rate is 6% and discount rate is uh 10% which is WACC and the downside revenue shock is 30%. Okay, let's run the simulation, and here is the result. You can see here just the entire words, and so many words, it's kind of boring to read them all. So I got the visual version here. There are many charts and tables that make it more user-friendly. You can read easily, and the assumptions are the same as the simple version. And the only difference is that the moderate shock is 20% and the severe shock is 50%. Okay, let's see the result. This financial analysis evaluated the new coffee shop in the downtown project across the three scenarios. A base case with moderate downside and a severe downside. And in the base case, the project consistently generates a positive free cash flow after initial investment, but the NPV remains significantly negative at a negative 1.92 million, indicating it fails to meet the 10% discount rate hurdle. Both downside scenarios show even poor financial performance, with moderate downside resulting in an NPV of negative 2.14 million dollars, and severe downside leading to an NPV of negative2.46 for $6 million across all scenarios. The internal rate of return, which is the IRR, is negative, and below the discount rate and the project files to recover its initial investment within five year analysis horizon. Here we can see that here is the projected free cash flow, and here are the three scenarios: base case, moderate downside, and severe downside. The table for NPV, and the bar chart for IRR are all negative. So what can go wrong? lower than anticipated in initial revenue as demonstrated by the project's ability to generate a positive NPV even in the base case, given some starter revenue potential, a comparison of the 20% operating margin due to intense competition, and expect an increase in raw material cost or higher labor expenses. is slower than project revenue growth below 10% could further exacerbate the negative cash flow position espe especially in the competitive downtown market. The initial three-million-dollar investment may prove in surf insufficient. They're requiring additional capital expenditure not accounted for, or are too highly leveraged to project revenue capacity. The market status or shifts in customer um preference away from the coffee shop could significantly impact the food traffic and sales. especially in downtown locations, and the shareholder verification is based on the comprehensive analysis across all scenarios. The new coffee shop in downtown projects appears highly unattractive for shareholder's perspective. It consistently fails to generate a positive net present level present value, indicating it will destroy shareholder value and exhibit a negative internal rate of return while below the cost of capital. The project does not pay back its initial investment within five year forecast, and significant adjustments to essential revenue operating margin or investment cost would be required to make this um opportunity otherwise it represents a high-risk investment with a poor prospect for return. Okay.During the validation phase, this includes testing whether the sliders actually affect the calculation results in the expected way. For example, whether higher cost inflation would reduce profit margins, or whether a larger revenue shock would significantly reduce cash flow under adverse scenarios. Additionally, it includes validating the mathematical accuracy of the model. The net present value (NPV) must correctly discount future cash flows; the internal rate of return (IRR) must be consistent with the cash flow order; and the payback period must appear in the correct position on the cumulative cash flow curve. In the visualization version, we also had to validate that the JSON chart data was valid and could be rendered. Finally, validation also included reviewing the clarity of the text explanations to ensure that users could easily understand the results. The final output showed that all the above validations passed. The evolve stage includes enhancing visuals with line charts and bar charts, adding new scenario types, and improving interactivity through sensitivity analysis or quick \"what-if\" toggles. It also includes expanding the tool's applicability by adding templates for real estate projects, product launches, or venture investments. Another area for growth is narrative storytelling, using natural language to describe how risks interact over time. This stage ensures that the tool remains flexible, powerful, and adaptable as user needs evolve. The Reflect stage is about learning from the process. Building this app demonstrates how interactive levers help users understand finance more intuitively. It reveals the importance of clear communication: numbers alone are not enough; explanations matter just as much. It also highlights the value of structured thinking: by defining inputs, modeling scenarios, and visualizing outcomes, the tool becomes both educational and practical. Thank you."
}