{
  "student_name": "Shree Bavana",
  "org_defined_id": "034904788",
  "username": "sbavana",
  "email": "",
  "transcript": "Hello everyone. Uh in this session nine for MVMD 310, we are conducting a cost of capital analysis for Netflix regarding a hypothetical $5 billion content investment. Our goal here is to determine the appropriate hurdle rate and assess the optimal capital structure. We are using the following key parameters to do this. the market risk premium of 5.5% a risk-free rate of 4.5% an equity beta of 1.3 market value add 200 billion equity with a 13 billion debt uh and the debt cost pre-tax would be 5.8% and the tax rate being 21%. uh we calculate the three uh whack components cost of equity using CPM C capm the after tax cost of debt incorporating the tax shield and we found out the current whack. Uh right here we have the Python code to get all of our results. So this code calculates the weighted average for a hypothetical company which here in case is Netflix. uh under two scenarios. First with its current capital structure and second after issuing an additional $3 billion in debt. Uh so the breakdown of everything h happening here is we here we're defining our financial parameters. It starts by setting a key financial input such as market capitalization, market value of debt, equity beta, pre-tax cost of debt, corporate tax rate, risk-free rate and market risk premium. We have all these here. Uh next moving on, we are calculating the cost of equity uh using the capital asset pricing model. Um next up we got the after tax cost of debt uh which accounts for the tax deductibility of interest expenses. Next we have the capital structure weights. It determines the proportion of equity and debt and the company's current capital structure based on the market values. Now we're calculating the current whack. It combines the cost of equity after cost of debt and their respective weights using the formula as given here. Uh moving on with the new debt issuance we are calculating the back here. It simulates it simulates the impact of issuing an additional $3 billion in debt. This increases the total debt and the total firm value which in turn changes the equity and debt weights. It then recalculates the new whack with these weights assuming that the cost of equity and after tax cost of debt remain unchanged. So now here we have the output results. Finally, we print out all the calculated components uh the current whack, the projected whack, uh the after death issuance along with the percentage values to provide a clear summary of the analysis. So, in a sense, the code models how a change in a cap company's capital structure specifically taking on more depth can affect its overall cost of capital. So now we are moving on to analyze what all of these values mean. The current whack of 11.2 is the minimum return Netflix must earn to satisfy its investors. Now let's see the impact of the post 3 billion debt insurance. Uh so the new capital structure shifts slightly from 92.6 equity and a 7.4 debt. The whack drops by eight basis points. Uh 11.21 to 11.12. Uh this confirms sorry 11.22 to 11.13. This confirms that the debt is value enhancing as it replaces some of the expensive uh equity with cheaper tax advantage debt. Uh the small reduction however suggests the company is still significantly underlevered. Um the 11.13 firm bite rate is for the average risk projects. We must use a lower rate for lower risk US content and a higher rate for a high risk international content. Uh pure comparison uh Netflix 11.22. Whack is higher than Disney's 8.2 and the industry range which is from 8 to 10%. This is primarily due to Netflix's low financial leverage and higher perceived equity risk. Our analysis shows Netflix is operating below its optimal capital structure proceeding with $3 billion debt. Uh recommendation two would be to establish a long-term target debt to capital ratio of 20 to 30% to strategically minimize whack and maximize firm value. Another recommendation would be to use risk adjusted hurdle rates for all new content projects. So in conclusion, Netflix's current back of 11.22 highlights an opportunity. By strategically increasing leverage, we can lower our hurdle rate, making more content investments profitable, ensuring we can earn the minimum return required to satisfy all of the investors. And thank you.",
  "video_url": "https://youtu.be/FaVug8oakeQ"
}