{
  "student_name": "Daniel Verachtert",
  "org_defined_id": "037038927",
  "username": "dveracht",
  "video_url": "https://youtu.be/kFKTc2RsGb4",
  "transcript": "Hi, my name is Daniel Verachtert. This is my Panera Bread valuation for KKR takeover. Um, so to start off investment questions and context. So the objective is value Panera for a potential KKR acquisition. The key question is what is a disciplined defensible bid range? Uh the company snapshot is six billion in revenue with 8% growth, 900 million in EVA, 15% margin, uh 400 million in net income, 200 2,100 stores, 50% digital and buyer. The buyers landscape is so there's financial buyers which acquire for return via cash flow leverage and exit. So that's KKR or strategic biders who acquire for synergies and long-term integrations like Starbucks, McDonald's.\n\nUh the valuation framework and plan. So threele I'm doing a three-legg valuation approach. So DCF which is an intrinsic model trading comps which is a market market pricing and precedence transactions which are control or control pricing. Um so key assumptions the whack the discount rate is 9% the terminal growth is 3 point or two to 3%. And the management rollover is 10%. So my DCF model structure these are the values I'm going to use for the downside the diff or downside base and upside scenarios. So revenue capex terminal growth and whack. Uh this is a true multi scenario DCF. Each scenario produces its own cash flow and valuation using the same structure but different economic assumptions. These are the equations I use for free cash flow, terminal value, EBIT, tax rate, capex, uh net working capital, and long-term growth rate. Here's my fiveyear operating projection. So down here you can see the year here uh revenue revenue uh free cash flow and to the left is going to be the downside B or middle is going to be base and right is upside. So we can see after five years obviously the upside makes the most and downside makes the least. Um revenue revenue growth reflects Panera's unit expansion and increasing digital penetration. Even though it captures operating profit proper profitability before reinvestment, it grows faster than revenue across all scenarios due to operating leverage from high digital mix and scale efficiencies. Uh the free cash flow represents the actual cash available to investors after taxes and reinvestment. free cash flow grows more gradually across all scenarios because expansion requires capital investment and working capital the whack and terminal value. So the wack justification uh cost of equity is about 10 to 11% to the capm um after tax cost of debt is 4.5% target capital structure is 7030 uh and then whack is about 9%. Um as for the terminal value in the base situation the terminal value is about 9.95 billion. Terminal value assumes that after 5 years the narrow grows at a stable sustainable rate and generates cash flows forever. Uh to support this economically the growth rate less than nominal GDP which is conservative. Panera is a mature brand not a startup. Uh store growth is slow, cash flows are stabilized, which means cash flows stabilized. Digital penetration boost efficiency not infinite growth. Mathematical support the spread between whack and growth rate is reasonable 6.5% and the terminal value 65 to 70% of EV which is normal.\n\ntrading comps and uh precedent transactions. So uh these are the comparable companies McDonald's, Starbucks uh and the industry average. This is their PE ratio. This is their uh evida EVIDA um the valuation translations down here. said trading comps and presidents uh and trading comps reflect minority pricing while presidents transactions include control premiums buyers perspective and synergies. So these this is a table I made factors the financial buyer or strategic buyer. So K are the financial buyer percentages they're not underwritten. Uh for strategic buyers that's a key value driver for control premiums uh sorry control premiums for financial buyers are disciplined while strategic buyers are willing to pay. uh integration risks, financial buyers avoided or avoid them, strategic buyers accept them. Management rollovers, financial buyers, it's 10% equity and strategic buyers, it's often retained. Uh synergies to quantify uh stores overlap, savings, digital platform leverage, operating margin expansions. Uh strategic buyers can justify higher prices due to synergies. Financial buyers must earn returns through cash flows exit discipline. Valuation synthesis and bid strategies. So the football field values are the DCF is about 7.5 to 12 billion. The trading comps are 9 to 10 billion. Presidents are 11 to 13.5 billion. Uh the bid strategy, the target bid in the base case is where the DCF overlaps. Walkway prices upper DCF bounds and financing is moderate leverage downside protection.\n\nThe overlap across methods defines fair value KKR should not chase strategic synergies and must maintain walkway discipline. My final recommendation is based on intrinsic value, market benchmarks, and buyer discipline, KKR should bid within the mid-range, evaluation outcomes, and walk away if pricing reflects strategic synergies.\n\nUh, let me just switch my screen to this. And here's my code. If I run it, see it has a lot. So it gives me the table that I used to project my revenue and free cash flow.\n\nUh then it has DCF valuation bridge scenario. So it has the downside base, upside, whack, growth rate, free cash flow, terminal value, enterprise val, and the enterprise values over here. Uh trading comp ranges, equity value, enterprise value, and the low, mid, and high ranges.\n\nThe resident transaction range. So enterprise value is low, mid, mid and high range. Again here\n\nsynergies captured um sensitivity\nmid range. Then it has graphs going projections for different scenarios."
}