{
  "student_name": "Melina Marsh",
  "org_defined_id": "035647509",
  "username": "marsh86",
  "video_url": "https://www.youtube.com/watch?v=b9B7dSPTvD0",
  "transcript": "0:00 Hello, today we'll be going over video assignment number 11, um, going through the driver framework.\n0:11 So, to start with our Define and Discover, um, we'll explore the question, should Apple execute a, a $90 billion share repurchase, or pursue the alternative to maximize shareholder value while balancing stockholder incentives.\n0:26 So, we have our given data here, which we will go over in the represent. So for our financial math structure mapping, we have our inputs.\n0:36 So we have our share price at $185, our shares outstanding at $15.5 billion, our total debt at $110 billion, our cash and investments at $165 billion, our buyback size at $90 million, or billion, sorry, our P.E.\n0:54 ratio, 30, and then our assumptions cost of debt is 4.0, or 4.0 percent, and then our tax rate is 20 percent.\n1:04 So then for our intermediate calculations, we have all of the equations here for our current market cap, um, current net incomer, N.I., our shares repurchased, interest, expense savings, and then our output.\n1:20 For new shares outstanding, new EPS, the exertion and dilution, um, new debt slash equity ratio, our leverage, um, percent ownership change, and then our new ROIC.\n1:36 Then we also have our shareholder impact mapping, so it's just showing you our buyback at the $90 billion, our special dividend at $6, our debt reduction, and then our acquisition slash R&D, um, showing our retail shareholders, our employee fees, bondholders, management, and then value outcome of all\n1:57 that information. So for our implement, the baseline financial metrics, we have our current market cap, so we would have 2.5 billion shares times 185.\n2:08 Dollars per share at 2,867.5 billion. Our current net income, we have this equation at 95.58 billion. Our current EPS for 6.17 dollars, 6 dollars and 7 cents per share.\n2:26 Our current, uhm, DE leverage, 0.0383. For our scenario calculation outcomes, the cash used, uhm, our shares repurchased, new shares outstanding.\n2:40 Total, new total debt, our new NI impact, our new net income, our new EPS, our new DE leverage, and then our BrickShire ownership change.\n2:50 So we have our baselines, our scenario, one at $90, $90 billion. Buyback, then our scenario two at $90, $90 billion debt reduction, and our scenario three at $90 billion acquisition.\n3:04 So for our cash used, it would be $90 billion across the board. Then for our scenario one, we have $90 billion debt reduction.\n3:12 Divided by $185, which gives us $0.4865 billion, and then the others are just $0. Um, for scenario one, for our new shares outstanding, we have $15.50 minus our, um, shares repurchased, giving us $15.50.\n3:28 So, $15.0135. And then, for scenario two and scenario three, it is just $15.50, considering that our shares repurchased is zero.\n3:36 Um, for our new total debt, we have $100 for scenario one. For scenario two, we have $100, I'm sorry, $110 for scenario one.\n3:49 For scenario two, we have $110 minus $90, which gives us $20. And then, for our scenario three, $110. Um, for scenario one, And for new Ni Impact, we have 95%...\n4:00 $8.58, no change, given our baseline. Um, then, for our scenario two, for scenario two, we have, uh, a positive $2.88 billion, and, For scenario three, we have a positive $10.8 billion.\n4:20 For new net income, um, scenario one is the same as our baseline, scenario two is 98.42, and scenario three is 106.38.\n4:31 eight. For a new EPS, um, scenario one goes up 3.24%, to 6.37, starting at 6.17, per baseline.\n4:43 Um, for scenario two, it goes up 2.92%, giving a- Okay. It's $3.06.35, and for scenario three, it goes up 11.18%, giving a $6.86.\n4:55 For a new DE leverage, it goes- For scenario one, it goes up 4%. 0.7% from 0.038320401.\n5:06 For scenario two, it goes down 81.7% to 0.0070. And for scenario three, there's no change- Thanks.\n5:20 at 0.0383. For a Bookshare ownership change, for scenario one, um, we have a positive 3.24% shares concentrated, and for scenario two and three, there's no change.\n5:34 So for our validate, our bi- back EPS, um, our implement increased 3.24% staying consistent, and it is valid by about correctly transfers value to boost per share metrics, our debt reduction EPS.\n5:50 So for the, um, and the- this information and this information is based on the implement stage. Um, so increased 2.92% which is consistent and valid, model correctly captures the benefit of deleveraging.\n6:05 And for our leverage impact based on our implement stage, we have our buyback, umm, going up 4.7% and our debt reduction going down 81.7% which is consistent and valid, the core tradeoff is modeled accurately.\n6:19 So for our evolve, the current buyback assumes the entire 90 billion dollars is- spent at the initial 185 dollar price.\n6:27 Given the buyback takes 1 year, a better assumption is a price increase which would reduce his efficiency. So our evolve assumption, assumption, would be buyback is executed at an average price of $200 per- share.\n6:41 This is an 8.1 increase, or an 8.1% increase, I'm sorry. So we have our metric, original assumption price at $185 price, um, which gives us our shares repurposed at 0.5%.\n6:56 And our new shares at standing at 15.0135, and our new EPS at $6.37. For our evolved assumption, we have $90 billion divided by $200, giving us 0.45 for our shares repurposed.\n7:12 Our new share- shares at standing would then be 15.05, and our new EPS would then be $6.35. For the impact for the shares repurposed, it would be down 7.5% fewer shares.\n7:24 Umm, for new shares at s- standing, we would have a higher share account. And for new EPS, it would go down 0.3% lower accretion.\n7:37 To reflect, the 90 billion dollar buyback is not the optimal use of capital. It is fundamentally a value. you have a mechanism that increases balance, sheet risk, and ignores opportunities for sustainable growth.\n7:49 A hybrid approach would be a better option. So 40 billion to targeted debt reduction, 40 billion to incremental R&D slash strategic AI investment, and 10% billion to a smaller buyback.\n8:02 This minimizes agency costs, balances the interests of shareholders and bondholders, and commits a significant amount of capital toward long-term value creation.8:12 Thank you for your time."
}