{
  "student_name": "Qianyue Wang",
  "org_defined_id": "034658523",
  "username": "wang5687",
  "email": "",
  "transcript": "Hi, this is Qianyue and this is my session assignment and in assignment we need to um evaluate a problem that calculate the weight average cost of capital for Netflix. So let's get started. We will define the problem first. So the business context here is that next Flex is evaluating a 5 billion content investment. To make a sound decision, we need to calculate the current V using market based input and estimate WACC after issuing um $3 billion of additional debate for the content investment. And we will evaluate project specific WACC for US content projects and international content projects. And for next stage we will compare the next phase to the similar uh company like Amazon, Disney and finally will recommend an optimal capital structure strategy that balances tax benefit of depth and financial risk. So why this uh business scenario and the and is important? So that WCC is a harder rate for long-term investment and it is a lower property estimated WCC may increase the MPVS and sports more growth but too much depth will raise it will raise financial risk also if we misestimating the WCC this can lead to overinvestment or underinvestment. So now we have some apps code uh inputs here are given. Here are some Netflix market data. We have market equal equality value E which is $200 billion and depth book value depth market value and equality beta and bond rating. Also, we have corporate tax rate and current stock price. And the market conditions are risk-free. The risk-free rate is 4.5% like we used before. And we have market risk uh premium is 5.5%. And the industry and peer benchmarks the media industry range is 8 to 10% and Disney which is 70% quality 30% depth which is 8.2%. And prime video is 9.5%. So the main objective of our assignment is to build a transparent web model in person and we will visualize the changes with the leverage and also we will compare it with Netflix. So let's get started. Here's some code we need to uh import first. Let's trans let's represent this part. We need to translate the business problem into a financial model with the assumptions. The cost of equity we give have the risk-f free rate and beta MRP and cost of depth after tax use the bond yield as a pretext of depth and we we have capital structure like market values also the web formula here is as swing trout from the test boot we will use the market value of equality divided by market value of depth and times cost of equality plus market value of depth divided by um E + D times the R D times the 1 + the corporate tax rate. So let's get started for building the models. Here is the financial parameters we have and mark condition taxes. We have functions of CAPM also we have the option text of cost of depth. Here it is the we use the preax times 1 minus tax rate. Also we will compute where given equality value E depth value D and cost of equality and after tax of C after text of depth. So now here is all the function we use. So the current Netflix so from that we can calculate that the cost of equality is 11.65% after tax cost of depth is 4.58%. And the equality weight is 93.9 and the depth weight is 6.1%. So the current back is uh 11 22%. So it's high because the firm almost entirely like equality finance we we know that it we have 94% equality and this equality is expensive due to it like 1.3 beta giving us 11.65 65 cost of equality although depth is cheap after taxes the small depth way means it barely affects the overall so as a result the Netflix is above the industry typical about 8 to 10% range like making the content investment harder to justify so part two we will uh analyze the WCC after is insuring three billion additional depth We will repeat the previous function but it will gives me I think different output. So the new dep is 60 uh 60 billion and now the equality is 200 billion. We assume unchanging the simple scenario and the equal to weight is now 92.59% and that way is 7 7 uh 41%. So the WCC now is become like 11.13%. So like 18 to three billion of depth versus Netflix depth only slightly about 9 uh 09% changes. So and lowers because the depth is cheaper than tax advantage. So even modest increase in radio this V. So this index net is under leveraged and could safely add more depth without raising overall funding cost and assuming credit risks uh stay stable. So for the employment part three we will have like a project based back. So we have base next we will use the base Netflix like firmer firm level and we will assume like additional risk premium for like international content we will use like uh 0.0 zero we use 1.5%. And the US project we use same um we use the same cost of equality as firm and for the international project we will have header cost of equality. So now we you we have the overall project specific back the base firm back it's WCC spot and it's like the US and for the international we will have like uh 1 4 1.5% equality premium it's about 12.63%. So the US contents project use the firm WCC because their risk matches Netflix core operations and international projects face higher uncertainty. So we were a aiding like 1.5% risk pre premium. So this ensures international investment must deliver higher expected returns to be worth well. And for the next part we will compare the next phase with Disney and Amazon. So just is a pair pair comparison we have Disney is 8.2% Amazon like 9.5% and the industrial range we we assumed before is 8 to 10%. So the Netflix WCC exceeds Disney's and Amazon and it also sits about industry benchmarked. So Disney and Amazon benefit from diversified lower risk business models and more balanced capital structures and Netflix higher beta and heavy reliance on equality drive up WCC meaning it needs stronger project return than its competitors. So that's for the next stage we will use the some validation for the basic sanity checks. So the first that the cost of equality must be greater than the risk greater than the um risk-f free rate. Yes. And after tax call or debit depth should be less than pre tax and weight should sum to one the capital W. So as we calculated before so if this all pass the this test it will print the basic sent. So all validation checks pass. So this confirms the model is logically consistent and that the WC results are based on sound input and standard financial relationships. So now we have the next stage of validation which is WCC WACCC sensitivity to leverage. We will giving us desire desired depth divided by depth plus equality ratio and compute WCC assuming total capital V equals 1. This is more easier for us to calculate. And the range of the depth ratios is from 0 to 15%. And now it gives me this kind of picture. So it shows that the WCC dling steadily as the depth increases because depth is cheaper and benefits from text shows and Netflix current like 60% depth ratio lies far to the left of this curve. So it's indexed that the company is underleveraged. The model suggests that increasing depth would reduce WCC and improve the firm value. So as long as financial risk remains manageable. So for the reflection part and what it is is about what I learned and the model limitations. So what I learned is that the V WCC combines the cost of equality and after tax cost of depth with bad market values of depth and equality. So it will leverage and leverage provide a texture that can reduce WCC but beyond the point increase financial risk raises both depth and equality cost. So we we say that using a single firm mind WC is not always appropriate. So higher risk international projects deserves a higher discount rate than the core US content. And for the compression part it help also help me to interpret whether nexus ve is high or low rel to its industry. And for our model we will we still have some like limitations or we have we can have more simplifications. So we assume the cost of equality and KD stay constant. So when leverage changes, so this is not always correct. It always changes based on the market situation. So we treated Netflix as having a single beta. We also ignore some segment level differences like different rate for types of content or regions. Also international project rate adjustment was modeled as a simple 1.5 premium and this is just for easy calculation. So in future we need to use like country risk premiums and also just cash flow scenarios and also for next step if I want to extend this model I will indogenize the relationship between the leverage and the cost of capital also I will model full MPV analysis for 500 5 billion content investment using the project spaces WCC Okay. So, I think that's all for my assignment nine. So, thank you for watching.",
  "video_url": "https://youtu.be/eCSVrh5ZA14"
}