{
  "student_name": "Benjamin Engels",
  "org_defined_id": "037980105",
  "username": "bmengels",
  "email": "",
  "transcript": "Alright, good evening everyone. Uh, for today's assignment, we have session 8. Which is the market efficiency and behavioral finance assignment. Uh, as we go here, through here, we are at- asked to use an AI platform, I use Google Gemini again to discuss, go through the driver, using the driver method. Umm, and discuss, uhh, market efficiencies and behavioral finances and come up with an umm, equation or a code through Python. Umm, so here I have the first part which is data verification, umm, of the information given back in the book. Whoa. So we have the D to find and discover, uhh, we have the research problems so we go through and we identify, you know, so as we have our EMH, so we determine if it's, you know, weak, semi-strong, or strong. Uh, we go through and we talk about it. And then we have, uh, each requirement, we have the data source, and we have the purpose. So then we move forward. In order to the R, which is the representing part, which is here. Mapping the analytical framework. And for this, with the ehm- h testing, we have the period, the days, the purpose of analysis, and then the ehm-h testing. best. We're given a couple of formulas here that we're able to use, umm, as part of the R. little bit more. I'll and driver. Umm, as we continue down, umm, we have the I, which is the implementation of the market efficiency event study. And here, we're able to see the EMH, um, kind of, . broken down into different periods, right? So, we have through Python, this is our coding that we're able to- use, umm, and that way it gives us a, umm. So, we'll see you We have, we're, we're determined, stock return, right? So, we go through Python, we enter that in. Mm. Mm. And then it gives us, uhm, an output, and then we do the same thing for abnormal return. Have that go through. Put it on, and then, uhm, what those mean is the eyes. So we interpret that for market efficiency. So, uhm, means, uhh, this is a largely unpredictable positive and normal returns during the period, uhh, the period of straw evidence, uhh, the shows of, violation of a semi-strong market efficiency for the E-M-H implication. So that's the eye. And then to the V, to do. We're gonna go we have the validate. So, umm, our findings, efficiency findings. We have the statistical significance. That's signal. So, we tested that, you know, we tested e-m-h, uhh, I have a couple of different tests here that we go through and that we're able to see. And then, finally, as we get down here to, uhh, kind of the market model, I guess you could say. Uhh, uhh, we have the test and adjustment, so, factor model, liquidity, liquidity, uhh, momentum factors in that microstructure risk. Uh, the short squeeze risk, uhh, and then we have the purpose and GME implication for all through those. moves. And then, finally, um, the E and the R, so obviously, uh, evolve what that means for future UME market. Thank you. Umm, and how that can apply and relate to each other. And then, they reflect on what it means and, ooh. What this, why we, why we do what we do, uhm. And then, I just went in further and broke it down, uhm, what the evolve meant. So, it actually, you know, you're able to look at more detail post-GME behavioral view, and then verses like a pre-GME ehm- h view. Uhm, and then finally, as you go down through that, you see cost of equity, stability for WACC. You see. And then, uh, we get to the evolve and the final couple stages here. Um. And. me. And basically, it just answers the final question and goes through a general analysis of it. So. But this was this week's assignment. For, um, market efficiency and behavioral finance. Um, thank you so much for watching. That is going through. Using the driver method and using code through Python. Alright, we'll see you in the next video.",
  "video_url": "https://www.loom.com/share/58bc2a636e1041fd8d76d484bbc5842a"
}