{
  "student_name": "Bella Hess",
  "org_defined_id": "037228782",
  "username": "hessi",
  "video_url": "https://youtu.be/yJzovPAMv_M",
  "transcript": "All right. So this is the session 11 assignments corporate decisions and incentives and essentially we are looking at we are looking at Apple and we are evaluating a potential um share buyback. That's a $90 billion share repurchasing for the company. and we are tasked to deliver a recommendation that explains the impact this buyback would have on shareholders um agency considerations and really taking into account the value creation versus value transfer outcomes of this decision. So essentially what we're facing here is how should Apple allocate this $90 billion in excess capital and our goal is to determine which choice maximizes the shareholder value the value creation so creating that value for shareholders while also maintaining the balance between stakeholder interest and also minimizing this agency risk. So just jumping right into our define and discover our problem. How should they um distribute this $90 billion in excess capital, our goal is to minimize that agency risk while also creating that value creation and maximizing the shareholder value and just balancing this with the stakeholder interest as well. To add on to this, we are currently given a liquidity of $165 billion in cash and investments, $100 billion annual fee, free cash flow, market context. So, we have $185 share price. So currently what they're working with, we have a PE of 30 and a dividend yield of 0.5% 15.5 billion shares outstanding. It gets into the balance sheet. So what our shareholders look like, we have 110 billion in debt. Um Berkshire Hathaways owns 6%. The CEO holds three million shares. The retail investors average 100 shares. The employees have $100 strike options. And again, just hitting that into that proposal. Um the $90 billion buyback executed over one year or roughly 10% of market capital. We also have some alternatives to look at. So if we don't do the buyback, one of the options is doing a $6 special dividends, a strategic AI/VR acquisition. So holding on to that value creation, we could do that. We could also do a debt reduction, an incremental R&D, so research and development. So, one of the first things we're going to do is to frame all the alternatives to the buyback. So, essentially, um, we have the $6 special dividend, which we're going to compare all of the alternatives to the financial impact, and then we're going to compare this to the strategic impact or that signaling aspect. So with the special dividends, we're looking at the cash cash outflow of six bill $6 shares on that 15.5 billion shares, which is $93 billion. Um, and essentially this signals to everybody that the financial the financial in this company is stable. So signals financial stability and this commitment to shareholders um because of this dividends um this also presents less flexibility which essentially triggers tax liability for the shareholders. Looking at the AI/VR acquisition the cash outflow is the $90 billion as stated in the assignments. Um and essentially this signal signals a future a promise of future growth and innovation to shareholders and stockholders. Um essentially it's the company stating hey we believe that this acquisition will work because we're putting so much money and time into it. Um so again it just kind of signals that promise of future growth and innovation. Um however this is high risk and high reward and it does have that negative immediate um earnings per share impact just because of the um the acquisition aspect of it, right? You're not necessarily promised anything. It's similar to research and development where you don't really know what the future holds. Whereas like the special dividend, that's pretty low risk because your shareholders understand what is promised and um they're able to just right up front see what the impact of this is with your company. Whereas again that acquisition aspect nothing is essentially promised. So that high risk but you can also have a very high reward and a high payout with that. So debt reduction you have the cash outflow of $90 billion. um which would we're estimating it would reduce that debt from 110 billion to 20 billion. Um because we would essentially put this put this $90 billion that we would be using for the shares into the um debt reduction. So again, $110 billion in debt to $20 billion in debt. And this puts out the signal of financial discipline and risk reduction. Um reduces the interest expense. So increasing the net income and the earnings per share and no direct stock price boost. So essentially this is saying, hey, we can pay off our debts. We can get there. um we're choosing to put our money into this and again just ultimately signals that financial discipline and responsibility. So incremental R&D research and development. So having this cash outflow of $90 billion again if we choose not to do the um buyback of $90 billion this is where it would go. Um again over a period of time or a large singular singular product that is up to the company to decide but this would signal to investors and to shareholders and to the public that um there's long-term commitment to this innovation. There is lots of uncertainty with this. Um, you know, research and development is very risky just because there's nothing essentially promised and you're going to put all this time and all this money into something that may not necessarily um end up doing so well for you. It just kind of depends. So with this, there's no immediate earnings per share impact and it may depress the short-term net income um because R&D is expensed on the income statement. So you can't necessarily count it as investment. You have to count it as expense. Um so ultimately there's a lot of risk with this and there may not be too high of a reward. It just time will tell with R&D. So an alternative to look at. So with this all of the alternatives we're looking at the buybacks and we're looking at the dividends acquisition the debt reduction R&D this creates an agency problem. So because of the conflicting viewpoints um these conflicts arise when managers shareholders and bond holders have different objectives. So this creates sub-optimal decision- making without proper incentive alignment. So getting into the key stakeholder conflicts. So let's look at shareholders versus bond holders. Equity holders prefer riskier projects where debt holders prefer safety. Um people who are bond holders expect their money to get back to them. Um shareholders also but it looks differently. So bond holders is promised they are you know promised something and they're they're bond holders because of this preference for safety whereas equity holders are a little different. Um you don't have as much certainty with this but it creates this conflict of of interest because equity holders want the most debt holders just want you know that safety net. So managers versus shareholders. Executives may want to pursue um empire building over shareholder values. So they may want to focus on other things rather than this value to create their brand and to create their image to further their reputation. Um thus that that empire building over the the shareholder value. So again another conflict of interest and then again we have some different types of shareholders which this can look different too. So like controlling versus minority shareholders. So larger shareholders may want to extract those private benefits rather than the minority ones. And so that also creates another stakeholder conflict. Um and then with all of this we have the capital structure effects. So the financial leverage is something to look at which ultimately amplifies both the returns and risks to equity holders while the debt discipline interests um obligations force efficient operations and the financial flexibility promises low debt preservation options for future opportunities. So each of these structures play into the different agencies that we have um and how ultimately they view each one. So it definitely creates that agency problem and that conflict that we're seeing with all of this. Our ultimate goal is to deliver a recommendation that explains the stakeholder impacts, the agency considerations, and the value versus value transfer outcomes. and ultimately how this would impact one another and how this would impact the company as a whole. For the represent stage, I have created a comparison of the buyback with the different alternatives in a financial sense. So we are comparing different metrics such as the um equity, the earnings per share, excuse me, such as the earnings per share and um the percentage of the EPS, the earnings per share, the new earnings per share. given all the alternatives, the ownership change and what that looks like, the new ROIC, the new debt equity ratio and the final cash balance. So ultimately, what is the big effect of this? So as we can see the main things to kind of take away here is that the buyback provides a higher um earnings per share boost. So an increase of 3.25, 25. But this however does not increase the company's actual um earnings. It mainly is looked at as a tool for management compensation. So that agency aspect um just because essentially you can choose what to to do with this EPS and it might not necessarily be promising as earnings for you. So it's not considered that. But this does boost it with the buyback. The 90 billion share buyback increases that EPS by 3.25%. Um the debt reduction provides a smaller but real EPS boost. So plus 2.15% um by lowering this interest expense and fundamentally lowers the firm's financial risk. So having that lower leverage and also walk so WACC making it more value creation. So this debt reduction coordinates specifically with the trade-off theory by creating value through lowering expected debt through these financial models proving that the company can be financially reliable and financially responsible by um paying off some of their debt. So kind of what we talked about earlier this signals this sends a signal to investors that the company is financially responsible. they practice financial discipline and risk reduction. So to further back this up, I have done my own calculations and um Google Gemini also has and has proven to be correct based off my own calculations. But calculating the earnings per share, we're specifically looking at the buyback here. The first thing to do is to calculate the earnings per share by having the share price divided by the price earnings. So having the $185 divided by the 30 which is given to us here. $185 share price, PE of 30, dividend yield of 0.5, and 15.5 billion shares outstanding, which is given to us within the market context context. This roughly equals $6.17. And then we take this to find the current net income. So the current earnings per share multiplied by the shares outstanding which gives us that 16.17 times the 15.5 billion shares outstanding which gives us 95.64 billion. And then to find the shares repurchased or the buyback amount we take the buyback amount and we divide it by the share price. So the 90 million $90 billion by back amount divided by the share price of $180 per share and that gives us 0.486 billion shares repurchased. With that repurchased amount, we find the new shares outstanding by taking the current shares we have which is given to us 15.5 billion and subtracting the shares repurchased. So what we just calculated which is 0.486 billion which in turn gives us 15.014 billion shares that are now outstanding after the buyback. To find the new earnings per share, we divide the net income by the shares outstanding. So we have that net income of 95.64 billion and divide that by our new shares outstanding which is 15.014 billion which gives us $6.37 for the new earnings per share. So overall, this buyback would affect the earnings per share with an increase of $0.20 again from that old EPS to that new EPS. Here's the further calculations that Google Gemini has put together. And these are my calculations to further back that up. So we're then going to reconstruct this impact on shareholders in from the $90 billion buyback over the span of one year or roughly 10% of market capital as was given to us in the assignment. So I have created a chart that shows the impact of each group we are looking at with the buyback but also with the different alternatives. So with the share buyback this decreases the shares outstanding um while also increasing the earnings per share. This increases the return for shareholders given that less shares means more value and it also in turn increases the earnings per share based compensation for management and increases financial leverage or risk for bond holders. So this first line we're looking at here, decreasing the number of shares outstanding, increase in earnings per share. Um for shareholders, the effect the impact for them would be a higher return. Manager, you get a higher earnings per share based compensation. Bond holders, you get a higher leverage or higher risk. Um which is not necessarily what bond holders are wanting for. Going back to that um the bond holders aren't necessarily wanting that higher risk which again creates that um group conflict we were talking about earlier between the bond holders and the shareholders and what that further looks like. This further is represented here with this chart. the special dividends. Um let's go back for a second for the return for for the retail shareholders the it is stated that the retail investors hold an average of 100 shares. So with this buyback they would see their ownership slightly increase if they do not tinder their shares in the buyback. um similar to institutional holders um such as Birkshshire Hathaway which owns 6% of the company as stated in the case would experience a higher concentration of ownership if they chose not to sell their stock. the management or the CEO that holds three million shares um would see that expected increase in EPS and the stock price resulting from the buyback, which would typically increase the value of the CEO's existing stock holdings. And for employees, we're saying that they're they have a $170 strike price. And we they would see this stand to benefit if the buyback drives the $185 share price even higher. So with this the buyback increases the potential return on equity or the ROE due to this leverage which would affect the stock price performance that determines the value of their options. So ultimately good for employees because they hold this percentage of this the shares for bond holders. It's they again prefer to play things safe and they are favorable with less riskier projects and having that lower financial leverage. So having this buyback would increase the financial risk that the bond holders face who currently hold $110 billion in debt. So again going back to this conflict the reduction in the cash reserves makes the bond holders position less secure compared to the alternative of using the cash for debt reduction. So um bond holders want that debt reduction. Shareholders want the buyback because it drives up the price and thus makes it um ultimately better outcome for them. Bond holders want to play it safe. They don't want to do the riskiness of the buyback. Um so it creates that tension and again the sources know that the scenario highlights the agency conflicts where shareholders favor the actions that increase the risk like buybacks and debt holders prefer the safety net. So just something important to note if we were to do the buyback. But looking at a special dividend, we would see that decrease in the cash retain earnings, a split between the shares outstanding um which ultimately increases that tax liability or that cash for the shareholders and decreases the value of the options for the employees because of the stock price drop. Debt reduction. So we would decrease the debt, decrease the interest expense and increase our net incomes. Bond holders benefit mostly from this by decreasing the risk which is the safest option. Management their increase net income. Um shareholders would see an increase in the indirect value um through that risk reduction. So not a horrible option for shareholders um but more benefits the bond holders through this and then that acquisition. we're gonna decrease our crash, increase our assets, our intangible assets, um, and increase the risk. So shareholders, you see long-term potential value, which drives that up. Um, an increase in execution risk. Management, you see an increase in the scope of what you can do with that. So more um, generalized administration side of things. And bond holders, you see that increase of business risk. So probably not favorable for the bond holders. Moving on to the implement stage. So again, I've created a table measuring these outcomes for the company slash um a trade-off chart for executives to see which each metric would derive. So we have the um for the metrics the EPS impacts the ownership changes the level or the leverage for the financial risk and the ROIC slash the strategic fit. So again we're given the buyback the special dividends the acquisition debt reduction and R&D. Some things to note here specifically with ownership change is the buyback would increase the um proportional ownership for the shareholder shareholders. So the retail and institutional who choose not to tender their shares. Um so that's something that differs between the buyback and the debt reduction. The debt reduction um produces no change in ownership. neither does the R&D or the acquisition or the dividend. Um, with the dividend, the cash is dist distributed equally to all of their shareholders and it's not um it it differs from that buyback in regards to that ownership change. Again, we have that earnings per share impact which I already touched on. buy back it would increase. Um special dividend it wouldn't have a direct impact because the share count is constant. Um acquisition you're uncertain. A lot of things with acquisition is kind of uncertain similar to R&D but for R&D you have that slightly negative impact because it's typically an operating expense. Debt reduction you see slight positive impact. So um interest expense decreases and increases in net income. Looking specifically here with the value transfer for the buyback. So again, the buyback is mostly a value transfer because it is seen more as a financial tool that transfers this value and improves the accounting metrics like the earnings per share and the return on invest um investments in the ROE, but ultimately suggests a lack of high net present value or internal investment opportunities. And then again, the rest of this chart here would be really good for executives to kind of compare all of the different measures. So the strategic growth for the acquisition, the stability, for the debt reduction um and then again how those impacts the group. So this is ultimately a better chart for executives to look at measuring the company as a whole while um the reconstruction impact is better for looking at how this would affect each group. So with the shareholders and management and bond holders, this is essentially what you would want to look at and how um that would affect each of them. But based off of this chart, those were some of the more prominent things to mention. And then further for this implement stage I have created Python code for the baseline scenarios. And it's important to note too that this is all interchangeable with numbers. So we are just using the numbers that were given. But um with each scenario you have the outflow, the final shares, final debt, final cash, um net income, new earnings per share, the earnings per share change, which I did mention earlier on those calculations and how we got here. They're the exact same here. Um so to prove that accuracy, this is another statement for that. and we have the ownership change and the new ROIC. So something to mention with this is um the ROIC to further those calculations it's the net operating profit after tax. So the net operating profit after tax with in this case it would be that 95.58 billion divided by that um assumed corporate tax rate of 21% and then divided this by the investment capital. So the debt plus the total equity which is $110 billion in debt plus the total equity of $2867.550 billion which is the marketable capital proxy. So that wasn't necessarily given in the case but it just is was an assumption and this is how we got to those calculations here which further implements this in the code as we are able to see um with defining the perimeters here. Again, all this is interchange interchangeable here. Um, we are able to see what different measurements would look like and what different um metrics would look like in regards to that. So for the validate stage, I have further taken the comparison of the earnings per share outcome. So that percentage, excuse me, not the percentage, the um dollar amount and compared them visually between each alternative. So with this, we're able to see the buyback having the greatest um earnings per share outcome if we were to do it was $6.37. The calculations again were um up here. I did them myself. The AI generator also confirmed it. We're also able to see that the debt reduction is $6.34. So falling behind, but not too much. So it's clear to see through this visual that the buyback and the debt reduction have the more promising earnings per share um compared to the baseline and the dividend um itself. So for the evolve stage, I kind of tied this into my recommendation. So based off of the visualization and the impacts that it has on um the different groups, a combined approach would be the best decision for this company. So allocating roughly $30 billion to debt reduction and roughly $60 billion to um acquisition would be the best um case here. So while returning capital is key, the market grants its high um PE 30 due to these growth expectations. So while having this peer buyback is a defensive move that signals a lack of high ROC projects, it's important to kind of take into different measures of this as well. So again, $30 billion debt reduction signals financial discipline which lowers the risk and provides a guaranteed um permanent boost to the net income. And we're also, if we were to look at this too, mentioned earlier, the bond holders rely kind of more heavily on this debt reduction and they want um less risky projects. So that increases the amount of loyalty it has within the company, but also too, it's just better for them to be able to see this. The $60 billion in acquisition signals a commitment to the future. Um so with the AI of VVR um to justify the PE multiple. It also directly addresses the opportunity cost of not funding growth. So you're not necessarily funding it in the future, but you are excuse me, you are funding it more for future growth. So you're you're saying hey we can pay off our current debts but we can also promise growth in the future which is essentially what this recommendation is saying and the value outcome. So this recommendation focuses on sustain sustainable value creation. So having that growth in that risk reduction as well but um also over the short term value transfer. So, so essentially we would prefer that value creation over the value transfer which in this scenario would be the buyback just because with this value creation you kind of are hitting two birds with one stone with the growth and with with the risk reduction. So again the recommendation focuses on shifting the value transfer to the value creation by prioritizing the two actions to improve the firm's health and future growth pro p pro p pro p pro p pro p pro p pro p pro p pro p pro p pro perspectives. So the financial discipline paying down the um debt shows promises of um financial responsibility and the growth investment promises um future growth. So with this recommendation we can look at the groups that are affected by this. So most notably because this will probably hit bond holders most I want to hit on this but it it also affects the retail and in institutional shareholders the CEO/management employees and future stakeholders slash the market as well but specifically focusing on bond holders having the impact of the buyback is negative for them because it increases that financial leverages and moves them to the firm to a net debt position. But the combination recommendation is highly positive for them with the $30 billion debt reduction lowers the default risk um significantly and also reduces the debts and lowers the cost of capital as a whole. So highly positive for bond holders. Um overall this would prioritize the risk reduction and the financial discipline which directly benefits the bond holders and improves the firm's credit rating. It's also positive for management is this is pretty balanced between financial health and strategic growth. So it's important to find the balance between both of them and not necessarily to lean too much to one side. Looking at trade-offs though, we're able to see that with the retail and institutional shareholders, one of the trade-offs is giving up that immediate guarantee increase in EPS and tax deferred cash return for higher more sustainable future cash flows. So while the buyback would have increased the EPS um more than the debt reduction which ultimately would be the trade-off, we are still being able to see this promise of sustainable future cash flows for the management. A trade-off would be um accepting a lower initial EPS boost, but aligns more with the long-term rewards and long-term goals for creation and strategic success. So again, that debt reduction um offers a more a lower initial EPS boost, but longer sustainability with growth and with innovation. If we're using the combined, our second option, second best option ultimately would just be to do the buyback. Um the company judges the stock itself to be significantly undervalued. So that signaling effect uh highest initial EPS boost again not like the debt but the cash the high cash in FCF so future cash flows still allow for future R&D funding without this $90 billion. All right. So that was my recommendation. I went through the define and discover phase. the represent phase with the comparison of the buybacks um with alternatives on a more financial note. Um to support this I did the calculation of the EPS myself and also to back this up with Google Gemini. I reconstructed the impacts with the buyback and with the different alternatives within the different groups themselves, the different groups that were present, the shareholders, management, bond holders, all of that. Um brought up an important note of the confl conflict that the buyback had. Um it was in favor of the shareholders but not in favor of the um bond holders. So it created that tension and you couldn't necessarily find a middle ground with that implementation um further created this table for the trade-offs for executives to look at um and then I further explained this measurement of tradeoff in the evolve stage with this recommendation going forward. implement stage again created that trade-off table and we also created the Python code that can be um interchangeable with different numbers. Um you can put input different percentages in there and it'll give you an accurate output. Validate created a bar graph based off the different comparisons of the earnings per share outcomes and what those looks like. Again, calculations were further accurate and the involve recommendation. So recommendation to com to do a combined approach $30 billion to debt reduction 62 um acquisition and then also too created another chart to uh illustrate the impact to each company based off the recommendation to do a mixed approach and further looked at the trade-offs that came with that. All right. Um, thank you so much and I hope that you have a wonderful rest of your night."
}