{
  "student_name": "Ryan Swann",
  "org_defined_id": "037338799",
  "username": "swannr",
  "video_url": "https://www.loom.com/share/501cd1e686514305bcb2670d739bcd47",
  "transcript": "00:00 Hello, my name is Ryan Swan, and today I'm going to be going over Session 11's assignment. Starting off, I'm going to be using the driver method, and getting right into it, I'm going to start with the define and display.\n00:16 My objective is to evaluate whether Apple's proposed 90 billion share repurchase creates more long-term value than alternative uses of capital.\n00:29 Specifically, a $6 special dividend. A strategic AIVR acquisition, debt reduction, or incremental R&D investment.\n00:41 The goal is not just to calculate EPS changes, but to determine which options maximizes the value while balancing stakeholder incentives, governance considerations, and strategic discipline.\n00:58 Key constraints include Apple's $165 billion in cash, $100 billion in annual revenue, and annual fee cash flow, $110 billion of debt, $885 share price, $15.5 billion shares outstanding, and the stakeholder mix.\n01:16 Burt Shire at 6%, the CEO of Apple. With 3 million shares, retail investors with about 100 shares, employees with a $170 strike options, and bondholders sensitive to leverage.\n01:33 My data inventory includes values. Evaluation metrics, uh, the $90 billion repurchase size, the $6 dividend scenario, and performance requirements for acquisitions, debt pay-down, and R&D returns.\n01:52 Established Apple's baseline, EPS share count and leverage. Model the buyback shares retired, EPS impact ownership shifts, and leverage changes.\n02:03 Model each alternative scenario using the same metrics. Compare the share value creation vs. value transfer, and assess stakeholder outcomes. This completes my define and discover stage, and now I will move into my represent stage.\n02:20 My model will follow a consistent logic across all scenarios, starting from a fair and transparent comparison. I will calculate, in this order, baseline metrics using the current EPS, current share count and ownership percentages, current leverage and cash positions by back mechanics.\n02:40 Uhm, this is shares retired, which equals the 90 billion divided by 185 dollars, new share count, updated EPS, ownership concentration changes, leverage effects, and bondholder impact.\n02:56 And then alternative scenario framework. For each alternative, I will compute the change in EPS, effect on share count or ownership, leverage impact, ROIC or return vs.\n03:09 Apple's cost of capital, stakeholder impact, etc. This gives me a consistent template to compare all capital allocation choices. My outputs will include EPS comparisons, ownership, concentration, leverage shifts, and a simple visual representation calculation comparing stakeholder outcomes across scenarios\n03:32 . Once this structure is set, I'll implement it step-by-step following this exact order so that the audience can see how the logic flows.\n03:43 Moving into my implement. I use the help of Gemini and AI to create Python codes that will help calculate the EPS, EPS change, and so on, so that I can analyze the company.\n03:58 First, I calculated Apple's baseline financial outcomes. I found the baseline EPS by taking net income and dividing it, shares, which gave me 6.17.\n04:08 And following this, I used AI to create this code. With the code, I got the outputs of this graph, which I will get into in a second, describing the impact.\n04:25 And then I also got these numbers so we can further look at what's going on. So, for the scenario summary, the baseline is $6.17 for EPS.\n04:41 If we buy back, it goes to $6.37, which is an EPS change of 3%. A dividend, it stays at $6.17, which would have no EPS change, debt reduction, uhm, this results in an EPS of $6.34 with an EPS change of 3%.\n05:04 2.8%. And then, looking at this graph, our acquisitions makes it $6.63.\n05:17 And then finally, our R&D, we get a EPS of $6.75. What this means?\n05:28 A higher EPS is genuinely good because it means each share is earning more profit, but EPS only shows true value at when profit increases.\n05:40 After analyzing all scenarios, my recommendation is that Apple should not allocate the full $90 billion toward a share buyback. The buyback does increase EPS from $6.75 to $6.37, which is a 3.2% improvement, but this is a value transfer, not value creation.\n06:03 However, now I want to validate to not only make sure that my recommendation is accurate, but that the code I had and the numbers it gave me are correct and accurate.\n06:16 So, for the buyback EPS, I manually did the math. I did $95.58 billion divided by $50 15.0135 billion, which did equal $6.37.\n06:30 I validated the model by re-computing Net Income Buyback EPS, Dividend Impact, Debt Reduction EPS, and R&D EPS. Using alternative methods, me doing it by hand.\n06:44 All results matched within the rounding error. This confirms the model is internally consistent and stable enough to rely on for decision making in the next step.\n06:56 Moving into our Evolve, I decided to test how sensitive the buyback decision is to the size of the repurchase. Instead of just $90 billion, I modeled EPS outcomes as three buyback sizes.\n07:11 $50 billion, $90 billion, $50 billion, and $120 billion. I hold net income and share price constant for comparability. What this did was the $50 billion was $6.28, the $90 billion, which is what we used in our earlier calculation was $6.37, and then our $120 billion was $6.44.\n07:38 What this shows is that the buyback size, the bigger it gets, the, more the EPS increases. The EPS benefit from buybacks is real, but shows diminishing returns.\n07:54 Moving from no buyback to a $50 billion buyback boosts EPS by 1.8%. Increasing the repurchase to $120 billion only adds another Buyback logic is not fragile.\n08:19 Even at different sizes, the outcome is consistently in the same range. This sensitivity reinforces that the buyback improves EPS, but it also highlights that beyond a certain point, spending more cash yields only marginal gains and may introduce liquidity or leverage risks.\n08:41 By evolving the model with different buyback sizes, I confirmed that the decision is sensitive to scale, but remains sensitive. Directionally consistent.\n08:50 This helps frame whether Apple's $90 billion program The modeling showed that Apple's $90 billion buyback does increase EPS and ownership concentration, but the value creation is modest.\n09:20 About a 3.2% EPS lift. Debt reduction produces nearly as much EPS upside, with far lower risks. In R&D and acquisitions, I'll perform the buyback only if Apple can exceed a run rate.\n09:36 Roughly 3.4% ROIC, which is historically, it often can't. This clarified that buybacks are more about value transfer, shifting value among shareholders, while R&D and acquisitions and strategic investment are more about value creation.\n09:56 The $90 billion buyback provides modest short-term value transfer, but redirecting a significant portion toward R&D and strategic investment offers far greater long-term value creation, with lower risk and better alignment to Apple's strategy.\n10:14 Overall, the driver process helped me structure the analysis clearly. I defined the problem, represented the logic before building anything, implemented the solution.\n10:24 validated them with multiple checks, evolved the model through sensitivity analysis, and reflected honestly on the strengths and limits of the conclusions.10:37 Thank you for watching my video."
}