{
  "student_name": "Brody Springer",
  "org_defined_id": "037338416",
  "username": "spring48",
  "email": "",
  "transcript": "My name is Ry Springer and this is for um management 310 with Professor Zang. Um you're given the prompt and uh for session 10. I said here's a prompt to the assignment. I need to work through I need you to work through I need to analyze this problem using the driver framework. But first I want to work through the first step which is to find and discover D. And so um the project is Starbucks proposed flagship roaster. Business objective is to determine if the flagship grocery project creates value for Starbucks. And then the recommen recommendation goal is provide an accept reject recommendation based on projects net present value and other capital budgeting metrics. This uh must this recommendation must be supported by the full driver analysis. And then some other uh key parameters the hurdle hurdle rate um WACC which is 8.5% used as the discount rate initial investment 12 million depreciation straight line 10 years working capital 500,000 project life 10 10 years and then some other ones tax rate 25%. And then some uh cash flows and inputs. Revenue for the first year is 8 million. Years 2 through 5 is 11 million. And then years 6 through 10 is 9 million. Cost of goods sold is 40% of revenue throughout all the years. And labor cost is also 2.5 million throughout the years. And then the written utilities and marketing costs are also there. As we move on to um our portion of uh driver framework which is refined and research um the initial investment building of 12 million million is depreciated using straight line over the project's 10ear life um which you take you the initial investment divided by the project life which will be $1.2 million each year it'll depreciate and the operating cash flows is the primary engine of the project's value. We need to calculate the annual revenues and operating costs. The cost are um cost of goods sold $3.2 million for the first year, $4.4 million for two through five, and uh $3.6 million through years 6 through 10. And then add in all the fixed cost. So the total operating cost for years 1 is 6.8 million. Years 2 through 5 is 7.8 million. And then um years 6 through 10 is 7 million. And then uh next we need to establish the cap capital budgeting metrics. The MP MPV the primary metric it represents the value created or destroyed by the project a positive MPV means accept the project um we need to find if the internal rate of return is higher than the WACC which is given 8.5%. And then we need to prepare the cash flow schedule structure. Um, as we move on, we got to use all this information to implement and investigate, which is where we constructed the full 10-year pro form of income statement, calculate annual cash flows, and determine the core metrics. And then I said, I need you to build a year 0 through10 incremental cash flow schedule that includes revenue, operating costs, depreciation tax, shields, taxes, working capital changes, and terminal value and also calculate the MPV, irrited payback period, simple rate of return, and then some other ones. Um, so for the cash flows, revenue that you each year is listed and then you take away all the cost of goods sold, fix fixed operating costs, depreciation, all of the good stuff. Um, this is used this is developed in Python using um code to figure out all these values. But the free cash flow um year zero is 12.5 million which is like the initial investment and then each year it goes up 1.2 million 2.7 million 1.8 8 million 4.55 million and then um core capital budgeting metrics base values in the free cash flow stream and the WACCC of 8 8.5% net pre present value is 2.332% or not 2% 2.3 million which is we accept this because it's higher than zero which is the net pre present value internal rate return is 12.33%. We accept that because it's higher than the WACCC which is 8.5%. And the profitability index is 1.19%. Which is also good because that's above one. Uh payback period for the initial investment is 5.37 years and then a discounted payback period is 6.24%. Um conclusion for the base case the project is financially acceptable based on all discounted cash flow metrics. is positive with NPV of 2.33 million confirms that the project creates value above and beyond the cost of capital required. The IRRa validated the IR is uh is about 3 uh um yeah so the IR is 12.33% higher or significantly exceeds which significantly exceeds the 8.5% hurdle rate. um um Cincinnati analysis when we when revenues reduced by 20% which is the worst case scenario if all revenues are uniformly 20% lower than the base uh case year's 2 to 5 revenue would be 8.8 8 million and the new MPV value would be -3.73 or 373,723 which is not good because it's below zero and the new IRRa is 7.9% which is also below the WACCC of 8.5% which is not good. So worst case scenario we are losing we're losing money and the uh internal rate of return is below the WACC. um if the WAC was plus or minus 2%. Um AB we have a regular base case um MPV 2.3 with 8.5%. Um, if WACC was at um 6 or 6.5% instead of 8.5%. We'd have a new MP MPV of 4,179,000. Still have the new we still have the same IRRa. And if the WACC was 10.5%, then our new MPV value would be 786,000. So um worst or the best case scenario is when WACC is 6.5% and worst case is when it's 10.5% or when revenue drops 20%. Um yeah and then as we move on to E portion of driver um endorsing explain the base case analysis strongly supports the project showing a positive net present value of 2.3 or $2.3 million in internal internal rate of return of uh 12.3% which is significantly higher than the 8% hurdle rate that we used in the beginning. Uh the project expected to create value for Starbucks to shareholders. Um the for the strategic fit um flagship groceries align with Starbucks long-term strategy of moving beyond traditional stores to create premium experimental third place. As they say they serve as coffee labs to test new products and techniques. Uh brand impact of this extremely positive. The roster concept elevates the Starbucks reserve brand conveying high quality craftsmanship and exclus exclusivity. It serves as a physical showcase for the coffey's original story and process deepening consumer loyalty and justifying premium pricing. And then the key project risks uh revenue risk sensitivity. The greatest risk is is failure to meet the ambitious sales forecast particularly in the initial years. Uh sensitivity the sensitivity analysis show that a 20% revenue reduction makes project the project financially unviable because it dropped made uh MBV negative 373,000. Um uh let's see here. Revenue risk the year one marketing budget is higher suggesting initial push. Management must aggressively track key performance indicators KPIs like foot traffic average ticket size conversion with this um this roster. And then cost overruns mitigation. in the initial $12 million outlays significant lumpsum strict project management and and must be enforced to prevent unexpected uh construction or equipment costs. Um as we move on to R which to reflect uh I say that we proceed uh with the investment based on the positive financial returns. However, the project's success is uh highly highly dependent on achieving the projected revenue. uh management should focus on resources on market execution and operational excellence to ensure the experimental investment translates into the ex expected sales figures. Thank you.",
  "video_url": "https://www.youtube.com/watch?v=C6ZNrUN03lU"
}