{
  "student_name": "Julia Munkholm",
  "org_defined_id": "037076876",
  "username": "jmunkhol",
  "email": "",
  "transcript": "Okay, so this is my session eight assignment over GameStop or GME. Um, so first the assignment overview. Um, basically the assignment was to investigate market efficiency using the GameStop GME short squeeze event of 2020 to 2021 as the case study. Um the first thing was to verify the accuracy of stated facts, analyze price behavior relative to efficient market hypothesis or EMH predictions and evaluate whether market anomalies constitute evidence against market efficiency or can be explained within existing frameworks. So the first step of this is to make sure that the data we were um provided is accurate. So, um, just seeing if GameStop GameStop being traded at 4 cents in August 2020 is an accurate statement. And then here are some of the events that we're also going to make sure are correct and the key data points so that our analysis is thorough and correct. And then here are the four questions we're going to answer kind of overall regarding this case. So first I'm going to go to the define and the discover. So our first step of this was um doing the critical first step and based off um market search of the history of GameStop's GME stock on public sites including Yahoo Finance Stapus and S3 the SEC references. In August 2020 the range of um its stock price was 120 to 180 per stock. Um so very far off from the 4 cents um number presented in this problem. Um the way I would communicate this information to the professor um I would show all the sites with opposing information and it's most likely that the professor just made like a small error or typo when including this information for the assignment um from the case study. So not a big deal. I will just continue working on this assignment and make sure all the other data um that is provided is correct before implementing it into my analysis. So um here is my verification and clarification of all the events and then also the extra data we got for this assignment. So August 2020 near bankrupt levels um this was true. they were um selling their stock at a low singledigit dollar and that is obviously not going to cut it for a big company. Um Ryan Cohen stake um RC Ventures disclosed an initial 9 to 10% in stake and later increasing at 12.9. So he did have around 13% um in holdings but it wasn't until um December of 2020. So small um error there but not too bad. um January 2021 um the price surge did happen. Um one thing with this is that the 483 is before the split. So posts split after a 4 in1 split in 2020 it was more around 120 which you can find on Yahoo Finance as well. Um February 2021 the congressional hearings um did happen and that was correct. present and postevent stabilization. Um the price volatality reduced and the stock settled to a range much lower um in January, but GME did experience additional meme um driven episodes later. Um so we'll get into that a little later. And then key data points that were verified/corrected where needed were short interest um peaked at 140% of float. Um this is supported. This is true. Found this on multiple sites. And then retail trading volume increased um tfold during freeze. Um this is basically correct. It was about 10. It kind of ranged based on the site to like 10 to I think it was 16, but overall um pretty much that trading restrictions implemented at peak um the Robin Hood this is correct. Melvin Capital sustained 53% loss required. Bella this is correct. and anal analyst fundamental value estimates 10 to 40. Um this is a plausible range for this um stock. So moving on um the object objective of this assignment is to test whether market prices for GME during 2020 and 2021 episode reflected available information um forms of EMH or instead displayed persistent predictable mispricing that rational traders could exploit. Um, did GME return around the short squeeze? How abnormal returns relative to market model using the efficient market hypothesis EMH? And then were those abnormal returns predictable? Um, using publicly available signals semi- strong or past returns weak. Um, so then this is some more information. were observed patterns better explained by behavioral slash microstructure frictions limits to and then that's just some examples than by fundamental information. So we're going to take a look into that. Um in this case it is hard to test market efficiency because it's unclear what new fundamental info um justified price changes and price shouldn't move on herd behavior or viral momentum. and the 140% short interest created a mechanical feedback loop causing forced buying by shorts um inflated prices independent of new info making it hard to identify the true cause of this price increase. Then also the fail falling back to normal prices could be viewed in two ways. Confirm it could confirm in eventual information efficiency prices corrected or show overcorrection and correction suggesting temporary inefficiency. So for the represent stage um quality framework for analyzing efficiency around specific events. So, uh, I wanted to implement the abnormal return calculation because this is a great formula to kind of put our put this stock into a test and see like how it comes out. And then we're going to do the ME or market efficiency analysis with the EMH uh, weak semi- strong and strong analysis. And I'll show you that in the code. And then behavioral finance analysis. Identify the key human biases that drove the price back into 2020 to be this high. and also how it came down. Um, rational profitability analysis, determine if this was a rational investment or a gamble based on the information found. So, we're going to go through all of that. So, next is the implement stage. Um, here is kind of the prompt that I used. Um, create code using Python that will show visuals of our data. Um, I provided the data that I was provided below using the price and volume of GME stock across times and then also evaluate this information with the abnormal return calculation and the EMA testing to see if the stock fails or succeeds and give me a simplified answer for the following questions. Test which form of market efficiency, weak, semi- strong, and strong was violated. evaluate whether rational investors could have profited systematically, compare efficient market hypothesis predictions to observed behavior, and assess behavioral finance explanations for observed anomalies. So now I'm going to show you the Gemini input I had and then the code that came along with that. So that is basically I just kind of set it. Um, so I just kind of put that into Google Gemini and then also uh pasted in some of the information provided for this assignment plus my corrected um finds in the data. So then this created this code which I ran and so first it kind of just gets grabs the data from Yahoo Finance about um the 2020 and 2021 information on GME like the prices and so then um first it calculated abnormal returns which is this part of the stock um and then it also did cumulative abnormal return um for a part of it too. And then it used this information to make um a plot which I'll show you down below. And then it also answered all four of the questions that are kind of the overall um questions for this assignment which I said earlier. So here are the results. So GM short squeeze EMHK study evaluation. So the total cumulative abnormal return is 155.74%. And total stock return over a period was 400%. And so if you see this um this is kind of the you can see it's fluctuating a lot not very steady which is not a good sign. Um and then this is days relative to start of observation. So there's that. And then the EMH qual qualitative analysis. um which form of market efficiency was violated. This event violated the semi- strong form of market effic efficiency and then by extension the weak form. So semi- strong violation the strong the stock prices soared to 400 plus despite the publicly known fundamental value estimates of only 10 to 40 per share. The market failed to rationally incorporate public and fundamental information. And then weak form violation. The massive gains confirmed by um our car analysis demonstrate that the past price and volume data like extreme like the extreme short interest could have only been used to earn market beating returns. So question two, evaluate whether rational investors could have profited systematically. No, not systematically in the long term. So initial profits only those who recognized the structural anomaly the massive short interest had um a systematic trade um peak profit peak profit analysis capturing the peak abnormal returns the final spike required ignoring fundamental value and relying on momentum and crowd psychology which is not systematic or rational um in terms of stocks. And then question three, compare efficient market hypothesis, EMH predictions to observe behavior. Um, EMH prediction. Um, so the price reach 400 plus ignoring blah blah blah. So this is basically um just showing how they all failed. So the price um liquidity liquidity so and it shows the trade was restricted by brokers which is the Robin Hood um effect. So question four, assess behavioral finance explanations for observed anomalies. So hurting in social proof buying was driven by massive retail coordination on social media creating a self-reinforcing momentum that ignored the fundamentals framing effect. The trade was framed as a revenue or revenge trade against institutional hedge funds. Um, this emotional satisfaction and desire to punish a perceived enemy outweighed the rational fear of loss for most clients. And then limited arbitrage, sorry, I can't say that word. Sophisticated short sellers, arbitrageers who knew the stock was overvalued were prevented from correcting the price due to high cost and risk associated with finding shares to short. So that is the analysis we got from the code and kind of how the code explains um all of these informations um as I showed it used the um the abnormal function that I entered in for it to use um to find that graph. So now um validate um our validation is that all information was validated using Yahoo Finance, the SEC references and also um chat GBT and then um the answers to this code are also apparent in the teachings um on this class subject and how the vitality of this doc kind of shows the behavioral aspects. So evolve. Um so I'm this kind of explains what was demonstrated in the stock behaviorally. So the hurting bandwagon effect um as I said people bought JA because they saw others doing it. It was a viral trend yada yada. Um confirmation bias investors focused only on posts that confirmed their to the moon belief ignoring other fundamental data that showed the stock was dangerously overvalued. And then limits to arbitrage market failure. Rational traders couldn't stop the bubble. Shorting was too risky, infinite losses, and trading platforms like Robin Hood broke the markets mechanics by halting buying. So for my reflection, this case is a perfect example of how markets do not always act rationally or how they are predicted to react. Clearly shows how the efficient market hypothesis can fail in certain scenarios considering the price wasn't just driven by fundamental data, but also by behavioral factors of humans. just showing how humans can make mistakes in these kinds of scenarios. Humans in this case fell to the mistake of hurting and following the crown. And this shows the idea that market sentiment can be a huge factor in the change of stocks. So that is my analysis on this case study. And yeah.",
  "video_url": "https://youtu.be/b90p91Xt31s"
}