{
  "student_name": "Josh Saarnio",
  "org_defined_id": "037335313",
  "username": "jsaarnio",
  "email": "",
  "transcript": "Okay, this is my session eight assignment. Let's get OBS out of here. So, the thing we're looking over today is the GameStop short squeeze in 2020 or in late 2020, early 2021. Uh we're looking at a case study trying to analyze really what happened here. So, the first thing I want to do is look over at the discover part of Driver. See what actually are we doing here. So I think the first and most important thing when you're looking at a case like this is to just gather information and figure out like okay what actually happened here. Uh the next thing that I want to look at is kind of downline try to analyze what happened here and to do that you want to look at uh the efficient market hypothesis forms see which one this really qualifies as. Look at the efficiency of the market during that time. look at uh how quickly and accurately the market reflected information specifically in something like this where the price of a stock rose and fell unbelievably dramatically over the course of like a week or two. Uh look at some behavioral biases that could have occurred during the time. Look at market anomalies that could have occurred during the time. Uh things like that. look at limits to arbitrage, which is when um I add it a second ago. I'm pretty sure I explain it later in the presentation, but uh yeah, for so the first thing I want to do is really just look over what happened during the case. There is a little bit of context here. There's the event timeline. Uh, I looked over whether or not most of this is true. It is. It gives you a pretty good picture as to what happened, but basically the overall uh look at what happened here is in before or Okay, what I should probably show is this. As you can see, their stock price from when they went on the market in 2002 up until this should be Yeah. late 2020 was somewhat consistent and then all of a sudden you see it randomly shoots up through the moon. What ended up happening here is a lot of big hedge funds had decided to short GameStop right around this time in late 2020. And so basically they were betting that the stock price would end up going down. And something that usually ends up happening with a lot of these hedge funds is they all tend to uh a good way to put it would be eaten the same patch of grass so to say. So if a bunch of if a couple of different hedge funds find an op uh what they would consider a good investment opportunity, a lot of the others will tend to latch on to the same investment opportunity, which uh there are plenty of reasons for that. But that is an anomaly that ends up or not anomaly necessarily, but it's something that ends up happening where if a couple of investment firms find an investment opportunity such as short and GameStop, a bunch of the other ones will latch on to it. It'll cause the the impact won't be one hedge fund. It'll typically be multiple. But essentially what happened is they ended up trying to short GameStop and then a bunch of people caught wind of this through uh SEC filing information and they saw that okay if all of these people are taking shorts that gives us an opportunity to as we see back up here that gives up gives us an opportunity to cause a short squeeze which is basically where if a bunch of people remember if they're shorting they're betting on the price going down. If a bunch of people flood money into the stock and the invest and the price goes up, it causes those people to go, \"Oh boy, wait a minute. The stock price isn't going down. We're about to lose who knows how much money.\" And then sell the stock at a loss. And which will then cause the price to go even further because they're selling the stock at a loss. And that's essentially why you see this somewhat random jump in stock price. Another piece of this that was uh somewhat more difficult to research is how the uh I keep clicking on this by the way. What this is I was just trying to verify that Ryan Cohen did buy that 13% stake according to the Wall Street Journal. He did. So that did actually happen. But one of the big uh parts about this is that it was a bunch of people on Reddit that ended up causing the short squeeze. I wasn't able to find much information from something like the Wall Street Journal from that, but Wikipedia does have a decent amount of information on it. And essentially, I'm not going to go through and read this whole thing, but essentially what happened is a bunch of people on a Reddit forum had realized that well, someone first and foremost said that this was a good investment opportunity to begin with and he got a bunch of people on board with him that hey, there's a huge opportunity here if we're able to pull our money together and cause that price to go up, which is essentially what ended up happening. So that's a overview really of the case. So then the next thing we want to do is kind of analyze some of what happened here. Uh I can I go back and show my prompts. Yeah, it's up there. Uh the prompt is kind of long. A short summary of what ended up happening here is every time it would generate the code, I was trying to get it to use the actual stock numbers and it would put a search reference into the code which it was unable to execute and it kept filing errors. So, this prompt is really drawn out because I had to keep coming in and changing the prompt to try to get it to actually embed the financial information instead of trying to search for it with Python code because it's not going to work. But essentially what I wanted it to do is make a couple calculations regarding what happened and then give uh a little bit of analysis regarding things like risk and market volatility. So then as we can see here the first thing that we ended up calculating is the EMH classification and it's decided that it's a classic case for the semi strong form. Uh I agree with this and as you can see the reasoning for it is an example of a weak form would be uh it states all price and volume data or all doesn't state it. An example of the weak form would be that all past uh price volume data is in the price. This isn't true because as it says momentum was a huge factor here. What ended up happening is a lot of the trading within this couple of days, people saw that the stock price of GameStop had gone up by 130%. And they without any idea as to how or why this ended up happening decided to just jump on the train and make uninformed decisions to buy GameStop because they saw that the price had shot up randomly. This ended up working out for some people, but a lot of what happened here was momentum and had nothing to do with the price or any financial indicators whatsoever. It was just people jumping on the craze really. And then the semi-strong form, which is what we probably think it is, states that all publicly available information is already in the price. This is true. Something specifically to look at is SEC filing and shorts interest data because a lot of the way that people are able to identify that there is a market opportunity there is looking through SEC filings to find that all of these hedge funds are pumping money into the short position. uh some yeah this just says the fact that GME was uh 140% of their public float which is the uh total of like the shares that are out there to buy was shorted. This was public knowledge so people were able to see this. The stock's price before the squeeze was $4, which didn't really fully reflect the short position for this. And then this also goes into a little bit about how the a lot of the investors on Reddit were able to find this data and then act on it, which kind of proves that it was wasn't priced correctly, that it is the semi-strong form. Then looking at why it's not the strong form, it states that all information is in the price, this really can't be true because uh if you look at all of the public data, if this was true, the stock valuation wouldn't have been off by this much. And there was probably some stuff going on behind the scenes here to try to adjust the price. So that's why that probably wouldn't be true. This is a value assessment before the squeeze just to see if there was any actual uh value there because as I mentioned earlier, some of the people involved from the Reddit side of things in initiating the squeeze, some of them had already decided well before the squeeze that there was potential growth in this stock regardless of the shorts. At first, it tried to do a P evaluation, but this isn't really possible because the company wasn't profitable at that time. So, instead, it did a PS valuation. And what it found from that is the PS ratio is 087, which means that the implied fair value per share based on that ratio is $6963. Obviously, at this point, it was trading at $4 a share. So there's a huge discrepancy between the fair value and what it's actually trading for which is what this says is that the stock was highly uh the stock was actually highly fundamentally undervalued since there was a opportunity there regardless. Um this is part of this section but it's not really fully connected to it. some of the abnormal returns during the event. The return on GameStop was 132% during the course of I think for the peak day which is incredible. Uh some things to look at the S&P 500's return that day is negative -2.44% which means the beta was 1.8. What this shows is that there was absolutely zero correlation between the return of GameStop and the S&P 500. They were not doing the same thing whatsoever. They were not connected to each other. Uh this is a conclusion basically saying that this goes all the way out here. Yeah, it was it's basically saying that the events of that uh couple of days were abnormal and aren't something that you would typically expect out of stocks. Like some things to look at is before the period which is in December. So before the short squeeze happened, the average daily return was 4%, the daily volatility was 19% which are somewhat regular. And then during the period which was in January right after the stock price shot up the average daily return was 43% and the daily volatility became 56%. So there was just a giant spike in potential return. The volatility the sharp ratio tripled just about in that time. So those are things to look at when analyzing what happened in the case. This is a graph showing the price of GameStop and then the price of the S&P 500. Uh, as you can see beforehand, the price of GameStop was steady and then here we see it shoot up, shoot down, shoot up, shoot down. And then what's funny is you do actually see right here some inverse correlation between that and the price in the S&P 500. when GameStop shoots up, the S&P 500 shoots down, and then you can see they're somewhat inverse to each other. Uh, let's see. There's other things that I need to go over here. I did look into the short interest peaked 100% 140% of float. That was true. Uh, reassec 10fold during the squeeze. If you go here, uh, before this squeeze, the volume was right before it, it was shifting quite a bit, but usually it was somewhere in the region of 400 million and then at the peak of it, it was trading the trading volume became 5 billion. So yeah, it shot up by quite a bit. What else? Oh, something else to talk about. Trading restricted restrictions implemented at peak. What ended up happening here is right when it hit its peak, some investing platforms, the most uh known of which and I guess the one that got a lot of slack for it, Robin Hood, ended up saying that you couldn't trade GameStop on their platform, which caused a really big stir because people were from their perspective, they were saying that they couldn't keep up with some of the customer demand and stuff like that. But some people were trying to say that they were trying to cover for the hedge funds that were losing an unbelievable amount amount of money, such as Melvin Capital, who basically just about went under for this. Basically, they're saying that Robin Hood ended up uh trying to cover for these capital firms. This obviously if you're uh a user of Robin Hood is a huge issue because if they can decide that you're making too much money one day and that their investor buddies are not making enough money, this is obviously a huge issue. And they had a really big PR spat about that. It also, I believe, ended up going into Congress. Yeah. Up here it talks about a little bit congressional hearings on market manipulation. it. One of the things that got brought up is whether or not Robin Hood is able to do that. And I believe they ended up saying that they uh depending on the scenario, they were, but I don't know when the next time we're going to see something like this is. So, there's that. Uh the fundamental value estimates $10 to $40 per share. We ended up estimating like $60 per share, but it was much higher than what the stock was valuated at. So, that is what it is. Uh other stuff to look at already talked said this was semi- strong whether rational investors could have profited systematically. Uh as I said earlier the stock ended up being severely undervalued regardless of the short happening or the regardless of the squeeze happening. So people could have profited from it regardless of that. Compare efficient market hypothesis prediction to observe behavior finite explanations uh for observe some potential behavioral reasons that this happened is I I mentioned I talked about a little bit earlier but what a lot of people ended up doing is when they saw the stock price within a couple of days go up by what was that before it was trading at like a dollar and up at $100. When people see that, a lot of people were just looking, people, investors I should probably say, when investors saw that, they were just looking to jump on the craze and try to make money. And this ends up basically clouding up the actual value of the stock completely because usually the value of the stock is tied to things like the beta or the P ratio. And what it was tied to was literally just the stock price. People were just betting that it would go up regardless of what was actually happening within the company. So, I think that's a behavioral thing to look at. It's not very repeatable because I don't think that happens very often, if really ever. But I think that was a big behavioral issue that ended up affecting the price of the stock then I believe. Just want to make sure I'm hitting everything here. Uh, okay. Okay, if I didn't go through the rest of this, I'll do it now. For the R part of the driver, the represent I wanted to ensure the given information in the scenario is correct and then test the validity of the data using resulting from the financial calculations for the I part implementing it. Obviously, that was me going in generating the code, getting it into collab, all that stuff for validating it. I end up doing quite a bit of that because at first the code wasn't working. So I had to go back in and try to reimplement it for uh the E part uh was fix potential issues that were found during the implementation and validation stages. Again, I had to go do that a bunch of times because it was not implementing correctly. Then present findings in a clear, informative, and concise manner. That's what I'm trying to do right now. So I think yeah, that's about it. Thank you.",
  "video_url": "https://www.youtube.com/watch?v=nHp1UeHDA9M"
}