{
  "student_name": "Max Vogt",
  "org_defined_id": "035680961",
  "username": "vogt14",
  "video_url": "https://www.youtube.com/watch?v=_T5COkX3rDE&feature=youtu.be",
  "transcript": "Okay, for the session 12 assignment for the Define and Discover, we will be KKRs considering a takeover of Panera Bread, and we must determine a credible valuation range using DCF, trading comps, and precedent transactions. We will consider financial buyers, discipline versus strategic buyer synergy, integration of growth levers, management rollover and control implications, and executive-ready recommendations for a bid strategy. So just some information that we're going to lay out is a revenue of $6 million growing 8%, EBITDA of $900 million with a 15% margin, net income of $400 million, 2,100 stores, and 50% digital sales. So the industry PE is 22, a precedent EBITDA multiples are 12 to 15x, and Chipotle's PE is 35 on McDonald's, PE is 25x. So some assumptions we have is a WAC of 9%, management wants 10% rollover, strategic bidders that are interested are Starbucks and McDonald's.\n\nWe have growth levers of firing new stores in five years, a digital mix to 70%, dinner and catering expansion, as well as early-stage international rollout. Some questions we will be answering during this is, what is the present value of projected cash flows, including terminal value across base, upside, and downside scenarios? How do comparable companies and precedent transactions translate into Panera's valuation range? What synergies could strategic buyer capture versus financial buyer discipline, and how does this affect valuation? What is the recommended bid range, walk-away price, and financing approach? So for a represent stage, we're just going to lay out some equations that we'll be using. So over the DCF free cash flow projection to project cash flows over five years forming the base of intrinsic value. The terminal value, we will capture the continuing value of Panera beyond the explicit forecast period.\n\nAnd the enterprise value, which combines projected cash flows and terminal value discounted at WACC. And then we'll also be looking at multiples, which are trading comps slash precedent transactions. This will provide market-based valuation benchmarks to triangulate ECF results. And then we will be finding strategic buyer adjustments, which quantifies potential incremental value for strategic buyers versus financial buyers. And then lastly the bid range which will find a lowest price consistent with financial discipline as well as a midpoint or adjusted based on strategic advantages and management rollover. So to implement we used Colab to write a code or Gemini to write a code in Colab. So we have it right here. This top part prompts users to enter the key financial and strategic assumptions. We then have the equations all laid out. We then have the actual calculations that will be happening throughout this section. And then we have the printing of the summary.\n\nSo we will run this really quick with the default values, revenue of $6 billion, EBITDA of $0.9 billion, net income of $0.4 billion, total debt of $1.5 billion, cash of $0.5, 9% WAC, 3% terminal growth rate, 10% FCF growth year 1, 8% year 2, 6% year 3, 4% year 4, 3% year 5, and then default of 22 PE multiple, 12 EBITDA multiple, 15 ebbs of multiple for precedent is the max and then we have a 5.5 billion annual cost energy 0.3 billion annual revenue digital sales and that will be all so then we run this we will get the results we have the cash flows laid out from year one to year five right here we have the We have the industry P multiple which has the implied equity value in the trading constant enterprise of 8.8 billion and 9.8 billion. We have the precedent transaction EV range of 10 billion to 13.5 billion and the enterprise value of 12.15 billion. We have annual synergies of 0.8 billion which gives us present value synergies of 13.33 and a synergy adjusted enterprise value of 21.\n\n27. We then have DCF 6.93 trading comps of 8.8, present minimum and present maximum ranging from 9.8 to 12.5 and a synergy adjusted for 20.27. We then have estimated bid range of $9.37 to $15.53. Bid equity value range of $8.37 to $14.53 and a management rollover equity of $1.45 billion. DCF EV of $7.93 billion with a trading comp EV of $9.8. Precedent transactions $12.15 billion which is the midpoint and synergy adjusted EV of $21.27 billion. And then at the end we just have the recommended bid range 8.37 million to the 14.53 billion. So to validate this we just ran through a couple. We found the DCF of year one which matches up 4.03.7. We took 440 mil times .91743 to get that. Trading EV of $8.8 billion plus $1.5 minus $0.5 which goes up to $9.8 which also matches up with the model. Then synergy EV $7.93 billion plus $13.33 equals $21.27 which matches up with the value. So, to evolve this, we're just going to lay out some of the information and add some conclusions on this.\n\nWe have a DCF EV of 7.93, Trading Comps EV of 9.8, President Transactions of 12.15, that's the midpoint, Synergy Adjusted EV of 21.27 billion. So, this means financial buyers are likely to close the DCF and Trading Comps range, reflecting disciplined cash flow-based valuations. Strategic buyers can justify higher bids due to cost-revenue synergies, which raise the potential enterprise value significantly. KKR should aim to stay near the lower bound of the bid range of $8.37 billion to maintain financial discipline, but remain flexible to negotiate upwards if competing with another buyer, particularly a strategic acquirer. Management rollover equity is about 10% of the max bid, which allows key executives to remain invested, aligning their interests with KKR and ensuring a smoother integration post-acquisition. Some sensitivity and key assumptions is DCF assumptions.\n\nheavily impact the lower bound, synergy captures uncertain overestimating could lead to overpayment, and precedent and trading multiples anchor the valuation to market reality and provide a sanity check. Some stakeholder implications are financial buyers such as KKR gains disciplined upside, focuses on operational improvement, management is incentivized through rollover equity to maintain performance, and strategic buyers can justify paying a premium due to operational or digital synergies. Now moving on to the reflect stage. Some lessons learned is using multiple valuation methods gives a more robust defensible bid range. Synergy assumptions can dramatically shift valuations highlighting the importance of sensitivity analysis and financial discipline versus strategic opportunity must be balanced in negotiation strategy.\n\nAdditional metrics that could be useful are EV revenue multiples for early stage growth comparables, store level unit economics to refine cash flow predictions, digital mix contribution to profitability and growth, and debt capacity if KKR intends to use leverage in the acquisition. Other potential uses of this model could be scenario analysis such as adjusted growth wax or synergies to test walkway prices, strategic planning to estimate potential ROI for expansion or digital initiatives, and investor communication that will present a clear bid rationale and valuation bridge to stakeholders. This framework ensures a step-by-step evidence-based approach rather than retrospective summary. Using interactive inputs in Python makes it easy to update assumptions and test a lot of scenarios, and the exercise emphasizes linking numbers to strategic decisions, not just calculating EVs.\nSo overall, the takeaway is just a disciplined multi-method valuation approach paired with some scenario flexibility allows KKR to make data-backed, stakeholder-conscious bidding decisions while preparing both financial and strategic contingencies. This will wrap up the... session 12 assignment."
}