{
  "student_name": "Aly Foster",
  "org_defined_id": "035604553",
  "username": "foste304",
  "video_url": "https://youtu.be/2KJ0RORSxZE",
  "transcript": "Hi, I'm Alyson and for the session 12 assignment, the goal is to determine KKR's justified bid range for Panera in a competitive auction with possible strategic biders such as McDonald's and Starbucks. So to do that, we need to understand business performance, identify key valuation drivers, identify risks and also define scenarios. So I identified the key value drivers as a strong fee cash flow generation um 500 plan new stores digital mix expanding from 50% to 70% and the margin expansion total which are all things that we were given while also identifying risks such as high sensitivity to walk and heavy reliance on terminal value. And then for represent we have um a map of the model that I built. So, this includes a 5-year FCF projection. Um, the DCF with 9% walk and a terminal value using both perpetuity and multiple and then a full set of trading and president precedent transactions. Um and then to create a chart to synthesize all valuation methods and then for implement I executed the valuation model. So first I projected the free cash flow which is also shown as FCF there. Um which grows from about 391 million in year 1 to 57 million in year 5. And then the discounted value um of those cash flows ranges from 375 million to about 344 million. And then\n\num we have calculations for the terminal value. So the perpetuity perpetuity TV is about 8 billion and then the exit multiple TV is around 15.8 billion. So from there I converted those into um implied share prices across the method. So the DCF financial buyer is 57 to $15 with a midpoint around 83. And then strategic buyer is from 84 to 86 driven by synergies trading comps PE of 88 to 140. Precedence of 108 to 135. And then the football field recommendation is that 63 to $135 bid range. So from there we can see this output shows all of those numbers that I just talked about. So the recommended bid range here is the 63 to 135. And then the president transactions are from 108 to 135. trading comp, strategic buyer and then the DCF valuation. And then from there we also have implied or sorry we have the football field valuation summary which is implied share price. So here again it shows those numbers that we saw up there. The mid prices, max prices and min prices. And then also this DCF valuation sensitivity. This shows all the percentages and implied shared prices along with that growth for each one of those. And then for evolve and validate I have the DCF sensitivity table. So that shows the different terminal growths and walks. So here we have 8 8% 8.8 9.5 10.2 and 11. And then these are all of those growth numbers. So for reflect we have all of the key terminology here. So the valuation range, the DCF, strategic premium and key range drivers um which all show the different values and um information there. And then we have the value drivers for Panera which are the digital and tech optimization, store count growth and capital structure optimization. And then key risks and financial versus strategic buyer comparison. So here we have the factor, financial buyer and strategic buyer and that shows the primary goal um the justifiable price and synergy and all of that stuff. And then for to go back for validate I checked that all of the assumptions were reasonable. So comparing the implied um I just say EBIT TDA multiples to market comparables verifying the FCF margins and growth align with restaurant peers review walk 9 point or 9% versus industry benchmarks validate that strategic premium is reasonable 2.8% and then confirm the football field alignment. So from all of that evolve I have that sensitivity table that showed um Panera's value is very sensitive to walk. So for example depending on walk the valuation ranged from around 51 to almost 90. And here we can see there's that 51 with a G 2% and walk of 11%.\nAnd then for reflect, I combined everything um to see that Panera's standalone value is roughly that $83 per share um which is which also should anchor the KKR discipline. So strategic um buyers can justify the $85 to $90 creating a higher floor and a soft price floor. And then also the largest risk that this terminal value drives most of um in that DCF. So assumptions must be conservative. So we see that um the key risks are interest rates, long-term growth and store roll out execution. So overall this model demonstrates strong FCF, solid growth, and a meaningful upside, but definitely does require disciplined bidding. Thank you."
}