{
  "student_name": "Robby Bergeron",
  "org_defined_id": "035626927",
  "username": "bergeror",
  "video_url": "https://youtu.be/iRppl1XIUT0",
  "transcript": "Okay. So, we're going to talk today about what Panera is worth to the investment buyer of the KKR versus a strategic buyer. So, we have some things we'll talk about. So, first off, Panera generates about $6 billion in revenue, growing at 8% with $900 million of EBID, EBIT TDA at 15% margin across roughly 2,000 stores. Digital sales represent up to 70% of their revenue, which materially impacts their scalability and margin potential. Um, we identify these deals early on. management has a ton of rollover at about 10% right now. So that's one of the major deal constraints. There's lots of competing buyers such as Starbucks and McDonald's that are big in the field. These correlate to uh the in the valuation discipline and the bid strategy. So we'll have to look at those. So on the revenue side, Panera's growth is driven by four things. their instore sales, the organic instore sales, the addition of about the 500 new stores they've added and the expansion of their digital dining and catering and the revenue that they generate from that. So moving on to the represent stage, the valuation is calculated using three approaches. First is the multi-senario DCF which serves as the core anchor. Second is the trading comparables or the market checks. Third is the president transaction or the control decks. And then we're going to look at some buyer type comparisons and look at the scenarios when we toggle them. Speaking of, we're going to look at that first. So, we can toggle different scenarios using code. So, right now I have it set at base and as you can see it predicts my five-year plan. But say I sense an upside or such and I can change the parameters. I've already lost it. Here we go. Upside\n\nand see. Oh, and now it's done.\n\nI didn't click the right button.\n\nThere we go. And as you can tell, now our valuations have changed and now they're on the upside. So, this is useful to show us how for a financial buyer, the downside protection. Uh, let me try a downside example.\n\nit will show us the protection for the downside that we'll need. Um, so that's really nice. Um, the 5-year DCF projects revenue growth and EBITDA expansion and the free cash flow based on the previously defined drivers. The free cash flow is calculated after all the taxes and the capital expenditures and the working capital needs ensuring that the clean cash flow is delivered in the stream. So looking next at our sensitivity analysis, we can tell that there's an inverse relation for the WACC evaluation and that there's no relationship for the terminal growth which I found when I was working later on down here with Gemini and collab right here. So I saw I started to learn that the weight adjusted cost of capital has an inverse calculation with the valuation at the terminal growth doesn't really add to it. So this table shows the valuation across the weight adjusted cost to capital and terminate growth assumptions and shows how it is sensitive to the discount rate assumptions and shows why the financial buyers have to remain disciplined when they buy. The sensitivity also shows um the defensive valuation corridor which is essential when it's negotiating against strategic biders who are willing to pay for the synergies of their companies. So looking at the valid to moving on to validate the trading competitions. So the companies that are competing for the company, the peer set includes industry averages at approximately that 22 times earnings with high growth like McDonald's and Chipotle who are completely bigger than Panera which trade even closely closer to 35 times the earnings in McDonald's around 25 times showing that they make a lot more money than these companies and that their addition could help a bit addition. of Panera could help. Applying these multiples to Panera's earnings produces an implied valuation range that fits the DCF outcomes, meaning that it would probably be good for the trading competition. Panera reasonably trades below Chipotle due to the lower growth but above the industry media, which means that it would be a good addition to Chipotle if they were interested in buying. it would add to their implied valuation range and it would it is above the yeah so it's saying that Panera is above median standards looking at president transactions the recent restaurant and consumer deals have cleared the EBIDTA multiples between 12 and 15 times applying these multiples to Panera's um valuations and their money shows that the EB PBITDA yields um at a large value that's consistent with a upper half a DCF and the trading competition outputs showing that it would make a profit. This step confirms that the DCF is not producing an unrealistic result and is aligning with our private market clearing prices so that they would make money overall. Preferably looking at this from an overview, we can see that the zones between DCF, trading comps, and president transactions represent the most defensible valuation range for the company. And importantly, all three of these methods um converge with a tight band, which shows confidence in the bid range, showing that this is how much Panera is actually worth to these companies after all of this.\nSo the financial versus the strategic buyer, which is going to have more value when it comes to buying Panera? The strategic buyers can justify their higher valuations because they have the digital scale store overlap efficiencies and operating leverages like McDonald's and Chipotle. They already have the facilities that they could add to Panera and make the companies stronger together. When these synergies are brought together, strategic biders can rationally outbid a financial buyer who wants to take over the company from a money point of view. However, these synergies come with an integration risk as McDonald's and Panera don't really sell the same amount of food. Our financial buyers like KKR prioritize predictable cash flows. They see the market's good and that Panera could be doing well in the future. So, they take a risk and try to invest money to make money for themselves. Reflecting back um based on this triangulated analysis, we'd recommend a valuation range of approximately 13 billion in the enterprise revenue because with the big companies competing for it, that's how much we think we could get for the company. The KKR should not chase strategic synergies it cannot realize. It should focus on execution quality instead. And I learned a lot from this analysis that about not just only the companies but from other financial investors and how they can really use the company to do well and then how some companies might not well align well with other companies and it wouldn't be a good valuation add-on or if the companies do align it would be a valuable valuation and then they should join RPBOT."
}