{
  "student_name": "Ronak Badam",
  "org_defined_id": "036108316",
  "username": "rbadam",
  "email": "",
  "transcript": "Hi, my name is Ronaksai and today we're going to go through our session 10 which is capital budgeting and investment analysis. So for this session we're switching from theoretical time value money TVM and then we're moving to high stakes corporate decision-m. So this is past calculating the price of a bond to determining whether a corporation should to deploy billions of dollars into a new asset or not. So this captures the essential stages of professional financial uh analyst workflow. We have three steps which is the go nogo decision where we calculate headline metrics like NPV and IRR the engine room where we manually build the operating cash flow cash flows to account for tax shield and depreciation and then three the stress test where we visualize risk through sensitivity analysis. So, we're going to use our Starbucks roaster assignment and uh as well as Google's Gemini to help create three Python examples and I will run through and how it solves and explains the Starbucks roster assignment to us. So, in our first block, we establish the financial baseline. We are translating the strategic proposal into a cash flow array. So, ensuring year zero is negative to represent the uh investment outlay. So, we apply NPF. NPV which is a um which is amppv that we installed prior. We discount all future cash flows back to today using the WACCC of 8.5. And so um NPV is very binary and ruthless. If NPV is positive, the project creates value. If negative, it destroys it. And then we also calculate the IR which gives us the project's break even interest rate. So for our Starbucks assignment, we're going to replace the cash flows future list with the specific annual flows derived from the roster data. So here let me run our section one uh our first block and here we can see that we're installing the numpy financial as npf and the and the pip to install it is the missing library and now we're going to and so I already ran this and this is just going to go through and check the nump fee so that's not important but now our project financial analysis so our total initial outlay is uh $2 billion and our NPV is a little over $2 billion it's 2 billion um 66,17,73162 and then our internal rate of return our IRRa is 27.45 four five. So our payback period is four years. So since our net present value since it's positive our project creates shareholder value. Now moving on to our next section we have the engine room. So in this block I will scroll down is our second block. We have pandas blah blah blah and a few other things. Um like I say blah blah blah a lot but um this block is where actual analysis happens. So it's the represent stage of driver and it just doesn't doesn't accept a cash flow number we calculate to ensure that we calc we capture the tax shield. So notice how we distract subtract depreciation to calculate the tax bill. So we can see that now we are subtracting depreciation in this section down here to uh data depend um but then and and then we add it back in the final cash flow. So we can see that here plus cash flow here we're subtracting um and then this because depreciation non-cash expense is specific mechanism saving cash on taxes without spending cash on operations is a major source of value in capital heavy projects like factories or roies using this structure. So we're going to verify our calculations here. So, I'm going to run. And so, our total PV of operating cash flows is 34,400,477.31. And this is our operating cash flow analysis. Okay. Now, moving on to block three. So, we have the stress test. So, finally, we evaluate we validate our decision. In the real world, WACC is an estimate, not a guaranteed fact. We didn't know that. This visualization answers the critical questions. How wrong can we be about our cast cost of capital and still make money? This graph shows the project's NPV at direct different discount rates. The point where the blue line crosses zero is the IRR, the distance between our green line, current WACC, and the crossing point represents our margin of safety. If the lines are close together, the project is risky. If they're far apart, the project is robust. So now let's run this and we will see our chart. So here we can see that our um our break even is down here and our current WACC is here. So the point where the blue line crosses zero is the IRR and the diff distance between our green line current W ACC and that crossing point is our margin of safety. So we can see that we never cross our break even NPV and this is about where we cross our WACC. So we're about a little between 2,00 and uh 1,500 millions right there. So$1.5 to2 billion dollars. Okay. Thank you. So that's my session",
  "video_url": "https://youtu.be/M7ZFsQDCKM4"
}