{
  "student_name": "Riley Gross",
  "org_defined_id": "037145708",
  "username": "gross132",
  "email": "",
  "transcript": "Hello, my name is Riley Gross and today we will be covering whack also known as weighted average cost of capital. In assistance to this um explanation that I will be giving, I'll be utilizing Gemini to help us write a Python script. That way we can understand the calculations utilizing the book for our formula as well as going and using the driver framework to help us solve this problem and approach it in in a proper way that allows us to get the most and understand as much as possible from it. So getting straight into whack. Whack or the weighted average cost of capital is essentially a metric that companies use for determining the financing costs um by averaging the after tax uh cost of all capital sources but specifically equity and debt. Now, for those of you who don't know, equity is or equity financing is when a company wants to get capital or money for a project or maybe they want to expand something within the business, but they will get capital from people but without having to pay interest on that. So, that that would be debt, which I will get to in a second. So, equity would be having an IPO, for example. Maybe they would be giving away 10% of the company's shares slash the equity in the company or power ownership for in return from investor an investor or investors let's say a million dollars. Now they don't have to pay this back. They gave that the shares to investors in which the investors um would hope to get a return but they would also have a say in the the company's doings. So there's disadvantages and advantages to both equity and debt. But the the disadvantage in terms of debt is that or in terms of equity is that you lose a share of your ownership in the company or your power. You have more shareholders to abide to and please. And then the advantage for equity would be that you don't have to pay interest which brings me to debt. Debt is when you finance but you have to pay interest on it. So something that you probably think interest that would be a loan as well as a bond. So those are the two common debt financing activities. So getting a loan from a bank you get that capital but you have to pay interest on it. So that's the disadvantage of debt. But the advantage of debt is that you don't lose a portion of power or equity in the company unlike in equity financing. So now that we kind of have an an established idea of what equity is, I will go into our first our um driver framework and then the problem. So we've kind of we're going to be going into the define and discover stage of the driver framework. Um which brings me to um our problem at hand. If it will let me. There we go. Um so the problem at hand is we are trying to calculate the whack for Netflix um in which they have a $5 billion content investment decision. We have to determine this whack. Ev evaluate the opportunities of debt financing and uh look at the project versus the uh internally or project specific versus the firmwide discount rates and as well as compare their cost of capital to other companies in their industry. So the parameters for this uh Netflix project is that the the market capitalization is 200 billion. The total debt or the book value is 14 billion and then the actual debt or the market value debt is 13 billion. So when we do this um looking in into whack we always use the market value not the book value. So that is the number that we will be using in this case. Then we have the equity beta which is the volatility of the equity. And then we have the bond rating. It's a B++. This is for our debt. And then the yield is 5% or 5.8%. The and then the corporate tax rate is 21% and the current stock price is 450. And then the market conditions, the risk-free rate is 4.5. The market risk premium is 5.5. And the industry w or whack range is from 8 to 10%. And then we also have some capital structure for the other companies. So Disney has is 70% equity and 30% debt and its whack is 8.2%. Amazon um their whack is 9.5 and they use Amazon corporate and Netflix is considering three billion additional debt issuance for their content investment. So this brings me to my Gemini and the output I got for it. So I said, \"I'm a finance student studying WAC or weighted average cost of capital and I need your help. Be my assistant. I need you to write me a Python script for a scenario based on calculating Netflix whack along with other metrics that we've been determining to find the best scenario for Netflix and then making sure to comment on all the code include formulas and explain and calculations in the output.\" And then I gave it the situation that I just covered. So I will now go to the equation for whack. So it is the um market value of equity divided by the total firm value which is just the equity plus the debt. So we're finding the it would give us a decimal. So what that is trying to find is the weight of the equity and then we're going to multiply that by the cost of the equity. And then the same thing for debt. We're going to multiply or we're going to take the market value of the debt divided by the value or the total value of the firm. Then we're going to multiply that by the pre-tax cost of the debt. And then we're going to multiply that by um one minus the corporate tax rate. So now going to my uh Python script already ran the output but I will go through. So, this top portion right here is just explaining what whack is. And I've already talked about it, but um just so that it's known in the in the the Python script and output. That way, if you're looking back at it, you can kind of understand what's going on. And then here we have the parameters that we were given in the problem in our textbook. And then all of these are calculating the um actual whack or the portions to get to the actual whack. So this first one is the cost of equity which I talked about and that is basically just the risk-free rate plus the beta and then the beta is multiplied by the market risk premium. So to calculate our after tax uh cost of debt. So this would be calculating um the equivalent um for what it is to equity. So we for this we would take the R underscored would be the current yield on the bond and then times 1 minus that corporate tax rate and then calculating the total firm value. Basically, we're just taking the equity plus the debt. And then to weight that out, we just divide it by um that specific equity divided by the total firm which we we covered. And right here we just have more calculations calculating the beta and then calculating the new capital structure which we mentioned in the uh the problem in the textbook. So I have ran um this code and we will get into it. So here is the explanation of what WAC is as well as the formula and then the cost of equity and the after tax cost of debt and then here we have the parameters. So the the market value of equity is uh 200 billion. The market value of debt is 13 billion. The current equity of beta or current equity beta is 1.3. Pre-tax cost of debt 5.8 corporate tax rate 21% and then 4.5% risk-free rate. Market risk premium is 5.5. And then the additional debt that we might take up is $3 billion. So part one, we're calculating the cost of equity. We just have our 4.5% or our risk uh risk-free rate and then we're adding that 1.3 and then times 0 55 which is the market risk premium rate. That gets us 11.65% for our cost of equity. the after cost uh or after tax cost of debt is 0.58 which we had that's the pre-tax cost of debt and then multiplying that by one minus the corporate um sorry one second and then um we get 4.58% um from that after tax cost of debt and then calculating our firm value is just 200 billion plus 13 billion which is the equity plus the debt and And then the weight of the equity is 93.9%. It's most of the firm structure in this case. So they are getting in angel investors for example or venture capital firms to um basically give them capital and they get a share of the company. So this company is mainly owned by uh shareholders and then the debt is only 6.1%. So they're taking out very little um loans andor um giving out bonds that they would then have to pay back at interest. And then calculating this whack, we had the the 93.9% of weight of equity. Then we multiply that by the cost of the equity. And then for the um debt, we have the 6.1% times the 4.58% after tax cost of debt. and then adding those both together and we get 11.22% um for the weighted average cost of capital. Now moving on to part two, we mentioned that Netflix was looking to add $3 billion in additional debt financing. So for that basically we just add that $3 billion to the value of the debt and then add that up to the the total firm value. And then we're just going to go through and calculate our um weight weight of equity, weight of debt, and then find our new whack. So the new whack that we got is 11.2% instead of 11.22%. So So the whack here slightly decreased um and then adding this more cheap debt um to our capital structure outweighed the small increase that we got in the cost of equity from 11.65% 65% to 11.72. So going back to our driver framework, we have now represented. We we've shown the um or explained all of the whack and how to calculate it and its um cost of equity uh weight of equity um etc. And then we have also implemented we used the Python code and got our output and looked at all the calculations and we have even calculated the Netflix's whack as well as the new whack with the slightly new capital structure when we added on the debt. So the next step we will be moving to now is validate. So, so for the validate stage, we will be looking into how debt levels affect Netflix as a company as well as comparing Netflix's whack to other companies and maybe explaining um why these companies have a whack that is lower in which a lower whack means that is a less risky investment and the um in investors don't demand as high of a return because it's not as risky in which Netflix uh is slightly high for whack meaning that it is a risky investment. So that required rate of return that investors are looking for is going to be higher. So going back to collab we are on part three of visualization. So this is a sensitivity um table. So bottom here is total market value of debt and then cost of capital percentage is on the side. So, as you can see here, as the market value of debt goes up, so does the cost of equity, it slightly increases um or the cost of capital increases as um the market value of debt goes up. And then the whack stays pretty similar. It goes up a little um as the market value of debt goes up. Um but one one kind of outlier we see here is that the after tax cost of debt goes up pretty significantly or the cost of capital um of the after tax cost of debt goes up as the market value increases. So for our kind of evolving and comparing these um we we first look at Netflix's whack which is 11 uh 20 with our new whack um with that extra debt. Now Disney's whack is 8.2%. Now why might Disney be a less risky investment in terms of us calculating the weighted average cost of capital? So um one one thing we can kind of compare here is that Disney's capital structure is 30% debt and Netflix's is only about 7.4%. So the Disney is kind of taking a more advantage of the cheap tax shielded debt as it is taxdeductible. That is why we use the um after tax cost of debt in our calculation. And this lower ends up lowering the whack. So taking on debt instead of getting equity from maybe an IPO or a VC firm makes the the company seem more reliable not only to investors but also in simply math and calc calculating our whack. Um additionally comparing it to Amazon they have a 9% or 9.5%. So looking at this comparison a little more, we see that Disney has a pretty lower um whack compared to Netflix in which Disney's capital structure is 30% debt and Netflix's is only 7.4. So Disney is taking advantage of the um tax shield and cheap debt that debt financing gets you. It is tax deduct deductible in which having more debt means your your whack is going to be lower. We see that from our calculation earlier when we calculated it. And kind of um the underlying tone of this is that Netflix is um pretty underleveraged and they could add more debt um financing for their capital structure in which this would decrease their whack and make them seem like a less risky investment. And I mean, look, even while um Netflix Netflix's stock price always seems like it's it's kind of up and down, right? And if they were able to kind of um leverage debt financing more, they would be able to lower that risk. And in in turn what we learned from our um last um session was that people can control the market and how it behaves. Moving on to the reflect portion of our driver framework and the last step of it. I would like to kind of give my recommendations for Netflix. I talked about how they're underleveraged, but they should continue to increase their debt financing to get a more balanced capital structure. Obviously, you don't want all debt because then you'd be paying a lot of interest. But having more of it allows whack to be decreased. And kind of their what their main goal should be throughout the next year or two is to lower their debt to equity ratio which in turn looks more appealing to investors and would allow them to or having a better capital structure and debt to equity ratio. turn would allow them to invest in more meaningful projects, more content, grow faster, and help reduce that risk of going bankrupt. Even though Netflix does seem like a a huge company, having a better capital structure is going to help them maintain and become more stable. I hope you learned a lot about whack and um hopefully can utilize the driver framework throughout um more future problems that you come across. Thank you.",
  "video_url": "https://www.youtube.com/watch?v=g2NrW_fEsto"
}