{
  "student_name": "Melina Marsh",
  "org_defined_id": "035647509",
  "username": "marsh86",
  "email": "",
  "transcript": "Hello, today we'll be going over video assignment number 10 using the Driver Framework. So, to start with our Define and Discover, we want to determine if Starbucks proposed a flagship roastery project creates value for the firm by calculating its Net Present Value, or NPV, and other capital budgeting metrics. So, our project parameters are 10 years. We have the upfront investment of $12 million, with an initial layout in year 0 for building, equipment, and training. We have our salvage slash terminal value of $3 million, expected value recovered at the end of year 10. Depreciation method is a strategy based on line over 10 years. Our annual depreciation is $12 million divided by 10, which equals to $1.2 million. Our working capital is $500,000, deployed in year 0, and recovered in year 10. Discount rate is 8.5%, the firm's hurdle rate. And then corporate tax rate, 25%, the rate applied to taxable income. So our revenue and operating costs are $1 established here. So our revenue, um, $8 million in year one, years two to five, 11 million, then years six to 10, 9 million. Um, our COGS 40% of revenue is 3.2 million in year one. Years two through five, 4.4 million, years six through 10, 3.6 million, and so on with our labor, rent, and utilities, and our marketing all shown here. So moving on to our represent, the core output is the incremental cash flow schedule for years zero to ten. Some equations we will use are the following, uhm, our operating cash flow using the tax shield approach. It's, uhm, all shown right here. Then we will go to our networking capital change. Uhm, which is shown here. Cash flows is the negative networking capital, uhm, capital spending, initial investment in year zero. Terminal cash flow includes the recovery of NWC and the salvage slash terminal value in year 10. Total incremental cash flow, uhm, the equation is shown here. And then some of our key calculations, we have our net present value shown here and we accept if the NPV is greater than zero. For our internal rate of return, the rate R, where the equation is shown here, and then we accept if the internal rate of return is greater than the WACC. For our profitability index, our R equation is shown here, and then we accept if the profitability index, index is greater than one. And then we have our payback period, um, the time until cumulative cash flows equal the initial investment, and the shortest time is preferred. Moving on to implement, um, our annual depreciation is going to be the $12,000,000 divided by 10 years, which is going to equal $1,200,000. Our initial cash flow in year 0, the outlay for investment and working capital, is $1 is, um, the negative $12,000,000 minus $500,000, making it a negative $12,500,000. Then we have our terminal cash flow in year 10, includes our OCF recovery of working capital and salvage value, and our year 10 total of CF, um, all given right here. So using the total CF stream and the WACC of 8.5%, the following metrics were calculated. The net present value, um, the sum of the present values of the total cash, year 0 through year 10, discounted at the 8.5% WACC equals to this number. And then since the NPV is greater than 0, the project is expected to create value, so it would be accepted. For internal rate of return, the discount rate that makes the NPV of the cash flow stream exactly 0, it equals to 10.97%. And based on this answer, the project is financially acceptable, which we would accept. Profitability. Profitability index, or PI, the present value of future cash flows, years 1 through 10, divided by the absolute value of the initial investment, year 0, equals to 1.15. And since the PI is greater than 1, the project is value creating, which means we would accept. And then for our payback periods, simple payback period, time until cumulative, undiscounted cash flows equal the initial investment, which would equal 6 years. Discounted payback period, time until cumulative, discounted cash flows equal the initial investment. would be 7.13 years. Based on the financial analysis, all three primary metrics indicate that the proposed Starbucks flagship roast jury should be accepted. The project generates a positive NPV of nearly 1.9 million dollars, exceeding the firm's required return. To validate, all variable, all variables are defined clearly at the beginning of the model, satisfying the technical requirement for updates. the depreciation. Decision tax shield is correctly captured implicitly within the OCF calculation method. The NPV and IRR functions correctly apply the 8.5% discount rate over the 10-year period, years 1 to 10, and the initial investment is correctly placed at year 0. The financial model is logically sound, the cash flows for critical years are manually verified, and the core decision metrics are correctly computed against the hurdle rate. For Evolve, we will systematically change the most uncertain variables to see how we're doing. For Scenario 1, revenue reduced by 20%. This tests the risk that the flagship roastery underperforms market expectations. So the input change, all annual revenue figures are reduced by 20%. Then the WACC stays at the base case 8.5%. For the NPV, best case is 1.89 million. Revenue, ah, negative 20% would be a negative 1.56 million dollars. And the conclusion, the NPV would be less than zero, so we would reject. The IRR, best case, ah, at 10.97%. The revenue, at negative 20%, would be 6.27%. And the conclusion, since IRR is less than the WACC, we would reject. The project is highly sensitive to revenue. A 20% drop in sales revenue. Causes the project to lose value, making it financially unacceptable. For Scenario 2, the WACC volatility, at plus or minus 2%. This tests the impact of potential changes in Starbucks cost of financing. Input change, the WACC is tested at 6.5%, down 2%, and 10.5%, up 2%. Revenue and costs revert to base case figures. For NPV, our WACC at negative 2% was tested or 6.5% is plus $3.51 million, which we would accept. The base case at 8.5% would be a plus 1.89 million, which we would accept. And the WACC at plus 2% or 10.5% would be a plus 0.44 million, which we would accept. The project is less sensitive to WACC. Even if the company's cost of capital rises to 10.5%, the project's MPV remains positive, though significantly smaller, indicating the project is less financially robust against moderate changes in the discount rate. For our reflect, based on this information, I would strongly advise accepting the proposed project, yielding a positive net present value of nearly 1.9 million in an IRR well above the 8.5. However, the sensitivity analysis revealed the project's vulnerability, showing that a mere 20% drop in revenue would cause the NPV to become negative, leading to a rejection. Therefore, while the project is financially attractive and sustainable, and strategically vital for reinforcing the Starbucks brand and moving into experimental retail, the final recommendation is that we accept the project, but only with a clear focus on risk mitigation and aggressive monitoring of the revenue. Targets, which are the primary driver of project value and failure.",
  "video_url": "https://www.youtube.com/watch?v=GaSkPibKYCU"
}