{
  "student_name": "Abbey Carroll",
  "org_defined_id": "035875419",
  "username": "carro146",
  "email": "",
  "transcript": "Hi everybody. So in this presentation, I will be walking through my Netflix cost of capital analysis using the driver framework. The focus of my analysis is to calculate Netflix's weighted average cost of capital or WACC in connection with a hypothetical $5 billion content investment. So, I'll evaluate Netflix's current WACC, analyze the impact of issuing $3 billion of new debt, calculate project specific hurdle rates for the US and international content, compare Netflix to Disney and AM and and Amazon, run a leverage sensitivity analysis, and conclude with a strategic capital structure recommendation. So, throughout the n the notebook, I follow all six driver stages. Define the decision problem. Research slashdiscocover key financial inputs. Implement formulas and code. Validate slash evolve with a sensitivity analysis and reflect with takeaways and recommendations. So in the next cell I import the main Python packages. I'll be using num pi pandas and mapplot lib. I also define helper functions to compute cost of equity using C capm after tax cost of debt wcc and the hamida equation to unlever and relever beta when capital structure changes. So even though this cell doesn't print anything, it sets up all the functions I'll rely on for the financial calculations later on in the notebook. So now for cell number three for our driver define and discover. So I'll move into the two driver stages define and discover. So in the define stage I lay out the exact decision problem. Netflix is considering a $5 billion content investment and may issue an additional $3 billion of debt to help fund it. To evaluate, I need to calculate Netflix's current WACC. WACC after new debt project specific WACC for US versus international content a comparison to Disney and Amazon and ultimately a capital structure recommendation. So in the discover stage I load all of the numerical inputs $200 billion in or 200 billion in equity market value 13 billion in debt market value 1.3 equity beta 5.8% 8% bond yield, 21% tax rate, 4.5% risk-free rate, 5.5% market risk premium. Media industry WACC range of around 8 to 10%. Disney's 8.2% WACC with a 70 out of 30 equity mix debt or equity debt mix. Amazon's 9.5% corporate WACC. So this cell satisfies the driver requirement that I fully document all assumptions before doing any calculations which is a critical grading component in this assignment. So now I'll move into the implementation. So first I calculate Netflix's current leverage. So equity weight is about 93.9%. There we go 93.9%. debt weight is only 6.1% which shows Netflix is very equity heavy and then I calculate the cost of equity using capm. So RA equals RF plus beta multiplied by market risk premium. So the cost of equity comes out to around 11.65%. The after tax cost of debt is 5.8% multiplied by 1 - 21% = 4.8 4.58%. So putting these together, Netflix's current WACC is approximately 11.22%. This is slightly above the media industry WACC range of 8 to 10% which implies Netflix faces a higher hurdle rate than many of its peers. So now for cell number five. So next I calculate the impact of use of issuing an additional $3 billion of debt. I look at two separate scenarios. One, a simple case where the cost of equity stays the same. And two, a more accurate case where I can adjust beta upward using the Hamida equation because more leverage in increases equity risk. With the simple assumption, WACC falls slightly from 11.22% to 11.13%. Because cheap debt replaces expensive equity. But once I adjust for the higher beta, WACC increases slightly compared to the simple case and ends up at 11.2%. These results illustrate the classic corporate finance trade-off. The tax shield lowers WACC but higher leverages raises equity risk which increases the cost of equity and counteracts some of its benefits. So now for cell six project specific WACC. So in this cell I calculate the project specific hurdle rates for the US versus international content. So I assume the US content has slightly a lower beta of 1.2%. And the international content has a higher beta of 1.5 due to currency political and regulatory risks. So using the same capital structure the US content WACC is about 10.7%. The international content WACCC is about 12.25%. So this matters because the company should discount each project at a rate that matches its perfect its specific risk, not the corporate average. This is a key point in the assignment rubric demonstrating that I understand project level discounting. So next for code cell 7, here I compare Netflix to two major peers. Disney's WACC is 8.2% and they use a 7030 equity debt mix. Their broad diversification, theme parks, merchandise, media networks, reduces their risks and lowers their cost of capital. So, Amazon's corporate WACCC is 9.5% and Prime Video uses that hurdle rate. Amazon's enormous diversification also stabilizes c stabilizes cash flow. Netflix, by contrast, has a higher WACCC of 11.22% reflecting a narrower business model, higher content spend, and greater perceived risk from investors. This comparison highlights that Netflix's hurdle rate is meaningfully higher than both major competitors for code cell number eight. So, next I move into the validate/evolve stage of driver. So here I run a sensitivity analysis to see how Netflix's WACCC changes across different debt ratios from 0% to 80%. So the output table shows that as debt increases, leverage beta increases, the cost of equity increases, but because debt is cheaper than equity, WACC still declines overall. The chart clearly shows a downward sloping line. In this simplified model, the minimum WACCC is about 10.22% occurring at roughly 80% debt. This result does not mean that Netflix should target 80% debt. That level is unrealistic for a company with volatile cash flows. But the analysis does show that Netflix could safely support more debt than it is currently using because it is extremely equityheavy today. So now for code cell 9. So finally I finished with the reflect stage of the driver. So first I summarize Netflix's current position. Its WACC is about 11.22% above the industry average and it uses very little debt which increases its reliance on expensive equity. Second I restate the impact of the $3 billion debt issuance. So WACC only falls slightly because once we adjust beta the benefit of leverage is mostly offset by rising equity risk. Third, I highlight project specific hurdle rates. So US content equals around 10.7%. And international content equals around 12.25%. So Netflix should not use a single corporate hurdle rate but should discount projects at risk appropriate WACCC's. Fourth, I compare Netflix to peers. So Disney's WACC is 8.2% and Amazon's WACC is 9.5%. So Netflix's higher WACCC reflects greater risk and less diversification. Fifth, I provide my recommended strategy. So Netflix should gradually increase leverage towards a moderate debt ratio, not as high as 80% but higher than today's 6%. It should maintain at least a BB a BBB plus credit quality, preserve flexibility for high ROI content spending and match the maturity of debt with the long-term nature of content investments. Finally, I tie the finance together. WACC represents the minimum return Netflix must earn to satisfy both debt and equity investors. Adding debt provides a tax shield, lowering WACC up to a point. But too much leverage raises equity risk and can increase WC WACC. So my overall conclusion is that a balanced moderately leveraged capital structure combined with project specific discount rates will support disciplined content investment and help Netflix create long-term shareholder value. Thank you.",
  "video_url": "https://youtu.be/qCAsNLQrh1s"
}