{
  "student_name": "Alex Lenig",
  "org_defined_id": "035836182",
  "username": "alenig",
  "video_url": "https://youtu.be/w_7JboJK-tI?si=ybZhDBKn4kJori6B",
  "transcript": "Hi. So, today we're looking at Panera\nBread and specifically we're doing a\nvaluation as a prospective uh buyer KKR\num in a takeover of the company. So, uh\nwhat do we start with? Um we're told\nwe're combining DCF trading comps and uh\npresident\nwhatever transactions to produce uh\ninformal bid range. um basically trying\nto make a bid range and make a bid uh\nstrategy for for us to go on. So we're\ngiven all this information which we'll\ngo through later. Um and then yeah so to\nstart out with in our driver framework\nwe have what is Panera's current\nsituation and who is KKR going against.\nSo to start out with uh we have Per\nPanera's current situation. So we can\nsee we have 900 million in EBITDA uh\nwhich stands for earnings before\ninterest, taxes, deprecation and\namortization and for that we have a 15%\nmargin. Um we have 400 million in net\nincome across two 2100 stores. So\num and then we're finally uh or Panera\nis finally uh getting some digital\npenetration. So they've had strong uh\n50% of sales uh through digital. So,\nthey're growing in that business. Um,\nand then some growth levers uh for the\nnext five-year projections. Uh, their\nplan is to open 500 new stores, which is\n25% unit growth. Uh, they have a digital\ndigital mix of a uh to 70% planned. Uh,\ndinner and catering expans expansions\nand international rollout. So, uh\nthey're planning on expanding and\ngrowing. They want to become a bigger\ncompany. Um, and they have some good\nfinancials to back them. So uh that's\nPanera's current situation. Uh we also\nwant to discuss uh for us KKR uh our\ndifferent situation in buying them. So\nin terms of buy buyer types and\nconflicts uh there's generally two types\nof buyers. Strategic buyers and\nfinancial buyers. Uh so the difference\nof these are I have some of them listed\nout but we can see uh strategic buyers\nare typically operating companies\nfocused on synergies and long-term\nvalue. So, they're pretty much companies\nthat actually operate in the business.\nUm, say a food company like we're\nlooking at here. Uh, if we're looking at\nuh Panera, they might be someone like\nMcDonald's, Starbucks, Chipotle, someone\nthat operates in that same kind of area.\nUm, they're focused on synergies. So,\nsynergies are basically being able to uh\ncombine your business into one thing.\nSo, um, like it sounds, you're able to\nput pieces of your company together and\ncombine it into one separate or one\nsingular entity. Um, because they're not\ntoo dissimilar. Like you said, like I\nsaid, if you're dealing in food, two\ntypes of food, you can try to start to\ncombine them. And this is able to, which\nI kind of mentioned down here, um, they\nfully integrate. Uh, that helps with\nbeing able to, uh, cond consolidate\nduplicate functions and rebranding. Um,\nso things like, you know, their HR\ndepartments or finance, if they're in\nthe similar market, they can just\ncombine them all into one thing and\nwon't make too much of a difference. And\nthat really helps companies cut down on\ntheir costs um and grow their profits in\nthe uh as a response to that. Um, and\nthese type of buyouts are typ typically\nlong-term or indefinite. Um, like I\nsaid, if they're in the same business,\nthen once they join them together,\nthey're pretty much going in the same\ndirection uh as time goes on. So, this\nis strategic buyer. Uh, financial buyer\nis different. Um, these are typically\ninvestment firms that are really purely\nfocused on ROI, return on investment.\nSo, they look at buying a business as um\nan investment. they're not looking well\nor uh their goal is to grow the company\nbut not because it grows uh like with\ntheir own company but because then their\nplan is typically going to be to sell it\nin a couple years. So you can see\ntypically this is just a range. It's not\nindefinite of what a financial buyer is.\nUm but they have a short to medium range\nterm usually about 3 to seven years. So\nthey look at the company the same as we\nlook at a stock uh something to invest\nin and they want to help the company\ngrow. They want to make sure it's\ngrowing and getting in profits because\nit's an investment um so that when they\nsell it later they can get a big return\non investment. So um their goal or what\nthey do typically is more optimizing the\nbusiness. Uh they add better management\nand operation efficiency um without did\nI add anything there? I guess I guess\nnot. Um,\nbut basically that just just without uh\nintegrating into the firm like a\nstrategic buyer would. So they're more\nfocused on helping the company run as\nefficiently as it it can, but they're\nnot specifically integrating themselves\ninto it. So if we're looking at this,\nuh, it's important to know the\ndifference because a we need to know\nwhat type of company we are and then\nwhat type of company the other people\nwould be that we'd be going against. So\nfor us uh KKR we'd be a financial buyer.\nUm we're looking to get a profit out of\nthe company but we're then fighting\nagainst strategic buyers. Um I think we\nare given\nyeah Starbucks and McDonald's are\ncircling. So companies that are um\nstrategic buyers want to also buy our um\nbuy this company. So they have the goal\nof being able to have a synergy with\nthat company which is very huge. Um,\nagain that makes it way more valuable to\nthem because they can add it into their\nuh kind of integrate it into their\ncompany at a much lower cost. So uh\nthose are important things to note about\nwho you're buying against and who you\nare actually trying to buy for the\ncompany because that helps with how you\nvalue the company. So that covers define\nuh now for represent uh how do we get a\nvaluation of uh for Panera. So what\nwe're going to do is uh three different\ntype of valuations um our methods and\nwhat they need. So the main one we'll be\nusing is discounted cash flows uh DCF\nanalysis. Uh this is basically a way to\nget an intrinsic value of the company.\nUm and it's one of a little more simple\nwell generally more simple. Um\nbasically we're just getting the present\nvalue of the expected cash flows in the\nfuture bringing them to expected value\nor uh bringing them to the present\nvalue. So bring them to where they are\nnow and then using that to see what the\nvalue of the company is. So it's a very\nuh financially uh like pure financial\nway to look at the company. Uh so this\nbasically um uses enterprise value uh\nfor valuation. So enterprise value is\nthis uh it's just the uh what is it\ncalled? Um\nwhy am I blanking on the name now? Uh it\nI'll start with UCFC. Uh that's\nunleveraged free cash flows. Um that's\nbasically uh the cash flows were given\nthe projections we're actually given. So\nfor what we'll be doing, we have a\n5-year projection. So it's those the\npresent value of those cash flows\nbrought to now. And then TV is terminal\nvalue. Uh so that's basically the value\nafter those five years. Um so a little\nless accurate than the UCFC's might be\nbut uh basically adding those together\nto get what the total valuation for the\ncompany would be. Um and what's\nimportant because we'll be looking at it\nis the calculations for UCFC. So this is\nNOA uh these are all acronyms we'll go\nthrough but uh the first one is NOPAT.\nUm this is basically profit after tax\nfor core operate operations and they\nassume no debt. Uh DA, this is\ndeprecation and amortization. Uh these\nare just non-cash expenses. Uh we added\nback into the cash flow because um again\nthey're not technically cash expenses.\nUm change in NWC. This is change in\nnetwork networking capital uh which is\ncash used or freed up uh by short-term\nassets and liabilities. And then we also\nsubtract off capex uh so capital\nexpenditures. So things like long-term\nassets, uh different types of equipment,\nthings like that. So that gets us to\nUCFC, uh which we'll be calculating\nlater. Um so that's our first analysis\nwe'll use. Uh the second one is\ncomparing comparable company analysis or\ntrading comps. Uh so these are basically\num uh relative valuation. Uh\nhere we go. um\nwhich uses uh basically values the\ncompany based on uh comparing it to\ncurrent valuations of other companies\nout there. Um so say star say Starbucks\nsomething kind of similar was valued\naround 30 billion billion or something\nlike that. Uh trying to use those kind\nof valuations out there in similar\nmarkets to value your company. Um so\nthis uses prices to earnings ratio PP PE\nuh to get an equity range. Um equity\nrange is just PE times net income. So um\nthese are uh results where we have here\num we can see I guess go into the actual\nuh thing. So PE net income\num\nso we can see we have uh these pees here\n35 and 25% I think that's what we used.\nYeah. Um\nbut yeah, so basically we take that\nmultiply it by uh the net income of\nPanera Bread and then that gets us our\nupper and lower ranges for our\nvaluation. Oh.\nUm\nokay. Uh so that's trading comps. Um and\nthen finally we're looking we're looking\nat uh president president transactional\nanalysis. Um this is kind of similar.\nIt's also just a uh relative valuation.\nUm and this uses uh information on how\ncompanies in the similar companies in\nthe past have traded um what their\nvaluations have been. Uh so recent\nmergers and acquisition transactions uh\nwith similar companies. Uh so this also\nuses uh earnings uh before interest,\ntax, deprecation and uh accumulation to\nget uh an an enterprise value. um that\nenterprise value is just that EBITDA of\nthe company. So in this case, Panerbread\nand then we multiply it by presented\nuh EBITDA multiples. So kind of like a\nPE ratio. Um we have an upper and lower\nratio and then multiply it by that. So\nin this case when we're looking at this\nwe have our uh 900 million EBT EBIT TDA\num and then multiples of 12 and 15 for\nuh the market. So we'll be multiplying\nthat uh 12 by 900 million and then 15 by\nthe 900 million to get our range. So um\ndon't know why I keep clicking on that.\nOkay, so that covers all of our\nevaluations what we'll need. Um, so we\nkind of covered the background of\neverything we'll need. So that gets us\ninto our actual code. So here, um, we\nbasically have a step. Um, we put in our\ncore financials. We basically just put\nin here all our, uh, information that\nwe've been given, our different rates.\nUm, we have a few different things I\nguess I should talk about beforehand.\nUm,\nlook. Yeah. Uh so we'll be doing some\ndifferent scenarios. Um like I said\nhere uh for these trading comps and uh\nuh the uh the other analysis uh we kind\nof get a range. So we want to do the\nsame for discount discounted cash flows\nDCF. Um so for this we'll need a whack.\nWe're given a 9% whack. Um I believe\nright?\nYeah. industry whack of 9%. Uh so that's\nwhat we'll be using for our base. Um but\nthen we also are given uh we aren't\ngiven a terminal growth or anything like\nthat. So we'll use a base terminal\ngrowth of 2.5%. Um that's the standard\nlong-term inflation GDP growth. Uh so\nagain, it's not not as based on\nsomething that's just a general uh\nmarket uh term growth rate. Um, but then\nfor the upside case, we'll be using an\n8.5% whack and then a 3% terminal\ngrowth, so a little higher side. Then\nthe down downside case, a 9.5% whack and\nthen a 2% terminal growth. So again, on\nthe little lower side. So we're able to\nvary vary those rates um based on again\na good scenario or bad scenario pretty\nmuch. So those are included in our\ncalculations and those those will be\nimportant for getting our DCR um\nuh results. So anyway, back to the code.\nUh so we have all those inputs.\nUm and then our core DCF calculation\nfunction. Um so this is all those\ncalculations we'll get in a minute. Um\nproject projected arrays.\nThere's the five-year projections uh for\nall our results. Again, we'll go through\nthat in a minute.\num terminal calculations, growth,\nbasically going through all our uh all\nour um\ncalculations for our uh analysis.\nUm so this one goes through our trading\ncomps and president uh precedent\ntransaction analysis uh results.\nThen we do a low sensitivity analysis\nbasically varying our whack and terminal\nterminal rates.\nUm then main execution output\nthen gives us a little final\nrecommendation.\nSo we have our results here uh couple\ndifferent tables and then uh some of the\nresults. Uh but yeah so that's the code\npart of that. So that gets us into our\nV. Uh what do the our results actually\nrepresent? Uh so this first table here\nis a DCFbased calc uh our DCFbased\ncalculations for our five-year\nprojections. Uh so this is what's going\nto get us our um sum of the present\nvalue for our five-year projections. So\nyou can see here it's lined up by time\n1, time 2, time three, time four, time\nfive. Um and then we get all this\ninformation here. Revenue uh EBITDA\nEBIT. So just the EBITDA without the DA\nuh NOAT, Capex, Delta and NWC and then\nuh U U U U U U U U U U U U U U U U U U U\nU UFC. So like we talked about earlier\nUFC was calculated um with add taking\nNOAT um you added in\nwhy am I blanking on it now? Go back uh\nDA. So yeah, NOPAT DA\nuh which we get here from just taking\nthe difference between our EBIT DA\nwithout the part without the EBIT. Uh so\nthat leaves us with our just our DA. So\nwe had that result and then we subtract\nout our uh capex here and then our uh\nchange in NWC and then that gets our our\nUFC. So that's the result for time one\nand then we have the same thing or do\nthe same thing for time two, three,\nfour, five, all that. Um so we have that\nresult and then we just take that back\nto the present value using our uh time\nvalue of money concepts and then that\ngets us all of these. So now we get into\nour ba uh valuation bridge our base\ncase. Um so basically the intermediate\nvalues we need for enterprise value. So\nhere we have our sum of uh present value\nof FCF\num for those times. So this is basically\ntaking this entire row here uh and then\nadding it up and we get uh 1.5 billion\naround 1.5 billion. Um then present\nvalue of the terminal value again like I\nsaid that's just using the terminal\ngrowth rate um and our other values. Um\nand that gets us to 4 uh 9 billion about\napproximately. Um, and then to get our\nenterprise value like we talked about,\nwe just add those two together and then\nthat gets us 6.451\nbillion. So, in general, looking at the\nfinancials, that's generally what we\nproject um, Panera to end up being\nvalued at. So, we think that's that's\nwhat the value of the company is. Um but\nnow we want to do a valuation triangle\nof looking at our using our different\nmethods looking at the low end and high\nends of uh what our valuations around\nabout are.\nSo\nso we have our DCF range um and we have\na uh kind of low estimate here of five\nuh 5.3 million then a high estimate of\n8.9 million. So, uh, two route values\nthat are both on the high and low side\nof our EV here. Uh, and again, we have a\nlittle graph here that shows us that's\nour basis, the EV. Um, our president\ntrans president transactions. Um, like I\nsaid earlier, these are calculated. Uh,\nwe take our 12 uh 12 and 15 times EBITDA\ntimes our what was it? Nine was it 900\nmillion? Yeah, 900 million. uh on our\nPanera Bread.\nUm so doing that we get a low-end\nestimate value valuation of 10.8 million\nand then a high estimation of 13.5\nmillion. So you can see that's much\nhigher than our DCF range. Um\nand\num\nwhich is kind of a stronger indication\nof what people in the past have been\nbuying companies for. So even if you\nknow our valuation based on the\nfinancials is lower, we can tell that\nother companies are typically going to\nvalue uh might value a company like\nPanera way higher than our financials\nwould actually put it at. Um then\ntrading comps uh this gives us uh values\nof 8.8 billion and 14 billion. Again,\nthat's just taking our uh P& times our\nnet uh net income. Um so yeah so these\ngive us basically our three different\nour three different methods uh for\ngetting evaluations. So um how we want\nto approach actually valuate evaluating\nour company is um going to depend on\nlike a mix looking at a mix of these um\nthinking well you see our DCF range is a\nlot lower than our president transaction\ntrading comps but um the market actually\nvalues these uh these kind uh these\nthings higher so\nthat's how we want to kind\ntake into effect what our valuation\nwould look like and what if we are going\nto bid how much we'd want to be bidding\non. So finally or almost finally uh we\nget our E. So we'll be looking at what\nis our final valuation and bid strategy.\nSo so\nhere um we end up getting a little uh\nexecutive recommendation here which is\nputs together. So we can see we're given\na valuation of about 12 billion to 13.25\nbillion. Um and it also is good. It\ngives us a little winning strategy. Uh\nkind of just the best uh case scenario\nwe can look at or what we can kind of\nhope to look at. So we get an initial\nbid of 12 billion. Um which is right in\nbetween our present present presented\ntransactions. Um, so basically looking\nat how companies have traded in the past\nand putting a value right in the middle.\nUm, that kind of gives us a basis to at\nleast start our bid at. Um, but we also\nneed a walk away price to know if the\nbid gets too high, we're not going to\nbuy it. Uh, so that ends up being our\n13.5 billion. Uh, which is just ends up\non the high end of our president\ntransactions.\nUm, and then they give us a little\nrationale. this bid is positioned to\nreflect the financial financial buyer\ndiscipline. Um so we basically want to\nbe uh focused on uh\nyeah okay um yeah so our financial buyer\ndiscipline that's what we were talking\nabout earlier um with between financial\nand um um strategic buyers. So, because\nwe're buying financially, we're not\nworried about things like Synergy or uh\nuh worries like that that might make\ncompanies like say McDonald's or\nStarbucks or any other company in that\nkind of situation value uh Panera high\nway more. So, this gives us an actual\nvalue um for Panera for us. Like I said,\num valuations are going to depend on who\nthe buyer is. So since we're kind of\nlooking more as an of it as an\ninvestment, other companies look at it\nmore as an actual merger. So\num here again it gives us a little\nrationale for our financial versus\nstrategic position positioning. Sorry\ncannot speak today. Um\nbut we basically we are trying to buy on\nthe standalone value because uh\nstrategic buyers will actually\nincorporate significant synergies. Um I\nthink we're giving this 150% EBIT lift\nsomewhere in here.\nMaybe not. Um but yeah, again basically\nthey value the company way higher than\nwe would just because of that. uh and\nit's something we can't achieve because\nwe're not in that market. Um\nand then yeah, the the range the\nvaluation we're putting on it um still\ngive us a strong IR. Um and like I said,\nwe're expecting that 500 store expansion\nand digital shift. Um\nand then key negotiating point is that\n10% manager rollover, which aligns with\nleadership incentives for the sponsor's\n5-year exit strategy. Yeah. So gives us\nthat big that bid strategy. Um this\ngenerally what we'd recommend it'd be\nthe best in between getting an actual\nchance to buy the company but while not\nover overpaying on it and making sure\nwe're get getting a good IRRa back um\ninvesting well in a company and getting\nsomething back uh reasonably for it. And\nif we're going to end up buying it and\nsomething like say Synergy is taking an\neffect and Panera wants to look at well\nsomething like McDonald's is going to\npay us more money. Um but uh we're still\noffering a fair price. we might be able\nto show that we something like opening\n500 stores and uh\num like going into the digital market um\nis something we can help them um move on\nwith and have like had success doing in\nthe past.\nSo um that's that journal part. I guess\nI forgot to kind of talk about this um\nsensitivity analysis. Um so this shows\nhow our uh evaluation will change uh\ndepending on if we increase whack or\ndecrease whack and then increase or\ndecrease our terminal value. Um so\nimportant thing to note here is that as\nwe increase our whack we end up actually\ndecreasing our valuation. Um that's\nbecause uh in that case we'd be planning\non getting less out or we wouldn't be\nable to get as much out of the company\num and vice versa. And then with our\nterminal growth uh sensitivity or\nterminal growth um rates, if we increase\nit, obviously that's going to make the\ncompany way higher or way more valuable.\nThat just means as the years go on, it's\ngrowing more and more. So if we increase\nthat,\num it tells us our company's more\nvaluable. So just some important things\nto look at if we're looking at uh you\nknow, like I said, our uh our wack is\njust a market representation. And then\nmore importantly, I think our terminal\ngrowth is um like I said that 1.5 I\nthink it was 1.5 I said we were looking\nat uh 2.5. Yeah. So we were originally\nassuming a 2.5 growth. Um\nbut there's obviously a bunch of\ndifferent scenarios it could be in. So\nit's important to look at that and kind\nof get an evaluation from there.\nSo finally, how useful is this uh model?\nUm, I mean, generally it's pretty\nuseful. Like I said, it's important to\nknow when you're running this or or\nyou're doing something like this,\nespecially with a big money in a merger\nlike this. Uh, whether you're a\nfinancial buyer or strategic buyer, uh,\nyou need to know because like I said,\nyou need to know those two things\nspecifically will completely change your\napproach uh to how you evaluate uh value\nthe company and yeah, just how valuable\nit is to you to you. Um what I was going\nto say oh yeah uh and then with those\ntwo you obviously need to know uh what\nis important to calculating it how\nimportant uh earnings before interest\ntax uh and all that is um and then yeah\njust using all this and then what the\nactual company itself Panera uh what\ntheir plans are for the future. So yeah,\nin this case, we would want to look\naround the we would want to be bidding\naround the 12 billion range. Um, and\nthen see where that goes from there.Yeah. So, thank you for listening."
}