{
  "student_name": "Caden Mainville",
  "org_defined_id": "037229244",
  "username": "cmainvil",
  "video_url": "https://youtu.be/NZtXdNW7Fg0",
  "transcript": "0:02\nHello, this is a management 310, the\n0:04\ncapstone project with driver. Let's go\n0:06\nahead and get started. So, the AI\n0:08\napplication that I wanted to make was a\n0:10\npersonalized investment portfolio app\n0:12\nthat um could take any user's input and\n0:15\ncreate a personalized investment\n0:16\nportfolio. So, the problem that I'm\n0:19\nsolving is there are a lot of ignorant\n0:21\ninvestors. There's a lot of people who\n0:22\nsee stuff on social media and they're\n0:24like, \"Oh, maybe I should throw my money\n0:25in that.\" But they don't really know\n0:26\nwhat they're getting themselves into.\n0:28\nAnd a lot of people just throw money\n0:30\ninto ETFs passively, but they don't\n0:32\nreally know what stocks they're buying\n0:34\ninto or how concentrated the ETF might\n0:36\nbe or just the risk associated with it.\n0:39\nUm, and who has this problem? Anyone\n0:41\nreally interested in retiring could have\n0:43\nthis problem because um, with a lot of\n0:45\nretirement accounts, they often involve\n0:48\num, investments. So, it would be nice to\n0:50\nreally see what you're getting into. And\n0:52\nmaybe besides just that retirement\n0:54\naccount, you can do some personalized\n0:56\ninvestments on the side with this tool.\n1:00\nAnd you know, as far as who could use\n1:02\nthis tool, um it could be either\n1:03\nportfolio managers, it could be retail\n1:05\ninvestors, it could be your average Joe,\n1:07\nit could be someone who's really high up\n1:09\nin finance. This tool could really be\n1:11\nbeneficial for anyone deciding um on how\n1:13\nyou want to use it and where you stand\n1:16\nwith your investments.\n1:18\nBut let's go ahead and dive into our\n1:20\nrepresent. We're going to look at our\n1:22\napproach and what tools we may need to\n1:24\nactually complete this.\n1:26\nSo as said earlier, we want to build an\n1:28\nAI app that produces a personalized\n1:30\ninvestment portfolios. So firstly, we're\n1:32\ngoing to be using Google AI studio.\n1:34\nWe're going to start with the core\n1:35\nmodel. We're going to build a super\n1:36\nbasic framework uh prompt just to kind\n1:39\nof get things moving. From there, we're\n1:40\ngoing to tweak all of the um things that\n1:43\nwe need to within the application. From\n1:46\nthere, we're going to create the user\n1:47\ninput page. So, this is going to have\n1:49\nall the nec necessary details to get the\n1:51\nbest recommendation. So, it's going to\n1:53\nhave stuff like age, it's going to have\n1:54\nstuff like your liquid assets, maybe\n1:56\nyour illlquid assets, um it could have\n1:58\nyour retirement goals or other goals and\n2:00\njust basic constraints in general. Um,\n2:02\nI'm going to try to make that as\n2:03\ndetailed as possible just so the\n2:05\nresponse can come out in a very detailed\n2:08\nfashion.\n2:10\nUm, as far as step three, we're then\n2:12\ngoing to create the output page. So,\n2:14\nthis is going to explain the positions\n2:15\nthat it chose and the why behind it.\n2:17\nIt's also going to explain the risks\n2:19\nassociated with it, if there's any\n2:20\nspecific concentrations that we're\n2:22\nfocusing on, and why it fits your\n2:24\nportfolio and your current standing in\n2:25\nyour life. And then uh it's going to\n2:28\nclearly state the assumptions and any\n2:30\nother disclaimers that it needs to um\n2:32\nwith the output page.\n2:35\nNext, uh this is kind of part of the\n2:36\nevolve step, but I put it here. Um I\n2:39\nwanted to create an uh an option for\n2:41\nmore detailed analysis. So, this could\n2:43\nbe more for the finance geeks or\n2:45\nportfolio managers who want to verify\n2:47\nthe AI thought process or even just\n2:49\npeople who want to see um where the AI\n2:51\nis pulling all this information from and\n2:53\nwhy it thinks that way.\n2:56\nUh lastly, um I want to create a option\n2:58\nto see how the portfolio has performed\n3:00\nover time. So, um we're going to need an\n3:02\nAPI key to fetch that market data and I\n3:05\nwant to compare it to either the global\n3:07\nmarket or the US S&P 500. Um, I think\n3:09\nthat this is a great visualization to\n3:11\nsee because after you make your\n3:12\nportfolio, you get an idea of how it's\n3:15\nperformed over time in the past. Um, and\n3:17\nyou can kind of get a visualization to\n3:20\nif you want to invest or not.\n3:23\nBut with all this being said, I'm going\n3:25\nto refine that, sorry, refine the\n3:27\napplication as time moves on and then\n3:29\nalso state all the warnings,\n3:30\ndisclaimers, and provide any possible\n3:32\nassumptions or legal disclaimers along\n3:34\nthe way.\n3:38\nSo, here's the basic input page for our\n3:41\nAI application.\n3:43\nI'm going to run through a few\n3:44\niterations just to kind of get the point\n3:46\nacross. We're going to do conservative\n3:48\nand then um maybe a more aggressive\n3:50\nportfolio. But first, we're going to\n3:52\nstart with this conservative portfolio.\n3:54\nWe're going to say\n3:56\nwe have this guy who got out of college\n3:59\nmaybe 5 years ago. He's started a\n4:01\nfamily. He's starting to get some\n4:02\nassets, some monthly income, and now he\n4:04\nreally wants to try to plan for\n4:05\nretirement. He has a time horizon of\n4:07\nabout 30 35 years with a target amount\n4:10\nof 5 million at the end of retirement.\n4:13\nUh we have some risk and constraints for\n4:14\nhim shown here. He prefers lowcost ETFs.\n4:17\nHe wants to get into some riskier\n4:18\nsatellite positions but wants to feel\n4:20\nsafe with his investments and he also\n4:21\nwants to source maybe fixed income\n4:23\nthrough bonds or dividends. And then we\n4:25\nadded some additional notes uh about the\n4:27\nclient so we can get some more detail.\n4:29\nSo let's go ahead and generate this\n4:31\nportfolio.\n4:35\nAll right. So here is the output that we\n4:37\nget. We get a portfolio recommendation\n4:39\nand we get the uh basic metric snapshot\n4:42\nof his required return and all the other\n4:45\nstuff that we put in in the beginning.\n4:48\nSo first we'll start with the strategic\n4:49\nasset allocation. So this is a cool\n4:51\nvisual to see. you can kind of see how\n4:53\num everything is split up into what he's\n4:55\ngoing to be investing in and then also\n4:57\njust a benchmark comparison um just to\n4:59\nkind of see how this portfolio compares.\n5:03\nBut then it uh provides the\n5:06\num equities or investments to go ahead\n5:09\nand put your money into as shown here\n5:11\nadds up to 100%.\n5:14\nWe can see that for this conservative\n5:16\nportfolio, they recommended uh VTI and\n5:19\nmajority in bonds, which I think is a uh\n5:22\npretty good way to go about it with also\n5:24\nsome um satellite tilts. Um they were\n5:26\nworried about inflation, so maybe get\n5:28\nsome um US Treasury bonds with TIPS and\n5:32\nuh VBR, which is a US small cap value\n5:36\nstock. So, higher risk, higher return\n5:38\nright there. Kind of what we said in the\n5:40\num beginning.\n5:41\nNext, here's the uh portfolio\n5:43\nrecommendation for the retirement goal.\n5:44\nSo, it kind of shows the long-term\n5:46\nfocus, diversification, inflation\n5:48\nprotection. It shows everything that he\n5:50\nwanted to do and how they did it.\n5:54\nSo, it tells us why it fits the\n5:55\nportfolio. Um, which I think is uh great\n5:59\nto see. Kind of gives the uh user a\n6:01\nlittle bit of reassurance. Uh the\n6:03\nalignment with the goals and the risks.\n6:07\nWe can see how it claims that the\n6:08\nportfolio structure acknowledges your\n6:10\ndire for safety by incorporating bonds\n6:12\nbut um while still taking advantage of\n6:14\nyour long-term investment horizon to\n6:15\ngenerate capital appreciation.\n6:18\nTalks about key risk, volatility, and\n6:20\ndraw down scenarios. So, how much they\n6:21\ncould expect to lose maybe in severe\n6:23\nbare markets or recessions,\n6:25\nmaybe some uh alternatives or\n6:27\ntrade-offs. So, um, they talk about some\n6:31\nother conservative portfolios and what\n6:33\nthey could get into, but the chosen\n6:36\nportfolio strikes a balance of these\n6:38\ntwo. So, I think that's really good to\n6:40\nalso see. Talks about historical\n6:42\nbehavior with this portfolio. So, we can\n6:44\nsee that this portfolio specifically has\n6:47\num long\n6:49\nuh sorry, long-term strong growth.\n6:52\nAnd then it talks about tax and imple\n6:54\ntax and implementation notes. Sorry,\n6:56\nimplementation notes.\n7:00\nThis is really helpful because people\n7:02\ndon't want to be spending more money\n7:03\nthan they have to and you kind of get to\n7:07\nsee that from there. Uh it talks about\n7:10\nrisk and when to revisit the plan to\n7:12\nkind of rebalance everything.\n7:15\nAnd then it gives a rational action\n7:17\nchecklist to go about um this portfolio.\n7:20\nAnd of course at the end um we talk\n7:22\nabout disclaimers and considering\n7:24\nworking with a financial adviser before\n7:26\ngoing um about doing this yourself.\n7:31\nNow I think that this is the coolest\n7:33\npart of the AI that I built. So I went\n7:36\nahead and built this historical behavior\n7:39\ntab which basically what it's going to\n7:42\ndo is you can run a back test to see how\n7:44\nthis portfolio has performed um given a\n7:47\nuh start year. So we're going to go\n7:48\nahead and run that.\n7:52\nSo we can see for a more conservative\n7:54\nportfolio we would expect this. We would\n7:56\nkind of expect to see um maybe a\n7:58\nunderperformance of the S&P 500. We can\n8:00\nsee the S&P 500 benchmark and the total\n8:03\nreturn\n8:04\nuh with a max draw down periods.\n8:08\nObviously past performance does not\n8:09\nguarantee future results, but this is\n8:11\nobviously really cool to see how the\n8:13\nportfolio performed over time and maybe\n8:14\nif you want to make any changes if\n8:15\nyou're too conservative.\n8:18\nBut I kind of want to talk about how I\n8:19\nactually did this because it really\n8:20\nwasn't as simple as just putting in the\n8:22\nprompt and having the AI do this. The\n8:24\nway I had to go about it. So the way I\n8:27\nwent about this was building with chat\n8:28\nGPT. This took me probably about 3 to\n8:30\nfour hours last night. But first what we\n8:32\ndid was build a back test with API in\n8:34\nPython. So what it did was use Yahoo\n8:37\nFinance to pull all the historical data.\n8:39\nUm it calculated the portfolio and the\n8:41\nuh benchmark performance and that it\n8:43\nreturned that as a U.JSON file.\n8:47\nThen we had to run the API locally. So\n8:50\nthis was a bit confusing because I had\n8:51\nto use terminal inside my Mac. But um I\n8:54\ngot through that and once it was ran\n8:56\nlocally, we had to then turn that local\n8:59\nAPI into a public one for the internet\n9:02\nto use. Once I did that, um I connected\n9:05\nit to the AI app through um the code as\n9:09\nshown here. And then uh we wired the\n9:11\ngraph to the live data to get this done.\n9:14\nSo definitely took me a while, but I'm\n9:16\nreally happy with how it turned out. So\n9:18\nlet's go ahead and look at another um\n9:20\nexample.\n9:22\nSo for our next potential user, um I\n9:24\nkind of went off some how some of my\n9:27\nfriends are here at Purdue. So I went\n9:29\nwith a client profile of a college\n9:31\nstudent, kind of their liquid assets,\n9:33\nand they are working a minimum wage job\n9:35\nwith uh college debt. We have their uh\n9:38\ntheir retirements with a ambitious\n9:40\ntarget amount and they are very\n9:43\naggressive. They want to stay out of\n9:44\nETFs. They only want equ um equities to\n9:47\nmaximize their potential returns. Client\n9:49\nis a student who still has parents for\n9:50\nfinancial support and uh some other\n9:53\nfactors, but we're going to go ahead and\n9:54\nshow the detailed analysis report uh\n9:57\nwith this one as well.\n10:01\nAll right, here's the output that it\n10:02\nprovided. Um, same thing as before, but\n10:05\nthis time we have some red flags that\n10:07\nraised us uh from our input. So, we can\n10:09\nsee that the student loan debt, and we\n10:11\ncan see that the goal of being\n10:12\nfinancially free by 40 is highly\n10:14\nambitious and very unrealistic, but\n10:17\nwe're going to go ahead and see what it\n10:19\nrecommended. So, we can see that it\n10:21\nrecommends uh this portfolio as shown\n10:23\nhere. Um, this is just a little asset\n10:25\nallocation, but specifically um here are\n10:27\nall the equities that it decided to\n10:28\nchoose.\n10:33\nUm, since I told it to stay out of ETFs,\n10:36\num, it only picked equities and I wanted\n10:38\nthis to be a really risky portfolio. But\n10:41\nnow we're going to go ahead and look at\n10:42\nthe detailed analysis.\n10:44\nSo, it's going to start with a little,\n10:46\num, executive summary of the client and\n10:48\ntheir goals, their risk profile, their\n10:50\nstructure, and what they want. Next,\n10:54\nthey're going to dive into the client\n10:56\nprofile and the constraints. um kind of\n10:58\nsimilar to what was up here uh the goals\n11:00\nand the required risk and returns and\n11:02\nwhat the client needs from that. Then\n11:04\nwe're going to look at the portfolio\n11:06\ndesign um to see how the AI decided to\n11:09\ngo about it go about designing it. And\n11:12\nreading through this, you can see that\n11:14\nin order to maximize this uh this high\n11:17\ngrowth that this client wants, um we\n11:19\nneed to\n11:23\nwe need to build a core sleeve and\n11:25\nsatellite sleeve of about uh 70 to 30.\n11:28\nNext, we're going to look at the return\n11:30\ndrivers and portfolio behavior. So, this\n11:31\nis uh basically the growth metrics.\n11:34\nThen, uh it would dive into this\n11:36\nportfolio versus the benchmark S&P 500\n11:39\nand the differences between those.\n11:42\nNext, it's going to look at the\n11:43\nhistorical behavior um of a portfolio\n11:46\nbuilt like this. Then it's going to look\n11:49\nat the risk, draw down, tracking errors\n11:51\nof the uh possible portfolio. And mostly\n11:55\nit's just all the primary risk of what\n11:57\nyou're getting yourself into.\n12:00\nThen it's going to give you some\n12:01\nalternatives to consider as shown here.\n12:04\nUm, basically it's recommending that we\n12:07\nget into some ETFs, but for this\n12:09\nexample, we're not. Then it's going to\n12:11\nlook at tax and imple implementation\n12:13\nnotes as shown in the last one. Um, same\n12:17\nthing when to revisit the plan. Um,\n12:19\nbasically during like life events or um\n12:23\nas your financial goals evolve and then\n12:26\nends with the ends with the checklist,\n12:29\nwhich I think is very helpful again with\n12:31\nthe disclaimers at the bottom.\n12:35\nSo now let's go ahead and look at the\n12:36\nhistorical behavior part.\n12:38\nWe're going to run the back test for\n12:40\n2010.\n12:43\nAnd we can see that this portfolio\n12:45\ncompared to the S&P 500 would have a\n12:48\nmassive return. Since it is equities\n12:49\nonly and we're looking all the way back\n12:51\nat 2010 and includes stocks like Apple,\n12:53\nNvidia, Microsoft, we can expect this.\n12:56\nSo, it's really cool to see that at the\n12:58\nend here, we would we would have over a\n13:01\n$500,000 difference um just from buying\n13:04\ninto the S&P 500 versus the these\n13:06\nindividual stocks. So, I think that this\n13:09\nwas really cool to see um the difference\n13:11\nbetween the aggressive growth and the\n13:12\nconservative growth.\n13:15\nSo, we're going to look at one last\n13:16\niteration um kind of for a moderate\n13:20\nperson. So, first we looked at\n13:21\nconservative, then we looked at highly\n13:22\naggressive, and now we're going to look\n13:23\nat the moderate. So, this guy would be\n13:25\n25 years old. Here's the financial\n13:27\noverview. Um, this time he wants to have\n13:30\nloads of fixed income through bonds or\n13:31\ndividends. And, uh, client has no\n13:34\ninvesting experience, but wants to start\n13:36\nnow. Um, but he wants to continue growth\n13:38\nand beat the S&P 500 while having fixed\n13:40\nincome through dividends. So, let's go\n13:42\nahead and generate this portfolio. Let's\n13:43\nsee what it spits out.\n13:46\nSo, again, here's the output page that\n13:48\nwe've seen before. Uh this time it\n13:50\nrecommended VTI brought exposure to the\n13:52\nentire US market. Some bonds for fixed\n13:53\nincome\n13:56\nand of course what we've been through\n13:57\nalready. I'm not going to go through all\n13:59\nthis again because it's just the same\n14:00\nstuff except for that client. But we're\n14:03\ngoing to look at the historical behavior\n14:04\nthis time. Let's look at it from 2020.\n14:08\nGoing to run the back test.\n14:10\nAnd we can see that since they do want\n14:12\nsome fixed income, uh this would make\n14:14\nsense because some of their portfolio is\n14:16\num not going to be in equities.\n14:19\nBut let's see how this portfolio\n14:21\nperformed from 2012. Let's run another\n14:24\nback test. And we can see it's uh pretty\n14:26\nsimilar from there. So,\n14:30\nso that's the overall model. Um\n14:36\nuh we tested with some polar opposites.\n14:37\nWe did a high growth profile and then\n14:40\nsomeone who's more conservative, uh a\n14:42\ncollege kid, and then um obviously the\n14:44\nmore moderate person that we just did.\n14:47\nBut just to test with a real user, uh\n14:49\nI'm going to use myself as an example.\n14:51\nSo this is a very rough estimate, but 20\n14:54\nyears old, college student, um I'm in\n14:56\ndebt because of the student loans I\n14:57\nhave. Um very little liquid assets. I'm\n15:00\nlooking to save for retirement. Um I\n15:02\nwant to target amount a little bit more\n15:03\nthan that. So let's go with 6 million.\n15:06\nUm I would say I'm a more aggressive\n15:09\nperson. Um I would buy more in a 20%\n15:12\ndrop. Uh I prefer or prefer lowc cost\n15:14\nETFs like VEO possibly and but I also\n15:17\nlike to be in single equities. I'm going\n15:19\nto say no bonds just because I don't\n15:21\nwant to be in any bonds. I'm a little\n15:23\nbit worried about inflation and maybe\n15:24\nthe overall economic state of the world\n15:26\num from a macro lens. Um and then I'm\n15:28\njust looking for overall long-term\n15:30\ngrowth. So let's see what this portfolio\n15:32\ncan do for me.\n15:35\nAll right. So for what it recommended\n15:38\nfor me again rose some red flags from\n15:41\nthe input that I gave it here's the\n15:44\nallocation that it provided.\n15:46\nSo VTI VA and then also a lot of\n15:49\nsatellite tilts because I wanted to be\n15:51\nan individual individual equities like I\n15:53\ntold it to.\n15:55\nAgain I'm not going to read through all\n15:57\nthis because I've been through it um two\n15:58\ntimes already. But let's go ahead and\n16:01\nlook at the historical behavior maybe\n16:02\nfrom 2010. see how this portfolio has\n16:04\nperformed and we can see that it has\n16:06\nbeat the S&P 500 over time. So\n16:10\nthat is uh the verification part. But as\n16:13\nfar as the evolve went um how can this\n16:15\nscale? I can scale this by adding the\n16:17\nback test um as shown here. But as far\n16:20\nas what's next, um I want to refine this\n16:22\nmodel, maybe to think a little bit\n16:23\ndifferently. Uh maybe to kind of change\n16:25\nthe AI brain. Um because right now it\n16:29\nseparates the input into different\n16:31\ngrowth buckets and that's kind of how it\n16:33\ndetermines the portfolio structure. So\n16:36\nmaybe with some refining of that, um I\n16:39\ncould make some other cool stuff with\n16:41\nthis\n16:44\nto also um scale it.\n16:48\nMaybe I can add a section where the user\n16:52\ncan put previous investments in their\n16:54\ncurrent standings and how much they're\n16:55\nup on those investments possibly. Um\n16:58\nmaybe to see if they want to rebalance\n17:00\ntheir portfolio at all or just see any\n17:03\nrisk associated with their portfolio.\n17:06\nUm but let's go ahead and wrap this up\n17:08\nwith reflect. Well, what did I learn\n17:11\nabout building with AI? Over the course\n17:13\nof semester, uh, I've learned so many\n17:15\nvaluable things about AI and how to\n17:18\nbuild with it. Um, firstly, I've learned\n17:20\nhow to prompt engineer way better than I\n17:22\nknew um in the past. So, being able to\n17:26\nbe super specific with prompts, uh, tell\n17:28\nit exactly what you want it to do. Um,\n17:30\nlearning how to learning how the AI\n17:32\nthinks and interprets information was\n17:34\nalso really important. So, learning that\n17:36\nas a skill, I think was awesome. Uh this\n17:38\nspecifically I learned how to manage\n17:41\nlocal APIs and turn them into public\n17:44\nones and put it into uh this AI to do\n17:46\nthis back test uh which I've never done\n17:48\nbefore. So I think that was awesome. Um\n17:50\nalso using Google AI Studio, there's a\n17:52\nbunch of different features that I've\n17:54\nbeen able to play around with that I\n17:56\nthink are super cool.\n17:59\nUh such as maybe adding like a little\n18:00\nchatbot in the side or other things like\n18:02\nthat.\n18:04\nWorking with AI has also instilled a lot\n18:06\nof perseverance because the AI majority\n18:09\nof the time does not do exactly what you\n18:11\nwant it to do. So there's a lot of trial\n18:14\nand error with it and kind of working\n18:15\nwith it to produce the outcome that you\n18:17\nwant to see.\n18:20\nOverall though, I've grasped such a\n18:21\nbetter understanding on how AI works,\n18:24\nhow it's used in finance. Um, you know,\n18:27\neven just beyond like the mundane code,\n18:29\nI think it's awesome to now that I have\n18:32\nthe ability to use this as a tool. um I\n18:34\ncan apply this to my future internship\n18:35\nin the summer. Um maybe I can show this\n18:37\nto some uh connections that I have\n18:39\nwithin the finance field. Um I think\n18:41\nthat overall this class has been super\n18:43\nhelpful for me and I've taken a lot away\n18:45\nfrom it in a uh positive outlook.\n18:48\nNext time what I do differently, um I\n18:51\nthink I would start a little more\n18:52\nsimple. Uh, I know that I did build the\n18:55\ngeneral core, but I think I was a little\n18:57\nbit too complicated with it. And um,\n19:00\nthere was a lot of just like errors that\n19:02\nthe AI kept running into that I had to\n19:03\nautofix and troubleshoot. So, I think\n19:05\nmaybe sticking to the KISS principle\n19:09\nthat we learned in the beginning of\n19:10\nclass would be super helpful. Um, but\n19:13\notherwise, I believe I hit all points\n19:15\nthat I needed to.\n19:17thank you."
}