{
  "student_name": "None None",
  "org_defined_id": "036201910",
  "username": "debadi",
  "video_url": "",
  "transcript": "Hello, my name is Don Body and this is my intelligent AI financial advisor tool built entirely using OpenAI's GBT4 and live financial data. And so this tool is designed to be go beyond just calculation and actually understands your financial goals, you know, analyze the context and pulls in real-time market data. Gives you personalized investment strategies all in plain English English. So first, let me explain to you how it works. So, I'm going to set up secure API keys over here for OpenAI and Alpha Vantage using\n\nPython's environment variables, which is just going to ensure my keys are kept private and they don't show up in the recording. And then I'm going to define the user's financial profile. In this example, the user is 32 years old. Um, $10,000 to invest and wants to buy a house in 5 years. The tool also considers the risk, tolerance, time horizon, financial goals, and it's just going to pull live prices for selected ETFs and assets like SPY, um, Triple Q, bonds, and gold using the Alpha Vantage\n\nAPI. And all of that context is fed into GBT4 using a carefully engineered prompt that asked the AI to understand the user's goal, recommend the strategy, and break down asset allocation. And finally, provide a clear disclaimer that this is not financial advice. Um, and so as you can see, the AI responds with a full analysis. It explains why certain assets are chosen. It shows the suggested portfolio breakdown, JSON format, and highlights key risks and trade-offs. For example, it recommends a\n\nmiss of equities, bonds, and cash tailored to the user's medium risk tolerance and fiveyear goal. So, I also added a code that parsed the AI's output into a clean table using pandas so users can clearly see the recommended allocation. And this tool is really useful because it doesn't just give you a number, it gives you a strategy and explains why. And it's just going to help users um it's just going to help users make informed decisions by translating financial jargon into something actionable and personable. And\n\nit's going to adapt based on user profile, time, horizon, and market data, which makes it better than a static calculator. And um that's my intelligent finance tool. Understands goals, explains concepts, and recommends strategies with reasoning. Um and one of the key takeaways I got is that AI is not a replacement for financial expertise. It's a tool that helps guide and explain. And built-in guardrail, sanity checks, and clear messaging."
}