{
  "student_name": "None None",
  "org_defined_id": "037200739",
  "username": "hindsj",
  "video_url": "",
  "transcript": "Hello, my name is John and for mini\n0:04\nproject three, uh I'm going to be\n0:07\nshowing you my uh project real quick.\n0:11\nSo, I base it on this stock news\n0:14\nsentiment analyzer. Uh should I worry\n0:17\nabout this headline? Um, and\n0:21\nuh, what I did for this assignment was I\n0:26\ngot on to active pieces and I had um,\n0:31\nused AI to help me figure out how to\n0:34\nbuild this thing. So, couple loops later\n0:36\nand I made it pretty useful. Um,\n0:40\nso I have some sample data. I'll just do\n0:43\na\n0:44\num\n0:47\nuh\n0:50\nsample data. This one looks good. One\n0:54\ntop cryptocurrency to buy before it\n0:56\nsoarses um according to\n1:01\nuh Michael Sailor. And so I'll just uh\n1:11\nwe we have we have that sample there.\n1:14\nAnd so we'll be using that for our\n1:17\nexample. So I made a Google sheet here\n1:20\nand I had uh put in some rows here um\n1:25\nwhich I put in date.\n1:28\nUm,\n1:30\nI can probably just do that. Probably\n1:33\nmakes it look a little cleaner. Um,\n1:35\ndate, headline, sentiment, uh, score,\n1:42\num, summary, and the link. So,\n1:49\nit's pretty self-explanatory.\n1:51\nUm\n1:54\nwe have our score here and uh I have it\n1:58\non a scale of negative 10 to positive\n2:00\n10. Um uh 10 being a very positive uh\n2:06\nmarket movement. Um good news um\n2:09\nnegative 10 being very bad news and then\n2:12\ntowards the middle very neutral just um\n2:16\nvery neutral. And there's a I have a\n2:18\nquick summary just so I can see what I'm\n2:20\nlooking at before I you know click on\n2:22\nthe link and um what time the article is\n2:25\nfrom. So it says date here. So they were\n2:28\nboth from um December 1st of this year.\n2:33\nAnd then it's uh it's in Zulu time. I\n2:36\nalready know how to read that. So um I\n2:38\njust didn't feel like changing it. Um so\n2:41\nthat's uh since we're EST, it's just\n2:43\nminus 500 hours. And uh so this both of\n2:47\nthese happened at around noon on the\n2:50\n1st. So um to showcase it off um we have\n2:55\nit reads the uh the feed, checks it uh\n3:00\nthen it figures out the date and it\n3:02\nit'll it'll do a check if uh if there's\n3:06\na duplicate in there. Um\n3:09\nif if there's no duplicate and stuff, it\n3:12\ndoesn't do anything. Um same with this.\n3:14\nIf there's a duplicate entry, it won't\n3:16\ndo anything. And that's, you know, steps\n3:18\nthree to five. That's what those are\n3:20\ndoing. And then we have step six here.\n3:23\nAnd six uh uh step seven uh is where I\n3:27\nuse the AI model um to\n3:32\nhelp me look at um our article. So, it's\n3:38\njust going to do a JSON so the step\n3:40\nseven can read it and it'll tell me if\n3:43\nit's bullish, bearish or neutral. Um,\n3:45\nand then the score that justifies that\n3:48\nand then um, you know, just a one\n3:51\nsentence uh, explanation of what the the\n3:54\nthing is and why it got that rating. Uh,\n3:56\nand then I just have, you know, it\n3:58\nconnected to my Google sheet. So, I'll\n4:01\ndo a uh, quick test flow to show off one\n4:04\nof those uh, sample\n4:07\num feeds.\n4:11\nSo, I go through\n4:13\ndoes everything fairly quick and just\n4:16\nlike that it's done. Um and I can go\n4:21\nhere and just like that pops in, you\n4:24\nknow, I have my time. So, um 12:15, so\n4:29\njust afternoon on the first um headline.\n4:33\none top cryptocurrency to buy before it\n4:36\nsoarses according to strategist. uh\n4:39\nbullish, very positive outlook. And this\n4:43\narticle, the article headline promotes\n4:46\nbuying a cryptocurrency with incredibly\n4:48\nhigh projected return attributed to\n4:50\nwell-known crypto advocate signaling\n4:52\nextremely positive marks\n4:55\nuh positive market sentiment. And then,\n4:57\nyou know, we have the link here. So, you\n4:59\nknow, I can just um\n5:02\nI can, you know, open the link and uh\n5:05\ncheck it out and, you know, go reading\n5:08\nthis and has a little nice video I can\n5:12\nwatch, but I can read the link from\n5:14\nthere and yeah, so it's pretty simple,\n5:17\nbut it it\n5:19\nit it gives a good look at um you know\n5:22\nwhat I'm looking at. So daytoday I can\n5:25\njust use this and as it goes you know I\n5:29\ncan I can just you know I can just do\n5:32\nthis or I'll you know do another one. Um\n5:35\nit's it's pretty simple. It's just you\n5:37\nknow\n5:38\num uh when when it's published it'll\n5:41\njust read the RSS feed and it'll just\n5:45\nkeep popping um new ones in here. So,\n5:47\nwhenever I check, you know, I can just\n5:52\nquickly look at the $5 bill challenge, a\n5:55\nloweffort way to grow your savings. You\n5:58\nknow, it's just a neutral article. Um,\n6:02\nnothing crazy going on there. The\n6:03\narticle focuses on personal savings\n6:05\nchallenge and does not discuss market\n6:08\nconditions or investment opportunities.\n6:11\nSo, if I'm looking for, you know, an\n6:13\ninvestment opportunity that day, I don't\n6:15\nneed to worry about this article. And\n6:17\nyeah, so it's it's there if I need it.\n6:19\nIf I don't, then oh well, and it'll just\n6:21\nkeep on going. So, thank you for letting\n6:23me showcase my project."
}