{
  "student_name": "None None",
  "org_defined_id": "037663656",
  "username": "pate2233",
  "video_url": "",
  "transcript": "Hey guys, today I'll be doing my project three. So for my defer and define and discover stage, the financial pain point I discovered is that many people including myself struggle to understand how to invest based on their age, income, risk level, and time. Most people know that they should invest but don't understand what strategy fits their situation or why certain choices are risky or safe compared to others. Doing this manually is difficult because it requires understanding risk of the market, the market behavior, diversification of your portfolio, and long-term volatility. My goal is to create a simple AI powered financial advisor that explains investment strategies in plain English based on the user's personal situation. So, the reason I'm doing this is that the simplest and most helpful version of this tool focuses on personalized investment guidance instead of just calculations. So the tool is going to accept inputs such as age, income, investment amount, time, and risk tolerance. And then using those inputs, the AI will then determine what matters most, the possible strategies, the trade-offs between the risks and rewards, and what could go wrong. To implement this, I used N8, and I'll show my workflow in just a bit. Um to verify that the tools work correctly correctly, I tested using realistic user scenarios with different ages, risk levels, and time horizons. I checked for missing or unclear inputs, extremely risky situations, short-term investing with high risk, and overconfident recommendations to improve accuracy and safety. The AI always includes risk warnings. The AI never gives specific talk stock picks, and the AI never promises guaranteed returns. And to evolve on this, I added memory so the AI can remember the user's past information. Risk based warnings such as warning against aggressive investing for short-term horizons or higher risks. A clear structured response format. And also feature improvements could include live market data, scenario comparisons, and goal-based planning such as retirement or buying a home. And then to reflect on this, building this tool helped me understand both how investment decisions work and how AI agents can reason through financial problems. I learned that AI can turn confusing financial decisions into simple explan explanations that normal users can understand. This project showed me that I am no longer just building calculators. I am now building intelligent financial factors, financial tools that think, explain, and adapt. So now going on to my workflow I have three different types of nodes. My first node is what when the chat message gets received. My second node is the AI agent which consists of the open AI chat model a simple memory that can store um chats and then the HTTP request and then my last note is to respond to the um web hook of this. So, uh, the prompt that I gave it is that I'm, let's say I'm 26 years old. I have $4,000 and I want to invest for 6 years with medium risk. And then it summarizes all that. And then it gives me what matters most. So, the time, the risk, and the cash needs. And then it gives me strategies based on that. So, it tells me to do a balanced portfolio. So invest in a mix of stocks, bonds, for example, 60% allocation of stocks and 40% bonds. Or I can do a target date fund or themed EFTs. The trade-offs can be stocks often offer higher returns but are more volatile, meaning the investment value could f fluctuate. Um, and then something that can go wrong is that market downturns can reduce to investment value before the six years are up. And then it even has like a warning saying that this is general educational information. It's not for financial advice. Okay. Thank you."
}