{
  "student_name": "Jacob Youngworth",
  "org_defined_id": "035845246",
  "username": "jyoungwo",
  "email": "",
  "transcript": "Hi everybody, my name is Jacob and today we're going to be going through my session 8 weekly video assignment which covers market efficiency um and the whole chapter with that. Obviously, as always, we're going to be using the driver framework to solve the problem and to work through our analysis. So, let's go ahead and get started. So the problem in general was to investigate market efficiency using the GameStop short squeeze events of 2020 and 2021 as a case study using the facts that we were given as well as some analysis into it to figure out if all of this data was correct. So the first step of this framework was to go in we're going to come back down to the defined and discovery stage. Our critical first step was to verify the statement that we were given and that was that GameStop GameStop stock traded at 4 cents in August of 2020. And that statement is incorrect. The actual adjusted closing price was approximately 26 to 42 times higher. Um anywhere between a dollar and $1.70. Um so 4 cents pretty much would have been a near worthless status. It would have been pretty much worth nothing. Um so when we looked into research, we did some details into Yahoo Finance and everything like that. We realized that that number was incorrect. So for the rest of our analysis, we assumed and we used the actual data between a dollar and $1.70, which made a little bit more sense. Um, and then it also asked us to be able to communicate that with the professor. So, I wrote a little bit of an email right in the middle right here. Um, just describing what I figured out and also why I thought that those values in that 4 cents didn't exactly work. So, with that data corrected and figured out, we also established our core question and our core objective, which is to investigate the GameStop short squeeze of 2020 and 21 as an empirical case study to literally assess the degree and the nature of market efficiency failure. So, we're going to pull in a time period analysis between September 2020 and March of 2021, drawing a conclusion regarding the form of market efficiency that was violated. Obviously, there are three different forms, which we're going to get into in just a second. Our key information, our key resources, market efficiency testing, behavioral finance analysis, that's all right here. And then the data we're going to use, we're going to use Yahoo Finance data as well as market index index data from the S&P 500, as well as a little bit of interest rate calculations here. Simply right here found down at the bottom is a list of the timeline. So in August of 2020, GameStop is near bankruptcy levels. It's not at a level of 4 cents like it was indicated in the problem, but it is definitely pretty low around a dollar to $1.70. Month later, Ryan Cohen acquires a 13% stake in the company. And then in January of 2021, this is really where everything picks up. A Reddit account um and Reddit at Bets drive the price of the stock almost up to $500 per share. And then a little bit later on, congressional hearings go into market manipulation and then everything kind of draws back down to normal. So we're going to really look at how that one little bit and how the outside factors can actually influence the market as a whole. So that's really off from the define and discover stage. Let's jump a little bit into the representation side of things. We're going to start off obviously using the driver framework to drive our analysis. We already established the problem and verified the facts, but our represent stage is really where we're going to formalize the analytical methodology. We're going to analyze our analytical blueprint for how we're going to use our GameStop data to test this efficient market hypothesis. We're going to go into the implement stage. We're going to execute it. We're going to run code and generate results with some graphs. Then we're going to test sign statistical significance, everything like that. Interpret our findings a little bit and then synthesize that all together at the end. If you look right here, I defined out the three forms of efficient market hypothesis. Weak form where you focus solely on past prices using autocorrelation analysis. a semi-strong form where you focus on public news and statistical tea tests and then the strong form which you use all of the information kind of like insider training and you do a qualitative assessment. Our main tool for this whole situation is event study methodology. It allows us to kind of measure the price reactions to use. We're going to actually use the market model, which is a form of the CAPM to use used to establish GameStop's normal expected return or ER based on its normal relationship with the S&P 500. We're going to calculate the abnormal return or AR, which simply is the stock's actual return minus its expected return. And so we're going to figure out the difference in that and then we're going to sum all of those up throughout the year throughout that period to find the cumulative of normal returns or C for this situation. Now with getting a lot of that stuff out of the way, we're going to jump a little bit right into our Google Collab kind of see exactly where we're going from here. So you start it off as always, you want to import all of the necessary data analysis software as always. So I imported those and then I defined my parameters right here. So when I wanted the periods to start and end. And then I ran my data synthesis. So pulling data out from Yahoo Finance, pulling data from the market to kind of figure out how is GameStop working through this period of time and how is everything situated. And then here we have graphical analysis software right here to build it out. So I built this with Gemini. Then when you come down to right here, it's using this real realistic synthesized data to actually ensure the completion to help understand it right here. So the objective of this stage is to utilize the market model which is a simplified application of the capital assets pricing model to establish their normal relationship with the S&P 500. And we focused on two distinct periods throughout this time. An estimation window from March to September of 2020 and then the actual event window from September of 2020 to about March of 2021. So that estimation window was really when we trained the regression model to kind of figure out what is the situation going on right now, what's predictable and then the event window when everything happens. So we can compare it using an ordinary le squares regression model kind of figure out what was going on. And when you are doing this market model regression, you get two main data points, two key metrics. The first one is beta. Beta is simply your systematic risk which we calculated to be.32. Beta simply is your risk relative to the overall market. So a negative beta such as that indicates that the stock historically moves inversely to the market. But since it's super low, it's actually very weak. So for every 1% change in the S&P 500, GameStop's expected to move about 32% in the opposite direction. So based on the data, GameStop didn't behave like the high volatility market trading stock prior to the squeeze, but its price movements were only slightly negative correlated to everything else, which is something we're going to look into in just a little bit. And then the other metric is alpha, which we analyzed and we calculated to be 1.58%. Alpha is simply a stock's risk adjusted performance relative to what the cap capital assets pricing model predicts. So a positive alpha indicates that after controlling for risk, which is beta, GameStop was generating actually slightly higher returns than expected. So when the market's flat, GameStop's going to perform a little bit better positively in comparison to everything else. But it suggests that marginal overperformance is can get risk adjusted back into everything else. And what do all of these mean? calculates into that cumulative abnormal return which really isolates the unexpected results generated during that specific event window that happens. So we calculated the abnormal return daily using some calculations down over here and then subtracted that from the actual return that we got normally. By summing it up we got about 595% which is pretty much statistically unexplainable. physically can't happen in the market. Even if situations happen in the market that are quote unquote drastic, it can't get up to that number. So, it's statistically unexplainable by the fundamental risk and the movement of the market, which means that it's quantifiable evidence of a market anomaly that was caused by the event, which we'll get into. Obviously, the Reddit did have an impact on it, but this helps to prove that right out there. We're going to scroll down. We have a few charts that we also want to talk about, some visualizations to kind of just help us figure out and see everything going on. The first one is the GameStop price history, um, which shows the event spike. You can see right here the unprecedented price appreciation right over here during the event window. Starts off, it stays pretty stagnant throughout the entire time, then strikes all the way up right over here. It's a speculative bubble. It completely detaches from its normal fundamentals from where it normally is. You can see even in those periods right after it starts to drop back down and eventually it's going to drop all the way back down. Your daily returns are right over here. The plot highlights the extreme volatility of that GameStop stock. Especially during the event right over here you can see it drops. It spikes all the way up. Then it drops all the way back down right after it was just a moment in time. It was just a ma moment of an event. That magnitude of these returns exceeds anything observed in the estimation period. right over here. You can see it's up and down, but it's nothing of this magnitude, which shows and for and proves this high cumulative abnormal returns value. And then the last one is that cumulative average abnormal returns chart throughout the event window. So you pull it up, you can see it tracks the accumulation of the unexpected returns. The massive almost vertical trajectory right over here confirms that market failure was pretty much systematic throughout the entire event. The sharp increase right over here helps us to statistically challenge the semi- strong form of the efficient market hypothesis right over here. This isn't something that can physically happen normally. Now after all this data analysis, we wanted to get a little bit into it. Let's get into the statistical significance testing with all the validation. So again, we're going to pull in all of our necessary data analysis tools that we're going to use. And then we perform some t tests and some t calculations to look at significance. We also look at some different tests that we can do. So the first one is a t test on the cumulative abnormal returns which we calculated previously. The test is the essential mechanism for looking at the semi- strong form of that efficient market hypothesis. It's governed by the null hypothesis that the cumulative abnormal returns is equal to zero. Pretty much meaning that the event had no effect on the actual price or the market value of the stock. So the so the empirical evidence calculated from this console provides the proof that we've been looking for forever. The calculated t statistic is extremely high right over here at around 3.71. That measures how many standard deviations it's away from the baseline. You know three standard deviations away means it's 99.9%. In the middle is those three standard deviations. So it's even farther away from that. A value this large simply demonstrates that extreme divergence from what can happen normally in the market then your p value right here is very very small as well pretty much meaning that if we were to deserve a cumulative abnormal return of this magnitude the market doesn't work like that so because that we reject the null hypothesis we understand that this event that happened is not a normal event that happens in the market this really leads us to our primary conclusion throughout the situation the GameStop event is statistically proven a violation of the semi-strong efficient market hypothesis. The returns were generated by publicly available information and can't simply be explained by GameStop's fundamental risk relationship with the market as a whole. We actually ran a different test as well to literally look a little bit more into the weak form of the efficient market hypothesis. It's called the ling box test which challenges that weak form right over there by testing and looking at autocorrelation within abnormal daily returns. The no hypothesis states pretty much that abnormal returns are independent meaning that there's physically no predictability. That statistic is 363.2. That p value is almost zero. It's less than that threshold of 0.05. Meaning we reject that null hypothesis of independence. That means that the abnormal returns exhibit significant autocorrelation demonstrating a violation of that hypothesis. The movement was not random rather everything happened for a reason and it's predictable meaning that it a lot of times is resulting of behavioral forces like trading momentumly or in this case a Reddit post and Reddit threads which pulled everything in together. So overall this validation stage really just helped us to look more detailed into the data that we had and figure out is this the truth and we realized through all of this through some behavioral finance analysis before we jump into the evolve stage that yes all of this is true. Now the evolve stage we wanted to synthesize everything together a little bit come up with some final conclusions as well as just a little bit more information that we'll need. So we ran a lot of the conclusions and the tests one more time to kind of figure out everything as a whole. So this evolved stage is to really connect the proven market failures, the significant cumulative average abnormal return and predictability to the theoretical framework of behavioral finance and what that is. The GameStop event was not an anomaly. As we've said a lot of times, it was the product of human error. We looked at autocorrelation. We looked at confirmation and behavioral bias and everything like that. Let's look a little bit down here at the limits to arbitrage and the persistence of the anomaly right over there. The statistically proven abnormal rate challenges a fundamental principle of the efficient market hypothesis which is the role of arbitrage. The anomaly persisted because investors were prevented from correcting the price. Meaning that they didn't have the power. They didn't even have the ability to do what they were doing. The limits weren't theoretical, but they were actually riskbased and structural. So, it's interesting to look at everything as a whole. When you're looking at some implications for an investment strategy, it actually challenges that efficient market hypothesis. The dual violation proves that systematic inefficiency exists within the market. It also limits the active strategy, the high beta and the extreme volatility. Highlight the danger of exploiting the anomaly. So, you know, from a lot of people who invested a lot of money into GameStop the moment they saw it going up, even after it went up and they could have possibly made their money back, it crashed a few days later, crashed a few weeks later. So even the people that put their money in when it was low, when it crashed back down, it was all the way at the bottom again. So they weren't even making money and a lot of times they were actually losing money into it. And then just some behavioral rationale that predictability is best explained by herd behavior. It's the understanding that people are going to follow the actions and the decisions of others, especially when they don't have all of the information in their hands. They're going to look just a little bit more and just follow the leader pretty much and figure everything out. So let's jump a little bit into this final stage which is the reflection stage where we're going to synthesize everything we had together the efficient market hypothesis as well a little bit of behavioral findings as well. The primary finding in this event study is that dual violation of market efficiency which is shown by two things. It's the statistically significant cumulative abnormal returns which was calculated by the t test and it's the proven predictability proven by the box test. Those two work together to help us build out our full analysis. Right here, you can see that the semi-strong is a failure as well as the weak form is also a failure as well. This dual dual failure creates a fundamental conflict with the assumptions of the efficient market hypothesis which possess that markets are ruled by perfectly rational actors. Here's the empirical data shown by our p values that we have proved that our assumption is perfect of assumption of perfectly rational markets failed during this event. So this event that happened is not something that's normal. And then while this market hypothesis provides a baseline, behavioral finance is super important for explanation. We have all of those down up in the top. And then the failure was caused simply by hurting behavior um and protected by severe limits to arbitrage. people and investors weren't able to put barriers in the right place to continue and limit this case from happening. It just continued to happen and snowballed into what we see today. Then our final takeaway overall is that the GameStop event showed that collective human emotion actually can and it actually did override fundamental economics. So it's something very interesting to look at. It actually created statistically significant and systematic anomalies which we've seen into the market today and created severe stress requiring extraordinary intervention such as trading restrictions implemented by brokers at the market's peak which highlights the need for regulation to account for extreme behavioral risk so that situations like this don't happen again and again. That's all I have for this market efficiency investigation. Looking a little bit into GameStop. I hope I answered all the questions that were asked and everything in relation to the stock. It was really interesting to look at it from a different side of things. I learned about the GameStop situation. I lived through it and saw a little bit of it. Never put any money into it or messed with it, but it was definitely interesting and an important thing to look at. I'm glad we did this whole project. And that's all I have. So thank you.",
  "video_url": "https://youtu.be/2hfA5KCJVYM"
}