{
  "student_name": "Krish Bansal",
  "org_defined_id": "037304971",
  "username": "bansa128",
  "email": "",
  "transcript": "Hello, my name is Krish, and today I'm going to walk through an analysis of the Netflix's Weighted Average Cost of Capital, or WACC, using Python. I've structured this using the DRIVER framework to ensure a rigorous step-by-step approach that integrates financial theory with technology. First, let's start with D, which is Define. Netflix is considering a five billion dollar content investment, and our goal is to identify and determine its current WACC, evaluate how additional debt financing affects it, and assess project-specific versus firm-wide discount rates. To do this, we need Netflix's financial data, which includes a market capitalization of two hundred billion dollars, current debt of thirteen billion dollars, an equity beta of 1.3, and a corporate tax rate of 21%. We also account for market conditions like a 4.5% risk-free rate and a 5.5% market risk premium. Next, for the Research, we focus on key financial concepts. WACC combines the cost of equity and the after-tax cost of debt, weighted by the firm's capital structure. The cost of equity is calculated using the Capital Asset Pricing Model, which accounts for the systematic risk through through beta. The cost of debt is adjusted for taxes because interest payments are deductible, which creates a tax shield that lowers the effective cost of borrowing. Understanding capital structure is critical because the mix of debt and equity directly affects WACC. Finally, WACC serves as a hurdle rate for investment projects, helping Netflix decide whether which content investments are worthwhile. So, the capital so the model is over here which shows the Netflix WACC, Disney WACC, and Amazon WACC for comparison. After gathering and understanding the data, I Validated the approach. I carefully checked the formulas, ensured correct calculation of after-tax cost of debt, and confirmed that CAPM is applied properly for equity. This step was crucial to ensure that my implementation in Python is accurate. After which, I Executed the analysis in Python. First, I calculated Netflix's current WACC using its market value of equity and debt. Then I simulated the impact of issuing three billion dollars in additional debt to fund content, which slightly reduces WACC due to the tax shield benefit. I also calculated the project-specific WACC for US content versus international content using adjusted betas, reflecting the different risk profiles. US content is typically lower risk, so it has a lower hurdle rate, while international content is riskier and requires a high discount rate. Finally, I performed a sensitivity analysis to visualize how WACC changes as debt levels increase, showing trade-off between tax benefits and financial risk. Once the calculations were done, I Reflected on the results. Netflix's current WACC is approximately 11.2% higher than Disney's 8.2% and Amazon's 9.5%, largely due to a higher equity beta and lower leverage. Adding three billion dollars in debt reduces WACC slightly to about 11.1%, demonstrating the tax shield effect. Comparing project-specific WACC, US content has a lower hurdle rate than international content, indicating we should apply different discount rates based on project risk. Our recommendation is that Netflix can moderately increase leverage to fund content, balancing the benefits of the tax shield against the financial risks of higher debt, and should use project-specific WACC when evaluating new content investments. Going back to the code and looking at the analysis and evaluation which my code has produced, you can see how the current WACC is 11.22%. Then the WACC after 3 billion dollars debt issuance is 11.13%, which is lower. The project-specific WACC for the US content is 10.11%. The project-specific WACC for the international content is 12.14%. And the industry WACC, which are for companies like Disney and Amazon, is 8.20% and 9.50% respectively. For the evaluation part, the code has said that an additional three billion dollar debt issuance slightly reduces WACC due to tax shield benefits. Netflix's WACC is higher than Disney and Amazon due to the higher equity beta and lower leverage, which I talked about earlier, and the project-specific WACC indicates international content is riskier and requires a higher discount rate than US content. This is because of the higher WACC. Then the code has also produced a recommendation, which says Netflix can moderately increase debt to reduce WACC while maintaining credit rating. Use project-specific WACC as hurdle rates for content investments. So for US content, lower beta gives lower WACC, which gives lower hurdle rates, and for international, a higher beta gives higher WACC, which gives higher hurdle rates. And this is the graph which shows the leverage to balance tax benefits and financial risks. Moving ahead, I thoroughly understood the whole financial analysis for this assignment, and the DRIVER framework helped me present it better, and the Python code helped me analyze the whole situation much better which I couldn't have had done manually, or I might have made some errors. Thank you so much.",
  "video_url": "https://youtu.be/S7tPS94Tlnk"
}