{
  "student_name": "None None",
  "org_defined_id": "037229244",
  "username": "cmainvil",
  "video_url": "",
  "transcript": "0:01\nHello, this is my management 310 mini\n0:04\nproject 3. Let's go ahead and get\n0:05\nstarted. So, we're tasked with building\n0:07\na more advanced AI finance tool using a\n0:10\nplatform of our choice. It should\n0:12\nanalyze, explain or advise on financial\n0:14\ndecisions using AI as the brain. So,\n0:16\nwhat I wanted to do was build an\n0:18\ninvestment analysis model uh beyond\n0:21\nnumbers. So this model will roughly\n0:23\ninclude a way to analyze assets, also a\n0:25\nway to rate your portfolio and see any\n0:28\nhidden risk involved and then also\n0:30\nperform a scenario lab to test the\n0:33\nportfolio durability during certain\n0:35\neconomic events.\n0:38\nBut who would this even be used by\n0:40\nbefore we make it? Well, this could be\n0:42\nused by retail investors who want to get\n0:44\na real realistic analysis um of their\n0:47\ninvestment beyond numbers that's easy to\n0:48\ninterpret and also get an idea of where\n0:50\ntheir portfolio sits based on the\n0:52\ndiversification and the AI's\n0:54\ninterpretation of the current\n0:56\ninvestments at hand.\n0:59\nSo, what's going to make this AI a\n1:00\nlittle different from other ones that\n1:01\nwe've made in the past? Well, this AI is\n1:04\ngoing to have better interpretation of\n1:07\nthe natural language input. So you can\n1:09\nreally input it in any way you want and\n1:11\nit's going to be able to interpret that.\n1:13\nUh it's going to be able to um have some\n1:15\ncontextual analysis.\n1:17\nBasically what that means is analysis uh\n1:19\ncontextualized.\n1:21\nSo it should be able to explain\n1:23\neverything that you need to have it\n1:24\nexplain and um it should be pretty clear\n1:27\nand then it should also have some good\n1:28\ncustomization options to um to better\n1:32\ngive you a more accurate answer of where\n1:34\nyour portfolio sits. So let's go ahead\n1:36\nand dive into the represent stage.\n1:39\nSo before we build this is our\n1:41\nanalytical approach. So we're going to\n1:43\nbuild an invest investment analysis AI\n1:45\npowered app that analyzes investment\n1:46\nopportunities beyond numbers. First\n1:48\nwe're going to build the asset analyzer.\n1:50\nThis is going to give a reality check\n1:52\nwhen researching an investment. So it's\n1:54\ngoing to be able to interpret multiple\n1:56\ntext translations to give you um what\n1:59\nyou need to know about that asset and\n2:01\nwhere it sits currently. And then it's\n2:02\ngoing to include an analysis, a thesis,\n2:04\nand the reality check part. I also want\n2:07\nit to include like some key risk or some\n2:09\nred flags. Um, just so people are aware\n2:13\nof them.\n2:14\nNext, I want to build the portfolio\n2:16\nsnapshot. So, first, this is going to\n2:18\nallow for a visual allocation of uh the\n2:21\nweight. So, kind of like how Robin Hood\n2:24\ndoes it uh with the little weight\n2:26\nbubbles. That's kind of how I was\n2:27\nthinking of setting it up. But\n2:29\nspecifically besides the visualization,\n2:31\nwhat this section would do was criticize\n2:34\nthe portfolio with some pros and cons.\n2:36\nIt would uncover the hidden portfolio\n2:38\nrisk. Uh maybe we're too concentrated in\n2:40\none area or we're not diversified\n2:42\nenough. And then it's also going to tell\n2:44\nwhere the portfolio is lacking with a\n2:46\ndiversification score.\n2:49\nLastly, we're going to build a scenario\n2:50\nlab. So we're going to be able to type\n2:52\nin any economic scenario um to the\n2:55\nportfolio or or individual investment.\n2:58\nIt's going to provide a practical what\n2:59\nif analysis based on historical data.\n3:02\nAnd then it's also going to show how\n3:03\nsensitive the investment or portfolio is\n3:05\nto certain events. And then while we're\n3:07\ndoing this, we're going to define our\n3:09\nassumptions, limitations, and\n3:10\ndisclaimers throughout um mostly around\n3:12\nAI and financial investment advice.\n3:17\nSo, as far as version one goes for my\n3:20\nmodel, uh it's just the asset analyzer\n3:22\npart. Right now, I'm having a hard time\n3:24\ntrying to figure out the version history\n3:26\nuh to bring it back to just the analysis\n3:29\nor asset analyzer part. But how I went\n3:31\nabout this was first I did the asset\n3:33\nanalyzer, then for version two to\n3:35\nupgrade it, I did the portfolio\n3:36\nsnapshot, and then for version three, I\n3:38\nadded the scenario lab.\n3:41\nBut before I dive into what it does,\n3:43\nthis is the prompt that I went about.\n3:45\nUm, I told it that it's a AI investment\n3:47\nthesis builder and told it its job and\n3:50\nwhat it's supposed to do, the core\n3:51\nprinciples to follow. And, uh, this is\n3:54\nbasically just the bare bones of what I\n3:57\nwanted it to do and what it would do.\n4:01\nUh, so then after it put out that, I\n4:04\nadded some additional instructions to\n4:06\nbetter um, better make this. And a lot\n4:10\nof it was just me going back and forth\n4:12\nwith the AI um trying to figure out\n4:16\num how to best build it and make it\n4:19\nclear enough for the user to understand.\n4:22\nBut to dive into version one, here's\n4:24\nwhat it does. So it's a instant AI\n4:27\npowered reality check for any public\n4:28\nasset. You can type in any uh timber\n4:31\nsickle or ticker symbol or asset name.\n4:35\nDown here it tells you what it does. So,\n4:36\nfilters out hype, focuses on business\n4:38\nfundamentals, gives a structured thesis\n4:41\nand a reality check, and down here it\n4:43\nhas the AI disclosure, uh, just for some\n4:45\nguard rails and some disclaimers, uh, so\n4:47\npeople aren't\n4:50\nusing this tool in the wrong way. So,\n4:53\nlet's go ahead and type in something\n4:55\nlike Tesla.\n4:57\nAnd for our risk tolerance, we'll say we\n5:01\nare high.\n5:03\nuh time. Let's say we want to invest for\n5:05\n10 years.\n5:07\nWe're going to put this in our Roth IRA.\n5:11\nOur primary goal, we'll just say we are\n5:14\nwe'll say it's for fun this time instead\n5:16\nof saving for retirement. Uh then our\n5:19\ncurrent portfolio, we'll say we just\n5:21\nhave 100% in spy.\n5:25\nSo then it's going to go ahead and build\n5:27\nthe thesis. So firstly, it's going to\n5:30\ntell you what the company like does\n5:34\nand what's involved with buying the\n5:36\ncompany. So as you can see here, the\n5:38\nvaluation risk and competitive uh\n5:40\npressures. Right here we have a cool\n5:42\nvisualization from Trading View their\n5:44\nAPI.\n5:47\nSo this really shows the last few months\n5:50\nor sorry the last day.\n5:53\nBut using this chart, um, investors can\n5:55\nobviously where it's sitting and see if\n5:57\nit's changed since the last time they\n5:59\nthought about buying it. And then\n6:01\nanother cool feature that I added was\n6:02\ncomparing it to the S&P 500.\n6:06\nSo what this chart actually is is a\n6:08\nrelative performance chart. It's\n6:09\nbasically just Tesla divided by SPY. So\n6:13\nwhen the line goes up, Tesla is\n6:15\noutperforming the S&P 500. When the line\n6:17\ngoes down, the S&P 500 is outperforming\n6:20\nTesla. And when it's flat, um, they're\n6:23\nroughly synced together. So, it's a cool\n6:25\ncool visualization to see right there.\n6:28\nBut let's get back into what the bot\n6:30\nactually does. So, it gives a little\n6:31\nbusiness snapshot. Uh, tells you what\n6:33\nthe company is actually doing and how\n6:35\nthey make money and where they sit\n6:36\ninside the industry. Now, we look at\n6:39\nsome upside drivers, why this investment\n6:41\nmight work. Tells you what the company's\n6:44\ndoing again and why it's important and\n6:46\nhow to monitor it. So, that's really\n6:48\ncool to see.\n6:50\nThen we got some risks that it's going\n6:51\nto show you and the impact on those\n6:53\nrisks and how it might affect the\n6:56\ncompany. So we can see that intense\n6:58\ncompetition and margin pressure might\n7:00\naffect the valuation and the execution\n7:02\nrisk for future ventures. So\n7:06\nso it gives a pretty cool uh detailed\n7:09\nlist of that and then it gives a little\n7:11\nsanity check right here. So, it's saying\n7:13\nthat Tesla is currently more expensive\n7:16\nuh trading at a high PE.\n7:19\nAnd as I told it before to only give\n7:22\ninformation, don't give advice and don't\n7:24\nuh try to lean one way or the other. And\n7:26\nthat's obviously what it's doing. Just\n7:28\ntelling you what it sees, but it's not\n7:30\ntelling you whether it's a buy or a\n7:31\nsell. And then as far as fit with the\n7:34\nuser, um, since we put in the little\n7:37\ncustomization tab, uh, this would be a\n7:41\ncool satellite growth idea for our\n7:43\nspeculative position. So that's what\n7:45\nit's telling us. And, um, gives us a\n7:47\nlittle bit more about our portfolio.\n7:50\nAnd then it gives us some open-ended\n7:52\nquestions to think about, um, outside of\n7:54\nthe AI and also some red flags that's\n7:57\ncurrently going on.\n8:00\nAnd then as far as the portfolio fit,\n8:02\nthis is kind of how you would size it if\n8:04\nyou wanted to put it in your portfolio.\n8:06\nIt's just a recommendation um you can\n8:10\nsee it's just a generic example, not\n8:12\nwhat you should actually do. And then\n8:14\ndown here, a little disclaimer uh that\n8:16\nit's not investment advice\n8:19\nalong with another AI disclaimer.\n8:21\nSo now let's move on to version two.\n8:26\nUh so the version two code started with\n8:28\nhere um told it what I wanted it to do\n8:30\nand what I wanted to see from it.\n8:34\nThe portfolio overview,\n8:36\nthe bubble composition that I was\n8:38\ntalking about earlier.\n8:40\nUh the diversification metrics\n8:46\nuh and then a risk map that I wanted it\n8:48\nto produce and then obviously just a\n8:50\nquick summary.\n8:53\nSo for version two, it is this asset\n8:55\nanalyzer plus this portfolio snapshot.\n8:58\nSo I'm going to go ahead and fill this\n9:00\npart out. So what's cool about this is\n9:02\nyou don't really have to put spy 50%\n9:06\nblah blah blah. You can put I have\n9:08\n$10,000 in Apple, $5,000 in Microsoft,\n9:10\nor I have 100 shares in Nvidia, 50\n9:12\nshares AMD. So there's a lot of\n9:15\ndifferent ways to frame it. You really\n9:16\ncan't get it wrong. You can say it\n9:18\nhowever you want to, and it's still\n9:20\ngoing to give the same answer.\n9:22\nSo, for this example, we'll go ahead and\n9:24\nuse the uh dollar amount values.\n9:28\nSo, I went ahead and put $10,000 of\n9:30\nvideo, $5,000 in Johnson and Johnson.\n9:33\nSo, here's what it's given us. The\n9:35\nportfolio composition tells us our\n9:37\nlargest pos uh percentage, our top three\n9:40\nconcentrations, our core weight, uh\n9:42\nwhere it's sitting, and then the div\n9:44\ndiversification score.\n9:46\nSo, it gives you a quick overview of how\n9:48\nyour portfolio looks\n9:50\nand then a little um composition of what\n9:54\neach investment position you have, where\n9:57\nit fits inside your portfolio. So, we\n9:59\nwould see Nvidia is high growth and more\n10:01\nof like a satellite position, but\n10:03\nJohnson and Johnson is a defensive\n10:05\nposition and um more of safety.\n10:09\nAnd then as far as it goes for the uh\n10:11\ndiversification and concentration\n10:13\nmetrics, the AI interprets uh the\n10:16\nportfolio and from there it gives a\n10:19\ndiversification score based on how many\n10:21\nholdings you have and how diversified it\n10:24\nis in the market including the global\n10:25\nmarket. So I thought that was pretty\n10:27\ncool. And um says here diversification\n10:31\nscore is very low uh dominant in one\n10:33\nposition\n10:35\nand we only have two stocks. So, here's\n10:37\na little risk map of what's wrong with\n10:40\nour portfolio, what could go wrong. So,\n10:42\nreally cool to see there.\n10:45\nI think that this part turned out really\n10:46\nwell. Um, again, disclaimers shown down\n10:50\nhere, but let's go ahead and move on to\n10:54\nversion three.\n10:56\nSo, for the prompt for the scenario lab,\n10:58\nit started as shown here.\n11:01\nUm, I told it what I wanted it to do and\n11:03\nhow to do it. I won't read read through\n11:05\nall of it because I'm basically going to\n11:06\nshow you what it does here in a second.\n11:10\nBut here's what it does. So we can\n11:11\ndescribe any scenario basically and\n11:14\ndefine or define the exposure. So we can\n11:16\njust do a singular asset or our entire\n11:19\nportfolio. So I thought that was also\n11:20\nreally cool to do. Down here it shows\n11:23\nyou what you're getting yourself into\n11:24\nbefore you input the information. Let's\n11:27\ngo ahead and type in something.\n11:31\nSo, we're going to go ahead and do a\n11:33\nscenario that the AI bubble burst. Uh,\n11:35\nwe have 50% of VO, 25% of Nvidia, and a\n11:38\ndefensive position of XOV and 25%.\n11:41\nSo, when we run this stress stress test,\n11:44\ntells us our information up here and our\n11:47\nprojected impact and how it might in\n11:49\naffect our portfolio. So, we can see\n11:51\nthat the bubble bursting would bring our\n11:54\nportfolio down a significant amount.\n11:57\nkind of tells us why in this bottom line\n12:00\nright here and gives us a small little\n12:02\nanalysis of how everything is affected\n12:04\nby it.\n12:06\nSo, this is just one of those things\n12:08\nthat you can just kind of get a rough\n12:11\nestim uh estimate\n12:14\nuh about your portfolio and to see if\n12:17\nyou should make any changes. Maybe add\n12:18\nanother defensive position or a hedge\n12:21\nposition or something along those lines.\n12:24\nNow, to do a quick verification for this\n12:27\nprojected impact, um, if you were to\n12:29\nlook up if the AI bubble burst, what\n12:31\nwould happen to the overall economy, you\n12:33\nwould get that the S&P 500 could drop\n12:35\naround 30% according to these sources\n12:37\nshown here.\n12:39\nSo, I would say that this is a pretty\n12:42\ngood indicator of what could happen\n12:45\ngiven scenarios.\n12:48\nBut that is the final AI model thesis\n12:51\nbot that I made.\n12:53\nUh it mainly includes external data\n12:55\nintegration via APIs uh memory state\n12:58\nthat can influence recommendations as\n13:00\nshown here and then also multiple sanity\n13:02\nchecks and disclaimers.\n13:05\nBut before I close out this video, I\n13:07\nwanted to reflect on a few questions.\n13:10\nFirstly, how does AI change the user\n13:12\nexperience? I would say AI changes the\n13:14\nuser experience in a positive way. Um,\n13:17\nit allows for a lot of convenience and\n13:19\nit makes things easier to understand in\n13:21\na lot of ways than another human\n13:22\nexplaining it. It's also really good\n13:25\njust for brainstorming in general. Um,\n13:28\neven just talking with AI, you might get\n13:31\nan idea just from looking at a risk\n13:33\nfactor or something from this website\n13:36\nand maybe you'll look at another\n13:38\ninvestment. So, I think AI using it as a\n13:41\ntool and\n13:43\nusing it that way can definitely benefit\n13:45\nthe user. um\n13:48\nin such such a way. But moving on to the\n13:50\nnext question, what's different about\n13:52\nbuilding with AI as a component?\n13:55\nUm I would say just I mean the main\n13:57\ndifference is just the API keys and\n13:59\nwhere the AI is actually used. Uh\n14:02\nbeforehand I was just using AI all the\n14:04\ntime just to kind of do stuff. But now\n14:06\nyou know you have to copy and paste AI\n14:08\nthe API keys for instance like the\n14:10\ntrading view one to get the uh correct\n14:12\ngraph in there. But kind of like I said\n14:15\nbefore, it makes everything a whole lot\n14:17\neasier uh once AI is actually integrated\n14:19\ninto whatever you're doing. Next\n14:22\nquestion. Uh what was hard about\n14:24\nfinancial prompt engineering?\n14:27\nI would say just general clarity with\n14:29\nthe AI. Um you could create a very\n14:31\nspecific prompt, but it could still spit\n14:33\nout something that you didn't want it to\n14:35\ndo. So, I think finding the balance\n14:37\nbetween being specific, but then also\n14:40\nnot overly specific to where the AI gets\n14:43\nconfused and spits out something that\n14:45\nwasn't what you even imagined. U, I\n14:47\nthink finding that sweet spot is most\n14:49\nimportant when you're financial prompt\n14:51\nengineering. Uh something that I find\n14:53\nhelpful um I put my prompt into uh chat\n14:57\nGPT and I have it edit it or I have it\n15:01\nadd-on and basically it can organize it\n15:05\nand make the prompt better in multiple\n15:07\nways. So I think that's also a great\n15:09\ngreat way\n15:13\nto uh prompt engineer. So what moving on\n15:16\nto the next question what ethical\n15:18\nconsiderations did you face?\n15:20\nUm, I think the main one was just the\n15:23\ndisclaimers for the investment uh\n15:26\nfinancial advice and the uh the AI\n15:29\ndisclaimers.\n15:31\nUh, obviously, you know, you have a\n15:33\nchoice as a person to put those or not,\n15:35\nand\n15:37\nyou should probably put them majority of\n15:39\nthe time because you don't want to be\n15:40\nheld liable for someone else's uh\n15:41\nfinancial mistakes.\n15:43\nUm, another ethical consideration to put\n15:46\ninto play was uh cost with the APIs.\n15:49\nObviously, they're super cheap for this\n15:50\nassignment, but in the future, if I am\n15:53\nbuilding a another AI app bot like this,\n15:56\num it might be important to consider\n15:58\ncost uh in that way.\n16:03\nLast question, would you trust your tool\n16:04\nwith your own money? I would say yes. Um\n16:07\nthis would be a very good tool uh if I\n16:10\njust wanted a good overview of any\n16:12\npublic asset.\n16:14\nI also really like the scenario lab. Um,\n16:17\nI like to see how certain catalyst or\n16:19\neconomic events can affect my portfolio,\n16:22\nnot just one uh investment in\n16:24\nparticular.\n16:27\nAnd then also just what I did with a\n16:28\nportfolio snapshot and generating a\n16:31\ndiversification score and seeing the\n16:32\nrisk. Um, I think uncovering those are\n16:35\nreally important even for my own\n16:36\nportfolio because even plugging in my\n16:38\nown portfolio into here, um, I uncovered\n16:40\nsome risk that I wasn't even aware\n16:42\nabout. So yes, I would use this tool\n16:44\nwith my own money and uh I do trust it.\n16:48\nBut that wraps up my walk through for\n16:50\nthe Mini Project 3. Thank you."
}