{
  "student_name": "Gurpreet Multani",
  "org_defined_id": "036767359",
  "username": "gmultan",
  "video_url": "https://www.youtube.com/watch?v=0WDDR1Q0sjE",
  "transcript": "So here we have session 11 where the assignment is to evaluate Apple's hypothetical $90 billion share repurchase using the driver method and we have to act as independent analysts who must determine whether the buyback creates value relative to alternative uses of cash while balancing stakeholders incentives. So here we have the driver method setup define discover. So we uh included all of the capital allocations, the liquidity, market contacts, balance sheet proposal and alternatives all over here. As you can see the share price is here, the P ratios here, the dividend yield of 0.5%. shares outstanding, the debt, buyback budget, the special dividend, the backsh, the shares of the CEO,\n\nthe\n\nemployee strike prices, and then the retail investor's average shares over here.\n\nover here. See, it's uh marks it down just like this right here. Then we have the represent plan, the model plan. It'll this model over here. It tells us the purpose of everything, what we're going to do, what the plan is, what the inputs are given by the assignment. As you can see right here, as I provided in the driver methods, now in the represent method, this is what the outputs will calculate. the stakeholders financial outcomes, the ownership concentration changes, ROIC implications, value creation versus value transfer, and then the scenarios to compare the buyback, the special dividend, the debt reduction, the ARVR acquisition, the R&D expansion for the $90 billion.\n\nNow we have the I section of the driver method which is to implement the model. So over here this is where the work becomes computational and we followed the driver method. So we're at I we're going to start with one the buyback ratio calculation. So it's going to calculate um all the functions to get the shares bought the new shares the EPS before and after the EPS increasing percentages the market caps before and after as well. So with this these answers over here explained right here how we got the outcome the shares bought with the $90 billion budget Apple can repurchase approximately 486.5 million of its shares that reduces the total number of shares available on the market. The new shares outstanding is 15.01 billion. So it decreased from 15.5 billion as you can see right here the shares outstanding. So that decreased a little bit too. The earnings per share before and after. Before it was calculated to 6.45 as you can see right here. Now it increased by 3.2% 3.2 24% to 6.66. The market capitalization before was 2.867 867 trillion and after the buyback it reduced to 2.777 trillion that reflected the reduction in shares outstanding assuming the share price would remain constant for the calculation then we go to the stakeholder outcome table outcome analysis and it provides a table over here too and then I have more with tables here but we'll go to this right here and Uh over here it calculates the Birkshshire the stakeholders buybacks for the CEO the investors the employees the bond holders in the Birkshshire hallways so the Birkshshire equities value became 1.72 172 billion CEO became 555 million retail investors became uh 21 cents the gain gained 21 cents per share. The employee interested value was $15. And then the bond holder leverage was a slight increase as well than it was from the original one. As you can see,\n\nokay, I can't find it. But that increased too as well.\n\nAnd then over here we have the value creation versus the value transfer analysis which is another table over here.\n\nAnd then here it asks do these scenarios create true economic value? Do they transfer value among stakeholders? And are they government are they agency or governance issues? So, it tells you for the buyback. Let's see if we can expand this table over here.\n\nScreen. Okay, I guess that's not working. But but uh the buyback is definitely a value transfer and yes, it transfers value among stakeholders and is a high management compensated.\n\nThe dividend and debt reduction are low. Dividend also transfer value among the stakeholders but does not create true economic value. Pure transfer of cash to investors. Debt reduction. Yes, it lowers the risk, improves credit. No, reduces overall risk for all stakeholders.\n\nAnd then it's low also for agency or governance issues because it promotes financial discipline.\n\nAcquisition R&D they both say yes. Transfer value among stakeholders yes. Agency or governance issues are high for acquisitions because the risk of empire building misaligned income. I think that's what it is. I don't know why it's not opening but then the last one R&D is medium because it requires strong oversight of R&D returns. The next we have signaling, market perception and capital allocation analysis. So here's another table over here. Buyback signals under valuation, dividend signals stability, debt reduction signals discipline, acquisition signals growth, ambition and expansion, R&D signals innovation, investment. You can see that most the the first three are positive. The third one is the fourth one 0 one two three four. So the fourth one is risky but appealing. And then the last one R&D is long-term focus investors favor that scenario. The capital allocation discipline it goes from weak to neutral to strong risk dependent because acquisition when is already risky. So that whole thing is just risky, but some people like to be risky, so they might just go for that. And the last one is strong if R&D is effectively monitor. So you got to know what you're doing with that as well. Then we got technical requirements confirming model coverage.\n\nYou see right here. So these are all the requirements and yes, they've all been completed as well. And then we have over here we have\n\nthe the special dividend scenarios again over here the new cash the Birkshshire payout the CEO payout the retail payout total dividends pay. So this right here just calculates all the payouts as well at the impact of $6 per share special dividend. So this is how much they would all get after each payout.\n\nAnd then we have the debt reduction scenario as well. This is I assume this is the\n\nOkay. Yeah. So this is all the part of the e the uh see oh no we're still in the implements. So we're still implementing over here dr iv.\n\nYeah we're still implementing all that. And then we go to validation right here. Sorry I just had to make sure. But yeah, so there's a couple more tables that it calculated for the R&D expansion scenario, the AI VR acquisition scenario. So, okay. So, we'll start back over here for the special dividend scenario. I just had to make sure. So, the total payout was $93 billion. The new cash dropped to $72 billion. Birkshshire would get 5.58 billion. The CEO would get paid $18 million. and the retail holder gets $600. Now we're calculating the debt reduction scenario and then the debt would drop from 110 billion to 20 billion and then the leverage would go from 0.0383 to 070. You round this up. So it's the power 007 and this is the largest reduction red largest risk reducing scenario right here. Then we have\n\nthe AI and VR acquisition scenario where when we assume the $10 billion the new earning the ROIC equals to 11.11%.\n\nand the R&D expansion scenario\n\nit would be a high strategic fit high potential financial cash flow growth and a long-term innovation benefits so you tell your strategic fit is high aligns with long-term innovation strategy and market leadership potential FCF growth high expected to drive future product development increasing long-term financial cash flow significantly after initial investment phase And then here we have the scenario comparison tables for all the things I just mentioned into one table right here.\n\nThe cash remaining\n\nthe APS changed the ROIC strategic fits.\n\nNo. Yeah. right here. It just talks about everything that I just mentioned just now.\n\nAnd now we have also insights. This company has a clear trade-off between immediately improving financial metrics and investing in future growth. The choice should align with the company's overarching strategic goals and risk tolerance. So over here now we have the V part D. We went through DR and I implement now we're doing the validating the model one. It says basic validation checks. Buyback reduces share count. Yes. EPS increases after buyback. Yes. Dividend is affordable with cash on hand. Yes. Debt reduction does not make the debt negative. Yes. Now validating the stakeholder outputs. Berg shar output exists. CEO value calculated. So vector calculated everything's been included and calculated. Yes. Third validating for the scenario comparison table.\n\nBuyback scenario is present. The dividend scenario is present. Debt reduction is present. Acquisition scenario R&D scenario. All the scenarios are present. It just says that the owner college ownership column is invalid. Then the model consistency and validation larger buyback increases EPS further. True. And the last one overall model validation summary basic checks stakeholder outputs valid scenario table valid sensitivity behavior valid all that's listed over here.\n\nThen the next E we have evolving the model. And over here we explored alternative uh assumptions as well. So when you go over here to the under strategic under different strategies. So now it'll give you strategic priorities then the best options and the reasons why long-term short-term risk reduction. So short-term returns you would do a buyback because it maximizes APS and the shareholder output. Long-term innovation, you will do the acquisition of the R&D because it expands future earning potentials. And then risk reduction, you'll do debt reduction because it strengthens balance sheet and lowers volatility as well. Over here though, oh, I forgot to mention this. The very buyback size tested buybacks. It tested uh buyback sizes of 30 billion, 60 billion, 90 billion, 120 billion and then the EPS rises proportionally as you can see over here confirming the model behaves logically.\n\nThen you have the agency and governments under different assumptions. You have the scenarios listed here, the risk amounts and the government government strengths needed. So it tell you some need minimal, some need moderate, some needs strong. Three of them need strong. As you can see, uh the ones that are high in agency risk, they need more governance strength as well. The ones with low risk, they moderate to minimal. governance strength. And now we over here we do the uh we have the plot sensitivity chart right here and then we have the how market signal changes with different conditions. So now if we have high condition interest rates, strongest signal of debt reduction, low growth environment, strongest signal would be dividend or buyback, tech expansion cycle would be acquisition R&D. Over here they also have comparing strategic outcomes. If Apple prior prioritizing growth, risk reduction, shareholder output,\n\nsee the table right here as you see what it is. That's how it is. growth focus, risk reduction, shareholder payout, payout gives you the best scenarios and rationalizes rationalizes why those are the best scenarios.\n\nAnd then four for the evolve is just made a summary of how the models adapt to new assumptions. When buyback size changes, the model adapts depending on strategic priority. So stability choose for if it's stability, you choose debt reduction. If it's growth orientated, you choose acquisition or R&D. They're optimal. And if it's short-term invested, returns are prioritized and the buyback wins. This shows that no single scenario is universally best as it depends on the Apple strategic objectives and stakeholders incentives. Then we're at the last one. are to reflect the final stage and this last stage documented what we learned as the work unfolded. It's basically the uh the EPS is not value creation. Sometimes it's just arithmetic. Stakeholder incentives matter especially agency risk. Um you see it provides more debt reduction is the safest long-term move as well.\n\nAnd then um acquisitions and R&D have the highest upside with the highest governance risk right here. You see the governance risk over here. And then uh so basically driver forced me into a structured approach as well. Let's see if we could find that. Find that real quick. But the structured approach was that um I guess this is right here was that they have to define inputs and stakeholders. They have to represent the model. You have they have to implement computations cleanly validate outputs. It just clarified how capital allocations decisions affect non-financial metrics but incentives risk governance and long-term strategy as well. So over here just uh key implications recommendations for Apple. Apple's decision regarding it $90 billion capital allocation involves involves significant trade-offs. This recommendation synthesizes insights from our scenario analysis to guide optimals decision making based on strategic priorities. As you can see is a summary of each one for uh key implications\n\nstrategy tradeoffs and strategic alignment. There's recommendations based on each one for short-term, long-term and prioritizing risk and financial stability\n\nregardless of the chosen path. Robust governance is crucial particularly for options with higher agency risks. So over here it'll tell you however you want to do it. is going to provide you with the government's the governance uh issues and agency risk and what you would need. So in conclusion, Apple should be carefully should carefully assess its primary strategic objectives and the prevailing market conditions while the $90 billion buyback provides immediate EPS uplift. And this is also crucial to consider whether it aligns with Apple's broader goals of sustainable long-term value creation and responsible capital allocation across all stakeholders.\n\nAnd then for some reason it repeated that again. Yeah. And it just summarizes everything right here.\nSo yeah, so delivered a couple recommendations. You know, it just depends on how they want to do it. But like we said earlier, the like we said earlier, the um debt reduction, it was the safest long-term move. So that would be the safest one, debt reduction because less risky and it works better long time in my in our opinion. All right. Thank you."
}