{
  "student_name": "Jarrett Evans",
  "org_defined_id": "037163659",
  "username": "evans596",
  "email": "",
  "transcript": "Alright, welcome back guys. So in this video we're going to talk through another real world case study in, uh, financial theory. So kind of the, the GameStop, uh, short story. Squeeze situation. So kind of going through a Python script here first, as we usually do, and then investigating the future. Facts of the event and analyze this kind of market anomaly, uhm, and what it really tells us about the efficient market hypothesis. So, we will be going through the code here first as always, and we are importing our different, uhm, different functions here to kind of serve as our attention, er, not attention. Uhm, information getters, and section two will then be, uhm, kind of the date of retrieval, as it usually is, kind of downloading, at least this time, which will be new, the GME file. ticker, so the GME ticker kind of sets the, after setting the date range for from January 2020 to March 2021, kind of captures the entire event that we're kind of analyzing here. And second, section three is kind of the core of our define and discover and validate phase. So we're going to kind of look at the downloaded data to find the lowest price in august 2021 and the highest price in january of 2021. Alright, I think it was august 2021, august 2020. Excuse me. So, and then step four will then just kind of be, uhm. The, our analysis and kind of where we'll print these facts and kind of compare them to the assignments. Kind of the claims, so let's run the script and kind of analyze the output and this is kind of the most important part and just look at the numbers and see what it tells us. So, first, we have, uhm, the script, which kind of reports two key facts from the actual historical data. So, the lowest GME in August 2020 was $1.07. So that's split adjusted. And the GME closing price in January 2020 2021 was 80. Let's see. Oh, it says 1.20.75. Sorry, I don't know why it said 1.07. It's 1. And then, Yes, okay, correct. And, so, kinda, going back after we see the, ,dialogue... ,and then the $120.75, kinda, compare it back to our assignment. So, the assignment, ,GME peaked at $483, and our code is kind of only showing, like, So, we're kind of gonna go back and, and see what's really going on, so, This is kind of our first conflicting signal, so, and it's, it's a technical one. So, the 4 cent value is, incorrect, and we need to adjust it, uhm, which is kind of our verdict and analysis number 1. So, The $483 value is correct, and it was the intraday spree, pre-intraday pre-split high. So the data from Y-Finance is split-adjusted, and GameStop is GameStop had a 4-for-1 split in 2022, and we're looking at closing prices. The 86-88 split-adjusted close is equivalent to a pre-split close of, uh, $3.47, uhm, $3.52, which was high on, on January 27th. Uh, the $4.83 was a monetary split. It was intraday spike the next day. So, the prompts $0.04 data is fundamentally wrong, but the $4.83 peak is correct. the efficient market hypothesis versus reality. So, the semi-strong form or efficient EMH states that all publicly available information like fundamentals, analyst reports, etc. and things of that nature should be reflected in the price. So, the rational price estimates about ten to forty dollars, yet the price hit four hundred eighty three. So, the public knew GM was fundamentals were poor. And, but they also knew short interest was over one hundred forty. And by GME I mean GameStop Kind of use this public information to trigger the squeeze. Uhm, so the anomaly was the price wasn't based on fundamentals. But on market mechanics and behavioral factors like social media. Uhm. So that kind of brings us, after this, to our final verdict of, like. the, the form, like, which form of market efficiency was violated here, and we're looking at which. weak, semi-strong, and strong, and so weak form is clearly violated because this form says you can't predict. future prices from past trading data, so this GameStop event was predictable by looking at the public short interest data and rising social media volume. And the semi-strong form was heavy. Heavily violated because this is the core issue of the price not reflecting the true demand. Negative fundamental value, wildly overshot, excuse me, overshot proving that publicly available information was not rationally priced. And the strong form was not necessarily tested because this event wasn't about private insider information. It was just a public spectacle. So how do we kind of explain this? So this is not really an EMH failure, but a behavioral finance textbook case, if that makes sense. So kind of going back hurting, which an entire subreddit kind of moved as one, if that makes sense. And then there was definitely overconfidence as well with the retail investors believing that they could collect more effectively beat Wall Street. And it kind of also limits to arbitrage because this is the key concept with Wall rational investors just short the stock at $4.83? Because they couldn't. As is like, you know, the market can, you know, remain irrational longer than you can remain solvent. So, shorting GameStop at $4.83 was a bet that you, that could, wipe you out before the price ever returned to its natural or rational $40 value. So, kind of to recap, uhm, our analysis kind of showed that the GameStop event isn't real. It isn't an anomaly that disproves market efficiency, it's really a perfect example of how behavioral finance and logic limits to arbitrage can create temporary, violent, and kind of high-risk pockets of inefficiency . The price did rise. information, just not the fundamental information. And this kind of shows that the market is not a, a, a, single rational mind, but a complex system of competing and sometimes irrational human actions. So, thank you for joining again, and we will see you next time.",
  "video_url": "https://youtu.be/6JiLDgLKHrw"
}