{
  "student_name": "Gage Pittman",
  "org_defined_id": "037005578",
  "username": "gcpittma",
  "video_url": "https://youtu.be/uuWeTujZfB4",
  "transcript": "valuation of Panera Bread for a potential acquisition by KKR. Using the driver framework, I've developed a bid strategy that balances financial discipline with aggressive growth targets. So for the define and discover stage, we can see that currently $6 billion in revenue growth at 8% $900 million in earnings before interest, taxes, depreciation, and amortization, 15% margin, $400 million in net income across our 2100 stores. Digital sales are already at 50%. Industry PTO ratio was 22 times. The president EBITDA multiples 12 to 15 times. Chipotle trades at 35 times the PTE ratio and McDonald's at 25 times. Our capital assumptions is that industry walk is 9%. Management wants 10% rollover. Strategic biders such as Starbucks and McDonald's are circling. Our growth levers are 500 new stores in 5 years. Digital mix to 70% and dinner catering expansion. early stage international rollout. So my apologies.\nAll right. So my analysis defines the winning bid as one that captures Panera standalone value plus the potential of a digital transformation specifically expanding our digital sales to 70%. And drive margin expansion. If the bidding war forces us to pay for synergies we can achieve. My recommendation is for us to walk away. So for the represent phase, I represent the business using a multi scenario DCF model. The core logic connects revenue growth directly to margin expansion. As you can see here in the code, I parameterize the drivers so that as revenue grows, margins scale linearly from 15 to 18% in our upside case. So the base case assumes 18 8% growth and stable margins. This yields an enterprise value of 7.9 billion. The downside case models a recession with margin compression dropping value to 5.2 2 billion. The upside case, this is our digital execution thesis. If we hit 10% growth and improve margins by just 300 basis points, the value unlocks to 11.5 billion. As you can see here, this is our detailed projections for our base case over the five years. This implementation confirms that our returns are highly sensitive to the margin assumptions. And now for phase three where we validate to ensure these numbers are robust. I validated them with a sensitivity analysis. So looking at this heat map, you can see the zone of risk. Even in our base case, if interest rates rise and our walk jumps from 9 to 10%. Our valid our valuation drops nearly $ 1.5 billion. This validates that we must lock in financing early. I further validated this against the market using trading comps and president transactions. So for trading comps I use a range of 12 to 15 EBITDA which we sit above Wendy's 12x but below Chipotle's 22 times. For president transactions looking at the Duncan and Costa Coffee acquisitions I applied a range of 14 to 17 which implies a market value between 12.6 billion and 15.3 billion. My DCF sits squarely in the middle of these market validations. Now for the evolution phase, which is the most critical part of this analysis, the strategic buyer perspective. Using the evolve stage, I modeled what a competitor like McDonald's would see. They can eliminate $100 million in overlapping SGA expense and supply chain cost. At a 14x multiple, that creates $1.4 billion in phantom value that they can add to their bid. This creates a clear ceiling for us. If bidding goes 1.4 4 billion above our intrinsic value. We know that the opponent is paying with synergy dollars and we simply cannot compete there. Now for our reflection stage, we bring it all together in this football field triangulation. As you can see, the overlap which is the zone agre zone of agreement is between 13 billion and 14 billion. My recommendation is KKR should submit a target bid of 13.5 billion. Why 13.5? Well, it secures the asset at a fair market premium, but leave significant upside if we execute the digital plan. In our walk away price, we must set at 15 billion because beyond this, our IRRa falls below 18% and we are overpaying for growth that we haven't earned. So, our strategy to negotiate to win against strategic buyers, we leverage speed and certainty. We can close in 90 days without the antitrust scrutiny that a McDonald's merger would face. Furthermore, we offer the 10% management rollover, signaling to the founders that we are betting on them, not replacing them. This concludes my valuation. The numbers show a clear path to value creation, provided we remain disciplined on price. Thank you for your time."
}