{
  "student_name": "Fabian Segura Vargas",
  "org_defined_id": "037407177",
  "username": "fsegurav",
  "email": "",
  "transcript": "So for my session 8 assignment, uh I decided to do an investigation of the 2021 GameStop stock short squeeze. Once again, this presentation will be following the driver methodology. Define, represent, implement, validate, evolve, and reflect. Starting off by defining what what are our goals. We want to verify historical GameStop price data. We also want to test the efficient market hypothesis. The three forms of it, the weak, semi- strong and strong form. We want to run an event study style for analysis of abnormal returns. Basically, you want to see how off from the median or the benchmark being the S&P 500 were these returns based off pot. And then you want to examine behavioral finance factors behind the short squeeze. Why did it happen? How could these abnormal returns be justified? The event the short squeeze took place between August and fe and February 2021. Uh the data we're going to be using is GameStop price, GameStop volume of stocks bought and sold, and the S&P 500 as a benchmark. And then key events uh that have to do with this stock, and we're going to see how they affected the price from a behavioral standpoint, not from a financial standpoint was coen stake, the Robin Hood restrictions, and the hearings. So to set up a timeline for our present stage, first we want to verify the historical price data. Then we want to collect GameStop and benchmark returns. Estimate the CAPM pre-event window to get a a measure of the average regression bench beta and alpha for this uh stock. Compute abnormal returns. Compute the cumulative abnormal returns for the same dates and then interpret the efficient market hypothesis versus behavioral finance implications. Here we're going to be using different fi Python concepts. We're going to be using the Yahoo Finance library to get the historical data. Numpy, pandas, map plot lib, and a regression return calculation function as well as price and return variables. So starting off with the Python code we're implementing. First, we import the libraries. This block in particular imports libraries, formats the decimals, and removes scientific notation for floats. Then we download the data directly from Yahoo Finance. Here we can see the parameters we're lining up and then here we're using the yif to download directly from the Yahoo Finance API. Then we estimate the cap. Here we're running a regression from a pre-wind to calculate alpha and a beta have a a variable number for this formula. Then we compute the abnormal returns and the cumulative abnormal returns using as you can see here the alpha and the beta as a market constant and as a coefficient of market return. We create a cumulative abnormal returns for the event window. Then we plot it using the mattplot lib Python extension Python Python library. We create graphs for both and it will return the trading volume and display dramatic spikes. And then finally we create a summary table to use these numbers and relate them to the events that happen in real life like cohen stake the wall street bet spike the Robin Hood halt and hearings. So now we're validating here are the formulas in theory that we use. So we use a linear regression formula and we got these regression results. As you can see here the constant or the alpha was 0.0155 and then the coefficient for market return or the beta in this case was 1.7418. Here we can also we can see we got the error and other variables used in linear regression. Then here we use the abnormal return formula using the the ones the already previously defined alpha and beta and then the return from the GameStop baseline that we got from Yahoo Finance. We plotted these are abnormal returns. So not necessarily the price spikes but the price spikes above from what would be expected of the stock and the benchmark. And here we can see the trading volume during those days. And there is some aligning here. The 21st of January was this day. And then the amount of volume kept going up which could indicate this spike. And then the sell-off here at the end of it. And then we get this data table output. So we can see when Ryan Cohen reports a 10% stake, the price return is 2.93 and this is a normal uh by a 3.34%. And this is one of the most normal ones. But here uh during our calculated phase this one between the 1st the 5th of January and the 5th of February we can see that there are some much higher returns and much higher abnormal returns even going into 137% and - 47 abnormal returns which is incredibly high. This was at the peak price day pre-split and then Robin Hood restricts buying which is what causes var to sell off in fear. So how could we evolve this experiment or this analysis? In the first part we could test alternate event windows. As you can see the graphs were only for a month. We could use different different times. We can start from before extended. We could also alternate test alternate risk models not only using the capen formula maybe using WACC other ways of of measuring a benchmark and then of in therefore measuring how much the abnormal return expands upon and then we can expand behavioral indicators and then the efficiency mark the efficient market hypothesis analysis we can see it violates all three types of efficient market hypothesis theories. First one is that it cannot predict we cannot predict a market using past returns. In this case that is true because is is it is so abnormal that no previous returns would have matched what happened here since it wasn't due to market or or earnings report or financial data. Then the semi- strong uh hypothesis form is you cannot earn abnormal returns using public information. And once again in this case we can say that that is violated because the returns the abnormal returns wen't due to public information through financial data from the company. there was an abnormal returns but due to external factors. And then the final one is that we can't beat the market which is also violated because if you were to buy here and then sell here, you would have beat the market by a pretty large margin in all of these high price return days specifically. And then going a bit deeper into a a behavioral finance analysis, uh we can see this situation reflects hurting. It reflects following behind a clear message which was the hold. The whole cultural momentum of the hold and people not wanting to sell not because it was the best financial decision but because they were acting as a group. Then attentionbased training. uh people were learning uh many times how to invest for the first time, opening their first investment accounts and Robin Hood accounts from Wall Street Bets and from this creator. So they were just following what he said and acting as if he was right which also resulted in the third point which was overconfidence. Normally in a standard market behavior, if a stock were to go up that much over its price or its average calculated price price target, then people would have sold off, but they weren't because of this market behavior and this cultural phenomenon which was occurring. So basically my conclusion and my results of our analysis is that these sort of return and this sort of event wouldn't happen naturally due to financial data. No, it wasn't like GameStop was doing great financial moves. Instead, it was because of a cultural phenomenon and uh emotional attachment to the stock. Thank you.",
  "video_url": "https://youtu.be/IR0wI_4FhJc"
}