{
  "student_name": "Jay Saini",
  "org_defined_id": "037907174",
  "username": "saini52",
  "video_url": "https://www.youtube.com/watch?v=bEVIMeOL7LQ",
  "transcript": "\"All right, so, um, for the Capstone project, I decided to do a AI kind of like financial wellness. Uh for my past mini-projects, I've been doing something kind of in the similar realm, but in this one, I wanted to make it a little bit more extensive and make it just overall a little bit more better. Um for me to personally use and for anyone else to use, because that's, you know, the main point is that we have um that usability on here. So, the AI financial um wellness thing right here is kind of it uses all these inputs of like saving, checking, annual salary, annual salary, excuse me, um to kind of gear towards a little bit of where you are at in terms of finances and if you need to improve upon something, um so on and so forth. So, I'm just pulling up my driver framework also here. So, I have it side by side and I can kind of talk about it.\n\nUm, first we have the savings option. So, in this little kind of GUI, you can increase them by the arrows or you can type it out just, you know, as anyone really would. So, I'm going to do, let's say we have $10,000 in savings. Um, and then we have like another $3,000 in checking. Um, our annual salary, we're about getting 150,000, which is pretty good. And we're at like $20,000 in debt from maybe an MBA that we were getting to and we have partially, you know, paid it off. Our living costs. So, let's say our this person we're doing it for has two kids, so we're spending about like $10,000 on their living every year or something. I don't know. Your filing status, which is your taxes, this can play a part into if you're doing well or not because it can determine if there might be another salary that's involved that this tracker doesn't know about. So, we'll just say single for this. Um then it has state of residency. So, this one I like because I incorporated kind of the tax rates. So, you can see how it doesn't say every state, but it categorizes different states into low, medium, or high tax states. Um so, let's say we do live in California, that's a very high tax state. We want to account for that as well because that can kind of determine if we're in a good path or not.\n\nUm, sorry. Okay. So, once, or and then we have household size. So, for this, uh, let's just say it's three people. We can do 'Analyze My Financial Health'. When you click it, it gives us kind of a nice little thing down here. Thing down here. So, I'm sorry. I just want to move this away. Um, it says we got about a 45 out of 100 as our ranking, which is actually pretty low. So, it says right here status, stable but improving. Uh, after-tax income, we're looking, we're about taking $106,000 home. So, that's really cool because you can take that tax and it calculates into your salary. So, you don't have to worry about the taxes that are getting pulled apart um because, you know, every salary is reported as a very big number before the taxes are taken off. So, this is really nice because it does that for you um so you don't have to worry about that. But, we have that. So, we're at 106,000 or 106, about $106,000. Our household adjusted expenses. So, this is really cool too, which will part part into it in a minute. Uh, we it gives us the value 15,000, despite me putting about 10,000 here. That is also because it kind of takes into contribution of other things that you might not think of. If I'm saying 10,000, I might be thinking of food, shelter, maybe um day care if I have kids in here that I'm reporting for. It adds a little bit of additional cushion room because it's quite a bit of truth that we don't account for everything in terms of living expenses.\n\nUm, our saving rate. So, this is also nice because it will calculate kind of where we're at with that. So, we have about a 9.4% there. And then we also have a debt burden, so that's about 18.8% um of how much in debt we have, which is 20,000. And then it kind of does like this drive. This is what I thought I would make it do, is the discover, reason, invest, verify, and explain part. So, discovering is that the taxes are 29% and your household size is 3%. Um, I think I like this because it kind of piggybacks off of the driver framework that we as developers throughout this class have seen, but being able to kind of see it as maybe on the client side, it makes it really nice. So, we were discovering. And then our reason is disposable income is about $106,000 after the taxes and other cuts have been taken out. Um, our I is invest. So, this is increasing savings or lowering the debt has, you know, whatever, has the biggest impact. So, if we were to increase our savings a little bit, or if we were to lower our debt, so paying more of it off, our number, our valuation would go higher. To verify, so the expense ratio is about 14.1%. That's taking our annual living costs with all our other values up there. And then explore or explain, this is just letting us know that it measures sustainability, not lifestyle. So, it's not technically saying that, you know, you're living a very bad life if you're at a 45 out of 100, but more saying that that's a good spot to be, but we can go better, if that makes sense. So, this score no way, like demeans the way you're living your life. It's more of where you are financially in terms of like a good capacity of saving or um how much debt you're taking on.\n\nSo, all this was again sourced by ChatGPT. Um, I'll show you the code right here. Maybe I'll show you the code. There we go. So, it did a lot of um finance or it did it all in Python and took a lot of financial data. It initially did not have all this. Um, I had to kind of, you know, play around with it, giving it prompts to add more stuff to make it look like this.\n\nBut, in terms of driver, the purpose of this app is to kind of identify where the average person could be. So, since this only has right now like American states, I would say America is kind of the primary demographic for this. So, just how Americans are with the federal and state taxes, the household size and dependence, the salary, saving, debt, and costs, which are very fundamental to a financial checker. And so, they matter because if you can't make decisions smart financially, um, you need to kind of know where the limits are in the real world. And I think this does a really good job of it.\n\nFor the reason, so a lot of people don't interpret data with vital tax cuts. That's a very big thing. So, people don't sometimes look into after-tax income, you know? They if they're making, if they're told they're making 160,000, they're going to act like they are truly making 160,000, when in reality you're probably only making about 110,000. Um, to kind of look more into that, it's also really important to look and just understand how important it is that people under just know the taxes that play into it. That's kind of what our app is here also for is just to to do that extra hard work. Because if you want to sit there and try to calculate how much taxes are getting taken off of your um paycheck. Then we have implement implementing was this actual graphical user interface, so the GUI, making it look nice, making it very easy to just put stuff into fields and then it interpreting that automatically and calculating makes your life easier and you don't have to sit there and do your calculations yourself.\n\nTo verify, I did take some numbers and I tried to calculate the savings rate and the debt burden rate and they would equal to what Gemini was or sorry, ChatGPT was giving, so that made me assured that all the facts and statistics and numbers that it was producing were correct.\nAnd overall, evolving the app, like I mentioned earlier, initially there was only about um, it only talked about savings, checking, annual salary, and total debt. So, I only had these four figures to give that financial wellness, but I thought it was really important to incorporate taxes and states of residencies and how many people you might be supporting and your living costs because those things don't get talked about enough when you're doing a financial calculator. So, this kind of helps tie all that in together. Um, but yeah, I think that is it uh for my project right here. I hope you have a great day.\""
}