{
  "student_name": "Nick Sikorski",
  "org_defined_id": "037205859",
  "username": "nsikorsk",
  "video_url": "The app will not allow me to download to YouTube.  Refer to the video and transcript.  Sorry for the inconvenience, thank you!",
  "transcript": "All right, so in this video we are going to be looking at and evaluating Apple's hypothetical $90 billion share repurchasing using driver. So how are we going to do this? We are going to first discover. So the core problem is to assess our optimal allocation of $90 billion in capital for Apple, focusing on stakeholder, uh, impact and uh, other issues within the agency. So we go down and we have our key data. So we have our cash available which is the value is about $165 billion. And we have a buyback size of $90 billion, a share price of $185. We have our shares outstanding of $15.5 billion. And then our market cap, we can calculate this by $15.5 billion. We multiply that by 185 to get us a total of 2.8675 trillion dollar market cap. Then we go down. Debt is 110 billion, free cash flow is 100 billion and our P E ratio is 30 and our earnings per share is around 6.17. After we estimate using our uh, share price and then our P and E ratio. So stakeholder interest. So Berkshire Hathaway holds 6%. Um. Desired share application, tax efficiency and capital preservation. So now let's look over to the CEO management side. CEO and management only hold. It holds 3 million shares which is, which means they're kind of motivated by higher eps. So it's often card to bonuses and share price. So the CEOs want the share price to increase to gain money. The employees hold hold options at uh, $170 strike. So they desire the share price to remain above $170 in appreciation to maximize option value. So the employees want it to be the stock price to be over $170. And then our retail shareholders, um, they have an average 100 shares. They prefer easy, tangible and tax efficient returns like anyone would want. Um. Bondholders hold $110 billion in debt. Um. Concerned with Apple. So they're kind of concerned with the credit rating and the risk of increased leverage within Apple. So we go down and we see alternate uses of cash. So we have a $6 special dividend which is a possibility. Then we see we have a strategic M. And A which is high growth, high risk and potentially transformative. We could also try debt reduction or uh, deleveraging so lower interest expenses and protects our credit. So let's go down represent. So we see the buyback calculation. So our shares we purchased is the 90 billion B like we see up here. Buyback size and Then we divide that by our P0, which I believe is the share uh, price. Yep. And then we get around 0.4865 billion shares are repurchased by Apple, which is quite a lot. It's about half a million or 500 million. Excuse me. So then we calculate our new shares outstanding which is our S0, uh, minus our change in S. So S0 being shares outstanding and change of S is change in shares. So this is around 15 billion shares as well. We have um, we then move down to our dividend comparison. So our total cost $6 times our shares outstanding value. And then we get around 93 billion in the total cost for our special dividends that we're giving out. So then um, scroll down to step three. So this kind of strategic financial metrics, we're comparing a lot of data. So our EPS or earnings per share impact. Excuse me, the buyback is positive with fewer shares, the dividend is, our dividends are neutral, the cost is cash. That's kind of just how it goes. Um. And then our debt reduction is positive as we're decreasing um, our interest costs which is always a good thing. I'm not going to worry about the last uh, column too much but so then our buyback for ownership change or buyback increases for non sellers dividends does nothing for our ownership. They, they really don't care. So we have ROIC where this improves as our denominator lowers with buyback. Um. And then doesn't really do much for dividends. And our debt reduction will also increase, um, as again we're lowering our denominator. Our leverage increases as we lower that E value we talked about. Where is it? Um. Um. D and E I guess which is, yeah, equities. We're lowering our equity so that's plus leverage. That's what that means. And then the dividend, none, it really affects liquidity, has nothing to do with dividends and our debt reduction actually decreases which um, could be looked at as a good or a bad thing. And then let's go down here to the implement section. So we have our financial modeling of the buyback, right. We already found out some of these values. Um. So the post buyback there was a slight decrease um, in the percent change from the pre buyback to the post buyback. And then with this we see our total earnings stays basically the same, which is assumed and our earnings per share actually increases. So this is a good thing. So it shows that our share is outstanding even though it decreases and we're buying some of this Back um, the EPS actually increases as a result um, which will make our stock, our stockholders and everyone around Apple very happy. We also see that the share price also increases by around $6 which is another positive. So overall shareholders are happy with this pre uh and post buyback. So let me go down to stakeholder impact. Um. We're quantifying that. So our stakeholder Burkshire, which is 6% um, they have around 0.93 billion shares according to this which is a lot um and their post buyback ownership value is just about 6.19%. So ownership actually increases from the 6% um, which is a good thing. You want to own more of the company or you got more at stake, especially a company like Apple, that's what you want. CEO has 3 million shares. Um. So post buyback we see a SL. We're gonna see a slight increase due to higher EPS. The uh, higher PS helps um, in this way triggering kind of higher bonuses tied to the EPS per share price. And then with our employees options at $170 they're in the money by around $15 a share. So the higher P value like we said earlier of 191.10 instead of the 185 so this is kind of maximizing our option value and again our employees will be happy with this. Then retail averages around 100 shares person. So then our post buyback ownership value is 100 divided by that entire um, entirety. Um. But they benefit from the appreciation and the higher eps. Um. So they're happy their, their shares and their stocks are worth more than they were um pre buyback. Then the bond holders $110 billion in debt. Um. So we just see this equation as that's kind of their ownership value which is around, I mean it's 110 billion divided by 2.86 something or other trillion minus 90 billion. So regardless that's going to be a very low number that we're not going to worry about. But these bond holders, they're kind of leveraging the leverage ratio increases which potentially strains um, kind of their balance sheet and could lead to a credit rating downgrade. So this increases bondholders risk. So bondholders are really the only one on this list who will be unhappy with the current changes um, going on. I'm not going to worry about this too much, um, going to go down to the validate part. So the analysis is kind of validated by this EPS uplift. Um. The eps increase of 3.24% is mathematically confirmed based on Our share reduction um, like we talked about earlier we also have um an agency risk where the buyback clearly provides an immediate boost to metrics um often tied to management compensation. So this kind of confirms the potential for agency conflict um or in parentheses it's saying management choosing buybacks over high RIC projects for personal gain. So it's saying management be a little greedy in that regard um and choosing buybacks um to compensate. Then we go down to capital efficiency where the current high P E ratio of 30 suggests that Apple's cost of equity is very low and its stock may not be um it's probably not severely undervalued because they're spending around 90 billion on a stock that is pretty highly priced which is less capital efficient than using the funds for projects with higher intrinsic roic. But I mean you got to keep the people happy. So um, it's they're there's so much money involved with Apple that it's not that um, it's not that ah, it's not crazy that they would have put this much money into stocks and the happiness of the customers and the people incorporated with running Apple. So let me go to the evolve section where this model kind of evolves beyond simple EPS dilution um and we go down to see that there's kind of an optimal capital structure um we quantify the debt to equity ratio shift post buyback and we compare it to industry median um if the shift moves to the firm closer to a theoretical capital structure um where WACC would then be minimized. This kind of creates value. So this is actually pretty optimal for Apple. So then we have an RIC thresholds for the M. And A alternative um where we determine the minimum required return on invested capital or um the ROIC which is necessary to justify um this acquisition cost which is significantly higher than Apple's cost of equity which is around like we saw earlier the R e is about 10 to 11%. Then we see that our tax rate um models the differential tax impacts um for various various shareholder groups like we talked about earlier long term capital groups, ordinary dividend income can assess the true after tax benefit of the buyback versus dividend we see with numerous different um people within society. So let me reflect. So our recommendation is to reject the $90 billion share repurchase and we want to prioritize more of a combination of strategic R and D and M. And A and other debt reduction um would be way more beneficial to Apple. So rationale for this is value creation versus value transfer. The buyback is primarily a value Transfer um shifting cash to existing equity holders um this increases leverage and really creates zero economic assets to Apple Um. Sustainable value is created by M. M. And A and R and D which kind of drives future cash flows and increases the intrinsic value of a firm opposed to um this buyback. Um. So then we see there's an agency risk mitigation so we're prioritizing internal investment, R D, um research and design or external growth M. And A which mitigates the agency risk um inherent in the buyback. So this directly benefits management, compensates compensation which targets the EPS inflation. So we want to, we don't want to risk too much mitigation within this. Then we go down and see that an optimal capital structure would be not the buyback which increases leverage as a debt reduction is more of a cleaner way to manage this balance sheet risk um it would protect our credit, Apple's credit rating sorry and achieve a permanent low risk wacc um weighted average care cost um which improves um our and kind of decreases our interest expenses. So overall the 90 billion should be divided to fund long term growth and prudent financial discipline. So maybe Hypothetically we throw 45 billion about the 90 targeted M. A and incremental R and D and then the other 45 billion a, um strategic debt reduction to reduced interest expense and kind of fortify the balance sheet and increase Apple's opportunity um opportunities to make cash in the future which be very beneficial. Now I'm going to turn over um I'm going to switch over to this Python code kind of gives an output on um kind of builds a transparent model um it fits all these technical requirements given within the uh share buyback model. Um. So we go down, we have our inputs net income NI0 shares outstanding. So current share price PO and I can go on and on. These are the list of the key keys of the inputs. So that's that one. We have our different values that were given on the uh presentation. Buyback, dividend, debt, borrowed, all this good stuff. Net income growth rate P, E multiple, all this stuff we go down, we have our calculation engine so we can see like cash used alpha times C underscore A which is cash available for use that will bring us our cash used. We can just find different things like that um good forecast net income um ni1 that's our initial net income. Multiply that by 1 plus gn1 which is our net income growth rate and then lastly we add um excuse me we add delta which would be um R. Which would be this value up here with these already would be our new interest expense. Yeah. And we have these values up here. We could do the same here. We go down for shares repurchased using the key above. Um. Shares outstanding, year one forecast, um, year one forecast, share price, um, year one forecast, leverage or special dividend per share, year one forecast, and so on with all these different keys. So pretty, pretty cool stuff. Then we can consolidate our results to give a list of every piece of data we want. We have some code to execute this model. Then we have our output, which is to print this financial data. Um. And with all the keys and all the equations above. And yeah, that's you can add value labels on top of the bars if you want. Value labels. Um. Not a big coder, but pretty sure this is how you add labels. And yeah, that's basically the model to help, um, complete any function that would be relevant to this topic. So thank you and hope that was educational."
}