{
  "student_name": "Gage Pittman",
  "org_defined_id": "037005578",
  "username": "gcpittma",
  "email": "",
  "transcript": "uals the weighted average of a company's debt and equity costs which reflects the return required of all capital providers. So obviously the first step is going to be determining our current WACC which if we head over to Google Collab we solved and given our current debt and equity we are looking at a weighted average cost of capital of 11.22% which is above the industry average. So what happens if we invest three billion on this content? Well, that would take our weighted average cost of capital down to 11.13%. Which is better because it's lower, but it's still above industry average. And our weight of equity is now 92.59% and our weight of debt is 7.41%. Now, this goes to show that with the more debt we have compared to equity, the lower our WACC will be. This is because debt is essentially cheaper than equity due to the tax shield effect whereas it's write offable. So it decreases the amount that actually has to go towards the debt. Does that make sense? And to try and make it make sense, if we look here, you see this is the formula in V is the sum of the market value of equity and the market value of debt. So if our debt is increasing in the denominator, then obviously our WACC will get smaller in return. Now when evaluating the project specific weighted average cost of capital per US content should be lower and the WACC for international content should be higher. The 11.22% hurdle rate is too low or too high for the US but too low for international investing. So it's hard to find a find a balance here. But when we compare Netflix and Disney, we see Netflix has a significantly higher weighted average cost of capital. You know, Disney's is 70% equity, 30% debt, whereas Netflix's equity is in the 90s and singledigit debt percentage, which that would explain why Disney's weighted average cost of capital is 8.2% within the range of this industry. This is due to Disney having a greater weight of debt. As I said, and as we mentioned previously, debt is cheaper than equity. There's a possibility Disney has a lower cost of equity because it's perceived as less risky compared to Netflix, which Disney has been around for a very long time. So, it kind of has a little more credibility than Netflix, who hasn't been around as long. So the recommended optimal capital structure strategy would be to invest more, try and get with the rest of the industry, increase our debt while reducing our equity. So what if we did invest the full 5 billion hypothetically? We would then be looking at a WACC of 11.07%. 07%. Which still not an industry range, but we're getting lower and lower and slowly changing the weight of equity to the weight of debt. And this just goes to show how important it is to take advantage of the tax shield effect and take on more debt and less equity because your lenders are lenders have less risk. So the debt is not as uh big of an issue. It's not that's why it's cheaper. And that kind of concludes our decision here. We need to continue to invest and increase our debt, reduce our equity so that we can fit into the the industry range.",
  "video_url": "https://youtu.be/7DWFTfFJKwU"
}