{
  "student_name": "Carter Perez",
  "org_defined_id": "034075354",
  "username": "perezcj",
  "video_url": "https://youtu.be/Gf_VdjM1xFw",
  "transcript": "All right. So, for my final project, I\nmade an app that rounds up any purchase\nand puts whatever was rounded up into a\nsavings account. Uh, I did this by using\nan AI\napp builder called base 44 and also I\nused some API keys as well. Uh so\nfor the sake of this video, you can you\ncan link up your card and like actually\nput your account in, but for this uh\nsake of the video, I'm going to just I\nadded a simulate purchases. So I'm not\nusing my actual bank account and sharing\nthat information. Um in the settings,\nyou can choose which account you want it\nto be connected to. Then you can do a\nmultiplier. So, if you want to do two\ntimes of the roundup, so instead of you\nspend 75 cents, it would go to 50 cents.\nUm, you can also put a weekly limit on\nthe roundup amount. That way, you're not\ntaking too much extra money in. And you\ncan also pause it and get notifications\nas well. Over here, you got we're going\nto start with total saved. So, it'll\ntell you how much has been saved by\ntaking that extra money that's been\nrounded up and putting it into a savings\naccount. We show you the weekly stats\nand then your goals. And you can put\ncustom goals. Right now I have summer\nvacation, emergency fund, and new\nMacBook. And then I'll do a simulate\npurchase. So you can kind of see, let's\nsay I went to Whole Foods, got\nfood and drink, and I spent $4530.\nUm, since that's 70 would 70 cents would\nbe rounding up. It's going to put a $140\ninto the savings account. So, you can\nsee that that went up by $140 and that\nwent up by $140 this week. And then\nit'll also track your recent roundups.\nAnd by doing this, it'll help you save\nup for each of these goals. And that's\nimportant because a lot of college\nstudents have trouble saving up for\ncertain goals. And this is kind of a way\nto do it without actively thinking. and\nyou're also still spending money, but\nyou're still saving. And then down here,\nthere's also an AI and analysis that'll\nkind of analyze your financial\npurchases. So, it'll tell you your food\nspending. You spent a significant amount\nof food, particularly at Whole Foods and\nStarbucks. So, it tells you consider\nreducing these visits. Um, you might\nwant to boost your emergency fund\nprogress and then also celebrate your\nachievements.\nSo, this is just another way for the\nstudents who are using this app to\nreally understand what it's doing and\ngive them some personalized tips for\ntheir savings. So, yeah, this is the appI created. Thank you."
}