{
  "student_name": "Christopher Valencia",
  "org_defined_id": "032156780",
  "username": "valencc",
  "email": "",
  "transcript": "All right. So, recession 8, market efficiency and behavioral finance. The question is, are markets perfectly rational or are we all just predictably crazy? Here's section one, the financial hook, the analysis paradox. You spent weeks analyzing GameStop using every technique from sessions one through six. Your CAPM based valuation sells intrinsic value of $12 per share, but the stock is trading at $200. Three explanations in your mind. Explanation one, I'm wrong. Um, so our analysis missed something important. The market knows information we don't have. Better analysts have driven the price to fair value. Explanation two, the market is wrong. Retail investor mania has created a bubble. Fundamental analysis reveals mispricing. Patient value investors will eventually profit. And explanation three, markets are weird. Prices reflect psychology as much as fundamentals. Behavioral biases create systematic patterns and traditional models miss important market dynamics. Um so here's a timeline visual visualization. Um here's a traditional theory. So fundamental value of $12 intrinsic rational analysis professional traders and the current market price should be $12 but here's the reality that we reser observe 200 mark dollar price actual trading. So which time represents how markets actually work and this session will examine the tension between theoretical and observed market behavior uh which is crucial for understanding when uh our analysis can beat market consensus. So our learning goal with AI is developing a sophic sophisticated understanding of how market efficiency theory impacts practical investment investment analysis and strategic development. Um and so we go on. So quick knowledge check. What is the efficient market hypothesis claim? Stock prices reflect all available information. Uh according to strong form market efficiency which strategy should not work. Insider trading. What is anchoring bias? Over relying on the first piece of information received. And if markets are semi- strong efficient, what information is already reflected in stock prices? All publicly available information. And so we go into section two, the efficient market hypothesis. And our EMH principle um stock practice fully reflect all available information making it impossible to consistently achieve abnormal returns through analysis of publicly available data. So there's three forms of market efficiency. Weak form prices reflect all past price and volume information. Technical analysis doesn't work. Semi- strong form prices reflect all publicly available information. Fundamental analysis doesn't work. Strong form prices reflect all information including private information. Insider trading doesn't work. So our key implications are random walk. Future price changes are unpredictable. No free lunch risk adjusted returns cannot consistently beat market information efficiency. New information is quickly incorporated into prices. And so we move on to part two where we testing where we're testing the market efficiency. And again, here's our timeline again. Normal returns, abnormal returns, and then after event return to normal. In efficient market, price adjusts immediately to new information. An inefficient market price adjust slowly or overreacts. Here's the abnormal return calculation. And then part three, behavioral finance challenges. Common behavioral biases, overconfidence, investors overestimate their analytical abilities, anchoring, over relying on first piece of information received, hurting, following crowd behavior rather than independent analysis, loss aversion, feeling losses more acutely than equivalent gains, mental accounting, treating money differently based on its source. Um, and their market anomalies, momentum, past winners continue winning in short-term value effects, low PE stocks outperform high PE stocks. size effect. Small companies outperform large companies in January effect. Um, small stocks perform especially well in January. So, our learning goal with EMH forms and trading strategy selection is mastering the practical implications of different market efficiency level levels for developing appropriate investment strategies. And here's uh our prompt that we put into, you know, GPT or Gemini. Uh I'm analyzing how different forms of EMH should guide strategy selection yada yada yada. Um what evidence do fund managers use to justify active management supposedly efficient markets and so why this shows a professional strategy development? You know efficiency thinking, strategy matching, cross market awareness, evidence-based decision- making. And here we go on to part four practical applications for analysis. So or strong efficiency use passive index investing semi-rong efficiency focus on private information and superior analysis weak efficiency fundamental analysis can work technical analysis cannot inefficient markets multiple strategies can generate alpha and then our connections to our previous sessions. Sessions 1 through six valuation assumes you can find mispriced securities. Session seven examines whether mispricing actually exists and persists and sessions 8 through 12 apply insights to corporate financial decisions and um we go on into the partner practice. So keep going through that and then we get into section four um our driver learning guide and then here's a case scenario for the coaching post earnings announcement drift analysis technology stock reported earnings 15% above consensus estimates stock rose 5% on announcement day but continues rising 1% daily for the next week question does this gradual price adjustment represent market inefficiency or rational information processing and here's our analysis framework market prediction observe pattern and then investigation is this inefficiency irrational adjustment to complex information. And so we move on to Discover frame the efficiency investigation. So our goal is to design systematics test of market efficiency around earnings announcements. Um so we do this with AI copy this and then our outcome we need to analyze whether continuing price movement represents market inefficiency inefficiency exploitable for profit rational processing of complex information or compensation for additional risk factors not captured in simple models and then we move on to represent. So here we're mapping the efficiency testing framework. Here's a timeline the benchmarks return analysis and then our implementation. So here we're coding the market efficiency analysis and this is obviously starting code. We use um our AI to help us figure out you know what to do with this and then we just validate it. So the robustness efficiency findings our goal return analysis distinguishes true efficiency from statistical noise and um so statistical significance or abnormal return statistically different from zero. Economic significance are profits large enough to overcome transaction costs, persistence and risk adjustment. And we go on to evolve efficiency insights across markets where we just apply our efficiency lessons to other market contexts and investment decisions where we recognize the efficiency patterns in various market settings. And we keep going and then onto the reflect. And so ultimately we did synthesize insights about market efficiency for practical investment approach and our approach earnings drift analysis suggests markets are mostly but not perfectly efficient which creates a nuanced investment philosophy. Respect mark respect market wisdom while maintaining healthy skepticism about perfect pricing. And that is it.",
  "video_url": "https://youtu.be/vIzFfR4gbik"
}