{
  "student_name": "Kulpreet Singh",
  "org_defined_id": "035817975",
  "username": "sing1099",
  "email": "",
  "transcript": "Hello, my name is Krit Singh and today we'll be talking about Netflix cost of capital to determine if they should proceed with a $5 billion content investment and how a three billion depth insurance affects their financial health. We will start with the define phase. We know that Netflix is a $200 billion equity company with very little debt, only 13 billion in market value. Their beta is 1.3, indicating that they are 30% more volatile than the market. Our goal is to calculate their WACC. Um so um we can see right here in the code where I have defined everything that I just said um and what what what we are trying to find and the the define and discover you know for the defining part and now we're on the uh the review and refine like the formulas. does um so the two main components is the cost of equity where we can see here we use the CAPM model with a risk-free rate of 4.5% and a market premium of 5.5% plus that high beta of 1.3 equity investors demand a higher return and then our other component is the cost of debt where we can see here uh Netflix borrows at of 5.8% but thanks to the tax shield of uh the effective cost of the debt is significantly lower. The interest is taxdeductible and subsiding subsiding the cost. Now we're on the implement uh implement stage. Um so uh right here we are doing we make our market uh we input our market variables. We calculate the cost equity at 11.65%. And we calculate the after tax cost of debt at roughly 4.58%. And then we weigh these based on Netflix capital structure. Then we go to our next step verification. So in the verify stage we look at the results. Netflix current WACCC is 11 uh 22%. This is our hurdle rate. Any content project like the $5 billion investment must generate higher uh returns higher than 11.22% to generate any value. Um um let's say we uh run our scenario where uh we add a hypothetical 3 billion dollar in debt. The WACC dropped significantly significantly to 11.12 and this is because we are swapping expensive equity at 11.65% for a cheaper debt at 4.58%. This demonstrates like the value of leverage and how that can affect your loan payments and uh how it can affect a project for Netflix. Um and then right here we can uh we can see like the d uh when we run the code we see this uh the Netflix WACC sensitivity and the impact of rising debt. Uh uh let we're going to we're on our report stage of driver. Um this is our findings. Looking at the sensitivity chart, you can see that Netflix add adds debt to their WACC and the W ACC decreases. Uh so like we can do a comparison like Disney has a WACC of 8.2% and Netflix is at 11.2%. This is because Disney uses 30% debt while Netflix only uses around 6%. So Disney is optimizing their capital better but you know that that's just an example. Uh so with the project specific risk we can uh we should see that 11.22% for everything that's not really um that's not really how it works. Um for uh the US content 11.22 22 is fair, but for like international content, risk risks are higher because of like currency and regulations that come with it. Uh so if if we were to do like an international project, uh the WACC uh it should be at least you you can assume that it's going to be 2% uh higher for the international projects. So my recommendation is that I would recommend Netflix to proceed with the $3 billion uh dollar debt insurance. It lowers their cost of capital without significantly uh increasing the distress risk and bringing them significantly closer to the to like industry peers like Disney. So yeah, we finding finding different ways to really um leverage your debt is how you can really stand out with any business, not just like the content creation. And we can see here where, you know, they're making uh they're they're they're not really financing a lot, but they need to they should be Netflix has like a higher cost of capital just because um Disney is a little bit more wellknown. They have better lenders, I think. So, we can see we can see that in this chart. India.",
  "video_url": "https://youtu.be/GJY371yv_kw"
}