{
  "student_name": "Noah Azevedo",
  "org_defined_id": "036596149",
  "username": "nazevedo",
  "email": "",
  "transcript": "Hey, my name is Noah. This is the assignment cost of capital analysis which relates directly to session 9. And the main idea of the whole session is the question, what's the hurdle rate a company must clear to make its investors happy? So there's a lot going on and I'll unpack that throughout this video. But let's go directly to the context of the actual assignment. So we have to calculate uh the weighted average cost of capital also known as walk uh for Netflix in connection with a hypothetical 5 billion contact investment decision. So our analysis must determine uh the current work and then evaluate the impact of additional debt financing assets project uh specific versus firmwide discount rates and compare Netflix cost of capital to industry peers which were um in this case uh Disney or Amazon Prime. So we have these hypothetical uh parameters that you can see over here that kind of build the context of the assignment. We have also uh the very important um market conditions which will be used in the calculations and I will go in depth of that and we also have the strategic context. So also uh this kind of relates also to Netflix but mainly to its uh other competitors so uh Disney and Amazon Prime. So uh we have also uh based on the assignment the required analysis which is uh this as you can see here and we also have uh other provided parameters uh such as Netflix market cap uh the beta which will relate to risk and uh bankruptcy and then uh but we'll we'll we'll go on and there's a lot of of numbers in the context and I think before we get to explaining I will we'll use the the driver framework and go through and then explain the terms as they come. So uh to solve the problem and and to create uh at the end a suggestion for this hypothetical situation uh of Netflix we first have to define and discover. So we have to have a clear understanding of cost of capital problem and Netflix financing decision. So the core problem here is that Netflix wants to spend five billion to create uh new content and whether we decide on that idea or not we want to know its hurdle rate which directly relates to the weighted average cost of capital and what is the concept of this whole problem. So the weighted average cost of capital is the average rate of return a company must pay to its to all its security holders. So stockholders and bond holders to finance its assets. And why does this matter at all? Well, if Netflix new contract generates a lower return uh than the walk, the company loses value. If it's higher, they create value. That's why it's called a hurdle rate cuz if you were to imagine a track and field for instance that there are hurdles depending on the percentage of that number that is the hurdle rate and then companies have to go over that in order to generate profit or generate value might I say. And then for the variables that we're going to use uh we are specifically using the risk-free rate. So this is just the baseline return for zero risk. So usually uh US treasuries or if I were to invest in uh bonds for instance and we also have a market risk premium. So the extra return investors demand for being in the stock market versus buying risk-free bonds. And um we have Netflix specifics which are its equity, its depth, its beta. As you can see uh 1.3 relates to its volatility with the market. So it's 30% more volatile than the market. And uh we have the cost of debt which is 5.8%. So this is the interest rate they pay on bonds. And uh at last we have the tax rate at 21%. But we're not just using or we're just we're not just calculating a number and then um moving on from that. We are we are also comparing the status quo. So walk with current depth a leverage scenario if they were to borrow 3 billion more. And you can see or and you will will see uh at the end of this video how much of a difference that will make. And we'll also have a pure comparison. How does this compare to Disney or Amazon for instance? And this is their hurdle rates. So now that we clearly identified and and and went through the first step of the driver method, we will now represent so we will create a framework um mapping capital structure components to the walk and we we're going to use two main formulas. So first we are going to calculate the cost of equity using uh capital asset price the capital asset pricing model which is this formula as you can see here and then we're going to start with the safe rate and add a premium base on how risky Netflix is compared to the market using the beta of 1.3 and then we will use the walk formula as you can see here. Um and um just to give context uh v= e + d just represents the total value as you can see um here and uh yeah and then we have the tax shield and this is important because interest payments on death are tax deductible. What does that mean? So this means that the company will save money because uh they don't have to to pay taxes for it. So this makes that cheaper than equity and this is why we multiply the cost of debt by uh 1 minus t. And then uh regarding the pro project specific risk. So um with the idea that Netflix might want to fund international content as it as as it has done in past years. uh we will use the logic that international markets might be riskier than the US market and if a project is riskier then uh a risk premium should be added to the walk and then using the standard and and why do we do that essentially we do that because if we were to just use this the standard formula for a high-risk project we might mistakenly approve a bad investment and therefore um Netflix will then essentially lose value once they they approve and and and proceed with this project. So this is the theory and then in regards to the actual Python so the code that we're going to do this was the mod logic map that we we developed uh so we would define the inputs uh calculate weights uh calculate cost of equity calculate walk and then uh therefore and then adapt it by um implementing this second scenario which would uh relate to the international content. Uh now we implement. So this is the perfect time for me to actually come here and bring this over here and run the the actual code. But as you can see here uh we have the the inputs defined. we um have the the actual functions then we calculate everything uh so the cost of equity and then the walk and then we have the first analysis for that and we'll print that out and then in the the the last step we have a new scenario so adding uh three billion in in in loaning three billion or actually borrowing three mill or 3 billion sorry. So borrowing uh 3 billion how how that would make a difference. So we we changed that scenario and then um we have the sensitivity analysis which is the impact of of beta just to test overall the sensitivity and how that volatility can can also change a lot uh towards decision making of an actual company. And as you can see, the code works fine. And then uh we will go on and um continue talking about it uh throughout this this video. So I just wanted to show how that was done. And and I think uh the the represent and the the implement section of of this um kind of really go hand in hand. So So yeah, but we have done done that. Now we have to validate. So now we have to cross check with industry benchmarks and peer companies. So when when doing the peer comparison this is the following. So from our code we got a walk of a very high walk actually of 11.22%. uh and uh this is uh the industry average Amazon and Disney and as you're seeing these numbers you might think wow Netflix is significantly above the the industry range why why is that and uh this goes directly to uh the capital structure of Netflix so as an example Disney uses around 30% debt which is cheap capital and Netflix only uses 6% and this is based on on the weight of the the actual context of the the assignment and um and this capital structure deeply impacts uh Netflix ability to do riskier projects compared to to Disney or or Amazon. And the financial logic behind that is that debt is cheaper than equity for two main reasons. So one, you have lower risk. So bond holders get paid first. So they they accept lower returns. And there's also what I mentioned before uh on the the formulas that I showed, we we also have this tax shield. So the government effectively sub subsidizes that and uh making it tax deductible. So our analysis shows Netflix has a walk of 11.22% which is higher than Disney's 8.2%. This is largely because uh Netflix is underleveraged and uh we are funding almost everything with expensive equity and barely using the cheap debt. So Disney takes advantage of that and currently while analyzing our or Netflix's situation, we currently do not. And uh I mentioned before the idea of uh if Netflix were to to do international projects I you would have to add a a a two or 3% risk premium which would create a a higher hurdle rate and uh because the standard is 11.2 to Netflix might approve. We do this just because Netflix might approve a risky project that destroys value. I think um but I think we went went into detail on that as I mentioned uh this this risk premium uh two times throughout this video. But uh now we go to evolve. So so we have to have the recognition of all applications in capital budgeting and valuation. So how does Netflix actually use this number right? So we have to connect the walk to the 5 billion investment mentioned. So uh if the hurdle rate is at 11.22% any project must generate a return on cap or invested capital also known as roic higher than the hurdle rate. So if Netflix were to spend 5 billion on content that only returns five 10% they're technically destroying sharehold value. So it doesn't matter exactly uh the the the amount you're investing but the actual percentage of return that you're going to get and how uh if if that number is greater or less than uh the hurdle rate. So if it's greater good, if it's lower than the hurdle rate, bad. So because Netflix walk is high, their future cash flows are discounted heavily. So if they were to lower their walk by adding cheap depth, the value of of the firm mathematically goes up. So this would directly impact on the stock price. Finally, the risk adjusted walk. So in the international context so uh to analyze the risk regarding um working in other countries. So historically Netflix has uh produced a lot of shows uh in Brazil and also in South Korea like around six for instance and um it was a huge success. So, so it is possible, but looking at it through a financial lens, there has to be a little bit more uh a little bit more work towards how they're actually going to structure their capital. Now, in the final step of the the driver method, we have to reflect. So we have the insights on optimal capital structure and financing strategy. So as a conclusion really Netflix is underleveraged and is paying premium prices for its capital by relying too much on expensive equity. So my recommendation and the code's recommendation actually is to issue a $3 billion uh is issuing the $3 billion in debt. So the Python output showed that by adding this step it lowered the walk from uh 11.22% to 113%. And you can say oh but that's that's such a small difference. Oh my god. It it really isn't because if Netflix is a $2 200 billion uh dollar company, nine basis points is a is massive value creation and gives a lot of of leg room to work with. So as a result, Netflix should continue to slowly increase that moving closer to Disney's 30% ratio and they can do this as long as it doesn't spike their their beta. So their bankruptcy risk and um Netflix should therefore move away from a pure equity model. So by taking on more depth, they lower their their hurdle rate and this makes it easier consequently to approve new projects like the $5 million investment and then it it kind of is a has a snowball effect. So with that they're able to to create more content, have more subscribers or more yeah more subscribers and then a higher stock price and a higher valuation as a whole. So our analysis shows this lowers our cost of capital, increases firm value, and optimizes our capital structure without adding reckless risk. Because at the end of the day, uh although we can't define the future with 100% certainty, we're able to um have an idea of the risk involved and the necessary measures it takes to define a project as successful or not successful through uh math and and yeah, so I'll just show the code again just cuz I I I wanted to to to show how the sensitivity analysis, how beta really changes the walk and how that creates a huge impact. But yeah, it's a very straightforward yet clean uh code on on what what was done. So, thank you. This this has been my work and um and yeah.",
  "video_url": "https://www.youtube.com/watch?v=Y9oR5e3ZJis"
}