{
  "student_name": "Andrea Typaldos",
  "org_defined_id": "036748997",
  "username": "atypaldo",
  "email": "",
  "transcript": "Hi, my name is Andrea Typaldos and in session 8, I'm looking at one big question. If my model says GameStop is worth $12, but the market price is 200, then who's wrong? Is it me because my model is missing something? The market since it might be a bubble or a market just weird mixing fundamentals with psychology. That's the tension between market efficiency and behavioral finance. and I'll walk through how I think about it using driver. First, for driver, I define and discover and I define the problem. My core question is how efficient are markets really and what does that mean for my analysis and my strategy. My goals in this session are to understand the efficient market hypothesis also known as EMH. Uh it can be either weak, semi-strong or strong form. Then to connect EMH to real strategies like technical analysis, fundamental analysis and passive indexing. And third to bring in behavioral finance, how biases and hurting can make prices move away from fundamentals. This session is basically about answering this question. When should I trust market prices and when is there a chance to earn alpha? To represent uh the I now I have to represent the ideas with simple frame frameworks. First, EMH in plain language. Uh, I already divided it into three categories. Weak, semi, and strong. A weak form. In when they're in weak form, prices already reflect past prices and volumes. That means chart patterns shouldn't give easy profits. If it's semi-strong, prices reflect all public information, including financial statements, news, and earnings. And this means basic fundamental analysis shouldn't consistently beat beat the market. If it's in a strong form, prices reflect all the information, even the private one. And that means even insider trading wouldn't work, which we know is unrealistic, basically. Second, the event study picture to test efficiency around an event like earnings I think in three basic windows uh with the code I'm going to show um well the code you're seeing right now before the announcement is in minus 10 days to minus one and the event date would be day zero and after the announcement would be would be + one to plus five or 10 days For each day, I can compute the expected return from CAPM and the abnormal return, which the formula is actual return minus expected return. If markets are semi-strong efficient, most abnormal return should show up on day zero, not slowly over several days. Third, the behavioral finance overlay. Then I layer on behavioral ideas could be overcompetence, anchoring, hurting, loss aversion, mental accounting and abnormalities like momentum, value effect and size effect. This lets me compare the clean EMH world versus the real world with humans and biases. Next step is to implement with my Python code that you can see here. Now I implement a simple event study style simulation in Python. And I'll explain really quickly what I'm doing. I'm simulating daily market returns from day minus 5 to day + 5. Um using a beta to compute the stock's normal return. And I add a big positive surprise on day zero. I also add a small drift for a few days after and compute abnormal returns and see how much of the total move happens on day zero. When I run this code, I see abnormal returns before event which should be close to zero and a big um and a big abnormal return on day zero and the small a smaller abnormal returns on day 1 to three. The efficient ratio tells me what share of the total reaction happened immediately. If most of it is on day zero, markets look mostly efficient and if a lot happens later, that looks more like a drift in possible efficiency. So here is my complete code and when I run oh sorry when I run it you can see here um the post earning announcement drift simulation with all the percentages in market stock and AR and the day from minus zero sorry from minus 5 to five and here I also put a summary um so then I validate And the next step in the driver framework is to validate. And in validate I ask myself is this pattern real or is it just noise? And I have to check first statistical significance which means that are average like I have to ask myself are average abnormal returns really different from zero. Then I check economic significant significance where I ask myself are they big enough to matter after fees and trading costs. Then I have to check persistence where I ask myself does this pattern show up across many stocks and time periods not just one lucky sample meaning are there any outliers basically if it if the drift is tiny or disappears when I include costs the prob it's probably not an exploitable inefficiency um then next step in the next step in the driver framework I evolve and in evolve I apply the lesson more broadly Let's say for big liquid markets my view is mostly efficient then there may still be pockets of inefficiency uh especially where information is complex attention is limited or behavioral biases are strong that suggests a hybrid strategy which I should use passive index funds as a core to respect efficiency and I should add targeted active strategies only where there is good evidence of persistent abnormalities. ities. My last step in the driver framework is to reflect and I reflect on what this means. I decided to reflect in this session what this means for me as an analyst as an analyst personally. Uh first of all, I shouldn't assume the market is dumb just because my model says a different number. Second, I learned that EMH gives me a discipline check. Prices usually contain a lot of information. Uh and thirdly, behavioral finance reminds me that humans are not fully rational and sometimes that creates opportunities. So my big takeaway is to treat the market prices as a strong sharing point but not as the final truth and to combine respect for efficiency with healthy skepticism and a datadriven search for real validated anormalities. And well, that's my driver walkthrough for session 8 and my code. Thank you.",
  "video_url": "https://youtu.be/fonGDaO2Wwg"
}