{
  "student_name": "Charlie Garrison",
  "org_defined_id": "036207648",
  "username": "garris26",
  "video_url": "https://youtu.be/EZ5gX16Oi2w",
  "transcript": "0:00\nHello, welcome to my capstone project\n0:02\nfor financial management 310.\n0:06\nUm, and for my capstone, I built an AI\n0:08\ngoal-based investor planner. Um, and the\n0:12\nmain reason I chose this is because I\n0:15\nsaw I thought of a common problem that\n0:17\nmany students and young investors have\n0:19\nis that they don't know how much uh they\n0:21\nshould save or invest each month to\n0:23\nreach a future goal. Um, and this can be\n0:26\nwith college savings or just investing\n0:30\nin stocks or whatever. Um, uh, and then\n0:33\nso the user for this specific problem\n0:35\nwould be mostly college students, early\n0:37\ncareer professionals or anyone new to\n0:39\ninvesting or just getting into it. And\n0:43\nour goal here is to build an AI that\n0:45\ncalculates how much to save each month\n0:47\nand then explains the reasoning behind\n0:49\nit. Um,\n0:52\nso that not only does it give you an\n0:54\nanswer, but it tells you why they got\n0:55\nthat. Um, and this matters because it\n0:57\nturns complex finance ma financial math\n1:00\nproblems into simple simple personal\n1:02\nguidance that anyone can use and making\n1:06\nit accessible to anyone even if you're\n1:09\nnot in a finance major or financial\n1:12\nmanager manager as well. Uh, the next\n1:15\nstage of our driver framework is to\n1:17\nrepresent. So, our approach here is to\n1:19\nuse an AI language model. And I chose to\n1:21\nuse chat GBT just because I'm most\n1:23\nfamiliar with it and I know that it can\n1:25\ndeliver\n1:27\num\n1:29\nwell-informed results. And so, I'm using\n1:33\nthis to combine simple time value of\n1:35\nmoney math with human style financial\n1:37\nadvice. So, the input that I'm going to\n1:40\nbe using is a user goal amount, a time\n1:43\nframe, and the expected return as well\n1:45\nas a risk level. And the output that I'm\n1:49\num predicting is a required month\n1:52\nsavings plus as well as an explanation\n1:54\nof recommended investment type whether\n1:57\nthat's safe, balanced or an aggressive\n2:00\num take on it. And so next was to\n2:04\nimplement and so for the implementation\n2:07\nstage I built the interactive AI planner\n2:10\ndirectly in chat GBT. Um and the tool\n2:14\nasks users to for their goal amount and\n2:17\nexpected annual return then calcit's\n2:19\nrequired monthly savings using the\n2:20\nfuture value of an and an unity formula.\n2:24\nSo basically I just started by giving\n2:29\nchad a prompt. I said you are an AI\n2:32\nfinancial planning assistant. Your goal\n2:34\nis to help users plan for their future\n2:38\nsaving goals in a simple and personaliz\n2:40\npersonalized way. And I said for it to\n2:42\nask three questions, one at a time. What\n2:44\nis your total goal amount? So that's the\n2:47\nfirst one I said. So once I submit this,\n2:49\nthat should be the first thing that the\n2:51\nchat AI financial planning assistant\n2:55\nresponds to. And then after that, these\n2:57\nare some follow-up questions. How many\n2:59\nyears until you want to reach this goal?\n3:01\nAnd then what annual return do you\n3:02\nexpect on your investments? Uh for\n3:05\ninstance, 5%, 7% or 10%. And then I said\n3:10\nfor it to calculate the required savings\n3:11\nusing the future value of annunity\n3:13\nformula. So I gave them that formula\n3:16\nthere that they could use and then also\n3:17\nto solve for the monthly payment using R\n3:20\nis annual return divided by 12 is which\n3:23\nis how many months there are um and then\n3:26\nthe number of years as well. And then\n3:27\nafter calculating\n3:29\num I just told it to explain certain\n3:32\nthings like the monthly savings and the\n3:34\ntotal amount contributed versus the\n3:35\ntotal amount at the end. Um, and then I\n3:39\nalso wanted to format it. So I said for\n3:42\nit to give me a goal summary, which is\n3:44\njust restate the user's goal and time\n3:46\nframe, a monthly savings needed. So this\n3:48\nis the dollar amount rounded to the\n3:50\nnearest whole number, and then an\n3:51\ninvestment strategy. So that's just a\n3:53\nshort paragraph tailored to the user's\n3:55\ntime and risk. Um,\n3:58\nand then I said, end by inviting the\n4:00\nuser to test another scenario. Um, and\n4:04\nso as you can see here, the chat says,\n4:06\"Got it. I'll follow the formula\n4:08exactly.\" And then as stated here, the\n4:11\nfirst question that they asked me is,\n4:12\"What is your total goal amount?\" Um,\n4:16\nalso just like the total amount of money\n4:18\nthat you want to save uh like at the end\n4:22\nof a certain amount of years is it's\n4:24\nbasically explaining here. Um, and so\n4:28\nlet's test the tool with a real world\n4:30\nexample. So, we can go down in the\n4:32\nprompt chat again and maybe let's type\n4:36\nmy goal is to save\n4:39\num let's say $10,000.\n4:44\nAnd we got to give it a time span. So,\n4:45\nwe'll say in three years. And then we\n4:49\nalso want to give it a return\n4:50\npercentage. Uh so, let's say with a 7%\n4:57\nuh return.\n4:59\nAnd let's insert that.\n5:02\nPerfect. Let's calculate it. And so now\n5:05\nit's looking at what I gave it. Um, so\n5:08\ngiven the goal future value of 10,000,\n5:11\nthe\n5:13\nuh time 3 years, it t times it by 12\n5:16\nmonths. So that that's how it gets that.\n5:18\nAnd then I it takes my 7% annual return\n5:22\nand divides it by 12 months again. So\n5:24\nthat's how it gets the monthly rate. Uh,\n5:26\nand then it uses the formulas that we\n5:28\ngave it earlier with future value and\n5:30\nthen it plugs in the values. Um, and you\n5:33\ncan see here that the goal summary is\n5:35\nthat I want to save $10,000 in three\n5:38\nyears while earning an average 7% annual\n5:41\nreturn. And so that's my goal right\n5:44\nthere. And the monthly savings needed to\n5:46\nreach this goal is $263\n5:49\nper month. And so this is very important\n5:52\nto know.\n5:53\nI I didn't basically I didn't have to do\n5:55\nany of this calculating myself. I just\n5:57\ngave it to this financial advisor and\n6:01\nthey told me exactly how much I guess\n6:03\nthey rounded down a little bit 6 263.3.\n6:07\nHowever, now I have a clear um goal,\n6:11\nmonthly goal of how much I need to save\n6:13\nin order to reach this goal. Um and you\n6:18\ncan see here that also says that this\n6:20\ntarget fits a balance plan. So, you know\n6:22\nhow we gave it uh the option to give me\n6:24\na aggressive plan or maybe a\n6:27\nconservative plan. So, this the default\n6:29\none I guess just decided to do a balance\n6:31\nplan just because I didn't specify\n6:32\nwhether I wanted to be aggressive or\n6:34\nnot. Um and so this is the investment\n6:36\nstrategy that I also told it um to do at\n6:40\nthe end here after the monthly savings\n6:43\nneeded. Um, and so it's giving me advice\n6:45\nhere, um,\n6:48\nthat saying a mix of index funds like\n6:51\nthe SPD, S&P 500 ETF and short-term bond\n6:54\nfunds would balance growth and\n6:56\nstability. So that's very important to\n6:58\nknow. Um, and so we can just see how the\n7:03\nAI generated a full explanation of the\n7:06\nformula, the monthly savings amount,\n7:08\nwhich was around $259,\n7:10\nand also a short investment strategy\n7:12\nthat balance risk and reward as well. So\n7:14\nbasically, this demonstrated that the\n7:16\ntool not only does the math, but it also\n7:18\ntranslates the output into practical\n7:21\nfinancial guidance for different users u\n7:24\ndepending on the circumstance. I just\n7:26\ncame up with a random circumstance. Um,\n7:30\nbut it can you can put in anything as\n7:32\nlong as you give it those three. Um, how\n7:35\nmuch you're saving, the percentage, and\n7:37\nthe uh how many years you want, the time\n7:40\nframe. Um, and so our next stage is to\n7:43\nvalidate. So, I tested around two to\n7:45\nthree different examples just to verify\n7:47\nthat the monthly savings adjusted\n7:49\ncorrectly when goals, time periods or\n7:51\ninterest rates change like I just said,\n7:53\nyou know, because it depends. Not\n7:55\nthere's not one set um scenario. It's\n7:58\neveryone has a different financial\n8:00\ngoals. So, I had to make sure that that\n8:03\nworked. Um and next, I confirmed the\n8:06\nreasoning matches each person's\n8:08\nscenario. So for short-term goals, they\n8:11\nrecommended safer portfolios and then in\n8:14\nlongerterm goals uh allowed for more\n8:16\naggressive investing. Uh and then I\n8:19\nchecked the math uh to make sure that it\n8:22\nwas directly accurate. So I just did\n8:24\nthis by um having knowing the formulas\n8:28\nmy myself and based on the inputs I just\n8:31\ncalculated it myself and it showed up to\n8:34\nbe the exact same. Um, the only\n8:36\ndifference was that the AI assistant\n8:39\nrounded uh my monthly savings. Um, which\n8:43\nis fine because that's actually makes it\n8:45\nmore simple and easier for me to have uh\n8:48\njust a set goal unless I really wanted\n8:51\nto be specific. Um, in which case I\n8:54\ncould just probably tell it to not round\n8:57\nup or whatever or just round. Um\n9:01\nand so the higher goals or short shorter\n9:03\ntimelines led to higher savings\n9:05\nrequirements as well. Um and then our\n9:07\nnext stage is to evolve. So um from here\n9:11\nto improve this financial planner, the\n9:14\nnext step I would take is to maybe add\n9:16\nsliders or user inputs using maybe just\n9:18\na simple web app um like Google Sheets\n9:21\ninterface or something like a stream\n9:23\nlit. And then also to include a small\n9:26\nvisual showing the growth over time and\n9:28\nthen the total contributions versus\n9:30\nreturns. This will just give the user uh\n9:33\nnot only a set number of how much to\n9:36\ninvest but also you know maybe a bigger\n9:39\ntimeline or just a visual to look at to\n9:41\nmake it easier um to process the\n9:45\ninformation especially if they are new\n9:47\nto investing. Um, and then finally, I\n9:50\ncould expand to handle like maybe an\n9:52\nemergency fund planning or retirement\n9:55\ngoals, something that's not just um a\n9:58\nfinancial goal, but maybe something more\n9:59\nspecific like a debt payoff scenario um\n10:02\njust to reach a broader broader audience\n10:05\nof people. Um, and the final step of the\n10:08\ndrive framework is to reflect. And so I\n10:10\nlearned that combining AI reasoning with\n10:12\nfinance formulas produce clear and\n10:15\npersonalized advice. And the hardest\n10:17\npart uh with this capstone project was\n10:20\njust prompting the AI. Uh it took me a\n10:23\ngood amount of time just to get the the\n10:26\ninitial prompt um to run the financial\n10:30\nadviser, but once I got that um\n10:33\nit was pretty um the AI did more of the\n10:37\nwork just cuz they're the ones that were\n10:39\ntrying to help me out. Um so the hardest\n10:41\npart was just the prompting uh trying to\n10:44\nget the explain both the math and the\n10:46\nhuman reasoning behind the numbers. Um\n10:48\nand finally this project showed me how\n10:50\nAI can make financial planning simple,\n10:52\ninteractive and accessible to anyone and\n10:55\nnot just the financial experts. So that\n10:57\nis my capstone project. Thank you for\n11:00listening."
}