{
  "student_name": "Anne Pumphrey",
  "org_defined_id": "037166275",
  "username": "apumphre",
  "email": "",
  "transcript": "Hello everyone. I'm Ann Pumphrey and to start off this assignment, I wanted to define what my goal is. So the goal is to determine if Starbucks should accept or reject a proposed flagship grocery project by eval by evaluating its financial availability using capital budgeting metrics and sensitivity analysis benchmarking against the WACC of 8.5%. And I also wanted to define the project parameters as well as the goal. So the initial investment is um $12 million which is for building equipment training um and is depreciated straight line over 10 years. Working capital is $500,000 deployed at launch and recovered in year 10. Revenues are $8 million in year one, $11 million in years two through five, and $9 million in years 6 through 10. And then operating costs, the cost of goods sold is 40% of the revenue. Um, labor costs are $12.5 million or $2.5 million. Rent and utilities is 0.8 million. marketing is 0.3 million in year one and then 0.1 million thereafter. Um taxes are 25% corporate rate terminal value um $300 million at the end of year 10. So after doing this I wanted to make sure that three components were represented in my model um which include the cash flow timeline metric calculations and sensitivity analysis. So as you can see here is my code and if I click run it runs and so right here is all the parameters set and all the calculations are shown here and then the results are given at the very bottom. So for each year 0 through 10 um the ICF and DCF are given for each year. So um the code does three things. It sets the rules which are also known as the parameters. Um it defines all of the starting numbers. So the cost, revenue, tax in the WACC. Second thing it does is calculates the cash flow. So it figures out how much actual cash the ro street brings in or pays out each year. And then the third thing it does is runs the test. So whether that be metrics or sensitivity um it checks the NPV IR and whether the project survives survives if costs go up or revenue goes down. Um the key to the model is the incremental cash flow also known as the ICF um which is actual cash moving in and out of the project. Then the next thing I wanted to do was validate my information. Um so first thing I checked was the ICF. So the calculation correctly handles depreciation. Um the tax shield changes in working capital and the terminal value. Uh the year zero outflow correctly includes both capital expenditure and initial working capital. Um, so once I knew that was correct, the next thing I wanted to check was the depreciation. So annual depreciation is correctly set at $1.2 million for all 10 years. And then the WACC or otherwise known as the hurdle rate. Um, the correct 8.5% hurdle rate was applied for NPV and IRR comparison. And then the last thing I checked was sensitivity. So the scenarios were correctly isolated and recalculated. The IRRa remains the same in the WACCC stress test because the cash flow schedule is unchanged and irr is an intrinsic rate of the project's cash flows. So, after looking over everything and reflecting on all the work that I've done, um, I found that the proposed flagship roaster project is strongly recommended for Starbucks to accept.",
  "video_url": "https://youtu.be/SI059SzkSJM"
}