{
  "student_name": "None None",
  "org_defined_id": "035713425",
  "username": "aemenhi",
  "video_url": "",
  "transcript": "Hello, my name is Alexander Emenhiser. It is currently Tuesday, November 25th, so I'm getting a bit of a head start on this, but this is my video for mini project 3. So in this video u our goal is to build a more advanced AI finance tool using uh in this case I'm using N8N um to explain or advise on some sort of financial decision. Uh so this is a bit more advanced than uh what we had before in mini project 2. I built a a inflation calculator. So, it just did the inflation calculation, but it didn't really um advise on anything. So, my goal for this project was to build something a little bit more advanced than that. Um, I mean, I'm still very, very new to this. And this AI stuff is not my strong suit. Um, but I think I was able to build something that uh at least sort of makes sense. Uh, as we'll see here, it's still pretty pretty basic. Um but through you know a couple hours of work and a few iterations um I was able to make something that actually did work. So I was pretty proud about that. So the first step of our driver framework as we always do in these scenarios is to define and discover. So basically that's uh identifying the problem that I wanted to solve. And in this situation uh I wanted to look at something that I think is really really re relevant to a lot of students coming uh out of college and that is to uh whether they should invest their money or pay off debt first. Uh a lot of us uh are going to be going into a lot of debt with taking out loans for college and we also want to start building up uh our funds as well. So, you know, balancing saving for, you know, something like retirement or, you know, trying to pay off student loans as quickly as you can, uh, can be a source of stress for a lot of people. So, building some sort of a model through NAN here, I think, is really, really relevant and can help a lot of uh, people my age uh, sort of ease their worries a little bit, I guess. So um the way that I wanted to sort of make the AI smarter and the R the reason of our driver framework is I just said this plain English output here. Uh I think that there's a lot of jargon that people experience when dealing with something like investing. Um, you know, and a lot of people, especially coming right out of college, not having a lot of experience in sort of investing or paying off debt, may not necessarily understand all of the phrases that people use. Um, so having some sort of AI model that can explain this a lot more clearly, I think, can be something that'll be a lot of benefit to people. And that's sort of the reasoning behind creating this is to make it sort of streamlined and really easy to use and easy to understand. So now that I've sort of defined and discovered you know what a pro what a problem that a lot of people are facing and sort of defined you know what I want to do with it and then the reasoning behind why I do it and you know kind of the big overarching goal of this project. Uh let's go to the implement stage and here I will show you sort of my background information that I have. Um so we see here I've executed already. Uh I I'll do another execution but just to kind of uh give some background here. Um, so I was able to use the assistance of the NAN AI to help kind of give me some ideas on, you know, different parameters and nodes that, uh, I wanted to execute here. uh since this is still something that's relatively new to me. But uh what I did was I used uh OpenAI like mini project 2 uh as our sort of uh AI model and I was able to use the same API key that I got for the second mini project uh for this one to um sort of assist in my uh model building. uh scenario here. Uh and then we had our workflow config configuration which uh then sent the uh data to my data table. And we see here I can have I have a diff couple of different iterations uh that I use just playing around with it trying to uh figure it out a little bit um here in the past and then uh it was able to calculate the financial metrics and then it took all of the data that uh I someone would input into the model send it to the financial advisor AI uh using our AI And here's the message that uh I was able to come up with um here. So this is sort of what I wanted our financial advisor to um kind of frame their message around. Uh, and I think that's kind of the big difference between using something like this and then just simply going to chat GPT is it's not going to have this like specific format uh really easy to understand uh sort of stepbystep uh things that we have here. We have our recommendation here, our key findings, action plan, uh reasoning, important considerations. Like a simple chat GBT prompt isn't going to give you all of that. It also this will make it easier to sort of input uh all of our data into one specific thing. So now that I've sort of explained a little bit, let's go ahead and execute a workflow. So we can see here, this is sort of the workflow that uh our prompt came up with. Now, when I first started this, and this is kind of the loop one, as there's a couple loops that I did, I probably did about four or five trying to optimize it as much as I could, but sort of the base loop that I did was just simply total debt amount, uh, monthly expenses, and my age. Uh, so I didn't really have all of these other things like interest rate. That's a big consideration uh for something like student loans. Um, I didn't have like your emergency fund. Uh, I didn't have whether you got a 401k matching, which is a big consideration when investing as you're able to get a lot more out of it. Um, so adding those things uh really makes it more real life. I think there's a lot of different variables uh when investing in real life. So having something like this, I think makes it a lot more clear uh with everything. So, I'm going to go ahead and implement one of these nodes. So, let's say 50,000 is about reasonable. Um, for how much you're going to have a student loans, about 6% or so. Uh, let's say we have about 4,000 extra. Uh, most people about 10,000. Um, let's say we're just starting off, so they don't. Um, monthly expenses about 3,000. and say you're graduating at age 22. So submit our form and then the workflow should\n\ngive us some sort of output. And we can see here each node executed correctly. And this\n\nuh\n\nand we can see here our recommendation. I guess not quite as clear as before. Um but you're able to see if this were organized more clearly. Uh which it was before. I don't quite know what I did, but uh this just gives you sort of different things that you could consider um\n\nwith\n\nthat. So\nthese are the inputs or the output that our AI model would have following our steps. And we can see here uh this new one that I created uh pops up on our data table as well. And we have a bunch of different nodes that I created there. So this is kind of the verify scenario. Um, for whatever reason, you know, this is not uh as organized as it was before. I must have hit something. But, um, you know, checking with real life scenarios, uh, this does, uh, help a lot, I think. And, you know, accuracy, uh, each in output is, um, correct based on, you know, what I put into the system. So that means that you know it's working correctly and that the AI is taking the uh the data that I've had more clearly. Um and now the next step is to evolve. And this is something that uh you know looking beyond sort of my skill set I guess. And uh you know I think that a great thing that this project or this node could have is to you know have some visual uh aspects to it. uh you know maybe having like you know how your debt would go down uh over time based on how much you pay or something like that something that is easy to uh grasp for people. I mean, as we had it earlier, it was pretty easy to understand and the AI was able to explain it pretty well. But having those visual components, I think could really make it stand out. And that's a bit beyond my skill set. Um, but I think that that would be valuable uh if you were able to implement that into the project here. Um, now what's different about building with the AI as a component is you're able to kind of structure the output that you want it to give to someone. Um, if you just use chat GPT, um, straight up, uh, you're not really going to know what output you get based on, you know, inputting all that data I have. But by having something that I can control, I'm able to sort of frame it into the reference uh that I want it to look into. Um, so it gives a much more structured response and a much more focused response. It's not going to give you a bunch of jargon uh or stuff that just really isn't necessary. Um, which I think is, like I said, the the big difference um between this. So, I talked about my loop and I mean my second loop and you know I had a bunch of different loops trying to continuously change this over the couple hours that I worked on this. Um, but I wanted to uh include more things like I said and uh you know include something like does your uh employee match your 401k contributions and stuff like that. something that'll make it um a little bit easier to to understand. So, I think it's really important to uh as it says here, overrusting AI. So, you know, like I said, I was able to use this NN AI uh as an assistant in building this, but I didn't want to uh rely solely uh on it. Um so, I was able to I also, you know, watched the video that we had in class as another sort of background check to make sure that the AI was following everything that it should. Um, another thing is, you know, just blindly uh taking what the AI gives you and going with it. You need to a make sure that you know it's outputting the right data, but b you know take that information that the AI gives you like in this scenario here and um you do your own research based on that and see you know is this correct? is the AI giving you reasonable uh scenarios that you think that you can use. Um, and I think that'll help make uh your financial decisions a lot more clear. So, that's sort of my overall project. I understand that it's still pretty simple, but I mean, this is the first time that I've really done something uh as advanced as this with AI. So, I'm pretty proud of uh how it turned out and uh I'm looking forward to the final mini project with the capstone project um where we will be able to build the future of finance since we know that AI is going to play a big big part in that. Uh getting ahead of the curve in a course like this is really really important. So building my base knowledge uh has been a big help. So this has been my mini project 3 where we've analyzed whether you should invest or pay off debt and I will see you in the next video. Have a happy Thanksgiving. Thank you."
}