{
  "student_name": "None None",
  "org_defined_id": "035875419",
  "username": "carro146",
  "video_url": "",
  "transcript": "Guys, my name is Abigail Carroll and this is my AI powered financial planning tool built in N. So, the idea is quite simple. A user types in their situation in normal English. For example, how old they are, how much they make, what they've saved, and their goal. And this tool, one understands that context, two runs real financial calculations on different investment scenarios, and three explains the results in plain English with trade-offs and warnings. It's meant for people who know what they want. Like, I want a down payment in 5 years, but don't really understand what it would take to get there. Okay, so here's the overall workflow. A trigger to run the workflow or one, a trigger to run the workflow. Two, a node where the user's natural language description goes in. Three, an AI node that turns that text in structured data. four, an HTTP node that pulls external data from API. Five, a code node that runs financial math and sanity checks. And six, a financial AI node that explains everything back to the user in a detailed, friendly report. So, in the first version, loop one, my workflow only used a single AI node. The AI could respond to the user's message, but it couldn't reliably extract numbers. It didn't perform any calculations. It had no guard rails and it often gave high-level advice without explaining why. So my loop 2 is a lot more trust for trustworthy. So I redesigned the entire workflow so that AI became just one component of a larger system. So let's start by doing the manual. So the first node is just a manual trigger for this demo. This lets me run the tool by clicking execute workflow like a test harness. So when I execute the step, this is what comes out of it. Um,\n\nso I'm 21. I make about $40,000 a year. I have $5,000 saved. I want $50,000 for a house payment in 5 years. I can save $400 a month and I'm a moderate risk. I also have $20,000 student loans at 5%. So we get to know that information. So now um so that's a real version that this could come from from a form or chatbot chatbot but here I'm simulating what a user would type. So now for the message model the so this note is the first AI step. I'm using open AI's GBT 4.1 mini model here. So the system message tells the model to act as a financial intake assistant and to output strict JSON with specific fields age, income, current savings, monthly contribution, goal type, goal amount, years to goal, risk tolerance, debts and notes. The user message is just a raw user message from the previous node. So the job of this node is to turn messy English into clean structured financial data. So, here is our JSON output. You can see it extracted age 21, annual income $40,000, current savings $5,000, monthly contribution 400. The goal type or the goal amount which was $50,000, years to goal which was 5 years, risk tolerance which is moderate and even a debts array for the student loans which is at the bottom part. So this is the understand context part of the assignment. So next is the HTTP request. So for this project, the requirement is to integrate external data via an API. So I'm calling a simple public JSON endpoint in a real production version. This could be a live interest rate or inflation API. The important thing is my workflow can pull data from outside, not just from other users. And if we just wait for that output, this will be our proof\n\nsomeday.\n\nThere we go. So this is the um external information. This is where it gets a little tricky. So this is our code in Java.\n\nUm, so this code and JavaScript node is the math engine. So let's see if this gives the output that we're hoping for. Awesome. So it takes the parsed profile from the first AI node and runs real financial formulas. Inside the code, I parse the AI's JSON output and then define three scenarios. One, conservative, so 3% annual return. Two, balance 6%. And three, aggressive, which is 8%. Here\n\nwe go. 8% 6% 3%. Um, so use and then use the stand standard future value formula that combines the existing savings and the monthly contribution over years to goal which is 12 months.\n\nUm, then it builds scenarios array with name, assumed return rate, projected value at the end of 5 years and risk level. I also added sanity checks. For example, I compared the annual savings to the user's income. So, if the if the savings rate is above 60% of income, I push a warning like savings exceeds 60% of income. Unrealistic. Um, which I really like the risk level because I feel like that's something that a lot of people would need. And then the warnings, which there's nothing there right now. um all of that is is returned as structured JSON. So here you can see the original profile, three scenarios with projected values and any warnings that the math generated which was none. So this is how I address the rubrics part about the accuracy and robustness. The numbers are coming from deterministic code not from model hallucinating. Okay. So now this is the why. So the last note is the advisor/explainer AI. The system prompt tells it you're a cautious financial coach. Don't give product recommendations or tell the user exactly what to buy. Use markdown. Create a comparison table of scenarios and explain risk versus return and include warnings in a disclaimer. So the user message passes in the profile JSON. the scenarios from the code node and any warnings. So here we are going to get our output. There we go. Final here's the final output. So it one summarizes the user's goal savings $15,000 in 5 years for a house down payment. two generates a markdown table comparing three scenarios with name, assumed return rate, projected value, risk level, and how close each gets to the goal. Ex. So three explains the trade-offs in plain English, like how conservative options are safer but fall short, while aggressive options get closer but have more volatility. Four surfaces warnings from math. for example, noting that even aggressive scenarios still fall short of the $50,000 target under these assumptions. And five ends with a clear disclaimer that this is educational, not for personalized financial advice. This is where my tool moves moves beyond just doing the calculation and actually explains the why to the non-expert user.\nSo in my version one, this was just a single AI node that responded to the user's message directly. It could give some highle advice, but it didn't understand the numbers in a structured way. It wasn't doing its own calculations, and it couldn't easily elucinate or contradict itself. In version two, which is what I've shown here, I added a dedicated intake step to extract a structured profile, a code step with real financial math, sanity checks on savings versus income, an external API call, and a final AI explanation layer that consumes the structured outputs and warns about limitations. Building it this way felt very different from just asking GBT a question. I had to to think like a system designer. What would AI do versus what should code do? How do validate inputs or how do I validate inputs and outputs? And how do I keep the model from overstepping and giving overconfident advice? I would not trust this tool on its own to manage real money, but I would trust it as a planning and educational tool to help people understand what's realistic for the goals and what trade-offs they're they're making. So overall, this project showed me how to use AI as a component inside a financial workflow, not just a chat interface. Thank you so much for watching."
}