{
  "student_name": "Graham Hubertz",
  "org_defined_id": "036212822",
  "username": "ghubertz",
  "email": "",
  "transcript": "Hi, my name is Graham Hubertz doing the Session 9 assignment for Management 310. So our assignment today is to calculate the weighted average cost of capital, WAC, for Netflix in connection with the hypothetical $5 billion content investment decision. Your analysis must determine current WAC, evaluate the impact of additional debt financing, assess project-specific versus firm-wide discount rates, and compare Netflix's cost of capital to industry peers. So I'll read over the overview. I'll show you what I put into Gemini and the code and summary that is spat out and what our result is. So first, we'll go over the overview. So Netflix financial parameters are hypothetical. Our market capitalization is $200 billion. Our total debt at the book value is $14 billion. Debt at the market value is $13 billion. Our equity beta is 1.3. Our bond rating is 3Bs plus or BBB plus, which our yield is 5.8%. Our corporate tax rate is 21%, and our current stock price is $450. So our market conditions. Our risk-free rate on a 10-year treasury is 4.5%. Our market risk premium is 5.5%. Our media industry whack range, 8% to 10%. Our strategic context. Next, so Disney's capital structure is 70% equity and 30% debt, which our WAC is 8.2% for Disney. Amazon Prime Video uses Amazon corporate WAC, which is 9.5%. Netflix is considering $3 billion additional debt issuance for content investment. So a required analysis, we are supposed to calculate Netflix's current WAC, determine the WAC after $3 billion debt issuance, evaluate project-specific WAC, U .S. content versus international content, and compare Netflix WAC to Disney and explain differences. And then we recommend optimal capital structure strategy. So we'll use the driver framework requirement for this, which is discover, represent, implement, validate, excuse me, evolve, and reflect. So I will go over into Google Gemini. I said to Gemini, I have an assignment due for class today and I want you to use the KISS method. Keep it simple and stupid when making the video while also following the driver framework. I also had a spit me out code, which I'll show later on. So as we'll scroll down, I put in the prompt that we just wrote over. Okay, so here we go. Here's our WAC calculation. So for the first two letters of driver, discover and represent, here's our current WAC calculation. The weighted average cost of capital is the minimum rate of return a company must earn on its existing asset base to satisfy its creditors and shareholders. The formula for WAC is WACC equals in parentheses E over V times RE, which is our cost of equity, and then in parentheses D over V times cost of debt, times one minus corporate tax rate. E is our market value of equity, which is our market cap. d is market value with debt v equals e plus d is total value of the firm r with the little e is cost of debt equity r with the little d is cost of debt t with the little c is corporate tax rate so we'll calculate the cost of equity first is r with the little e we use the capital asset pricing model cap m and our equation here is r with the little e equals r with the little f plus beta times and in parentheses r with a little m minus r with a little f which our risk-free rate which is our r with our little f is 4.5 percent our equity beta is 1.3 percent and our market risk premium which is our r with our little m minus our r with our little f which is 5.5 percent so we plug those in we have 4.5 percent plus 1 .3 times 5.5 we get 11 .65 percent so now we calculate the cost of debt, which is R with a little d times 1 minus T with a little c. The after-tax cost of debt is used because interest payments are tax deductible. So we use our pre-tax yield, which is R with a little d, which is 5.8%. Our corporate tax rate, which is T with a little c, is 21%. So we plug those numbers in. We have 5 times 8% times, and in 1 minus 0.21, which gives us 5.8% times 0.79, which gives us 4.58%. Now we go into calculate capital structure weights, which is E over V and D over V. E is equity, which is $200 billion. Debt is $13 billion for D. Total value is $200 billion plus $13 billion, which equals $213 billion. So our weight of equity is 200 over 213, which is 93 .9%. Our weight of debt is 13 over $213, which is 6.10%. So now we calculate our current WAC, or weighted average cost of capital. So now we put these in. We have 93.9% times 11.65% together, plus 6.1% times 4.58 % together, which would give us 10.94% plus 0.28%, which gives us 11.22%. So, current Netflix weighted average cost of capital is 11.22%. So, now we implement. We use WAC with additional debt. Netflix is considering a $3 billion additional debt issuance for the content investment. This changes the capital structure, but is assumed not to change the cost of debt or cost of equity for simplicity, which is our KISS method assumption. So now we go into new capital structure weights. So new debt, which is D, new, is $13 billion plus $3 billion, which gives us $16 billion. Our new total value, which is V, new, is $200 billion plus $16 billion, which gives us $216 billion. Our new weight of equity, which is E over VNU, which is our new total value, is 200 over 216, which is 92.59%. Our new weight of debt, D over VNU, which is 16 over 216 dollars, billion dollars but same thing, is 7 .41%. So now we calculate the new WAC. Our WAC new is 92.59% times 11.65% together, plus 7.41% times 4.58 % together. So we have 10.78% plus 0.34%, which gives us 11.12%. So, our weighted average cost of capital after $3 billion debt issuance is 11.12%. So, our impact. The WAC decreases slightly from 11.22% to 11.12% because the firm is replacing expensive equity financing with cheaper tax-advantaged debt. So, now we go into validate. Project -specific versus firm-wide WAC. A firm's WAC is the average hurdle rate. However, a single firm-wide WAC is often an inappropriate discount rate for all projects. So, our project type, U.S. content firm -wide WAC, which is 11.22%. Irrational here is Netflix's core business slash market, and the project risk likely aligns closely with the company's average risk profile, which is our beta. International content, our project-specific WAC, which gives us a higher percentage. The rationale here is that the international expansion, especially into emerging markets, is generally riskier than the U.S. core business. The project's cost of equity should be higher. Use a higher beta to reflect the country, currency, and political risk. A firm wide whack would understate the true cost of capital for a riskier venture. So now E and R. Evolve and reflect industry comparison and strategy. So we compare this to peers. Netflix's current, their weighted average cost capital is 11 .22%, so our capital structure is 93.9% over 6.1%. The key difference here is we have a high WAC, extremely low debt usage, resulting in a very high reliance on expensive equity financing. Disney's WAC is 8.2%, with a capital structure of 70% over 30%. This is our lowest WAC. They have a significantly higher debt usage, lowering the overall cost of capital. Disney is a more mature business with stable, predictive cash flows, allowing for more debt. Amazon Prime Video's whack is 9.5%, and we just have a corporate whack here for our capital structure. The difference here is that it uses the whack of its parent, Amazon, which has a more diversified, lower-risk profile than a pure-play streamer like Netflix. In our media industry range, 8% to 10%. There is no capital structure here. Netflix's WAC is above the industry range, indicating its capital structure is suboptimal. So, our optimal capital structure recommendation. Our recommendation is that Netflix should continue to increase its debt usage to move its capital structure toward the industry average, which is closer to Disney's 70-30 fraction. Our rationale. The debt is currently the cheapest source of financing, 4.58% after tax, compared to equity, 11.65%. Increasing debt lowers the WAC, maximizing the firm's value. It provides tax-shielding benefits as their interest is tax-deductible, and it signals confidence and financial maturity to the market. So, in conclusion, the $5 billion content investment is a good catalyst to increase debt financing. While the initial $3 billion debt issuance marginally lowers WAC to 11.12%, Netflix should continue to issue debt until its financial risk profile, its credit rating, begins to deteriorate, which will provide the greatest benefit to shareholder value. So, I had to import this into Python code and into Collab, as here is our Python code. This goes over what we just talked about. As our Python code goes over every single frame of driver framework as discover and represent, our implement stage here, our validate and reflect stage, and that's it that I have. And as we said, our conclusion here is that our $5 billion content investment is a good catalyst to increase debt financing. That's it I have for today. That's my session nine assignment for Management 310. Thank you.",
  "video_url": "https://youtu.be/60s1sTHvvSk"
}