{
  "student_name": "None None",
  "org_defined_id": "036748997",
  "username": "atypaldo",
  "video_url": "",
  "transcript": "Hi, I'm Andrea and this is my Finn Path AI, my advanced AI finance tool for the mini project 3. Finn Path AI is designed for young professionals and students who feel overwhelmed by generic money advice. Instead of you should save more, it uses AI to give context aware goal-based strategies built from your actual numbers. The first step is the financial prof profile. Here I enter my monthly income and expenses, my cash, investment and debt. And then I set risk tolerance, age range, and free text primary goal. As you can see here, technically this page uses react hook form to collect the data and stores it in a financial profile entity in the database. That profile is then injected into every AI prompt. So the model never answers in a vacuum. From the driver perspective, I discover and I realized that generic AI like save more is useless. High depth lowincome people need different advice than high income high-risk users. As for reason, I need a persistent memory layer, not just one off questions. And to implement, I implemented the financial profile as that memory. It basically acts like a structured system prompt the AI always sees first. This profile also lets also sets up one of my advanced capability which is memory/state that influences every recommendation. You can see at the bottom I also added a disclaimer bar reminding users that this is AI generated not professional financial advice which supports the safety requirement. Next is the AI executive dashboard. This is where Pinpath AI connects my personal profile with the outside world. When the page loads, it calls the llm via base 44.inttegrations.core\n\ninvoke llm with add context form internet equals true that lets the AI pull live economic data like current inflation, mortgage rates, and SNP500 performance. The LLM is instructed to return a strict W uh sorry JSO N object. one part with the numeric market data I use for these market pulse widgets and one part with a plain English summary of what it means for this specific user. So instead of just inflation is 3.5% the AI can say something like with inflation at 3.5% your 10k in cash is slowly losing purchasing power so keeping everything in cash may not fit your risk tolerance. Here I'm using two advanced capabilities which are external data integration via internet context and structured outputs so that UI doesn't become a chat dump for driver. I discover that people hear the Fed raises rates but don't know what it means for their budget specifically. Reason I made the AI a translator between macro data and the user's wallet. For implement, I forced a JSo N schema so I could render clean widgets. And to verify, I added the loading and error states so that the dashboard doesn't break if the AI is low or the fetch fails. The heart of Pinpath AI is the goal strategist. So here the user picks a goal like buy a house or pay off debt and enters a target amount and date. Behind the scenes, I send the goal plus the full financial profile into a specialized financial planner prompt. The AI returns three scenarios. Conservative, balanced, and aggressive. Conservative means it's safer assets, low expected return. Balance means mix of safety and growth, and aggressive is higher growth, more risk. Each scenario includes the assumed return, estimated future value, and required monthly contribution. The AI returns this as a JSo n array which the react fronted parses and visualizes the red charts. I also ask the model to generate pros and cons text for each strategy. So here I'm using structured outputs again and scenario comparison with trade-offs for driver discover. Real financial decisions aren't yes or no. People want options. The reason is that AI doesn't multi multi-step reasoning. It reads the time horizon, picks appropriate risk levels and backs into monthly savings for each path. For implementing, I first j to keep it from just chatting and then plotted the scenarios to make trade-offs visual. Then to verify the pros and cons sections and risk language act as sanity checks, reminding users that aggressive paths come with real downside risk. and to evolve. Then I my V1 was just a text explanation. In V2, I added structured JS O N charts and explicit pros and cons which made it more trustworthy and easier to understand. To wrap up, Finn Path AI shows how AI changes the user experience from calculator to coach. It remembers your profile, pulls in a realworld data, compares scenarios, and explains the why behind the numbers in plain English. The hardest part of prompt engineering was getting the model to output reliable JSON N and to always mention risks, not just the upside. I addressed that with stricter schemas pros and cons requirements and visible disclaimers. I personally wouldn't give this as the one source for real money decisions, but I would use it as a learning and planning tool to understand how my goals, risk tolerance, and market fit together. So that's my fin path AI, my intelligence finance tool built using the driver method. Now so you can see how it works, I can create a profile. So let's say my net monthly income is of $4,000. Total monthly expenses are of $3,700.\ncash emerging fund. Let's say I'm going to use random numbers. 4500, no 45,000 investments. Let's say 6,000. And let's say in total depth I have I bought a car and I'm in 20,000. Then the strategy settings risk tolerance. Let's say I want something moderate. and my age range. I'm going to put my actual age range from 18 to 25. Let's say my financial goal is okay, let's put the one from the example. I want to retire by 50 to 5 by 50 and own vacation home. So then I just save the profile and at the top right I can see my profile. Thank you very much. This was my project."
}