{
  "student_name": "Sarah Alharthi",
  "org_defined_id": "034887536",
  "username": "salharth",
  "email": "",
  "transcript": "Hello, my name is Sarah, and this presentation walks through my DRIVER-guided financial analysis of Starbucks' proposed flagship roastery project. I'll explain the modeling approach, show how Python was used to automate the calculations, and present the final investment recommendation. The problem is to determine whether Starbucks should invest $12 million in a flagship roastery expected to operate for 10 years. Starbucks' hurdle rate is 8.5%, so the key question is whether the project creates value as measured by NPV, IRR, and other capital-budgeting metrics. I gathered all project parameters from the assignment: revenue forecasts, cost structure, depreciation, taxes, working capital, and terminal value. I also reviewed standard methods for NPV, IRR, profitability index, and payback analysis.\" I designed a year-by-year incremental cash-flow model that calculates EBIT, taxes, NOPAT, depreciation add-back, working-capital changes, and terminal value. Python was chosen because it makes the model fully reproducible and allows automated sensitivity analysis.\" To ensure accuracy, I verified that depreciation was correctly applied, terminal value and working-capital adjustments were only in Year 10, and sensitivity outputs behaved as expected. The model ran successfully end-to-end. Here are the results. The base-case NPV is approximately +3.02 million. The IRR is 13.33%, above the 8.5% WACC. The profitability index is 1.25, and the payback periods are reasonable. The sensitivity tests show the project remains positive under discount-rate changes but becomes negative if revenue falls by 20% This chart shows free cash flows over time. The large outflow occurs at Year 0 from investment and working capital, followed by stable positive flows and a terminal value in Year 10. The second chart shows NPV sensitivity. The base case is positive, revenue downside is negative, and both WACC adjustments remain positive. Through the DRIVER process, I learned the importance of structured analysis, parametric modeling, and stress-testing assumptions to understand risk.\" Based on positive NPV, strong IRR, and strategic alignment with Starbucks' brand identity, I recommend that Starbucks proceed with the flagship roastery investment. While revenue risk is the primary concern, the project still meets financial hurdles under normal conditions. Thank you for listening. I'm happy to answer any questions.",
  "video_url": "https://youtu.be/rH0EfQ8kVIs"
}