{
  "student_name": "Jeenay Dedhia",
  "org_defined_id": "036587896",
  "username": "dedhiaj",
  "email": "",
  "transcript": "So this presentation is about the session 8 project. Um I'm going to use a GameStop short squeeze and post on an announcement example to investigate market efficiency. So here is the big research question for session 8. Are markets basically rational information processing machines like the efficiency market hypothesis that we learned in session 8 suggest? Or are prices heavily shaped on human psychology and predictable mistakes? And do humans basically decide the prices or the markets do like behavioral finance suggest? So we will use the driver framework. So the assignment gives us very specific measures. So this is what we already have from the 2020 to 2021 GameStop short squeeze. In August 2020, GME was trading at uh near bankruptcy levels. In September 2020, uh, Ryan Cohen, the founder of Chewy, bought the company at about bought about 13% of the company. In January 2021, there was a massive price search gi driven by Reddit's uh, tweets and Gamestock started hitting at $483. Short interest peaked at about 140% of the float. Retail um, trading volume exploded because obviously the stock was giving such high returns to everyone. A huge major hedge fund, Melvin Capital, lost about 53% and needed a bailout. Analysts fundamental value estimates were in the range of about $10 to $40 per share, but as we just found out was trading at $483 per share. We are also asked to use a post earnings announcement drift uh scenario as a smaller lab efficient uh example efficiency. A tech stock beats earnings by 15%. the stock jumps 5% and uh then it keeps drifting 1% per week. So the guiding question that I found out from all of this and the guiding question that I will be exploring today is does this kind of gradual drift after new information like earnings for GameStop news represent true market inefficiency because analysts told were told that the shares were worth around $10 to $40 but were sh like going at $483 or it can still be explained as a rational market behavior like just what the market does. So to discover what's really going on, I first remind myself what efficient market hypothesis actually says. So it basically says that stock prices fully react all available information. So you cannot consistently earn higher returns just by analyzing public data. So there are three main forms of this. Weak form, semi- strong form and strong form. Weak form is like prices are determined by past prices and volume information. Semi-rong is all public information and super like strong firm is basically all the information in including the private insider information that's going on in the company. On the other side, behavioral finance tells us that investors are human. Investors are overconfident and we anchor on initial numbers. They don't follow the trends. They don't follow and we hate losses more than we love gains. And it also tells us that these systematic biases can create predictable patterns called anomalies like momentum, value, size, effect, and calendar effects. So today in what I'm going to do, I'm going to use the driver framework to analyze a post earnings draft example in code. Use that to build in institution uh about what an ineffective pattern looks like. and then link back logic link logic back to GameStop case and ask what form of EMH seems violated. So now let's go to the represent stage. So this assignment points me to event study methodology and event study looks at returns around a specific event. So from uh days 10 to 1 is the estimation period, day 0 is the event day and more than 10 days is the postevent period. So the formula that we use is abnormal return A R is equal to actual return minus the expected return and the expected return can be found from CAPM that we learned in session 7 which is E is equal to alpha into beta alpha plus beta into market return. So here's the framework in words. First estimate what a normal return would be given the stock's risk in the market. Compare what it actually happens at around that event. The difference is surprise or abnormal return. If a market is semi- strong efficient, most abnormal return should happen immediately to when information about that company is released in market. And if a normal return drifts for several days after the news, it looks like a potential inefficiency in the news. So this is what we have for the data. Everything is locked up. The stock beta is at 1.3. Risk free return rate is 0.03 and market PM is 0.08. So I'll walk you through the Python script now from the assignment. Uh it simulates a post earnings announcement disc for GameStop. I'll show you the code and explain in plain language what everything is doing. So let's run the code for now. So the code is run and this is what we get. So yeah, don't get confused. I'll explain what this means. Um so in simple terms at top we import random and print heather saying we're doing a post earnings announcement drift analysis. We have kept the stock beta to 1.3 which means that the stock is more volatile than the market and the risk free rate and the market premium are there to represent the general idea of expected returns. Although uh in this simplified script um we mainly use beta and small alpha. So we create a list from minus 10 to positive 10 days which is a span of 20 days. Negative days are before the earnings report. Zero is the announcement day of the earnings report and positive days are the after earnings report uh what happens to the stock return. So in the fall loop uh that we have in this uh we generate a random market return each day between minus2 to plus 2%. And that's a simplified overall market movement. So after we generate the stock returns we calculate the abnormal returns in the code. We compute normal red the stock return. The difference is abnormal return and we also accumulate this into the accumulative abnormal return in the very end and we split the abnormal returns into three parts. We will split it into post earnings which is minus1 to 10 announcement day which is day zero and then the post earnings report which is 1 to 10. And then finally we will compute an efficiency ratio where we will have the immediate reaction on the abnormal day at day zero. The post drift is the sum of abnormal returns from day plus 1 to + 5. Total reaction is day 0 plus the drift and efficiency ratio is the immediate reaction. If more than 80% happens on day zero we call it mostly effective. If 60 to 80% happens we call it moderately effective. And if less than 60% happens then we can call it a potential ineffectivity. The important thing in this script is that we're not trying to be realistic like we're not using the real values of the GameStop from World Wars in 2020. So this is a simulation of an event of study and it shows how to connect the numbers back to the EMS and how much of the reaction is immediate and uh versus delayed. So if I run the script a few times, I see something like pre- earnings average abnormal returns are close to zero. So almost all these stock like the abnormal the returns are close to zero and then on announcement day there's a big positive abnormal return of uh 5% over here and then over days + 1 to + 5 there is still positive abnormal returns maybe another few percentage points that is the post earnings drift. So if markets were perfectly semi- strong efficient nearly all abnormal returns uh should be on day zero but as you can see there are more abnormal returns happening after the day. In fact the fact that this crypto delberty builds and drift means that we are modeling a world where the market does not instantly process all information. This by construction is an inefficiency but obviously um we'll come to the validate state now. So is drift statistically significant? Is it reliably different from zero across many events or could it be just random noise that is happening and like small menu changes that are happening like after the day zero? Is it economically significant? Is the profit after cost spreads and risk still meaningful? A 1 to 2% lift might be wiped out by trading frictions and how persistent the um return is. So in the GameStop assignment, we are asked to classify which form of EM is violated, analyze how information was incorporated into the price, look at the abnormal returns and predictability. So with the G uh GME stock, prices did not calmly adjust to new fundamental information. is that social media extreme short interest and detail uh hering produce enormous swings to the like the abnormality and the price of the stock and from semi- strong EMH lens this looks like an extreme case where public information may not have been profess pro processed in a rational and timely way on day zero so let's look at this from a behavioral basis the assignment explicitly list basis overconfidenting anchoring loss aversion and mental accounting. So in gamesoft you can see overconfidence. Many traders believe they could outsmart the hedge funds hurting people piled in because others were doing it especially on Reddit. So more people buying the stock the stock goes up the valuation increases. This is a very normal thing that keeps happening with such noisy stocks and less aversion and mental accounting. Uh some treated GME as a fun money or lottery tickets while others refused to sell at a loss and they were like we're going to wait we're going to hope it goes up. So let's look at the limit to the arbitrage even if some investors believe that the price was irrationally high which is more than it was more than a,000% high because it was valued at around $10 to $40 but it was $483. So it becomes extremely dangerous to short the stock because shorting interest would uh already massive will be massive. So you would basically not get a lot back on the stock. Brokers restricted uh the trading on the stock obviously and prices could jump to hundreds of percents in a day. So it was a very volatile stock with changes happening almost every day. So this is a classic example of why inefficiencies can persist. It's not enough to be right about the fair value. You also have to survive in the path and the prices to get there to get to the right value. So markets can mostly be efficient most of the time. But in specific situations like such a stock where Reddit drove the stock value to another high to a new high behavioral forces and structural constraints can generate huge temporarily divisions from fundamental value. So here is my aha moment. At first, it's very tempting to think that if EMF is true, even like GameStop shouldn't happen. So, EMH is wrong. The markets are just crazy. The markets are just like increasing values of stocks here and there because there's more interest coming into the stocks. The real question here is not are markets efficient or crazy. It's about how efficient they are or how inefficient they are and over what time horizon are they efficient or inefficient. So this code will simply like tells us that prices react very quickly to the news. As soon as a news of the companies out on day zero, that is when the abnormal return will be the most. It can be a drift that kind of looks like an inefficiency. Yet turning that pattern into real risk adjusted profit is very hard especially after the cost and risk. So the GameStop case basically shows us that behavioral finance is like crucial. Human psychology and social media can practically change what a stock is worth and practically change the views on that stock. If a stock is if say a company is not doing well but human psychology and social media can make the stock still plummet. Uh limits to arbitrage means that even obvious mispricings can't easily be fixed by rational traders. Shorting the stock isn't going to help and it doesn't mean that the markets are totally random or hopeless obviously because this been going for a while. It just means that some companies are it's mostly efficient with like some companies having those small little inefficiencies in the middle due to human psychology and behavioral finance. So my emerging investment prof philosophy is treat markets with respect assume they are hard to beat on an average. Don't think that because the stock is plummeting, it will go on plummeting or selling at a loss is a bad thing. Use passive index strategies as strong foundations. Obviously, make a diversified portfolio. You don't want to just invest in GameStop and then look at the price right now. It's not as high as 483. In other words, markets are nearly perfectly rational nor purely insane. They are just humanic systems which where behavioral finance comes into play a lot. Usually if they are usually effective efficient through lazy strategy when lazy strategies fail but imperfect enough that disciplined analysis combined with an understanding of behavioral finance and psychology can sometimes add value. That's the balance I take away from session 8 and from this market efficiency investigation.",
  "video_url": "https://youtu.be/o83NMC-_h6Q"
}