{
  "student_name": "Sharanya Srivastava",
  "org_defined_id": "035908028",
  "username": "sriva154",
  "email": "",
  "transcript": "Hi everyone, my name is Sharanya and in this analysis I will evaluate whether uh Starbucks should invest in a $12 million flagship roaster with a 10-year operating life. I'll walk through my full driver process from defining the business question all the way to implementing the financial model in Python, validating the outputs, and reflecting on what we've learned. Now, moving on to define. In the defined stage, my goal wasn't to build a model just yet. I focused only on understanding the decision Starbucks is trying to make. So the core question is pretty simple. Does Starbucks does the Starbucks flagship roaster project create value once we discount its cash flow at the company's 8.5% um WACCC? So to the answer this um what Starbucks needs is a year 0 to 10 incremental cash cash flow model a core capital building um core capital budgeting metrics. So it has NPV, IRR, payback, discounted payback and profitability index um sensitivity analysis and a sensitivity analysis for lower revenues and a different discount rates and a final recommendation that considers not only the numbers but the also the strategic branding factors like customer engagement, foot traffic effects and premium positioning. So at this stage I established the decision rule. So if the NPV is greater than zero, Starbucks should accept the project otherwise reject it. Now um moving on to discover I gathered all the inputs that we had. So this is where I made sure I had every assumption documented before touching Python and Collab. So these are the key parameters that Starbucks provided us. It's investment in depreciation, $12 million initial investment with a straight line over 10 years and um $500 $500,000 working capital recovered in year 10. Now the revenue for year 1 was 8 million, the year 2 through 5 was 11 million and years 6 through 10 was 9 million. Um our operating cost, our COGS was 40% of revenue. Our labor was $2.5 million each year. Our rent and utilities was around.8 million. Um our marketing our marketing was 3 million in year one and then point um.1 million thereafter. And our other assumptions that we have is our tax rate is 25%. Our terminal value is 3.3 million. our hurdle rates are 8.5 um is 8.5% WACC. So all of this becomes the foundation or the base that we have to build up to the represent stage. Now in the represent stage I structured the model before coding it. So this helped ensure uh clarity, accuracy and clean automation. Here's my plan. Build a data frame with one row per year. So 0 to 10. Our columns would include revenue, operating cost, depreciation, EBIT, um taxes, operating cash flow, um working capital changes, terminal value, and final free cash flow. Now, and then we made a we created a reusable Python functions for cash flow construction, NPV, IRR, payback metrics, profitability index, and sensitivity analysis. Third, we parame um we um made parameters for all the assumptions. So changing um WACCC or revenues instantly updates everything that we have. The fourth thing was we added visualization. So free cash flow timeline, MPVs versus WACCC curve. And once the plan was clear, I moved on to the implementation. Now um in implement I will walk through the Python um code. So this is the code where um I imported numpy pandas and mapplot lib. Um here we have our represent or implement our helper functions and um once we run this code uh here is our output. Um okay so our data frame shows that in year 0 um our outflow was $12 million capeex plus a negative.5 working capital um yeah um which okay we also had a positive operating cash flow from years 1 through 10 our working our working capital recovery and terminal value in year 10 Um, yeah. And then our straight line depreciation of $1.2 million each year. Next, we compute the capital budgeting metrics. Our code prints um NPV positive irr greater than 8.5% our profitability index is greater than one um and simple and discounted payback both are within within the project life. So these results basically already predict that the project or hint at that the project is attractive or will gain money from it. Step three are uh sensitivity tests. So our script our code basically calculates that the revenue is around negative 20%. In the scenario our N MPV decreases but stays positive or close to break even depending on the magnitude. Um our IRRa declines but remains above our WACC. Sorry, it's over here. um our WACCC is around plus or minus 2%. At 6.5% WACC, our NPV value um rises, but at 10.5% WACC, NPV shrinks, but it does not doesn't collapse. So, this basically shows us that the project is robust. Um our free cash flow bar chart here confirms uh strong inflows after year 1. Um the NPV versus WACCC curve slopes downward as we expected and this intersection confirms that IRR is greater than WACC and that sorry that completes our implementation stage. Now moving on to validate. Um in validate I checked whether the models behaved logically or not. So uh some validation checks I performed um year zero FCF which currently includes correctly includes sorry a negative 12 million investment and a negative 500k working capital. Our depreciation across years 1 through 10 sum up to 12 million matching our initial investment. Our working capital is fully recovered in year 10. Um, our NPV and IRR agree with the expected decision rules that when NPV is greater than zero, IRR should be greater than WACC. Our profitability index is actually is greater than one which confirms our value creation. Our discounted payback occurs well before year 10. And so these internal checks increase the confidence in the results that we have. Now in evolve um I explored what if scenarios to stress test the project. Um for example if our revenue dropped dramatically potentially to 50% of the base case. The model would then show that NPV is approaching zero or slightly turning slightly negative. Um, if marketing costs or labors were to increase, the project would still hold up moderately well. If WAC increases significantly, NPV would decline, but it doesn't immediately destroy the value. So, these valuations show that the Ro Street is sensitive to revenue assumptions, but still pretty resilient. Uh, this experimentation helps Starbucks understand which variables matter most before committing to the $12 million. Finally, in reflect, I considered what I learned and how this analysis helped Starbucks make a better decision. The driver process uh prevented me from jumping straight into code without understanding the problem. So, representing the structure first uh made the implementation clean and transparent for me. Uh the Python automation also let me run sensitivity analysis instantly. So, my overall recommendations for Starbucks would be uh Starbucks should um accept the project. Here's why. Our NPV is clearly positive at 8.5%. Um I our IRRa comfortably exceeds the hurdle rate. The payback occurs well within our project life. The project remains attractive under moderate downside scenarios. and strategically a flagship roaster strengthens the Starbucks premium brand which drives tourism style foot traffic and anchors a long-term customer loyalty. So even when revenue falls or WACC rises, the project still creates value or stays close to break even, reinforcing our decision. So combining the financial evaluations with strategic benefits, this investment is aligned with Starbucks's long-term brand goals. Thank you for watching my analysis. This concludes my full driver-based evaluation of the Starbucks flagship roaster project.",
  "video_url": "https://youtu.be/GWdffT3DczI"
}