{
  "student_name": "Lucas Case",
  "org_defined_id": "037512866",
  "username": "case47",
  "email": "",
  "transcript": "Hello, my name is Lucas Casease and for my week assignment, we're going to do a deep dive of a case study into the GameStop crisis uh back in January of 2021. And we're going to talk about market efficiency and behavioral finance. Uh so, first a bit of background information on our case study. We're going to talk about uh market efficiency using the GameStop short squeeze event. Uh we're going to verify some stated facts, analyze price behavior relative to the efficient market hypothesis predictions and we're going to evaluate uh market anomalies and if those can be explained uh with existing behavioral finance frameworks or not. So, the first step we're going to go over is we're going to verify whether or not GameStop traded at 4 cents in August of 2020. And if that is incorrect, we're going to document the accurate figures. And then here here's an event timeline as well. Uh in August of 2020, GameStop was near bankruptcy levels. Um, and then the next month, a Ryan Cohen, uh, a rich founder, acquired a 13% stake. In January of 21 is when the short squeeze occurred and the price surged to about $400. And then in February, there were congressional hearings on market manipulation. Some key data points is that throughout that time, analyst fundamental value estimates had GameStop at $10 to $40 a share. And there were lots of people who lost lots of money like hedge fund manager Melvin Capital. And that was one of the reasons uh why Congress had to have hearings about market manipulation. So, diving straight into the first statement that GameStop traded at 4 cents a share in August. This is false. Uh, using Yahoo Finance through Google Collab, I tracked that the lowest traded price of the GameStop stock in August of 2020 was about a dollar. and you'll see the graph of the daily and closing prices from July of 2020 to March 2021 that I generated using Yahoo Finance and Google Collab with Python. Uh you'll see it's right around a dollar uh from July honestly through about December it starts to rise slightly and then January is obviously when our event occurs. You'll also see that I created a daily trading volumes from July 2020 to March 2021 of GameStop. And you'll see that it's relatively the trading volumes are relatively low compared to the month of January and early February where you'll see huge spikes. Um overall these plots show a stable period for GameStop from July 2020 through around December and then there's a rapid increase in both that uh closing price and trading volume which indicates that that's when the short squeeze event occurred. Now, um, now that we've verified that that previous information was false, we're going to run a CAPM regression to calculate the alpha and beta of the Gamestock stock and compare that to expected uh, S&P 500 returns to uh, see if there was an abnormal return and whether or not we need to talk about what happened there. So the estimation period we're going to use is from September 1st to the end of 2020. And our event period is from January is just the month of January. And after I performed the capital asset pricing model regression using Python through Google Collab, uh our alpha was 0.011. Again, alpha is the excess return not explained by movement within the market. Uh in an ideal market, uh this would be zero. And then the beta that was calculated was 1.834. And this measures volatility compared to the market. So for each 1% that the S&P 500 or the market moved, uh Gamestock was moving at 1.84%. So this tells us that we need to figure out why exactly GameStop is moving at such a higher rate compared to the market. Uh so using the regression that I mentioned, I generated uh again via Google Collab and Python a cumulative abnormal return for GameStop during the event of January. And you'll see that the abnormal returns uh were at the for the first few weeks were very low. And as the short squeeze event occurred, you'll see that they uh rose exponentially very quickly. And then again, the cumulative abnormal return is just the sum of all individual abnormal returns over the event period. And by plotting it, we can see the exact moment the stock price detached from the fundamental expected value. Now, we're going to talk about how this happened and why it matters. First, uh we're going to talk about what is the efficient market hypothesis. This is the theory that a stock's current price already reflects all available information and no one can beat the market because there are no undervalued or overvalued stocks. It comes in three forms. Uh the first two we're going to talk about are the weak form and strong form. Weak form essentially bakes down to all historical data is already baked into price. So you can't predict future prices by looking at past prices. And the strong form is that all information public or private which would include insider trading is reflected in the price. And this form is not my favorite form because insider trading is illegal. And the one that is most relevant to the GameStop case is the semi-torrong form which says that prices adjust instantly to all public publicly available information. Uh the example that comes from the GameStop case would be the 140% short interest report that they had as well as the significant and sustained positive cumulative abnormal returns that we observed in my graph on the previous slide. Uh those also suggest a violation of at least the semi- strong form of market efficiency and the substantial deviation of GameStop returns from what was expected with its historical relationship with the market which we tested with our capital asset pricing model regression. And that indicates that public information and market sentiment surrounding the short squeeze uh weren't efficiently incorporated into the price. Uh by extension, you could argue that the game case violates the strong form of market efficiency. Um, also we're going to talk about behavioral finance and this is the how did this happen and uh the efficient market hypothesis semi- strong form was why it matters. Uh we're going to be diving into like the people aspect of this. So first off an intro into behavioral finance. It's a field of finance that argues psychological biases and emotional factors uh such as greed which is important one for investing because you know everyone wants to make more money. uh these influence investors and make them irrational. Uh one or two that are relevant to the GameStop case are hurting and limits to arbitrage. Hurting is the tendency for individuals to follow the actions of a larger group even if those actions are uh irrational. So for the GameStop case, uh this would be all the people in the subreddit Wall Street Bets who uh coordinated all together and helped to drive the price surge up to 400 plus. As for limits to arbitrage, this is the real world reasons why a rational investor uh won't bet against a bubble. Uh in the GameStop case, this was the risk of uh ruin. You could say that the stock would stay irrational longer than the short stellar could stay solvent. Uh this is an example of the hedge fund I mentioned previously, Melbourne Capital. Uh so in light of this, could a rational investor have profited systematically? I believe they could have. uh a rational investor who identified the market inefficiently. the market inefficiency. Sorry. definitely could have profited because in the uh if you look back at our cumulative uh abnormal return graph, you'll see that the dramatic increase indicates that any investor who bought the GameStop stock and held it through the short squeeze would have had returns far above what was predicted by the capital asset pricing model or even the affforementioned uh analyst estimates of GameStop stock at around $10 to $40. Uh so even though this would be risky uh a rational investor could have profited. Overall though, the GameStop short squeeze uh is a unique event and the presence of these significant and sustained admiral returns uh means that it would have been very very risky and this uh unique event is not something that is can be used to like downtrod on uh the efficient market hypothesis and it's just a direct consequence of the breakdown in market efficiency. as a result of hurting and limits to arbitrage like we talked about in behavioral finance. Uh, thank you so much for your time and I hope you learned a lot about the GameStop case and how it relates to market efficiency and behavioral finance. Thank you.",
  "video_url": "https://www.youtube.com/watch?v=lIZcIQpeEZE"
}