{
  "student_name": "Ray Sumpter",
  "org_defined_id": "032277341",
  "username": "asumpter",
  "video_url": "https://youtu.be/EW4MrH7aN_A",
  "transcript": "All\n\nright. Hi there. I have recorded this video about\n\nfour five times now and I'm a little tired of it. So, sorry this is going to be a quick run through. My audio is not working very well on this computer. I don't know why. That being said, my name is Alexandra Sumpter. I also go by Ray Sumpter. This is my work. I've been working on this for a long time. This is from assignment 11 in the book. Please don't discredit this. I don't know what else to do. So, that being said, I put a prompt together. I put it in Gemini. Gemini gave me code. Here we go. Let's go through it. All right. I'm a data analysis or something analysis for this company right here. I'm comparing these hedge strategies for my 450 million portfolio. Oh yeah. And I want to define initial assumptions introduction. Yep. And so for my prompt, I asked to do a lot of different things. And you can sit here and you can read over that for yourself if you'd like. Define specific market scenarios. Calculate portfolio value under each scenario. Unhedged portfolio and each hedge unhedged portfolio and each hedge strategy. And then give me analysis, you know.\n\nYep, there we are. Okay. Where's my thing? There it is. Moving on. so that you can see this. I will run the code as you saw. Everything ran smoothly just we'll just keep going.\n\nSo,\n\nexcuse me. This is the first little graph that it puts out for the protective put strategy. Here's the information that it provides. This is a lot of information. We're not going to run through it all right now. I don't think my audio is going to pick it up. So, sorry. This is the second set of graphic you know calculations for color strategy. Here's the output.\n\nIt says long underlying assess assets, short sale options. It gives you the pros and cons for each one of these as well. Um payoffs, executions, subtasks, etc. Here's the next set of calculations. Right. Right. Okay. And boom. Vertical put strategy. Yes, sir. Yes, sir. Look, look at that graph. Beautiful. Moving on. It gives you once again long put options, short put options. What do those mean? It explains that in detail. Payoff behavior, pros and cons. Sorry, a little shaky metaphor. Pros and cons right there.\n\nAnd then it gives an explanation of what this is.\n\nOnce again, the advantages, disadvantages, and the subtest. Moving on.\n\nFinally, it brings them all together for the hedged and unhedged portfolio payoffs.\n\nThen it explains what it gave us here with the delta, gamma, theta, and theta\n\nprotective post strategy, collar strategy, and vertical. Here's the collar.\n\nHere's the vertical.\n\nAnd it tells you the hedge effectiveness\n\nand it walks you through how to pick the best strategy for the recommendations gives. We're not going to go through all that right now, but it gives you the rundown, the in-depth calculations,\n\nhow best fits the scenario provided, etc. And lastly, what we're going to read is this little bit right here, the recommendation. So, it recommends to go with the collar strategy because it offers the most robust downside protection against significant market corrections as demonstrated by its performance in the negative 20% scenario. Now, I'm not going to read the rest of this and dredge on through it. uh but it has an ability to implement implemented for the is its ability for implemented net credit. So its advantage is that\nand significantly reducing or even eliminating the cost associated with hedging. Moving on, that was that was the answer that you were looking for as well. That's that's it. It gives you the rundown, breakdown, etc. If you would like to go more in depth, you can pause and read it. Then it goes into some Q&A. If you have any questions, it'll answer them right there and gives you more detailed data analysis and the key findings throughout the scenario that me and it were able to come up with. And then lastly, it tells you, excuse me, the next steps for moving forward this process. Thank you so much and that will be the end of this video."
}