{
  "student_name": "Campbell Schmonsky",
  "org_defined_id": "037406837",
  "username": "cschmons",
  "email": "",
  "transcript": "All right, I'm going to share my screen. Campbell All right. And so here is my cost of capital, um, let me, what I made using Gemini's help. Um, so today we determined the minimum return Netflix needs to achieve on its 5 billion content investment. It's weighted average cost of capital. So the goal here is to state the main objective, which is to calculate the current, um, weighted average cost of capital and analyze the impact of 30 billion dollars of debt and compare to peers like Disney. So the weighted average cost of capital definition is the minimum return a company must earn on its existing asset base to satisfy all of its capital providers, equity and debt holders. It's the hurdle rate for new investments. Um, the capital structure is, um, needing market values, and the market cap here is 200 billion, but the debt is 13 billion. Um, because they reflect the true cost and weights of capital, current debt weight is only 6.1%. Um, and then we're going to walk through the cost of equity calculations. So Netflix's high of 1.3 means its stock is 30%. Um, it's high beta of 1.3 is its stock is 30%, which is more um, volatile than the overall market, and this higher risk demands a higher expected return, which would be 11.65%. Um, and then interest payments are tax-deductible. The pre-tax debt yield of 5.8% drops to an after-tax cost of 4.58% due to the 21% corporate tax rate. So, the, we're going to present the final number here using all of these as 11.21%. So, this is Netflix's baseline hurdle rate, and any project of average risk must clear 11.21%. Um, the introduction of cheaper debt capital acts as a subtle value creator, decreasing the overall cost of funding. Um, the primary driver of the difference is leverage. Disney utilizes 30% debt, benefiting heavily from the tax shield, while Netflix is high equality reliant. This makes Netflix's capital structurally more expensive. High risk, new market international content should use a higher hurdle rate, perhaps 13%, while low risk US renewal deal could deal, or could use a lower rate, which maybe like 10%. Um, Netflix is significantly underleveraged. The marginal benefit of adding debt um currently outweighs the marginal cost. To truly optimize shareholder value, Netflix should target a debt-to-capital ratio closer to the industry range, which is potentially 15 to 20% to realize a lower more competitive um WACC. Um, the proposed 3 billion debt financing is a good first step, lowering WACC to 11.13%. However, our analysis reveals a strategic opportunity further increasing debt leverage offers the potential to create shareholder value by significantly reducing the company's cost of capital and making more value-eccentric investments possible. So, thank you.",
  "video_url": "https://youtu.be/ktyLqAOKiSc"
}