{
  "student_name": "Harry White",
  "org_defined_id": "037593398",
  "username": "white977",
  "email": "",
  "transcript": "Hello, I'm Harry White and today I will be going over my session 9 assignment. So for our session 9 assignment, as you can see here, but we have been tasked with calculating the weighted average cost of capital, the whack as I've called it for Netflix in connection with a hypothetical $55 billion content investment decision. Your analysis must determine current whack all the above the impact of additional debt financing which we'll get into a potential $3 billion debt financing uh assessing project specific versus firmwide discount rates and compare Netflix's uh cost of capital to industry peers. So, we're given all of this data shown right here, all of Netflix's parameters, the market conditions that are present in the situation and the context of the people in their market, the their competitors like Disney and Amazon Prime. Um, so as you can see, Disney has 70% equity and 30% debt and a whack of 8.2%. And Amazon has a 9.5 whack, which means that they rely on equity more than Disney does. So, we have to do all of these steps as said before, determine the whack after a $3 billion debt issuance and then project specific whack and compare Netflix to all the other competitors. So, for my represent um going over this whack, this is how you calculate it. You have to divide market value of equity by market value of the firm. multiply that by the cost of equity and then you add that to market value of debt over market value of the firm times RD which is cost of debt and you multiply that by 1 minus corporate tax rate and re is the yeah so this is how you calculate cost of equity um using the beta and we're provided that Netflix has a beta of an equity beta of 1.3 and then this is the market risk premium So yeah, I wanted to calculate their current whack before going into all the other aspects. So I plugged in their data. As you can see up here, they have a market capitalization of $2 billion. And as you can see right here, their debt right here, the market value of it is 13. So that comes out to here. All this data is given. So Netflix's current whack is 11.22% 22% which is much higher than their competitors but we'll get into that later because this is before the debt issuance of $3 billion. So uh in order to understand this more and sorry the debt financing will lower the whack but we'll go into that once we calculate it. um the trade-off theory which as you can see here I can make this a little bigger but uh it shows that how a tra the trade-off theory basically in this graph it explains how companies finance their operations by balancing benefits of debt like tax deductions and costs of debt like bankruptcy financial failure and shortcomings and you can see the gap in between the green line and the red line is the cost of financial distress so we want to find the perfect balance between that for implement I used Google Collab. I asked Gemini to write me a code and it gave me right here that the new whack after the debt issuance is 11.13% which is lower than the one we had before the 11.22% just by 0.9%. But um yeah, it decreases 9 percentage point or 0.09 percentage points. Um I'll go into that but this is the new values that we get after the debt issuance. Um it the decrease demonstrates the tax shield effect. Uh yep this is the project specific hurdle rates US content core business risk is 11.13 and then the international the higher risk which is 13.35%. And as you can see all this data right here the uh the midpoint the we were given that most wax in this industry are between 8 and 10% which Netflix is still above even after the debt issuance in order to get in that range you would have to issue a lot more debt than $3 billion. And then it explains the current whack or the whack the weighted average cost of capital before financing was 11.22%. 22% now it is 11.13 and their capital structure is suboptimal because they rely on debt too much and they have to move toward a higher debt to equity ratio closer to Disney's 30% debt. Um so uh yeah their whack is higher compared to their competition because their capital structure is heavy reliance on equity. Sorry I said debt before but I meant equity. um the wack cross companies as you can see right here um Disney or sorry Disney has a 70% equity to 30% debt ratio while Netflix is closer to 92 um but we go into that later but it shows you that they're too reliant on equity which uh shows a risky corporate structure and they require a bigger return on investments to show stockholder value and stockholder benefit. I wanted to validate these results and so I decided to calculate whack the whack rate post financing for Netflix on my own which I did. As you can see the biggest changes are right here on this side. Obviously 11.65% does not change but the since we add $3 billion of debt issuance then it becomes 216 as a denominator and we get 11.13%. So the calculation was right in my code. the numbers are correct and they can be explained because the after tax cost of debt is far lower than the cost of equity at 4.852% and 11.65 respectfully. Um Netflix is currently leveraging the tax shield benefit for interest payments which reduces cost of capital which why we saw uh waiting average cost of capital lower. But moving on from that my evolve a lower whack value is often considered best because it indicates a company uh that a company endures lower financing costs and less associated risk. Higher whack indicates that investors want a higher return. Um it shows that they have to prove before going into a project. Let's say their whack was 11.22%. Uh they want to see at they want to see a expected return greater than the 11.22%. Um yeah Disney's capital structure 70% equity and 30% debt while Netflix's ratio is 92.59 to 7.41. A lot riskier than Disney's. It's not safe and Disney has a lot more freedom to do stuff do more stuff investment wise for investment decisions. The new 11.13 whack means new investment projects have to expect a greater return than 11.13% to show profit and shareholder value. The lower whack opens the door to more investment projects because the project's been taken on, but it's still well above the market average, the 8 to 10% range. and median of 9%. So, while they're moving in the right uh direction, they're still not in the best place they can be. Yeah, like I just said, Netflix is taking a step in the right direction, but can't compete with their competitors like Disney and Amazon who have much lower wax. Their cost of capital is far higher than other firms who can source capital for much cheaper. they can take on more projects because they don't require a minimum expected return like Netflix will with their current uh weighted average cost of capital. So that is what I found for my reflection. Uh yeah, this project confused me a lot at the start obviously was uh whack I mean calculating the for using the formula to calculate whack uh I struggled with at first but then I got accustomed to it and it helped me figure it out. But I also wanted to see how debt financing and issuance of debt can help a company like Netflix in this situation. Um, it tells you a lot about their corporate structure and the risks associated with their investment decisions. Confused me at first, but after cleaning completing this assignment, I have a far better understanding. So, overall, this is what I had for session 9. And um",
  "video_url": "https://youtu.be/Xmf5xSvfjn8"
}