{
  "student_name": "Ivy Fu",
  "org_defined_id": "034845705",
  "username": "fu450",
  "email": "",
  "transcript": "Hi, my name is Ivy and today we're gonna talk about the GST stop quiz. So to start with I want to start with a little story, a background. So, in early 2021, oh, sorry, in early 2021, a bunch of regular investors on Reddit noticed that hedge funds had a heavily bat against GameStop stock and they all started buying shares together, which made the price skyrocket and forced the hedge funds to buy more to cover losses. This caused a short squeeze and turning a struggling company into a huge stock frenzy. So I remember one of our class our professor make us watch a movies about this and it was quite interesting. I mean at that time G Gamestock is nearly bankrupt. It's not doing really well but after people just start to buy the stocks and all of that and all the people are talking about it the social media spreading like how they come back alive which is pretty cool. Okay so start with define and discover. The purpose of this analyze is to evaluate market efficiency using the game stock which is the GME short squiz of 2020 and 2021. This project examinates price behavior rel relative to the efficient market hypothesis. Verifies key factual claims measure abnormal returns and trading value and assess whether investors behavior can be explained through rational or behavioral frameworks. And critical thinking we need to verify is the statement of GANSTOP traded at 0.04 in August 2020. If this is wrong, the correct price data will be documented sorry documented along with the correction to the professor. So they will be at the end of the page. The scope and time frame. So the primary period is August 2020 to March 2021. the extended data through 2023 for context and postevent stabilization and key facts to verify. So it's actually we're going to have more than that but these are the like some of them. So August 2020 closing prices and Ryan colon RC venture stake disclosure peak short interest volume increase trading restriction days Melvin capital losses analysis and in strength stick fundamental value estimates. So those are some of them represent. So we got some research questions like was GME traded at 0.04 04 in August 20 accurate and if not what was the true price range which type of market efficiency is violated where systematic risk adjusted profit opportunities available to rational investors can observed on my all the miles be explained through the behavioral finance limit to Arabage and market micro structure or did they fundamentally contradict EMH and we have a couple method here like verify daily closing and adjusting prices for August 2020 to market March 2021. Plot time series data like price returns, volatility and volume. Calculate abnormal and cumulative abnormal returns using a market model. Evaluate your interest ratio and days to cover. Compare peak trading values to prevent average and then analyze behavior and micro structure factors are null. So the claims are going to be verified if two independent rate reputable sources agree and numeric numeric fold changes are considered accurate if within plus 20 and negative 20% of calculated values. So let's move to our implementation. So here we have our link um take us to things that I have AI to generate code do the coding for us and then we can find like the alpha here beta here and I also have the graph and when we move down say like interpretation summary so there's a summary that GME traded around 1.67 in August 20 is not 0.04 04 um it's not 0.04 it's around 1.67 67 and volume rose roughly 18.3x at a January 2021 peak consistent with short squid narives and C shows extreme abnormal returns during the event window indicating deviation from semi-strong market efficiency so here it's pretty clear we have everything we need some some of the summary let's move to validate so I have event timeline and key data points that we get on validate and with the sore. So, um because these are pretty long, I won't like I'll click in it and make sure the link is working, but I won't like try to find the statement that I called inside because that'll be too much. So, I just have the information here from the source. So, to start with, we got August 2020 with the GME near bankruptcy level. It's partially correct from the source we have in here. Um this article here um we are having the answer of GameStop was among retailers not in bankruptcy that announced closing many stores highlighting financial distress. So it was not doing good for sure but well it's not in bankruptcy. So it's partially correct it's near. And then the second one August 2020 Ryen Cohen chewy fun acquires 13% stake which is wrong. So we have this government documentation here. um you know have the information in there and in here it says that RC Ventures managed by Ryan Colon acquires a 9% stake in GameStop. So it's nine it's not 13. Um here we have January 21 with the Reddit Wall Street Bats driven price surges to 500 oh 483 and that was correct. We used the Wikipedia for this references and we'll talk about that GameStop stock price peak in at an intra intraday high of approximately 483 in late January 21. So it is correct. Now the next statement talking about the Congress hearings on market manipulation which is also correct. We have this Robin Hood um Maripedia page, Wikipedia page, and it was saying that in February 2021, US Congress held hearings to investigate the trading activity surrounding GameStop. So that was correct. Um prestand so for now the postevent price stabilization and that was correct. We also have the we have the PDF of government documentation in here which mentions that after the pig stop stock price and trading volume stabilized through remained volatile. So this part is correct stabilization part. Now we have key points. So it say like short interest peak at 140% of float. Uh that was wrong. We have also the same thing. uh the government PDF page to verify that the GameStop short interest reach approximately 122.97 of the float. Um it's close but it's different. Now the retail trading volume increased 10fold during the squeeze. That's partially correct. Uh we also have the Wikipedia of Gam short squeeze to validate and a daily trading volume reached several hundred millions shares exceed pre-squeeze average by more than 10x. So well partially correct. Now the next next one is trading restriction implemented Robin Hood. So that part is correct. We have the we have the Texas law scholarship website with data to validate. And here was saying the Robin Hood imposed restrictions on trading GameStop during the peak of the short squ. So this part is this part is correct. They do have restrictions in post. Now we're moving on. Melvin capital losses at 40 53% requiring bailout. So this part is correct. We have the um here so we have the PDF uh of the case study and business law of the short gang stop short squiz and in here they mentioned that Melvin Capital lost approximately 53% of its asset due to scan stop short position so that part is correct and the last part is analysis fundamental value estimate $10 to 40 per share and we have realtors and we go in there. We go in there um in the article they mentioned that analysis maintain that the stock true value is significant lower average analyzis valition patch GameStop at around so 13.44 44 is within the range around that number. So I say that's partially correct, not entirely wrong like partially correct. Um moving on. So to involve in extensions, we can like looking for signs of game squiz in options market. Okay. Modeling how share sellers buy back shares using borrow lending simulations. Okay. analyze social media trends and online chatter to spot hardening behavior, you know, like Reddit, Google trends. There's a lot of things going on and that's what we can also look on and studying how trades during the day affect price movements and market mechanisms. So those are things that we can look into. So final reflect, the claim that GME traded at 0.04 04 in August 2020 20 is incorrect. Likely source of error like why it could be wrong is like misreading the split adjusted historical data can be one of the reasons and well for this corrections to the professor will say that after reviewing the primary market data from Yahoo Finance and stat news Jam Jimmy did not trade at 0.04 04 in August 20. The adjusted close on August 31, 2020 was approximately 1.67 with daily lows around 1.20 to 1.4t. So the full data tables and SEC fillings are available and if needed like those are the part that if they ask for more data we can like pro provide but yeah by far we confirm that the statement is wrong and we validate all the data here the key from the key points to the event timeline and everything and then also have pictures to support our information. Yeah and that's pretty much the video. Thank you for watching.",
  "video_url": "https://youtu.be/0rQR8K4QKIg?si=nrduh_M5eGCij0pB"
}