{
  "student_name": "None None",
  "org_defined_id": "037338416",
  "username": "spring48",
  "video_url": "",
  "transcript": "0:00\nis Brody Springer and this is um mini\n0:03\nproject number three for uh management\n0:05\n310 with Professor Zang. Our goal is to\n0:08\num\n0:10\nbuild a uh just uh an advanced AI\n0:14\nfinance tool and whatever um uh AI open\n0:18\nAI that we wanted to. So I used Gemini.\n0:22\nAnd so for my first prompt, I said, um,\n0:25\ncan you build me an app that's that's,\n0:27\nuh, a goal-based financial tool? I\n0:29\nwanted to give me strategic strategic\n0:31\nrecommendations to the questions that I\n0:33\ninput. I want to use natural language\n0:35\ninput. Like, for example, I have 10K to\n0:37\ninvest. What should I do with it to make\n0:39\nme the most money? However, this goal\n0:41\nwith base financial tools, I want to\n0:42\nhave the answers and recommendations to\n0:44\nmany financial questions. I also need a\n0:46\nclear English output with numbers that\n0:48\nback up the recommendations.\n0:50\nAnd so it gave me a financial tool\n0:53\noutput that was very basic and didn't do\n0:56\na lot of stuff. It um it wasn't\n0:58\nmulti-step. So if I put in a prompt and\n1:01\nI wanted to continue to build on that\n1:03\nprompt, it didn't it just completely\n1:05\nforgot. And so it would h it would reset\n1:08\nevery single time. And so I uh developed\n1:11this prompt and I said, \"What are some\n1:13\nthings that this AI app can improve on\n1:14from its original design?\" I said, \"Is\n1:16\nthere a way that we can make this a\n1:17\nmulti-step app that I can ask it\n1:19questions after the initial prompt?\" And\n1:21\nso it gave me um another app that has a\n1:25\nconversational memory. The multi-step\n1:28\nwhich can build on the previous prompt.\n1:30\nAnd um and it's data persistence, a true\n1:34\ngoal-based tool should remember your\n1:36\ngoals. And so they um so they integrated\n1:39\nfire store to save a user's entire\n1:41\nconver uh conversation thread and the\n1:43\nfinal the final strategic\n1:44\nrecommendation. And then um the original\n1:49\napp that it gave me for the second time\n1:52\nit wasn't working. And so I asked why is\n1:54\nthis app not working? And we had to\n1:56\ncheck some of the console tabs. And\n1:59\napparently there was an error in the\n2:00\ncode. And so it rewrote it and um\n2:05\nit checked uh and the\n2:09\nthe syntax error invalid expected token\n2:11\nwas the error and so it it used\n2:13\nJavaScript to to fix these problems.\n2:16\nUm, and so for this app, it's a\n2:19\ngoal-based financial strategic, uh, and\n2:22\nit gives me recommendations based on the\n2:23\nquestions that I asked. And I said, if I\n2:25\nhad 100k as a down payment, and 20K is\n2:27\nmy monthly salary, what house could I\n2:29\nafford if I wanted to pay it off in 30\n2:31\nyears? And so, it gave me this entire\n2:33\noutput. Um, it said the most crucial\n2:36\nfinance rule for housing is that your\n2:38\ntotal monthly housing payment is 28% of\n2:40\nyour gross monthly income. And so I\n2:42\ncalculated it uh out and um my total\n2:46\nmonthly payment can be $5,600 which is\n2:49\n28% of uh the 20k that I get monthly.\n2:53\nAnd then also gives me my estimated\n2:55\ninterest rate, the estimated annual\n2:57\nproperty tax, estimated annual home\n2:59\ninsurance values and stuff like that. Um\n3:03\nand so maximum PMI PNI payment uh $833\n3:07\ngoes to tax, 120 goes$125 goes to\n3:10\ninsurance. Um, and the principal and\n3:13\ninterest payment is 400 $4,642.\n3:17\nAnd so with this amount, with my down\n3:20\npayment of 100 grand 100 100 grand, the\n3:22\nmaximum affordable house uh is $848,000,\n3:28\nwhich is quite odd cuz I did this before\n3:30\nuh and I tried to validate it and um\n3:33\nwhen I did it before, it said my maximum\n3:35\npayment my m maximum um house payment uh\n3:39\noverall affordable house price was 780K.\n3:43\nSo, um it was very it's very\n3:46\ninconsistent I feel like. So, um yeah, I\n3:51\nmean it's off by 50 grand, but you could\n3:53\nalways just estimate. Um,\n3:57\nand so it also recommended that I\n4:00\nincrease my um my down payment because\n4:02\nmy down payment is not 20% of the\n4:05\n$848,000.\n4:06\nI would need um\n4:09\naround like 150k as a down payment. And\n4:13\nI and I continued my prompt and I said,\n4:15\nlet's say I had a down payment of 200k\n4:16\ninstead of 100K. My monthly salary\n4:18\nstayed the same. How much shorter can I\n4:20\npay off the loan? And uh as it build on\n4:23\nto my previous prompt, it said um that\n4:27\nwith this $56 $5,600 payment um per\n4:30\nmonth, I can pay it off 12 and 1/2 years\n4:33\nfaster than the original goal with the\n4:36\n100k down payment. Um so I could pay it\n4:39\noff in 17 and a half years instead of 30\n4:41\nyears if I purchase 840 uh $848,000\n4:46\nhome. Um yeah and then this app can do\n4:51\nmany other things. Debt and loan\n4:53\ncalculations, retirement savings\n4:54\nplannings and personal finance rules and\n4:57\nratios. Many things that it can do.\n4:59Thank you."
}