{
  "student_name": "Caden David",
  "org_defined_id": "035815616",
  "username": "david54",
  "email": "",
  "transcript": "Hi, my name is Caden and this is my assignment nine. today I'm going to walk through an analysis I did to help Netflix make a big financial decision. The company is considering a $5 billion investment and a new context and they need to know if it's a good idea. to do this you need to figure out the cost of money which is called the weighted average cost of capital or I'm going to be referring it to as WACCC. This number is the minimum return they need to earn on their in on their investments to keep their investors happy. I'm not just going to give you the final number. I want to show you how I got the number to to guide my thinking and I used driver framework.this helped me organize the problem, make a plan, do the math, and come up with a smart recommendation. So let's walk through the six steps define, represent, implement, validate, evolve, and reflect. So first, for define and discover. this is where I figured out the real problem with the information that I had. the problem wasn't just to calculate the WACC. It was to set five key questions. What is Netflix current WACC? What happened to the WACC if they borrowed an extra three billion to help pay for the new content? Should they use the one WACC for all projects? For example, is a new show on Netflix just as risky as a new show in an emerging international market? How does their WACC compare to competitors like Disney? And finally, what's our strategic recommendation for this $5 billion investment? So, to discover based on like the gathered data that the assignment gave me, the Netflix market capital cap was 200 billion. Their market value of debt was 13 billion. Their stock beta or risk level was 1.3. Their cost to borrow debt was 5.8%. and their market data like the risk-free rate was 4.5% and the market premium was 5.5%. The big unknown was what what would happen if the stock's risk if they added more debt. I knew I'd have to figure that out. So, for represent, the second stage is represent. This is where I made my plan before touching any numbers. I laid out the formulas or models I would use. the the two main formulas we needed the two main formulas we needed. The first was the WACC formula itself. It looks complicated but it's really just a simple blend. A company pays for things using two kinds of money. equity from shareholders and debt from banks. the WACC is just the weight of equity times the cost of equity plus weight of debt times after tax cost of debt. Then the second formula is for the cost of equity. we use the B theorem. we get this using the capital asset pricing model or the CAPM. This formula says that the cost of stock is equal to the base risk-free rate plus a bonus for the stock specific risk. The risk is measured by beta. My plan was for part one, use these formulas to calculate Netflix current WACC. Part two is recalculate the WACC for the new scenario with 3 billion more debt. This was the tricky part. I couldn't just use the old beta. More debt makes the stock riskier for stockholders. So, the beta would go up. My plan was to unlever the beta to find Netflix pure business risk and then relever it using the new higher debt amount. And then parts three and four, I use the new numbers to answer the qualitative questions about project risk competitors and the final strategy. Third was implement where I executed the plan and did the math for you to see in this Python script. So when we run it, so for part one, first I found that the capital weight with the 200 billion in equity and 13 billion in debt, the company is about 93.9% equity and 6.1% in debt. Next I used the CAPM to find the cost of liquidity. Plug the numbers I got I got a cost of 11.65%. This was the shareholders exact expected to return. After tax cost, the debt is cheap, only 4.58%. When I blended these two costs together using the weights I got from the first answer, Netflix current WACCC is 11.21%. Now for part two, part two was WACC after 3 billion debt. Now Netflix borrows 3 billion. So their new debt is 16 billion. I ran the unlever and relever calculation just as I planned. The new debt made the stock riskier. The new beta rose from 1.3 to to 1.33. This pushed the new cost of liquidity up to 11.82%. But even though the liquidity cost rose, the company is still now using more more of that super cheap 4.58% debt. When I blended the two weights and new cost, the cheaper debt won out. The new WACC is 11.12%. the WACC decreased which is good for the company. Finally, I use these numbers to analyze a strategic question for product for project risk. For project risk, they now can use one rate international content is way riskier due to currency politics and different mark market risk. For peers, Disney's WACCC is lower at 8.2% because it's more diverse, and stable company with parks, movies, products, and it uses more cheap debt at 30% debt. For the recommendation, the 3 billion in debt is a good move. Now, the fourth step of the driver is to validate. We ask do these numbers make sense? So for question one is our current WACCC of 11.21% reasonable. The industry range was 8 to 10%. Ours is a little high but it makes sense. Netflix is pure a pure play streaming company. It's high growth and high high risk and its beta at 1.3 is high. it also uses very little debt. So a WACC slightly above the average is perfectly logical. So it passes the test. Now for question two, did the WATC move in the right direction? Yes, we added cheap debt and the WACC went down from 11.21% to 11.12%. This is exactly what finance theory predicts. Now for question three, why is the change so small? because $3 billion is actually a very small amount for a company worth over $216 billion. The capital structure only changes a little bit. So the WAC also changes a little bit. So it passed all the all of the checks the validation checks. Now the fifth step is evolve. this step is about listing what we would do for the next to do next to make this analysis even better. I have three main ideas for improvement. first one is more accurate cost of debt. I assume that Netflix could borrow an extra 3 billion at the same the same 5.8% interest rate. But in reality, borrowing more money might make lenders nervous and cause them to demand a higher interest rate. The next step would to be to research that. Now for idea number two is quantify project risk. I just said use a higher rate for international projects. To evolve this, we would actually calculate it. We would find the country's risk premium for markets like India or Brazil and add the numbers directly into the CAPM formula to get a specific discount rate for this projects. Now the third third idea is a sensitivity analysis. I used fixed numbers like the beta of 1.3. But what if that's wrong? I could better anal I a better analysis would test a range of inputs and see how sensitivity sensitivity the how sensitive the WACCC is to our assumptions. Now finally step seven is reflect I have two key insights from this whole project. The first one is the financing decision is good. Adding 3 billion in debt is a smart move. It lowers their WACC and frankly Netflix is probably still underlevered. They could likely borrow even more to lower their cost of capital making them more competitive like Disney. And then insight two is this is the most important one. Netflix cannot use a single hurdle rate for this 5 billion investment. the new WACCC of 11.12% is the minimum they must earn on an average risk project like the new like for a new show like a new show for the US market. But if they use the same 11.12% rate to approve a high-risk project in a new international market, they could end up improving a project that will actually lose them money. They must use a higher project specific rate for their for those riskier investments. So in conclusion, the driver process took us from a simple request for a WACC calculation to a complete actionable strategic for strategy for Netflix 5 billion dollar decision. It shows us how you finance an investment and how to measure its risk are you is just as important as the investment itself. Thank you.",
  "video_url": "https://youtu.be/heIwQB83lCY"
}