{
  "student_name": "Deep Patel",
  "org_defined_id": "037663656",
  "username": "pate2233",
  "email": "",
  "transcript": "Hey guys, it's um Deeb and today I will be doing my session 8 market efficiency investigation. Okay. Um so today um I will start off with define and discover. So the goal is to investigate whether the GameStop um short squeeze violated market efficiency under the efficient market hypothesis. So the claim that we're given is that GameStop traded at 4 cents in August of 2020. Um after doing some research I found out that the um it started off trading for a dollar at the beginning of August and then at the end of August it ended off trading for $1.40. So it was false and it wasn't a um trading for 4 cents. So the problem statement is um to um see if GME store short squeeze exposed efficiencies in the world in the market or can it be explained with EMH and behavioral frameworks. So the sources that I will be using is Yahoo Finance, SEC filings, Bloomberg and FIRA um short interest reports. Um the key metrics that I am also given is the short interest rate is 140% a float. retail trading volume is um increased by 10 um times the fold. Melbourne capital is um negative 53% loss and um analyst value range is 10 to 40% a share. Okay. So I'm going to represent all this information. So I know that EMH suggest prices reflects all available information in three forms which is weak, semi-strong and strong. Weak is historical data. Um semi- strong is public information and strong is private information and um behavioral finance and psychological and social biases which everyone knows that's true. Um unknown to unknown information and stuff that we need to analyze is did GME prices deviate from fundamentals in violation of EMH? um were abnormal returns statistically significant and were um profits predictable xante and approach we're going to be using is we're going to collect daily GME prices and volume data from 2020 to 2021. Um the window that we're going to look at is August 2020 to March 2021. We're going to estimate the expected returns using the CAPM market model and we're going to compute abnormal and cumulative abnormal returns. Um we're going to identify behavioral signals which is hurting over contracts and social trading. So I'm going to implement um Gemini to for Gemini to make me a python code to pull GME data from Yahoo Finance um using Y Finance. Um, we're going to calculate daily returns, apply CAPM to find expected returns, compute abnormal returns, which is the actual minus expected, and then we're going to plot the um, GameStop price versus the S&P 500 price. We're going to identify abnormal spikes in January 2021 and summarize the evidence of inefficiency. So, I already have the um code ready. Um so I told um Gemini for it to write me a Python code using Jupiter notebook to analyze market efficiency during GameStop short squeeze which was during this time frame and use the efficient market hypothesis. And this is everything that it's going to import. It's going to use daily prices from Yahoo Finance between these dates. It's going to calculate daily returns using the um return on investment formula um using the rate free numbers and all that. And then it's going to um identify major events such as the Ryan Cohen stake in September 2020, the Reddit surge in January 2021 and so on. It's going to improve whether the abnormal returns represent violations of weak semi-strong or strong form efficiency. And then it gave me some information. However, it didn't give me the code. So I just told it um just give me the Python code. And then it gave me the Python code. And then this is what it gave me. However, when I took it to um collab, it gave me an error which I pasted the error and then it fixed it for me. Okay, so um I ran the code. This is it importing pandas, numpy, yahoo finance, um math plot, which is where it can plot ma math and then this is um GameStop and the dates. Okay, so and this is the output that it gave me. Okay, and now I'm going to analyze this. So the regression output shows that GameStop's daily returns were largely uncorrelated with the broader market. The R squar of 0.08 which is right here um means less than 1% of GameStop's movements were explained by the S&P 500 changes. the beta of negative um 1.58 which is right here um suggests that GameStop moved opposite direction on than the market average and it's consistent with short squeeze behavior not normal fundamentals the alpha of 2.5% which is um 2.5% which is right here um per day represents extremely high abnormal returns that cannot be explained by standard risk factors. This clearly violates the semi-strong form of market efficiency since public information did not rationally reflect the price. Okay. Um now I I I can validate this um because of the findings that I found. Abnormal returns in January 2021 were extremely high and it's not explained by fundamentals. The short squeeze event um inconsistent was inconsistent with semi-strong efficiency um and the weak form may still hold um since patterns were not repeated. Um probability is um systematic arbitrage um was impossible due to trading habits and liquidity limits and it supports um limits to arbitrage and um conclusion is that if event shows temporary inefficiency not the total EMH failure. I can evolve on this by extending the study to um AMC and um BBBY for cross event efficiency testing. I can integrate the um Reddit situation to um an analyze for quantify hurting. I can use um event study regression to test C significance. I can refine the model using semi-strong efficiency um extensions. And um something that I learned is that market efficiency can break temporally under social media um driven hurting behavioral biases such as overconfidence FOMO anchoring um dominance short-term pricing. Um EMH remains largely intact when considering information costs and trading fictions. Um the one takeaway is that GameStop wasn't um proof that markets are irrational. It showed that investors are also human. And my final thought is that effic efficiency does not equal stability. Um and the mark the market corrected provided providing its self-healing nature. Thank you.",
  "video_url": "https://youtu.be/aIYZ3mXqg9o"
}