{
  "student_name": "Robert Dinn",
  "org_defined_id": "035870380",
  "username": "rdinn",
  "video_url": "https://youtu.be/yjmR9lc65yg",
  "transcript": "Hey guys. Um, so yeah, in this video I'm going to be walking through my full valuation of Panera Bread for potential KKR takeover using the driver framework. Um, this is all in Google Collab. Um, using Python code created by uh, Gemini uh, Pro. Um, so let's start with the first stage which is define. Um, in what I what I'm defining here is the actual decision KKR is facing. They need a defense defensible bid range for Panera. Um, and the goal is to make sure the valuation holds up against both financial buyer discipline and the the higher prices strategic buyers might pay because of synergies. So the core question becomes what is Panera worth across DCF comps and uh preceded and how should KKR position its bid so it's aggressive enough to win but not overpay. Um so the the discover part of the the first letter D um define and discover. Uh I list out all the inputs and constraints I have to work with. Um, Panera is um 900 million EBITDA and 400 million um net income. Um, EBITDA margin is um 15% which gives me a sense of revenue scale. Industry PE averages around 22. uh preceded um 22 and then u preceded EB uh EBITDA uh multiples are 12 to 15X. Strategic comps include Chipotle at 30 35x earning and McDonald's at 25x um uh and then industry WACCC is about 9%. um growth levers 500 new stores digital mix expansion dinner/catering and early international this tells me the valuation um can't beed one-dimensional I need DCF for fundamentals comps for market sentiment and pre preedence uh to capture takeover pricing um let's move on to the represent stage um now I'm mapping out the plan before I model it uh anything. Um, I built a three scenario DCF base upside downside. Um, build trading I built a trading comps using PE and EV um, EBITDA multiples. Um, and I built a precedent transaction comps. Layer in synergy analysis for uh, strategic biders. Combine everything into football field range. Um finish with a bid strategy for KKR. Um once this plan exists, becomes uh super clean. Now I actually show the code. Um so implement so this is uh I'm going to walk through each cell now. So in cell one I loaded the libraries. Um here I just imported everything I need for uh pandas, numpy and uh mattplot liib. The these are just basic set setups. um in cell two um are in input assumptions. Um so these are all the variables the the rest of the the model pulls from. I parametricized everything so I can toggle uh WACCC growth rates, terminal growth, synergies and scenario switches. Um cells three through five are uh year project projection functions. Um this function builds out revenue, growth, margins, EBI, TDDA, and free cash flow. Um flows for all the three scenarios. Um the output is a clean table for each scenario. Um cell four uh was a run base slashup slash down projections. Here I actually uh run the projections. Uh the results um populate three uh data frames base DF, upside DF and downside uh DF. Um cell five uh was the DCF calculator. This cell takes the the projected cash flows uh discounts them at WACCC and then adds the terminal value. It returns the enterprise value for each scenario. This is where uh I get the DCF valuation range. Um and then cell six uh trading comps calculation. Um here I apply PE multiples and EV/EBI TVA multiples from the pure sheet. Um I use Chipotle and McDonald's for the highend because they help bracket strategic sentiment. Uh this code spits out implied valuation ranges from each multiple. Um until 7 um preceded transactions. I use the 12 through 15x EBITDA range to build an implied deal price. This simulates an actual takeover environment. Um, this lets me adjust synergy uh capture percentages and see how much additional um value uh strategic buyer like Starbucks or um uh or or McDonald's could justify it to KKR. Um and then cell nine uh this cell combines DCF comps, procedants and synergies into one table. So I can show the full valuation spectrum in the video. Um in cell 10 um the plot football field. Uh so this creates a chart that visually shows the entire valuation range uh and helps justify the recommended bid. Um and then cell 11 uh this this outputs the numerical ranges so I can talk through them clearly in the video. Um and then validate. So now um that the model is actually what now I validate what the model is actually saying. So across DCF scenarios, uh, Panera's implied enterprise value, uh, generally falls in the mid teens to to billions around where you'd expect a stable multi-unit restaurant chain with decent growth optionality. Uh, trading comps give a tighter range around industry norms. precedented transactions give me the the deal appropriate premium and synergy analysis shows that the strategic buyers could reasonably justify a higher price. Um so then let's move on to the evolve stage uh for evolving the analysis. I ran sensitivity checks on WACCC uh between 8 to 10% uh terminal growth between 1 to 3% synergy capture from 20 to 60%. Um this the sensitivity runs uh help make sure the bid range doesn't hinge on one fragile assumption and then um let's move on to the reflect stage. Finally reflecting on the the driver process um breaking out uh define and discover before the modeling kept me from jumping straight into numbers. Representing the plan ahead of time made the technical modeling uh extremely clean and uh having everything uh parameterized helped with scenario toggles and sensitivity analysis. Uh so the final bid recommendation uh so based on the full triangle DCF comps preceded plus synergy overlaps uh here's my executive ready bid recommendation for KKR uh valuation ranges illustrative based on code outputs uh DCF range 14 billion to 18 billion trading comps uh 16 billion to 19 billion precedence 10.8 8 billion to 13.5 billion. Strategic synergy adjusted valued uh 20 billion plus. Um so my recommended bid strategy KKR walk away price 16 billion. Uh initial bid anchor 13.5 billion. And here's my justification. Uh financial buyer uh discipline requires not overpaying for projected growth that still carries execution risk. uh synergies occur uh mainly to strategic buyers not KKR rollover ownership from management helps uh alignment and gives upside without overstretching uh strategic players may over bid due to restaurant overlap uh digital inf infrastructure and brand uh leverage but KKR shouldn't chase that um so the clean takeaway is uh KKR should bid aggressively enough to be competitive with financial show buyers but not draft into strategic buyer pricing territory. Um yeah, so that's all the the driver framework. Um and then here's all the code from uh the Google Collab, the notebook if you want to take a deeper look into it. Um yeah, thank you guys for for watching. Um these are all the outputs and that's all for today's video. Thank you very much."
}