{
  "student_name": "Brody Springer",
  "org_defined_id": "037338416",
  "username": "spring48",
  "email": "",
  "transcript": "is and this is for um professor Zen's class management 310 um and this is session 8 assignment um we're supposed to investigate market eventually using the GameStop um GME short squeeze event of 2020 and 2021 and then for the first part for divine define and discover our goal is to establish the scope objectives and initial data requirements our primary goal of this um case studies to investigate the GME short squeeze to ac assess market efficiency and evaluate the role of behavioral finance. Some key questions to ask was the initial price statement of for cents in August 2020 accurate? Which form of EMH was potentially violated? And could a rational investor have generated systematic risk adjustment abnormal returns? Um and then discover an initial data check. um immediately create create a reliable financial data source for GME's historical trading data from August 2020 and then we're supposed to verify the accuracy of the 4 cents in August 2020 but the actual price was likely the to the $4 to $6 range so it was um incorrect 4 cents next step is to represent um our data requirements and acquisition plan data points um gi price and volume. Um, S&P 500 or Russell 2000 market returns for abnormal return calculation, the historical short interest data for GME and the relevant news social media sediment data. um SP supposed to figure out an em testing use auto auto correction of daily returns and risk test to check for non-randomous or pred predictability and past price data. Um and then we're supposed to identify map behavioral biases hurting available bias and confirmation bias. for the I we're supposed to execute the plain analytical models using the acquired data and Python code. Um and then if we we have this code down here um here's all the code um over here. Um if we look at some individual things um the the code gene analysis pon py uh load loads the necessary libraries y to download data um for the man manipul manipulation for plotting um some other ones fetch and verify data it's fetching data from other websites like fan finance and figuring out um like uh the different prices like GameStop traded at 4 cents in August 2020 but that was incorrect is an incorrect statement. Usually it traded at between $4 to $6 range. And then the calculate returns is just calculating um in finance log returns are preferred over simple returns because they're additive making cumulative calculations easier and better approximate continuous compounding. Um as we move on to um the Eve portion of driver um the EMH violation conclusion the strongest conclusion the event primary primarily violated the semi- strong form EMH because the price 483 severely deviated from the public fundamental value to 10 to 40 range. Um weak form check if the time series analysis showed non-random returns during an event. It also points for a weak form violation. Um the strong form check the fact that insiders um and retail traders had information coordination not available to the general public or institutions suggest a violation of strong form efficiency as well. Um for the behavioral finance assessment hurting in social media conclude that the GM event is classic example of crowd behavior driven by social media. The large volume spikes confirm hurting um the rational investor profitability conclusion. Expost looking backwards systematic profit was possible for lows with superior information or coordination. However, X anti- irrational risk averse investor could not have real reliably predicted timing or magnitude of the squeeze thus preventing systematic risk adjustment profit. The high volatility implies the risk returns came from unacceptably high risk. Now for the R report and refine key takeaways, the GMA short squeeze represents a severe short-lived semi- strong market anomaly driven by combination of high short interest and social mediadriven hurting behaviors. Um while EMH defines the price um the framework preference while EMH defines the price as a massive mispricing the behavioral fire finance framework is better equipped to explain the mechanism duration of anomaly the hurting plus limits to arbitrage um policy implications. The event highlights the need for reviewing rules around short selling disclosure trade settlement times and the ability of brokerages to restrict trading. Some limitations in future work. Um some limitations. The current analysis based on daily data. Intraday data would provide deeper insight into the speed of um of price changes. Statistical significance testing was optional. So it's basic here. Uh the refinement future work could involve building a regress a regression model to more rigorously estimate the expected return and calculate abnormal returns with greater precision. And that's about it.",
  "video_url": "https://youtu.be/R6QYOjbUW6g"
}