{
  "student_name": "Robby Bergeron",
  "org_defined_id": "035626927",
  "username": "bergeror",
  "email": "",
  "transcript": "Today we are looking at Netflix's decision to invest $5 billion into their content and we're going to look at the weighted average cost of capital. So the key formulas today are the cost of equity and it is going to equal the risk-free rate plus the beta times the market risk premium. The after tax cost of debt equals the yield times 1 minus the corporate rate. the capital structure weight of equity equals the market value of the equity divided by the market value of the debt plus the market value of the equity and the capital structure weight of debt equals the market value of debt divided by the market value of debt plus the market value of equity. So that makes the weight adjusted cost of capital equal the weight of the equity times the cost of the equity plus the after tax cost of debt times the weighted cost of debt. So looking at the financial layout that we have here mark Netflix's market capitalization is $200 billion. They have 13 billion as their market value, $14 billion debt is their book value. So, not very much debt as we can see. Lots of equity, equity beta of 1.3, bond rating of tripleB plus with a yield of 5.8. Corporate tax rating of 21% and a current stock price of 450, which is pretty high. Kind of nice, you know. Market risk and inputs, market risk free rate is 4.5%. Market risk premium 5.5%. And this is an important thing to look at. It's going to tie in later. The industry and peer benchmarks. The media industry weight adjusted cost of capital range is 8 to 10%. Disney's capital structure is 70% equity and 30% debt with a weight adjusted cost of capital of 8.2%. And Amazon Prime Video uses Amazon Corporate's weight adjusted cost of capital. So big company there at 9.5%. So our plan for today is we're going to compute the weighted adjusted cost of capital. Compute the weight adjusted cost of capital after $3 billion in new debt. Build a leverage sensitivity graph. Find the project specific weight adjusted cost of capital. Compare to the industry and recommend a structure to build the capital more efficiently. So using the formulas that I defined earlier um the cost of equity is going to be 11% 11.65%. The after talk after tax cost of debt is going to be 4.58%. The weight of equity is going to be 93%. So that's a lot of equity with a weighted debt of 6.10%. not a lot of debt with a current weight adjusted cost of capital of 11.22%. Looking back at our um resource or industry standards um we can tell that we're very far above this well not very far a percent or two but by doing the five billion dollars that would be a good step in the right direction to increasing our debt to match our competitors more efficiently. So that would be a good step in the direction from these calculations. And then looking at the weighted cost of capital after the additional three billion, we're going to have a new market value of 16 billion of debt with the weight of equity being 92% dropping a percent there. The weight of debt going up by a percent with a new weight addressed cost of capital of 11%. With the low 11% not 11 and a half. So well was it was the cost of equity was 11 and a half. It only goes down about.1%. But as we can tell headed in the right direction starting to look more like our competitors. So this is because the portion of debt is cheaper because the taxes on the debt can be written off and is low risk for the lender. As they start to build trust they will give you better rates. So these companies will add on to their debt so that they can write off more in taxes and pay less in taxes overall. So this is the called the tax shield effect which can shield the company from their taxes by getting more debt and then writing off the taxes from their debt. So it's just a com it's a tactic that these companies use to shield themselves from some tax. So looking at the sensitivity model, we can tell that our so Disney's about here, but they have an 8%. They're so diversified. This is Netflix we're talking about. So this is a graph based on the Netflix parameters. So this is what Netflix look like with their debt weight distribution. So if we want to get it down to about 10%, we're going to have to push it up to about 40, which would be a big step for Netflix as they are currently about up here. So this proves that it can be heavy heavily risky for them to increase their debt as quickly but they will get increased returns in the long run. So it is a give and take relationship. Looking at the industry standards across the board, Netflix is a lot higher than its competitors and both weight adjusted cost of equity of co cost of capital sorry and the equity weight looking at Disney they have about 20% less equity weight than Netflix which can be explained by their vast diversity which we'll get to. So looking at first at the cost of equity, Netflix has a higher cost of equity than Disney reflecting their higher risk and yep looking at the capital structure 94% to six low leverage and Disney has 30% reflecting their lower weight adjusted cost of capital. So looking at the business models, Netflix is a very focused on their streaming which is technically a higher risk which reflects the weight adjusted cost of capital being higher and their equity being higher and their debt being lower because it's a high risk industry with so much competition. And since they are so focused on the one aspect of streaming, their competitors like Disney or Amazon that have more companies such as the parks or delivery services or other companies that they own are able to diversify more and stabilize their weight adjusted cost of capital while also delving into debt with less risk. So that's why we can tell these numbers are the way they are. And the the way this can be a problem is the way to adjusted cost of capital can act as a hurdle rate for investors kind of like a blockade. It seems a little risky. Like why would you want to invest in Netflix when Disney is so much less risky with an 8% risk you know why would you want to um invest in Netflix but you can get a higher reward. So we would need to lower our weightages of cost of capital if we want to compete with the likes of Disney or Amazon and investors might perceive us as more high risk because of our equity structure being so high. Looking at the international versus US market for the weight adjusted cost of capital, we can tell that the US has a much lower cost of capital for the weight adjusted variety because they the United States has so many different resources and streams that we are able to diversify more and lower our weight adjusted cost of capital. It is about 2% lower than the international weight adjusted cost of capital which could show that the hurdle rates for some of the projects would be more valuable to the United States competitors as it would be harder for them to go over the hurdle rate in the international um markets. This could be to many reasons because of the instability in Europe and the overseas market. Um this makes a lot of sense. This goes with the market research that we would expect. The market volatility of international markets might be less mature in the international market which would make it harder for Netflix to get their immediate returns or such. Therefore, it would be easier for Netflix to try to be in the United States as the international requires a higher return and hurdle rate. Reflecting on what we know now, we would recommend that Netflix tries to achieve a target debt weight of about 20 to 25% to match its competitors and reference the debt sensitivity graph as here. So they might want to even try to go down to 40% or at least try to get 30 20 to 30%. So they can just continuously start the letter. But 40% might be a better determining goal for the long run. But that's a heavy heavy burden to take on and such a time like this. You know, it takes a lot of time to reach that goal because we want to minimize the weight adjusted cost of capital so that we can look better for investors and have a better overseas market, which means more money in the long run and then maintain a balance between our equity and our tax shield so that we're able to establish this tax shield and write off more of our taxes to achieve a better equity goal and look more appealing to our investors overall. I really like this project. I got to learn a lot through Gemini and the collab experience. So, I was very appreciative of that.",
  "video_url": "https://youtu.be/2HaCA3stb2o"
}