{
  "student_name": "Juan Antonio Sevilla",
  "org_defined_id": "033541051",
  "username": "sevillaj",
  "video_url": "https://youtu.be/LSq5WFdHatU",
  "transcript": "Slide 1 — Title Slide: Netflix: Debt vs. Equity Financing – A DRIVER Analysis\nHi everyone. Today I'm going to walk you through a DRIVER analysis of how Netflix might finance a $3 billion global studio expansion.\nThe idea is to compare debt, equity, and mixed financing, but not just from a cost perspective. Instead, I focus on how each choice affects risk, ROE, and the incentives of different stakeholders.\nTo make it concrete, I built a small Python simulation that models how Netflix's return on equity changes under different EBIT scenarios. This lets us see how leverage impacts outcomes even when the core business stays exactly the same.\n\n Slide 2 — D: Define / Discover\nLet's start with Define and Discover. Netflix wants to expand its production capacity globally, and that requires raising about $3 billion.On the surface, the question is \"How should Netflix pay for this?\" But the deeper issue is how the financing structure shifts incentives and risk between shareholders, bondholders, and managers.\nNetflix has three options:\nIt can issue equity, which avoids fixed payments but dilutes ownership.\n\n\nIt can issue debt, which maintains control but adds interest that has to be paid no matter what.\n\n\nOr it can use a hybrid approach.\n\n\nThe key point here is that financing decisions aren't neutral. They change who absorbs the downside and who benefits from the upside. So before running numbers, we already see a tension between dilution, control, and financial risk.\n\n Slide 3 — R: Represent\nNow moving into Represent, we translate the decision into financial logic.\nIf Netflix uses more debt, it increases leverage. Leverage amplifies returns to equity holders—positively in strong years and negatively in weak ones. With fixed interest payments, debt makes the upside bigger but also makes the downside more painful.\nIf Netflix uses more equity, leverage falls. That lowers bankruptcy risk and creates smoother, smaller returns. It also gives management more flexibility because there are no mandatory payments.\nThis creates classic agency conflicts:\n Shareholders may want higher leverage to increase ROE, while bondholders prefer stability. Managers must balance growth investments with financial safety, especially in a volatile industry like streaming.\n\n Slide 4 — I: Implement (Python Simulation)\nTo implement this, I built a Python model using a simplified Netflix scenario.\nI assumed an $800 million investment, with a debt case where Netflix borrows $400 million at 6%. The business operations stay exactly the same; the only thing changing is how the project is financed.\nI then tested three EBIT scenarios:\nA recession year\n\n\nA normal year\n\n\nAnd a boom year\n\n\nFor each case, I calculated Net Income and ROE for both the no-debt and with-debt structures.\nWhat the model shows is that financing alone can dramatically change the return to equity holders—even when the core business is identical. This is the real power of leverage.\n\n Slide 5 — V: Validate (Results)\nNow let's validate the results.\nThe model confirms the theory very clearly.\n In the no-debt scenario, ROE is lower but stable. There's less upside, but also less exposure to downturns.\nIn the with-debt scenario, ROE increases significantly in the normal and boom years because equity is a smaller base. But in the recession case, ROE drops sharply since interest eats up a big portion of earnings.\nThe ROE plot visually shows this: the leveraged line is much steeper, meaning outcomes become more extreme in both directions.\nSo the model validates what we expect: debt increases both return and risk.\n\n Slide 6 — E: Evolve\nIn the Evolve step, we think about how the recommendation might change if assumptions shift.\nIf interest rates rise, debt becomes more expensive and less attractive.\n If Netflix's earnings become more volatile, equity financing becomes safer.\n On the other hand, if Netflix enters a period of strong, stable cash flows, leverage might actually be the optimal choice to boost shareholder returns.\nThe point is that the model is flexible. Netflix can evolve the analysis as new information comes in—new markets, new projects, or even changes in competition and subscriber growth.\n\n Slide 7 — R: Reflect\nFinally, in Reflect, we step back to think about the broader lesson.\nThe takeaway isn't just about Netflix's expansion—it's about how capital structure shapes behavior. Debt and equity influence stakeholders differently. Shareholders may push for leverage to amplify returns. Bondholders care about protecting their capital. Managers must balance risk with long-term strategy.So the \"best choice\" isn't just debt or equity—it's finding the right mix that aligns with Netflix's risk tolerance, growth goals, and cash-flow patterns.\nThat completes my DRIVER analysis of Netflix's financing decision. Thank you."
}