{
  "student_name": "None None",
  "org_defined_id": "036732462",
  "username": "cjparmer",
  "video_url": "",
  "transcript": "Here is the word-for-word transcript of the audio recording:\"Good afternoon. Uh, this is going over Mini-Project Number 3. Um, which is using N8N to, uh, make an assignment or make a a financial tool to help you calculate, uh, pretty much whatever you want to calculate. So, uh, the assignment was to build a more advanced AI financial tool using N8N or other platform of your choice. I choose N8N. Uh, it should analyze, explain, and or advise a financial decision you AI through the brain.Uh, the progression that we have had. We've used N8N before and made uh, one step or an easier build of a financial tool. Where this one here goes more in the depth. Uh, discover what financial uh decisions need explanations, not just calculations. Uh, how can AI make this smarter for the reasoning? Implementing it, verifying it. Is AI actually helpful and evolved? So, uh, the first thing I did was I will, uh, just show you. So, let's say, um, here is my whole uh diagram here. Uh, let's get rid of this for now. Um, let's see, I've got a chat tri- chat trigger. So, anything I want to type, uh, for example, mortgages. I can just go ahead and type them in. $\\$300,000$, say I got a $\\$300,000$ house on a $6.7\\%$ interest per year. What's the payment over 20 years per month? So that'll go through there. Trigger everything into the financial management uh agent. Using chat, using simple memory, using calculator, and that'll all format a response. Um, on the first one, it was a lot easier, you just use chat and kind of a uh your chat trigger and AI to get your answer. You didn't really have to have a whole lot. Where this one has calculator. It has the memory of my budget. Um, everything like that. So, I'll go ahead and open this up here. Let's say we've got a um, uh, so I can ask any question that I set, one. What uh is the payment on a $\\$300,000$ house at $6.7\\%$ interest?So, as you can see, this is the chat trigger, workflow configuration, um, and the it says that it is not capable. Oh, it's 'cause I typed some stuff wrong here. So, uh, I'll calculate this. It doesn't know my yearly uh loan or anything like that. I'll go ahead and put this one in there. If I buy a house $\\$300,000$, $6.7\\%$ interest, what's the payment over a 20-year loan? And it'll spit that out for me. Financial Summary right here in the output. Um, category, mortgage, amount. So, this is where it spits out the $\\$2,272$ and $18$ cents monthly payment on a $\\$300,000$ house with $6.7\\%$ interest over 20 years. And then this is where the AI comes into it. Um, you can get calculations where budget is not good. But for this one, the budget is impact, or the budget impact is within budget. So, I've gone ahead and put the budget in here. Uh, what my budget is per month and everything like that. Let's do a different one here. Um, we'll go to this one here. What is the monthly in- um, payment on a $\\$540,000$ house at $2.3\\%$ interest? Calculate this one. Once again, chat trigger, memory, it goes back for the old ones. Pulls the data, everything like that, to get the answer, um, out of all this to format the response. Uh, this run is different because, um, I'm using multiple steps here. I'm using workflow configuration, simple memory, which we never used before, um, in N8N before. Uh, Open AI chat model. We have used, that's where you put your keys in to make it, uh, pull from your Open AI profile, uh, where you pay to get the key. The memory key or the, um, hidden key. Um, here's the calculator, and then structured output parser, uh, and then it formats a response. So, for this one, Financial Summary, category, mortgage. Amount, uh, you can see this one's a little bit more, $\\$2,809$, which you would expect on a $\\$540,000$ house. Um, so right here is where it says monthly on a $\\$540,000$ house, $2.3\\%$ interest over 20 years. Budget impact, and this one is also within budget. So, if I go here, um, my simple memory, open that up. Here's kind of what, uh, it's shown. Here's the history of it. And it'll remember all that for you. So, it's uh, easy to understand. Easy to use. Uh, here's my Open AI chat model. So, this is where my, this is where you go ahead and put your key in there. So, you'll hit this. Um, it'll say what key. And then you go to my API keys. Um, and here's ones that I've created to use for the N8N platform.Uh, I've kind of done a loop one and two all in the same thing to where I've added, um, calculators and memory. I started without the memory and then I added the memory to make it easier for the financial management agent to understand what I'm asking every time that I ask a question. If I was just to put in, uh, 'What's the loan on a $\\$300,000$?' It has no interest, it has no years. To where on the memory, it wants you to have all that stuff every time. So, it's easier for it to understand every time that you ask the question, what it's asking for.I hope this uh is helpful for you. Appreciate it."
}