{
  "student_name": "Gage Pittman",
  "org_defined_id": "037005578",
  "username": "gcpittma",
  "email": "",
  "transcript": "All right. Hello, my name is Gage Pitman and today I'll be discussing the uh GameStop short squeeze and why the efficient market hypothesis failed in this situation. Uh to start the define and discover stage, um we verified that GameStop did not trade at 4 cents in August of 2020. It actually traded between a dollar and 1 cent to $167. And I got this information from Trading View, which also informs me that the current price GameStop is trading at is $24, $21.36. Now, the all three forms had some sort of failure. Um, you know, the public knew that GameStop was near bankruptcy levels. It was below its market price, well, what it should have been at. Um and hedge funds were trying to drive this price even further down such as uh Melvin Capital which the capital investment officer Gabe Plin is the one who made the call and in the end buried the company quite a bit. The weak form failed because the past price and volume could not predict the future because it was mostly uh financial or behavioral bias uh hurting. People used the Wall Street Bets Reddit form and it took off like crazy. And then the semi- strong form was also violated because even though that the 140% short interest was there the price was not the fundamental value. Instead it was market price which due to the 1.4 four times amount of shares being sold and what was actually available caused this which was due to the hedge funds trying to get themselves out of the hole that they dug and put themselves in by buying more of the shares which eventually resulted in Robin Hood a broker to no longer be able to sell any more GameStop shares and this in turn caused mass panic amongst the retail investors who drove the price up and many of him freaked out and started selling. And this is what the hedge funds wanted was to drive their price back down because they banked on the price going down. One point, the market price did reach $438. It was only valued between $10 and $4 a share. So, you could have made a lot of money or you could have lost a lot of money, which happened to many people. Now, the EMH works in a perfect environment, whereas this was no perfect environment. There was several abnormalities that caused it to go way off track. And as you can see, hopefully you can see this. Um, so this was when it to the price, which mean it looks like it just keeps on going. And then the drop after the lawsuit in the market manipulation and the Trading View platform I just showed you is how we validated our information. And after the uh the lawsuit of market manipulation, the price went down, the hype died down, and it remained pretty pretty steady. So, I don't know how to get this off of there. Okay. Well, oh boy. But the hurting kind of gave uh gave way to show that you know retail investors have a stronger influence than what a lot of these uh larger firms and hedge funds think which uh afterwards created the ability for meme coins to become a thing where you know things were all about hype. people came out with a a coin or a a stock, not exactly a stock, but a something you could buy. And people bought it out of hype and then eventually it, you know, bit a couple people in the behind and then other people profited from it cuz they got out when the time was right. Kind of like the GameStop situation. But watch out for abnormalities and don't always trust EMH",
  "video_url": "https://youtu.be/PA9A-saPEbE"
}