{
  "student_name": "Anushka Wayse",
  "org_defined_id": "037494252",
  "username": "wayse",
  "video_url": "https://youtu.be/UVx4qP0DugI",
  "transcript": "00:01\n Hello, this is my Management 310 Capstone project.\n00:05\n So to begin, I ran a prompt in Google AI Studio to solve our problem of creating an app that is an executive variance explainer\n00:18\n that just explains variance to people who may not have a financial background.\n00:22\n So in order to do this, I sent a prompt into here, and it just essentially begins with\n00:27\n that you are an AI financial analyst and a product builder.\n00:32\n So the task is to help me build an interactive AI tool that explains budget versus actual finance variances\n00:38\n to non-financed people like managers, founders, and board members.\n00:42\n And this is not a report, it's just something that users can interact with and can be live demoed.\n00:47\n So our goal for this app is to create an MVP, variance explanation tool, that takes the user input for budgeted and actual numbers,\n00:53\n identifies favorable and unfavorable variances, explains what happened in plain and simple English,\n01:00\n and avoids accounting jargon and sounds like a clear boardroom explanation.\n01:04\n So user input should include a budgeted revenue, an actual revenue, budgeted expensive, actual expensive,\n01:10\n and also an optional short context, whether it's a recording, a micro-conditions, or even a one-time event.\n01:17\n And the AI output should clearly state what performance, be it or miss, expectations,\n01:22\n explain likely causes in a non-technical language, focuses on the business impact, not formulas,\n01:28\n and also to be concise, so three to six short paragraphs or bullets,\n01:34\n and some constraints to use live AI reasoning, so not any of these hardcore RAD responses that are up and ready to use,\n01:43\n something that's actually being generated by AI. Assume the reader has no finance background.\n01:48\n Keep a demo ready inside Google AI Studio.\n01:51\n So the task was to design a user flow, what the user inputs and what they receive,\n01:57\n write a system prompt and a user prompt for the variance explainer,\n02:01\n provide example inputs and example outputs, explain how the eye can remember this in under two minutes,\n02:07\n suggest how this can be extended to a V2, and to the again.\n02:18\n So to start, our app has input for financials, so here we have budgeted revenue and expensive,\n02:26\n which can be changed and are interactive, as well as our actual revenue and our actual expenses,\n02:35\n which are also interactive. And then a short brief context.\n02:39\n And for this example, we went ahead and used, we explained that our sales from quarter two,\n02:43\n which are higher revenue, but slightly increased payroll costs.\n02:49\n So our context for this is that we expanded our sales team.\n02:54\n And then go ahead and get that AI results.\n02:59\n So what we see from putting that all in is here we have a visualization of the performance.\n03:06\n Here we have our revenue, our expenses and our net income, and then also how those went up.\n03:11\n And we can see here that the expenses variance went up by 2.5%, and that is red as it was increasing.\n03:19\n However, our revenue variance is green, even though it is increasing.\n03:24\n And here's we don't want to see our expenses to increase.\n03:27\n So it gives a good visualization of that, especially for someone who doesn't have that finance background\n03:32\n or accounting background and don't understand.\n03:35\n And then it sends out an executive summary as well.\n03:40\n So profitability significantly exceeded expectations driven by strong revenue growth.\n03:46\n And here just AI, you can see that it generated a quick executive summary that they can give to a board meeting.\n03:53\n So here we see the revenue summary, our total expenses as well, and the overall result as well in the income.\n04:03\n We can see that AI gave a reasoning behind this.\n04:07\n So I think someone who may want to use this tool and someone who this tool, an app can be useful for,\n04:13\n is non-finance managers, startup founders, project leads,\n04:17\n just people who may not understand completely what a lot of these numbers mean\n04:21\n and how to calculate them into actual distinguishable values.\n04:27\n So just you need to understand financial results but may not have that background.\n04:34\n And someone who really is like finance teams regularly,\n04:38\n you have to explain the budget versus actual results in meeting and reports.\n04:43\n And this tool replaces our manual explanation with a clear instant summary that non-finance people can understand.\n04:49\n So even they can cut out a lot of that technical jargon that they may need to do in order to calculate these costs.\n04:56\n And with actual users, I've tested this various times using numbers that may have gone negative.\n05:02\n So seeing if the AI would generate an executive summary that says that they did not do well that year\n05:10\n or they did not do well that quarter, and it worked, as well as different numbers, which are high and low.\n05:17\n The case that people can use it is monthly or quarterly performance reviews.\n05:21\n Manager can enter a budgeted and actual number around\n05:26\n and actually get instantaneously explanations to use meetings, emails, or report updates\n05:32\n without needing a lot of that finance background.\n05:35\n Something that was hard, however, was getting the AI to actually explain the numbers\n05:39\n without using a lot of that accounting jargon.\n05:41\n So a lot of the early versions sounded way too technical.\n05:44\n So I had to refine the prompt multiple times to make the language simpler and more business-focused.\n05:48\n And what I'd do differently in the future to combat this is I would add more input fields\n05:55\n to the department levels, costs, or one-time events.\n05:58\n Let users choose a tone, so if they want something that's even more brief,\n06:02\n something that's more detailed, or an executive summary, as well.\n06:06\n And also add charts alongside the explanation for any visual learners, as well.\n06:10\n So understanding the build process is that I learned that building with AI\n06:14\n is about the prompt and the iteration and testing, not just about asking one question.\n06:19\n I had to define the clear outputs, the structure for the prompt carefully,\n06:22\n and also test different scenarios and adjust based on any feedback.\n06:27\n And also what the AI had generated to make sure the output was useful and consistent.\n06:33 Thank you."
}