{
  "student_name": "Scott Robbins",
  "org_defined_id": "034079527",
  "username": "robbin55",
  "email": "",
  "transcript": "Okay, so, Session 10, Assignment, Cost of Capital Analysis. So, in class, we, ahem, the way the professor described it to us, was we went through and then we made it applicable, So Apple, Apple. Applicable to us, and we talked about construction projects and how we get the money, what it takes to start the project, like the front load, like the initial cost, what you have to put in, like the initial investment and how, uh, the general contractor starts. And how he gets, and how he use it, gets the money. So usually it's like the company puts up 50% of its own money and then they get a loan for the rest to start paying out the work that's being done. So that's kind of the same thing we're doing here. And we're evaluating Starbucks and the $12 million upfront. Outlay operate for 10 years. Okay. 8.5% WCC. Okay. So the initial investments, 12 million building equipment, training depreciated straight line over 10 years, working capital, 500,000 revenues, 8 million in one year, 11 and two years, two to five 90. Okay. Operating costs, basic stuff, taxes, corporate tax. Okay. So the driver framework, so define the core investment decision. So obviously we just defined that, which is Starbucks. Um, initial investment was 12 million. So the first thing that we really talked about in class was like the depreciation. So depreciation, 12 million divided by the 10 is $1.2 million a year. Okay. Initial atlay that is the initial, like investment, how much you're losing right off the bat. So our map, the cashflow, so make, make a financial timeline. I made it use a graph, make a graph on how much you're we would make. I also did it here. You could, where's that? Cashflow, present value, and how much we have per year. Build model and calculate. So we built a model using all the math and the cashflow, the after tax, everything to calculate and give us the initial rate of return, everything to give me. Year 1, year 2 to 5, and then year 6 to 10, and how much we make. Net present value, 8.5%, 2.691 million dollars. Give us the same chart, let's see. Test assumptions, initial rate of return. So, the initial rate of return, eh, calculated it worse. 10.15% a year. So, I think we should 100% do this, based on how much we will make a year. Yeah, it's a huge hit to make it, but you could take out loans, like we talked about in class, put up half of it, uhm, get business partners. This is Curse.",
  "video_url": "https://youtu.be/8Rmt8oV4hdk"
}