{
  "student_name": "Deep Patel",
  "org_defined_id": "037663656",
  "username": "pate2233",
  "video_url": "https://youtu.be/wsITozgcOiI",
  "transcript": "Hey guys, today I'll be doing my session 12 corporate financial decision assignment. Okay, so for define and discover the goal is to value Panera Bread for a potential KKR acquisition. So Panera generates roughly 900 million EBITDA, 400 million net income, 15% is their margin, and across 2,100 stores across the US. Digital sales already represent 50% of their revenue. um march market benchmarks like for the industry um PE value is roughly 22 times the predicent EBITDA multiplies about 12 to 15% Chipotle trades at 35 35 times the PE and McDonald's is 25 times the PE um capital assumptions is that the WACC is 9% the management wants 10% equity rollover and then the key decision ition questions that we want to answer is should KKR win in win this as a financial buyer or will it will a strategic buyer outbid due to the synergies. So to represent this I built three um valuation engines a multi-senar DCF trading compositions and precedent um transactions. So I structured the base upside and downside cases. And for growth drivers, there are 500 new stores in the next five years, the digital mix rising to 70%. Um, dinner and catering expansions throughout their stores, early international rollout, and then the outputs I'll get is the enterprise value, equity value, implied share price, and the bid range. So to implement this I'm going to um use Gemini for the information that we already know. Okay. So I entered in all the things in Gemini. So the EBITDA is 900 um million and then the margin is 15%, net income is 400 million. The stores are 2,100. The digital mix is 50% right now and the WACC is 9%. And management rollover wants roughly 10%. So um I just gave it some stuff that it should do and then it gave me the code and then as for the code um this is things that I already told it and then this is all just like formulas and scenarios that it uses to calculate the problem that I have and then I'm going to analyze this back into the Google slides. Okay. So the DCF base um case value at Panera is about 11.2 billion of the enterprise value with an upside of roughly 19 billion and a downside of roughly 7 billion reflecting growth and risk scenarios. The 5-year projections show steady growth um steady store growth, rising digital mix and EBITDA increasing from 970 million to 1.28 28 billion with um drives free cash flow growth. Um trading compositions value Panera between 11.8 billion and 17 billion depending on whether we anchor to industry McDonald's or Chipotle. Um precedent um transactions imply a tighter range of about 10.8 billion to 13.5 billion which reflect typical takeover discipline. The financial buyer value KKR is anchored near the 11.2 2 billion base case and um base case DCF while the strategic buyer values rises to 14.5 billion due to energies and the football field chart shows where all methods overlap and the dashed lines marked um marks the base DCF as the fair standalone value and the sensitivity table shows valuations is more sensitive to WACCC and terminal growth with EV ranging ranging roughly from 7.6 6 billion over um 21 billion. And then the five five-year projections of revenue EBT EBITDA and free cash flow terminal value growth using the perpetual growth method. And the multiplies applied were the EBITDA compositions at 12 to 15% and the PE compositions at 22 to 35% and strategic buyer case includes store overlap synergies, digital scale efficiencies and operating leverages. So to validate all this, DCF outputs fell between trading compositions and precedent transactions which is um expected. So the upside case reflects faster store growth, higher digital margins. A downside case reflects and slower slower unit expansion and margin um pressure. Strategic buyer valuation exceeds financial buyer due to the synergies and control premium. So I can evolve on this by using the KKR which is the financial buyer they focus on the free cash flow the leverage capacity the exit multiply discipline and the synergies is minimal. So for the strategic buyer which is like Starbucks and McDonald's they pay more due to overhead elimination digital infrastructure sharing and purchasing power and as for the strategic bidding can rationalize higher EBITDA multiplies and um higher takeover premium. So to reflect on this, my football field valuation triangulates the DCF compositions and precedent deals. And I recommend KKR bid range for the low end to be the financial buyer DCF and for the high end to be bottom of the strategic buyer value. Thank you."
}