{
  "student_name": "Chihiro Ueki",
  "org_defined_id": "034175099",
  "username": "ueki",
  "video_url": "https://youtu.be/ylt8HlOqdqg",
  "transcript": "So, first we're going to start by defining our core inputs from the deal snapshot. And so that here is the right here. So get in $900 million in EBIT TDA and $400 million in net income crucial. We set the financial buyers baseline cost of capital which is the 9% industry whack. And then we have a strategic whack of 8%. To contrast with the financial buyer, we made that lower which reflects our assumed synergies. We also set our long-term 3% growth rate and 10% management rollover as deal constraints below. Next,\n\nit's all about market references. These multiples like the 22 times industry P& and the 12 to 15 times precedent EVITDA range are the anchors of the analysis. So just setting that again but again we have the other industries as well and uh other companies in similar industries as well just as a reference like Chipotle and McDonald's here. Next, moving on to the implementation. We want to talk about this right here, public training comparables. So, here we implement the P& analysis. We calculate the baseline equity value of 8.8 billion using the 22 times industry multiple. The code then uses the McDonald's 25 times P& to calculate the premium equity value\n\nto calculate the premium equity value of $10 billion establishing the high-end benchmark for stable QSR brand. Third, we talk next about president transactions which is right in here. So here we implement implement the EBITDA analysis. This is critical for the analysis and the assignment details as well. So applying the 12 and 15 times precedent multiples directly to the $900 million EBITDA gives us the core enterprise value value range of $10.8 billion to 13.5 billion.\n\nNext, another thing is the discounted cash flow right here. As you can see, we proxy the future cash generation as 1.25 times the net income. This high multiplier is justified by Panera's stated growth levers, which is lots of new stores and 70% digital. As it said within the assignment, the DCF is run using the golden growth model as we went over. So next we talk next about financial buyers. So this runs the DCF using the 9% industry whack. This yields the discipline standalone EV of 14.1 billion. Next the strategic buyer again here is using the lower rack of eight whack of 8% incorporating the value of synergies. And then we see that this value this significantly boosts the valuation to $18.8 billion as you can see in the output below as I'll show at the very end there. Next in terms of validation and reflection we talk next about let me find it in here real quick. EV\nyes right down in here. So next it defines the competitive ranges based on the valuations. KKR's discipline range is set from the president minimum to the financial DCF maximum of 10.8 billion to 14.1 billion. The strategic range is validated a ceiling of $18.8 billion. So in terms of the winning strategy, we calculate the midpoint next between the KKR's high floor and the strategic buyer's low floor. The target price as shown in the output is going to be $15 billion. Again, here's the output. Thank you."
}