{
  "student_name": "Sam Eichstadt",
  "org_defined_id": "035801901",
  "username": "seichsta",
  "email": "",
  "transcript": "Hello, my name is Sam Eichstedt and this is my session 9 assignment. So for this assignment we were tasked with finding the weighted average cost of capital capital for Netflix. And in connection with a hypothetical 5 dot, $5 billion content investment decision. So we pretty much want to calculate what their cost of capital is right now and then we want to calculate what their cost of capital is after they do this said $5 billion investment. So for this analysis, we're going to determine current WACC impact of the debt and assess different discount rates in Netflix Capital Disney. Sorry. So for this I came up with my driver framework here. Define the problem here. Netflix must evaluate its cost of capital support a hypothetical $5 billion content investment. Why does this analysis matter? Capital structure influences financing costs, hurdle rates, and investment variability. The metrics that we need for this are the weighted average cost of capital, cost of equity or CAPM, cost of debt, tax shield, project specific discount rates and yeah, for research and requirements that are of the driver framework. We need to have we were listed all of the financial inputs. So we have a market cap of 200 billion, a book debt of 14 billion, market debt of 13 billion. The beta for this company is 1.3. That means for every 1% the market moves this. This moves 1.3% in either direction. The bond yield for this company is 5.8%, tax rate is 21%, risk-free rate of 4.5, market risk premium of 5.5 and et cetera, et cetera. This is all just stuff we were given. So for interpreting this data, I'm going to calculate the cap in before and after the investment, define the after tax cost of debts, decide whether these book market values, interpret how leverage affects beta and whack. And to validate this, we're gonna check it and compile or compare from the investment from before the investment or after after the investment to before the investment and see how much it changed. We're gonna validate the beta and risk free rate. I'm sure the debt yield is investable, I guess not too risky because Netflix isn't a very risky investment in general. OK, so and then executing these. I have a Python code that kind of executed all of the calculations that we need. We'll get into that and then at the end I'll recommend my kinda action that I think they should take. So that's my driver framework that I'm following for this assignment. So if we head over here. To sorry, head over here to Gemini. So Gemini, I need a Python code that I can transfer to collab for the following about the attached pictures. The pictures are just a picture of the assignment and then I told calculate Netflix's current whack. The WACC after $3, the $3 billion debt issuance value project specific WACC carry Netflix to Disney and explore differences and recommend optional structure strategy. So it gave me this long kind of Python code that I transferred here. You can click run here and see it popped out the following. We can see that the parameters that it loaded were the market value of equity of 200 billion, market value of debt of 13 billion. And then to calculate it, we calculated Netflix's current whack as 11.22%. So that number is very important. Keep an eye on that cost of equity of around 11.65% after tax cost of debt of 4.5%, equity weight is 93%, debt is only 6%. That's relatively low low debt to equity ratio. And then that gives us the current whack of 11.22%. So after Netflix does this $3 billion debt issuance, we can see that the new whack after this debt issuance is 11.13%. So before it was 11.22, now it's 11.13. We can see that it dropped 8 basis points. Yeah, or 9 basis points. Sorry. No, 8 basis points. Yeah. OK, so it dropped. That means it's good. That means the company's costs are less. Than they were without the debt. So I guess my kind of recommendation would be to issue more debt. They're not using enough if the WAC is still going down from issuing more debt, because why wouldn't you make your cost of capital cheaper if you could? I think that's pretty straightforward. Forward answer for that one, so that would be my recommendation. But yeah, so project specific whack out evaluation from here for international we can see here. Yeah. So the beta for the US content is 1.1 per 1.1, sorry, which is relatively good. And then the international content for Netflix is the beta is 1.5%, so it's way more volatile. The cost of equity in the US is 10.55%, where internationally it's 12.75%. So if they spend more international, which kind of makes sense because they're a US based company, but yeah, that's expected. So that's my international versus domestic. kind of summary. Uh, yeah. And then the leverage impact, they're under leveraged, um that you need more debt. Like I said earlier, we can see that only 6.1% Um is their debt weight compared to their equity weight of 93.9%. Um, I'm not sure the exact debt to equity ratio that would be it's. Something not too high. Let's see 6.10 divided by 8. Yeah. So they have around a 6% debt to equity ratio, which is. Which is very low, so they can definitely afford to issue more debt, and I think they should. So comparing it to a peer, I chose Disney because Disney's in the entertainment industry as well. Netflix's whack is 11.22% higher and it's higher than Disney's of 8.2%. Means Disney. Disney's cost of capital is 8.2% and Netflix's cost of capital is 11.2%, which means Netflix is spending 3.02% more money on their company than Disney is. That's not spending. That's how much it costs them. Sorry. Netflix has a lower debt weight compared to Disney. Lower debt means less tax shield benefits, which increases whack, which we can see here. The cost of equity slash risk. Netflix's equity beta of 1.3 implies higher systematic risk than Disney, leading to a higher cost of equity. This typical for growth companies versus established media media conglomerates. But yeah, so again, my recommendation is that they issue more debt cause they're under leveraged and they can use more cheap debt just to lower their costs for now. But yeah, the industry whack range is 8 to 10%. Netflix is current. WAC is 11.22%. That's within the range. But yeah, so I think they should gradually increase their debt financing until the WAC is minimized. That means until they issue more debt and their costs go up and you'd find that kind of that.",
  "video_url": "https://youtu.be/S5aBESRkafw"
}