{
  "student_name": "None None",
  "org_defined_id": "037006517",
  "username": "mwsantan",
  "video_url": "",
  "transcript": "All right, this is my uh mini project\nnumber three. And um it's a goal-based\nsaving advisor that basically just helps\npeople understand whether their\nfinancial goals are realistic. And it\nuses uh Gemini to help analyze, explain,\nand uh provide advice on whether the it\ntheir uh goal is realistic or not. So\nthe problem that I wanted to solve is\nthat most saving calculators only tell\nyou numbers like my previous ones did,\nthe previous projects. They don't tell\nyou if your plan actually makes sense,\nwhat the risks are, or what you should\ndo next. So, I built a tool that doesn't\njust calculate, it advises.\nAnd to make this smarter, I added AI\nreasoning using Gemini. The app\nunderstands the user's goal, their\ntimeline, and their starting savings.\nAnd then Gemini explains what this means\nin real life. So, instead of a cold\nnumber, you'll you get context warnings\nand personalized insights.\nSo, here's how it works. It has a goal,\nthe goal name, uh the goal amount, uh\ntime to reach it, and the current\nsavings. The app does the map math in\nthe background, and then sends\nstructured data to Gemini, which then\nuses the information to generate a\nbreakdown, risk level, and\nrecommendations, which everyone likes it\nto keep it simple. Just we like to put\nthe information in and just have the\ninformation spit back out to us, which\nis what I created with this. So, here's\nthe analysis. uh you know, everyone\nwants to buy a new house and let's put\nit in my shoes. Let's say it's a we want\na really nice house, $1.5 million, and\nlet's do an un unrealistic\num goal, which is just 12 months to get\nthat money. And you know, basic college\nstudents like me have like around\n$10,000 in savings. So, let's calculate\nthe saving plan.\nHigh effort required. It's a very\nhigh-risisk um goal. So to achieve this\nit it provides you the warning how much\nwe need per month to get that money and\nit gives us an explanation. This goal is\nhighly ambitious and carries a lot of\nrisk. So it gives us next steps to\nconsider recommended timeline\nuh try to find some project products and\nthe guards rail. So it it breaks down\nwhy the required savings are so\ndemanding, what the total savings would\nlook like, and why this goal is likely\nunachievable.\nAnd\nyeah, instead of leaving the user stuck\nwith just the calculations, it gives a\npractical next step like expanding the\ntimeline, lowering the goal, or\nadjusting the budget. Um, this turns a\nsimple calculation into a real financial\ninsight. And I tested the tool with a\nlot of different scenarios to make sure\nGemini stayed accurate, didn't\nhallucinate the numbers or and always\nmatch the math the app produced. So one\nimprovement I made after testing was\nadding the effort levels low, medium,\nhigh, so the communications\nthe so it communicates the difficulty\nclearly. I also re refined the prompt so\nGemini gives more helpful realistic\nadvice.\nSo, uh, what stood out to me about this\nproject is how different it is to the\nhow different it is to build AI. I\nwasn't just coding, um, with, uh,\ncollab. Um, I was shaping how the AI\nthinks and talks. The tools became way\nmore helpful once I focused on clarity,\nsafety, and giving others real real\nguidance. And I really, really enjoy\nthis one cuz it's very, very simple and\neasy to understand. And yeah, that's my\nuh goalbased savings advisor and it it\ncalculates, analyzes, and advises.\nSo yeah, thank you"
}