{
  "student_name": "None None",
  "org_defined_id": "037715236",
  "username": "jcasian",
  "video_url": "",
  "transcript": "Oh, hi. For the mic project three, what I did was to build an AI finance tool using NA10 that it could completely take unstructured financial goals and basically turn them into structured savings analysis with scenarios, recommendations and clean data logging. So, first as always in the driver framework, it comes the define and discover. And in this section, what I defined is how most financial tools only work after the user already knows what they're asking. So real people like we need to understand that real people don't really speak in formulas. They speak in like in different ways. For example, I want a car or I don't know the target amount or maybe I don't know the risk tolerance is low or high and all those type of things. So for me the first thing I needed was a tool that didn't need perfect input. So for example as the things I mentioned before if you can talk to the tool in a human way it will actually understand. I basically I wanted something that could listen to a messy conversational description and later converted into a structured financial logic which then I you will see that it includes some timeline savings contributions risk and etc etc and the key problem here wasn't really the math it was translating human language in into something that an AI could really analyze. So then for let's say for represent it was my first attempt into this this translation. However, it wasn't really usable. My first system message that I entered was this right here. And my first prompt was this. The system message I got it out of an AI. I told it to create a system message for my goal and the prompt it is um really basic. However, these two things after inputting them to the AI agent is message and the chat prompt. Oh, not that. What it did was that it gave me into Oh, and also into my Excel, but I I will explain that later. It gave me these values which in theory it seems that they are correct as they except for the timestamps they present real numbers. However, when I validated that, it gave me incorrect values for all scenarios and the target amount was slightly incorrect and the recommendation notes were incorrect because they were based on incorrect numbers. So, what I did for my second loop was to rebuild the whole thing inside NA10. H what I did was to create a new system message with the help of AI as always that had that basically act as a contract. It had strict formatting with no bullets and every value in the exact order the sheet expected. And here after the after this the workflow became more clear. I inputed a chat message into the chatbot. Then the AI, the open AI with the help of the system message and the simple memory that it didn't really matter but it's useful to have it. It gave an output to Excel which then it gave this output which in this case it actually worked as then I verified it and make sure the tool wasn't just giving random numbers as I manually recalculated the conservative the balance and the aggressive scenar. scenarios using the same formulas and it gave me the exact same values. They matched exactly and this obviously mattered because this proved that the tool wasn't just like giving random things. It actually followed the math and it worked. So when comparing this side by side, we can clearly see how loop one has scattered formatting and assumptions because they're incorrect while loop 2 has clean structured and most importantly it's correct and this is how we knew how this workflow was really stable. So into the next stage which is e which is evolve. I think that maybe a next thing to improve is pulling real external data, for example, interest rate and maybe adding some sanity checks. It might help a lot as well. And maybe we can actually use the simple memory function because right now we're only using one chat. We can maybe use this memory thing in a useful way. And finally to reflect I think in this project the biggest and the most important thing was to realize AI alone isn't just the solution it is mostly the structure around it. Loop one was let's say like a small intern it is helpful however it is very chaotic and loop two however it became more like an analyst. It is organized. It is predictable and respectful of the constraints. I think that was what that was the main change for me. I stopped prompting the AI and I started engineering the environment it worked inside and that's basically where this project actually worked. So, thanks for watching. This was my AI finance tool for mini project 3."
}