{
  "student_name": "Connor Bakota",
  "org_defined_id": "035716300",
  "username": "cbakota",
  "video_url": "https://youtu.be/BoN94bRxNeM",
  "transcript": "Hello and welcome back to another\n0:06\nassignment for management 310. Um today\n0:08\nwe're going to be going over session 11\n0:10\nassignment. Um once again I'll be using\n0:12\num a dual monitor setup. So right over\n0:15\nhere is where I'm going to be explaining\n0:16\nit and then right over here is where\n0:18\nI'll be recording. Um but let's just dig\n0:20\nright into it. So for section six\n0:22\nassignment, corporate financial decision\n0:24\nanalysis. Um our assignment overview\n0:26\nthat we're given is that we're\n0:27\nevaluating Apple's hypothetical $90\n0:29\nbillion share um repurchase using\n0:32\nDriver. Um we're acting as an\n0:34\nindependent analyst who must determine\n0:36\nwhether the buyback creates value\n0:38\nrelative to alternative uses of cash\n0:40\nwhile balancing stakeholder incentives.\n0:42\nUm our capital allocation snapshot um we\n0:45\nsee that our liquidity is 165 billion\n0:47\ncash and investments with 100 billion\n0:49\nannual free cash flow. Um our market\n0:51\ncontext is we're at 185 uh share price\n0:54\nwith a P P over E 30 um and dividend\n0:56\nyield of.5% with five 15.5 billion\n1:00\nshares outstanding. Our balance sheet\n1:02\nyou see we have 110 billion in debt. Um\n1:04\nBirkshshire owns 6% CEO holds 3 million\n1:06\nshares. Retail investors average 100\n1:08\nshares and then employees have $170\n1:11\nstrike options. Um our proposal is a $90\n1:13\nbillion buyback executed over one year\n1:16\nwith a 10% of market cap. Um the\n1:19\nalternatives are a $6 special dividend,\n1:22\num a strate strategic AIVR acquisition,\n1:25\num debt reduction and incremental R&D.\n1:28\nUm and we'll go through all of those\n1:29\nthrough our code which we've put uh\n1:31\nthrough um AI and refined um ourselves.\n1:35\nUm so you can see in our code right here\n1:37\num we have all our inputs, our price,\n1:39\nshares outstanding, cash, investments,\n1:41\ndebt um and everything else that we had\n1:43\njust explained in our acquisition\n1:44\nsnapshot. Um and then we have our\n1:46\ncalculated inputs with our market cap,\n1:48\nnet income, EPS, um and more. Um and\n1:51\nthen we're defining our different\n1:52\nscenarios. Um our scenarios are we're\n1:54\ndoing status quo. Um we're doing a share\n1:56\nrepurchase, uh special dividend, a debt\n1:58\nreduction, and strategic acquisition\n2:01\nR&D, which is the last option that they\n2:02\nhad given us. Um and you can see in all\n2:05\nthese they have um various calculations\n2:07\ncompared to what it would be um relative\n2:10\num to the scenario. Um and then each\n2:14\ncalculation we have different metrics.\n2:15\nWe have EPS, net debt, net income, debt,\n2:18\nuh cash investment, share outstanding.\n2:20\nUm then you know our impacts right here\n2:23\nare new APS, new share count, new debt\n2:25\nand implied price which will be our you\n2:26\nknow our returns of what we get through\n2:28\nthese different equations. Um and then\n2:30\nyou know our last thing is we just have\n2:31\nit execute and display it um down here.\n2:34\nUm and then we'll run run this code one\n2:36\nmore time right here um just to make\n2:38\nsure that we are consistent.\n2:42\nUm, but that will be running. But I'm\n2:43\ngoing to take you through this financial\n2:44\ndriver analysis. Apple with a $90\n2:46\nbillion allocation. Um, you can see\n2:49\nright here, um, this is our scenarios on\n2:52\nthis side. And then these are each of\n2:53\nour, um, columns giving us our returned,\n2:56\num, metrics. Um, so for status quo, our\n2:59\nnew EPS is 6.17. Our new share count is\n3:02\n15.50. Our net debt is 555, and our\n3:06\nimplied price is 185. Um, now for the\n3:08\nshare repurchase, we have a new EPS of\n3:10\n6.18 with a new share count of 15.01.\n3:14\nOur net debt is 35 with our implied\n3:16\nprice at 185.31.\n3:18\nNow, moving on to our special dividend\n3:21\num scenario. We have a new EPS of 5.1\n3:24\n5.98\n3:26\num with a new share count of 15.50, our\n3:29\nnet debt at 35 as well, and then our\n3:31\napplied price at 179.19.\n3:33\nUm and then moving on to our debt\n3:35\nreduction uh reduction scenario, we have\n3:38\na new EPS of 6.21. Um we have a new\n3:40\nshare count of 15.50 once again. Um and\n3:43\nthen we have a net debt of 55 with an\n3:46\nimplied price at 186.38. Um and then our\n3:49\nfinal one, our strategic acquisition\n3:51\nR&D. Our new EPS is 6.44. Our new share\n3:54\ncount is 15.50. Net net debt is 35. And\n3:57\nthen our implied price is 193.26, making\n4:00\nthat our highest implied price. Um now\n4:03\nafter we have this we can pull a little\n4:05\nbit out out from this um using um some\n4:08\nanalysis and some understanding from\n4:10\nclass. Um so one of the main things that\n4:12\nwe're going to want to look at is our\n4:13\nquantifying stakeholders outcomes. So we\n4:16\nhave a few groups in this that have\n4:18\nstake in this organization. Our first\n4:20\none is retail stockholders. Um they\n4:23\nwould generally prefer the buyback or\n4:25\nthe share repurchase. Um why is this?\n4:28\nWhile the total wealth the price plus\n4:29\nthe cash might look similar between a\n4:32\nbuyback and dividend, the buybacks is\n4:33\ntax deferred. Um and the div dividend\n4:36\nenforces immediate tax bill. So for our\n4:38\nretail shareholders, they would prefer\n4:40\nthe buyback with um tax being deferred.\n4:43\nNow moving on to our management CEO who\n4:45\nis another stakeholder um we see their\n4:47\nstrong preference would be for buyback\n4:48\nor um acquisition. So buyback or\n4:52\nacquisition here. Um and why would that\n4:55\nbe? Well, the CEO wealth column um\n4:58\nbuybacks mechanic uh mechanically\n5:00\nincreased EPS. Uh if your CEO's bonus is\n5:03\ntied to EPS targets, uh buyback helps\n5:06\nthem hit the target without actually\n5:07\nselling more products, which is why that\n5:09\nthey would pick either buyback or\n5:11\nacquisition. Most likely buyback in this\n5:13\nscenario. Um and then for employees, um\n5:15\nwe can see um there's a critical\n5:18\nconflict. They hate the dividend here.\n5:20\nUm if you look at the employee column,\n5:23\num options have a strike price of 170.\n5:26\nUm the buyback stock prices go up. Um\n5:29\nand then the options are worth only $20\n5:31\na share. Um then with dividend stock\n5:34\nprice um drops by the dividend amount.\n5:36\nIf the price drops near 179, the options\n5:39\nare worth $9 a share. Um dividends crush\n5:42\noption value and we know that employees\n5:44\nhave options. Um so this is why that\n5:46\nthey would thoroughly um re um prefer\n5:50\nthe uh buyback or the repurchase. Um and\n5:53\nnow we have for our final one is bond\n5:55\nholders. Um in this outcome they would\n5:57\nprefer debt reduction or status quo. So\n5:59\ndebt reduction or status quo here. Um\n6:02\nand this would be because if you look at\n6:03\nthe net the net debt over here\n6:06\num buyback strip cash from balance sheet\n6:08\nreducing the cushion available to pay\n6:10\nback bonds if the economy crashes. So\n6:12\nfor bond holders, they would obviously\n6:14\nprefer these two um in comparison to the\n6:16\nothers. Um now we're looking at the uh\n6:18\ndifferent alternatives for metrics. Um\n6:20\nfirst we're going to look at the EPS\n6:22\nimpact. Um with buyback, it has the\n6:23\nhighest EPS and it reduces the\n6:25\ndenominator in shares. Um for\n6:27\nacquisition, it has a medium EPS. Uh\n6:29\ndepends on how profitable the new\n6:31\ncompany is. Um and then finally for\n6:33\ndividend um we see it's the lowest EPS\n6:35\nimpact. Um the share count stays the\n6:37\nsame, but we lose interest income on the\n6:39\ncash. Um now moving from EPS impact we\n6:41\ngo to the ROIC which is the return on\n6:44\ninvestment capital. Um with buyback you\n6:46\nusually increases ROIC you're shrinking\n6:48\nthe equity base and making the remaining\n6:50\ncapital look more uh efficient. Um and\n6:53\nthen on the other side of the spectum uh\n6:55\nspectrum we see acquisition um it\n6:57\ndilutes ROIC initially um unless the\n7:00\nacquisition is wildly profitable. Um so\n7:03\nthose are the two difference on ROIC. Um\n7:05\nand then moving on with leverage um\n7:07\nwhich is our final one for our um\n7:09\nalternatives. With leverage you see debt\n7:11\nreduction is obviously lowering um\n7:14\nleverage here. Um but on the other hand\n7:16\nyou see buyback and dividend increases\n7:18\nour net debt um over here\n7:21\num uh by reducing the cash. Um and then\n7:24\nfinally we're going to look at the value\n7:25\ncreation versus the value transfer um\n7:27\nwhich is one of the main things that we\n7:28\nwant to look at. Um as you can see with\n7:30\nthe value transfer, the buyback and the\n7:32\ndividend um neither of these uh creates\n7:34\na new product or con or customer. Um the\n7:37\nbuyback transfers value from bond\n7:39\nholders to shareholders um with bond\n7:41\nholders having less security and then\n7:43\nshareholders having the higher EPS. Um\n7:46\nand then you know our agency cost um\n7:47\nbecause management holds options um they\n7:50\nare biased toward buybacks. Um this is\n7:52\nan agency problem. they might choose the\n7:54\nbuyback to boost their personal wealth\n7:56\num even if an R&D investment would be\n7:58\nbetter for the company in 10 years. Um\n8:01\nand then now we're looking at value\n8:02\ncreation with R&D and acquisition. Uh\n8:04\nthis is the only path that increases the\n8:06\nintrinsic size of the firm. Um however\n8:08\nit carries uh execution risk. If the\n8:11\nacquisition fails um with many tech\n8:14\nmergers um this happens uh value is\n8:16\ncompletely destroyed. Um\n8:20\nso those are our two options with um the\n8:22\nvalue creation and the value transfer.\n8:25\nUm now we're going to go look at the uh\n8:27\nsignaling and market perception. Um what\n8:30\ndoes this you know these decisions you\n8:32\nknow based on it what does it look like\n8:34\nin the market. So if we uh go with the\n8:36\nbuyback um we're saying that we are\n8:39\nundervalued. It shows confidence. It\n8:41\ntells the market we think our stock is\n8:43\nthe best investment we can make right\n8:45\nnow. Um so buyback has a strong signal.\n8:47\nUm dividend um it's looked at as like we\n8:50\nare a utility. Um initiation initiating\n8:53\na large dividend offer signals that\n8:54\nhyperrowth phase is over and Apple is\n8:57\nnow like a cash crow cash cow and not a\n8:59\nstartup. So this one kind of you know\n9:01\nshows um we're stagnant. Um now for\n9:04\nacquisition signal um it shows that we\n9:06\nneed growth. Um we can be viewed as\n9:09\ndesperate if the price paid is is too\n9:11\nhigh or uh or visionary if the uh\n9:14\nstrategic fit is obvious. Um so\n9:16\nacquisition kind of shows you know uh we\n9:19\nare desperate. Um and then debt\n9:21\nreduction signal um this one just shows\n9:23\nwe are sca flatout scared. Um for a\n9:26\ncompany like Apple with huge cash um\n9:28\npaying down debt signals extreme con\n9:30\nconservative conservatism\n9:33\num and perhaps expecting a recession. Um\n9:36\nso debt reduction signal is basically\n9:38\nshowing that we are on the decline and\n9:40\nwe are scared at what's going to happen\n9:41\nin the future. So using all this I think\n9:44\nwe've learned a lot about this you know\n9:46\nuh allocation of whether we should buy\n9:48\nback uh we should do a dividend we\n9:50\nshould acquire or we should uh do debt\n9:52\nreduction. Um through these we've\n9:54\nlearned um the different importance of\n9:56\nyou know our shareholders in this um we\n9:59\nsee our retail shareholders have\n10:00\nsomething um in it management has uh\n10:02\nmanagement like CEOs um employees also\n10:05\nhave and then bond holders as well um\n10:07\nand then we've also seen the different\n10:09\nmetrics and their impacts we've seen the\n10:11\nEPS impact the ROIC the leverage um and\n10:15\nthen another huge thing that we had to\n10:16\ntalk about today was the value transfer\n10:18\ncompared to our value creation skills um\n10:21\nin this market um overall All I think\n10:23\nwe've learned a lot today. Um we\n10:25\ndefinitely have um a better grasp on\n10:29\nwhat we're learning about. Um we know\n10:32\nthe different uh effects of these\n10:33\nmetrics and what it shows in our market\n10:35\nand how we can relay this in real world\n10:38\num and see these different um signals\n10:40\nourselves and make um I and identify\n10:43\nthese trends. Um thank you so much for\n10:45\ntuning in and we'll see you for the next\n10:48\num assignment."
}