{
  "student_name": "Javier Patino-Jacuinde",
  "org_defined_id": "038237921",
  "username": "jpatinoj",
  "email": "",
  "transcript": "Hello everyone. My name is Javier Patino and this is my uh this is my capital budgeting analysis for Starbucks uh proposed flagship roaster. Uh I'll walk through my driver process and show how the model leads to my recommendation. So on my define and discover, I started by defining the decision. Should Starbucks invest $12 million in a roaster expected to operate for 10 years using the firm's 8.5% walk or not or but before doing any modeling um I gathered the inputs I needed. So things such as the revenue pattern, cost structure, depreciation on the $12 million asset, uh taxes, uh working capital requirements, uh and the after tax terminal value. Now this gave me a complete list of all the cash flow components required to evaluate the project. So down in my represent section um I mapped the project into a 0 to 10ear timeline. Uh I laid out revenue COGS or COGS um labor renting depreciation EBIT taxes operating cash flow uh working capital changes uh and and terminal cash flows. um the structure uh guided my Python implementation and ensured every relevant inflow and outflow was captured. So down my implement section go down here uh in Python I built in paramement uh uh paramementized the model that um I built a parame I cannot spell it I not spell I can't pronounce it a parameterized model that uh creates the full cash flow schedule uh and automatically calculates the MPV IRR simple payback discounted payback here let me scroll down too discounted payback and the profitable index As you can see down here, as you can see down here, they calculated that for us. I also coded two sensitivity tests. Um, one revenue down to 20 uh one one that's a revenue down 20% uh for each for the MPV and the IRR. And I had the same go for our walk plus or minus 2%. Here you can see the output table and the charts of the cash flows uh of uh sorry the charts for cash flows and NPV versus uh our walk. So down my validate um I validated the model by confirming that NPV behaves correctly across discount rates IRR is independent of walk and that the revenue shocks change uh the revenue shocks change MPV in an expected direction. I also checked depreciation consistency, tax calculations and terminal value treatment um terminal value treatment. So down to my evolve section, the model is flexible by changing inputs. Um Starbucks can test scenarios like uh higher construction costs uh higher construction costs uh different uh revenue curves or lower salvage value. Uh this makes the analysis a reusable decision tool. So, down in my reflect section, which will basically be going over um my data and what I looked at, it's not working. Give me a sec. My reflect section. If we look here, um from the base case, the MPV uh was about um 7 uh 7 2.7 million uh dollars and IR IR is about 12.8% 8% which is uh above Starbucks's 8.5% hurdle rate. Financially, the project creates value. Um however, the downside uh however the downside sensitivity shows MPV becomes negative if revenue falls uh 20%. Um meaning demand risk is significant. So my recommendation is accept but only if Starbucks has uh strong evidence of sustained demand and commits to a tight cost control strate uh oh my gosh sorry um that they commit to a tight uh cost control. So strategically the flagship fits uh brand positioning but execution and local market strengths are key. Um besides that thank you. Um, this completes my driver walkthrough uh of my capital budgeting evaluation. Uh, thank you for watching. Bye.",
  "video_url": "https://www.youtube.com/watch?v=uTbYvgqyUL0"
}