{
  "student_name": "Tirth Patel",
  "org_defined_id": "037647601",
  "username": "pate2347",
  "email": "",
  "transcript": "Hello. Um, my name is Tarth and in this project I'm going to be using the driver framework on session 8, assignment six, market efficiency investigation. I'm just going to go over the overview real quick. Um, our goal is to investigate market efficiency using GameStop short squeeze event of 2020 2021 as a case study, verify the accuracy of the state facts, analyze price behavior related to the EMH prediction, and evaluate market anomalies. Um, constitute evidence against market efficiency or can it be explained with existing frameworks? The first critical step is to verify if GameStop traded at uh 4 cents in August 2020 against actual historical data. If incorrect, document accurate figures and determine appropriate communication approach for existing or for correcting their professor. Here's the timeline. August 20 GME near bankruptcy levels and then Chevy founder acquires a 13% stake. Reddit, Wall Street Bets, retail traders driven price surge to 483, congressional hearing on market manipulation, postevent price stabilation, which is something that happen uh happens a lot when we see like IPOs or high volatile trading um situations where price stabilizes after a while. Key points, short interest peaked at 140% of float. Retail trading volume increased 10fold during the squeeze. Trading restriction implanted on peak Robin Hood hedge fund Melvin Capital sustained 40 uh 53% loss during loss requiring bailout. Analyst fundamental value estimates $10 to $40 per share. Um so we're going to be required to verify all state historical price data and document corrections. Test whe which form of the market efficiency weak semi- strong was volatile violated. Um evaluate whether rational investors would have profited systematically. Compare effective market hypothesis reductions uh predictions to observe behavior. assess behavior finance expectations for absorbed anomalies. Um, we're going to be using the driver framework for this. So, I'm going to get started with uh the define and discover and the define discover stage. My first step, what I'm actually going to be testing is the core question I'm going to be focused on. Did the GameStop short squeeze represent a breakdown of weak form, semi- strong or strong form market efficiency or can it be explained once we have behavioral bias and time limited arbitrage? The assignment also asked me to do this one critical step first to see if it if GameStop was being traded at 4 cents in August 2020, which already from looking at GameStop's history, I don't think that's true. But we'll get in that to deeper like deeper into that uh later. Um we're also going to be performing a market efficiency test around a short squeeze evaluating abnormal returns, behavioral biases and market anomalies and limits to arbitrage and rational investor profitability. Um I briefly reviewed the three forms of market uh efficient market hypothesis. Weak form is prices already reflect all price past price and volume data. Semi-rong prices reflect all publicly available information and then strong form prices reflect all public and privately um private information. I also reviewed the basic story of GameStop. extremely high short interest, high uh huge retail participation from Reddit, Wall Street Bets, massive volatility, trading halts, and broker restrictions. Just give me a clear picture on what efficiency and inefficiency might look like in the event before actually touching any code and moving into using AI to help us understand this. Um in the represent stage of the driver framework, I chose a broad question and turned it into a solid concrete simplified analytical plan um as finance uh professional should do. So GameStop is the stock I'm analyzing. S&P 500 is going to be used as a simple proxy for the overall market. I downloaded data from August 1st, 2020 and to January 31st, 2022 and represented what I needed um GMC GME price and GME volume and then GME daily returns and then also looked at SMC price returns and um for market efficiency testing I used a event study structure picked a event date around the height of the squeeze. I also defined a event window of 10 trading days and before and then 10 training days after to see the price before and after. Um it was affected by the volatility. Instead of a complex regression model, I used a very simple expected return model. expected uh GME return should roughly equal the S&P 500 return each day in the event window. And then this simplified event study lets me see how unusual GME returns relative to the market. So this is going to help us see if this is actually normal, which obviously it's not. And then it's gonna show us how and why. Um, for the implement stage, I'm going to be using Python to help me and analyze the situation. Python's also going to be used um to make sure all the questions are answered. So, I was having a bit of trouble with my Python code in Gemini. So, this time I'm going to be using chat. Um, this is the code, my final piece of code that I used. Um, it had some errors. I fixed the errors and then I already ran it ran it sorry in collab. I'll run it again to get right. There we go. It ran again perfectly. And then let's go over the code briefly here. It downloads the data that we need for our charts, our analysis for S&P and GameStop. Here it's going to verify the claim of 2020 if price was actually trading at 4 cents or if it was higher or lower. And then here is a simple event study I talked about 10 days before, 10 days after. And it's going to compare to the S&P 500 return to see a normal what a normal asset would do over a long term. And then I have a visualization of both a price chart volume abnormal returns and then I have simple stats code right here. Okay, let's get through this then. Here's the volume. Uh we see so the price of GameStop on August 3rd, 2020 we see is roughly around a dollar volume. Here's S&P 500 price. The return seems normalish for both. Here is the price check which was a key factor. Price is not trading at 4. Is trading at $14 and going up to 167 in the month of August 2020. And here's the event window. We're going to see So, GME price, here's a chart of the price increasing dramatically to over $80 in a period of what is that, a month or like two or threeish weeks. And then here's the volume. This is where we can see an interesting picture right here. An insane amount of volume is being traded almost eightfold or tfold stated in the GitHub. And we can see that's not normal. So this is there's a lot of retail action going on, a lot of activity going on. And then here's an abnormal return. And according to the simple event we did, we can see that there's a few days where there's extreme returns for GameStop compared to normal. And then abnormal return summary. The mean AR was 0.2543. AR on event day zero was 1.3. Mean AR from + one to + 10 was negative0.1119. A simple t stat test for abnormal returns mean abnormal return was 0.1332. Standard deviation was 0.760. Our sample size was 21 and t stat was 1.29. Um, so for this I feel like I'm complete with the implement stage. I used in AI and chat and Gemini all combination to get code to help me analyze this. Analyzing just the charts alone tells me this is unnormal. This is not usual. Um, so I think I'm going to move on to the validated stage to use the information from the implement stage to further understand the situation. In the valid stage, I evaluated whether my results genuinely suggest market inefficiency and how strong the evidence is. From the stats I observed, the normal return on day zero um AR events, you can uh was very large and positive. Mean abnormal return before day zero was and after day zero it was mean post if they are positive. Let's see. This is getting into the statistical statistical stuff. This code. Oh, yes. Right here. Mean, pre mean post. Okay. Yeah, this is getting the stats stuff. I really don't want to get into this stat that stuff before understand other um things. Let's see if I can find Yeah. So validating efficiency isn't just about statistics. So I considered um economic significance into this. The car is a very large in this window. So expost some investors earned huge profits others lost a lot of money like the hedge fund. At times some traders faced extreme volatility shorts risk and the huge poss uh possibility of crash limited to arbitrage and market structure. Um short interest exceeded 100% of the float. Short sellers face margin calls and the risk of the classic squeeze. Brokers like Robin Hood imposed trading restrictions limiting buys volatility halts. So when the abnormal returns and the car patterns are are to reconcile with a clean frictionless version of the semi- strong EMH once we include behavioral behavior uh biases and strong limits to our arbitrage they become more understandable in the ball state. I generally I generalize these findings to a broader market investment strategy and theory. My conclusion is that the markets are mostly efficient but not perfectly efficient. In normal conditions, prices for long liquid stacks trend to reflect public information quickly which supports semi- strong EMH as a baseline. But in special circumstances like GameStop where there's a short extreme short interest, the social media coordination intense retail speculation, behavioral finance and structural frictions can dominate, creating large and temporary deviations from fundamental value, which we can see clearly from these charts alone. From behavioral pe uh perspective, GameStop hurting people piling stocks because everyone else on Reddit was doing it. This is like something we can see on a lot of social medias today when someone is doing something like crypto or bitcoin. Other people try hurting in causing inflation or inflated assets which technically should not be doing but they are because people are hurting in. It can also cause overconfidence strong belief that they can beat hedge funds and the broader market. anchoring and limiting attention focuses on slogans to the moon or short squeeze narratives instead of the fundamentals from investment strategy. This supports a barbell style philosophy um using passive index fund for core of portfolio acknowledging that markets are generally efficient and hard to beat after cost. All right, for that's I think we're good for the ball stage. I'm going to move into the reflect stage. In the final reflect stage, I look back at what I learned and how the driver process helped me. The biggest shift in my thinking is the EMH is still a useful framework, but it's clearly incomplete on its own. The GameStop squeeze produced large significant abnormal returns that contradicted a naive version of semi strong um EMH. At the same time, once I layered it into a behavioral bias and the limits to arbitrage, which event look less like a free money and more like a high-risk type of gamble driven into anomaly. Um, I would say the driver framework was very helpful for this. It helped me discover and analyze the situation. It helped me uh identify which questions need to be answered. The represent stage helped me choose a simple but uh coherent study design and a comparison. The implement stage helped me use Python to get real data and compute returns. The valid stage helped um me compare a statistical significance from economic standpoint and comparing it to financial standpoint which cannot always match. But we saw um the returns down here which yeah evolve connected this one event to a broader idea and the overall uh behavioral finance of retail traders compared to hedge funds and other types of investing. Overall this project showed me how to move from textbook theory to real data and back using code. And I think that completes this assignment. Thank you for watching.",
  "video_url": "https://youtu.be/GUWKSQwpYzg"
}