{
  "student_name": "Luke Hardymon",
  "org_defined_id": "035866355",
  "username": "lhardymo",
  "email": "",
  "transcript": "So for my assignment um session 9 assignment um this was primarily looking at the WACC capital sort of structure weighted average cost of capital and just sort of seeing how different capital structures for example like um more equity or more debt um can affect somebody's weighted average cost of capital and kind of whether companies decide to like take on basically investments or not. Um so in my first kind of define and discover stage um I sort of had it define kind of um the WACC and then I also asked like back here um h I kind of asked like how does $3 billion of debt sort of change the weighted average cost of capital like how does debt sort of um change that? Um and it actually put it into this is something we'll look at later basically. Um and then I ended up having actually looking at different capital structures like more equity or more debt and how this changes a company's WACC value. And I actually had made a graph. So if you look all the way here um so this is was the first part of the graph. Um but then the second graph here actually shows um how when you keep taking on more and more and more debt um while it is cheap it also um gets has more risk and so it actually increases the WACC once you get into more and more debt and so it's usually kind of like a U shape and so that's kind of the structure or that's kind of the relationship between um high equity or high det high debt. And so I thought that was kind of interesting to start out with. Um, and then I looked sort of represent. So I kind of wanted to map out all of the capital cost components. Um, so that's like the equity component, the debt component, and then I looked at total capital value and then I eventually calculated um the WACC for the company. Um, so you can see here kind of all the parameters and then everything calculated. So you can see here that um you use total cap value and all these things. Um so you can see market value of the equity, market value of the debt, total capital value. So just added those together and then the weight of each one. So you can see that uh Netflix is highly um weighted towards equity um 93.9%. Um which means it's going to be more expensive um which we'll get into later. Um and then you can see here it calculated the cost of equity using the CIPM model. Um you can see here they got 11.65. Um and then they also got four tax cost of debt and after tax um after tax cost of debt is always lower um because of tax shielding which we'll get into later. Um, and then it it eventually calculated the WACCC for Netflix. Um, which is 11.22% which we'll look at later is higher than Disney and Amazon's. Um, but we'll look at that later. And then now we're going to look at implement. So using that weighted average cost of capital that we used, we are going to find a new WACC after the $3 billion of debt issuance um we're going to explain the after tax cost of debt and then also the tax shield benefit and we're compare it to Disney Amazon. So first um I actually had to recalculate it um just to make sure it was consistent um so sort of like validating it a little bit. Um you can see here we got the same answer so we're good. Um and then number two was explain after tax cost of debt. Um and basically the after tax is the true cost to the company because interest payments are taxdeductible and basically so like the government sort of subsidizes debt. Um and it just reduces the cost of borrowing and it's called sort of called a tax shield. Um you can sort of see here in like a little hypothetical um for every 10 million in interest paid Nike Netflix would save 2.1 million in taxes due to the tax deductibility. Um and basically this shield makes debt a cheaper source of financing compared to equity. Um so that's kind of interesting. And then we also compared it to Netflix and Amazon. Um so um basically you can see Netflix is 11.22% Disney's is 8.2 2% and Amazon's is 9.5%. Um, and uh you could also see here um there's also a lot of different components of why someone's WCC would be higher, but one of those is equity to debt ratio. So if you have lower equity and higher debt, your WACCC is going to be higher. Um so for instance, Dizzy's is lower than Netflix's because it has 70% equity compared to Netflix is like over 90%. Um and so they just use debt more. Um therefore they're going to have a lower WACC. So, I thought that was interesting. Um, and then next we went into validate where we looked at I sort of changed the numbers of debt to equity ratios and see kind of how it affected the WACCC value. Um, so I I made three scenarios. One 80% equity, 20% debt. Um, the second one was 50/50 and the third one was mostly debt and less equity. Um, so you can see here the WACC for more equity is 10.2 then 8.12 and then 6%. And so that makes sense, right? when you have more debt, it's cheaper and so your WACC is going to be higher. But eventually, you're going to get to a point where you're going to kind of get to the tipping point where we saw that graph earlier. Um, where the WACC is actually going to go up significantly higher because there's more risk when you just have like more and more and more debt. Um and then when you so sort of looking at this further um I wanted to look at so here Netflix was investing in different content and so I wanted to look at like US content versus international content and sort of make different hypotheticals um just kind of look the difference between those two. Um and so it said here because I really had no idea it said US content was lower market risk and minimal minimal risk. And so basically um the WACC here is going to be uh lower um because there's less risk uh where the international um is actually more and more risk um and so say they did more international content this would increase the risk of the business. Um, and it says here, \"This change in the aggregate risk file could cause a shift in the firm's overall WACC.\" Um, and so long-term commitments to very high risk markets um could lead to overall higher cost equity and a higher WACC. So when the more risk risky their like investments are, they're going to have higher weighted average cost of capitals. Um, and so if say they took on more international, they could need to actually restructure their capital um, and maybe take on more debt um, because it's cheaper. Um, so I think that could be that could be interesting. Um, so to reflect, I wanted to just highlight two things that I learned. Um, one was that higher debt could actually decrease a weighted average cost of capital, which I thought was interesting, mostly because of like tax shielding. Um, but um, when you take on more and more debt um, it just gets more and more like risky and investors don't like that. Um, so while like the WACC might be really low, um, it's not taking in several other factors. So it kind of showed that like the WACCC calculation can sort of be like misleading. And then secondly, um that just debt capital is cheaper than equity capital um because of tax shielding and that the government kind of just subsidizes that um and makes debt easier to take on. Whereas with equity, there's no subsidation because when you're paying investors, like that's not taxdeductible. Like that's different. And so debt makes it easier to get money, but when you do more and more of it, um it gets riskier and riskier. So yeah, that's what I learned with weighted average cost of capital on this assignment.",
  "video_url": "https://www.youtube.com/watch?v=B9afhvh3PJA"
}