{
  "student_name": "Tirth Patel",
  "org_defined_id": "037647601",
  "username": "pate2347",
  "email": "",
  "transcript": "Hello. Um, today this is going to be my capital budget analysis for Starbucks uh proposed flagship roaster project. I'll walk through the project using the frameworks of uh the driver define, discover, represent, implement, validate, evolve and also reflect. All right, a brief overview of the assignment is that section six assignment cost of capital analysis. Assignment overview evaluates Starbucks proposed flagship roaster that requires a $12 million upfront layout and is expected to operate for 10 years. Use a firm's 8.5 WACC as a hurdle rate. determine whether the project creates value and to recommend slashreject decisions supported by the driver documentation. So the parameters for this project are going to be the initial investment is going to be 12 billion or 12 million sorry building equipment training depreciated straight line over 10 years. The working capital is going to be 500,000 deployed at launch and recovered in year 10. The revenue is going to be 8 million in year 1. 12 million sorry 11 million in years 2.5 225 and then 9 millions for years 6 to 10. Operating cost of goods sold is 40% of revenue. Labor is 2.5 is 0.8. Marketing is 0.3 in year 1 and then 0.1 million thereafter. Taxes are going to be 25% corporate rate. uh terminal value 3 million at the end of 10 years. Focus on your analysis on producing a transparent cash flow model, core capital budgeting matrix, sensity sensitivity test, and executable ready recommendation. So we're going to be using the driver framework and the financial analysts uh sorry analysis requirements for this project are going to be build a 0 to10 incremental cash flow schedule that includes revenue operating cost appreciation tax yields taxes working capital changes terminal value. We're also going to calculate the NPV IR discounted payback period simple payback period profitability index using Starbucks WACC. We're also gonna we'll run sensitivity analysis for a revenue reduced by 20% b WACC increased by 2% summarized impact on NVPIRR provide recommendation that ways financial results strategic fit brand implications and key project risk and I'll do all this by using Python code along with using AI to help me understand and implement the driver framework. So let me get started with first the define phase. The decision problem is whether Starbucks should invest 12 million plus 0.5 million 500k in a 10-year flagship grocery project. The objective is to determine if the investment creates sher shareholder value given to Starbucks 0.5 WCC including a disciplined budget um capital model. So the key question is does the flagship roaster generate a possible MVP net uh profit value when evaluated at Starbucks 0 sorry 8.5 WCC and do the risk strategy consideration support and accept support and accept or reject recommendation. So we're going to be using a 0 to10 incremental cash flow schedule including all the parameters the core metrics and then we're also going to do a sensitivity analysis revenues reduced by 20% and then also a W ACC shifted by 2% up or down and doing this we're going to get the final executive Friday recommendation which is going to answer our question. So in the discover phases I will go through this briefly because I already talked through it. Um, our initial is investment is going to be 12 million plus 500,000 which we'll get back. So straight line depreciation is going to be 1.2 million a year. Working capital we're going to get back at year 10. Revenues we've already went through this. Cost of goods sold, we went through this. Tax rate we went through this. Terminal value of tax is going to be 3 million. Working capital recovery 0.5 million in year 10. The Starbucks discount rate is going to be 8.5 according to the WCC. Um the key uncertain and risks are going to be revenue realization demand risk traffic to flagship roastery micro conditions margin compression higher cost terminal value and brand impact. Um, we could all represent this by using a timeline. We could have year zero. The cap set is going to be 12. The working capital is going to be 0.5. The total year 0 CF is going to be -2.5. Adding all that together, the operating cost structure is going to be here. To be honest, we could represent this. Give me a timeline for the represent stage of the project. We can represent this using AI. I know I should go into more detail for my prompt, but I've already fed it all the data I needed to. So, it should be able to give us a good and nice timeline. I'm choose Okay, so let's go through this brief timeline for the represent stage. So we're year zero, we have a 12.5 in initial investment. Year one revenue, all of this is going to end us up with a 1.2 CF. Year two, 2.7. as we go. We're going to end with a 5.3 CS or CF, sorry, in the end. So, the cash flow timeline is -12.5 million outflow in year zero followed by a stream of positive operating cash flows around 1.2 in year 1, 2.7 in year 2 to 5, 1.8 eight in years 6 to 7 and a final year 10 inflow about 5.3 including both operating cash flow and terminal value plus working capital recovery. So that shows us a timeline for the represent stage. Um now I'm going to we can move to the implementation phase. In this stage, I'm going to be using a script generated by uh sorry, a Python code generated by AI to help me answer all the questions for this using all of the um numbers parameters provided in the problem. So, let's go through this real quick. So this is all of the parameters, working capital, t project life, terminal value, tax rate, all of that good stuff. This is the revenues that change based on years. This is the cost assumption, cost of goods sold, labor, all the parameters. And then this is the depreciation. And all this is going to be used to calculate our answers from here on out. Okay, the script looked like it ran perfectly. All right, so the initial outllay is -12.5 million as we saw the IRR is 13.25% profitably uh profitability index is a 1.2 simple payback is 5.28 years which is uh I think good in my opinion the discounted payback at 12% or sorry 8.5% is 8.21 two one years a cash by yearby-year cash flow. We can see all this. This is what we also saw on the timeline. Um just a little bit more simply. So sensitivity A which was a let me see what that was back here. too far up. Okay. Run a sensitivity analysis for revenue reduction by 20% and then B was wacc with a up 2% and down 2% and summarize the impact on NVR/IRR. So here we can see with a revenue decrease of 20% the NVR at 8.5% WACC is going to be negative 3.16 million which is not good and then an irring the rate B we get a 6.5% reducing the WCC from 8.5 to 6.5 the NVP is 4.64 million the IRR is unchanged at 13.2 25. If we change the NVC to okay, this is the current NVC actually. So if we change it to 10.5, we get an NVP of 1.63 and this is a brief graph of the financial inflows. So our initial is 12.5 million out and then we get a little bit of that back every year. decreases from these years to these years. Uh I think it was five to nine because um a decrease in revenue and then a refund of the half a million dollar um capital in year 10. And this is the MVP profile for Starbucks grocery project. We can see the MVP affecting the WCC. So this is where IR is roughly 13.25 for our project. Okay. So let's go to the we got finished with the I implement. I use the code to figure out answers for our question implementation. Implementation is done. Um we're going to move to the V validate stage. So this is going to be technically validating all of our numbers. So the single convention year zero is negative 12.5. All inflows are positive. Depreciation applied only to 12 million capex straight line 1.2 million year non-cash but creates a tax shield tax calculation is applied to EBIT non-cash flow if EBIT were negative. Let me see let me go find EBIT here. Yes, we can see the tax rate is applied to EBIT. Um if EBIT were negative tax would equal zero which is conservative terminal value and WC both added to year 10 matching problem statement and NVPIR relationship IRR of 13.3 is greater than WCC of 8.5 which is consistent with NVP is greater than zero reasonable reasonability checks um OCFs are highest when revenues are highest year to Five. Let's see. Let's go to the year to five. Two to five right here. Um decline slightly when revenues fall 6 to 10. Simply simple and discounted paybacks are within the project life of 5.3 and 8.2 which is plausible for a 10-year asset. Sensitivity results behave as expected. Lower revenues means a lower NVPIRRA which we saw with right here. And then a higher WCC equals a lower NVP. Economic validation the base case is NVP is plus roughly about 3 million and P uh PL is 1.25 25 million project passes strict financial filter revenue of -12 20% case that case which we uh analyze a sensitivity of -20% revenue NVP is negative 3.2 IRR is 3 oh sorry NVP is negative 3.2 million irr is 3.2% 2% which is lower than WCC which is clear clearly value destroying. WACC range is 6.5 to 10.5% still yields validative valid positive um MVP's decision is to reasonably robust to moderate changes in the cost capital. Um that was my valid stage. I'm going to move to the E stage evolve. Here we think about how analysis generates on what Starbucks could improve in decision making. The grocery is not just a standalone cash flow asset. It may provide a brand Halo experimental value that increases sale and surrounding stores. Um it might bring pricing power and premium brand boosting a prototype for future flagship experiences. The current model only um introduces direct project cash flow and evolved model could increase uh incremental uplift to nearby stores. Online sales incorporate scenario trees base upside down um downside for volume pricing including option value. From a process perspective, f Starbucks's financial scheme could use a model as a template for a simple store or concept level investment. Build a scenario where leadership can adjust um revenue growth or decline cost inflation WCC range. Um we can also integrate data over time, update the model once actual performance data comes in and compares actual versus projected returns. Um that was my evolve stage. I'm going to move on to the reflection stage and also have a conclusion at the end. Um for my first point and reflection is going to be that positive accounting profits are not enough. The project value must be judged relative to the cost of capital. Even a profitable store can um have a negative MVP if returns are below WCC. MVP is an anchor matrix. It directly measures shareholder value creation in dollar terms. IRRa paychecks PI are helpful but there are supporting characters. Um sensitivity analysis is crucial. The project looks attractive in the base case but a 20% revenue decline flips the MVP strongly to the negative making unprofitable. The highlights in the importance of the dam. This highlights the importance of demand risk and execution. Strategy context still matters. The roaster brand and experimental value may justify proceeds even with a moderate downside risk but that must be consistently weighed against financial results. Overall my recommendations under the base cases assumption is that Starbucks flagship um should be accepted. It generates an MVP of roughly 3 million and a IRR of 13.12 and a profitable index. However, management should be very aware that the project is sensitive to revenue underperforming and should pair this approval with strict execution plans and ongoing performance monitoring to make sure everything is up to standards and running according to plan. Thank you for watching my video for the Starbucks analyzation.",
  "video_url": "https://youtu.be/hzTjqQQkym0?si=ZDeKzWcV_3Ota6v2"
}