{
  "student_name": "Johanna Wen",
  "org_defined_id": "037039526",
  "username": "wen196",
  "email": "",
  "transcript": ":02 Hi, I'm Japan Win from your 4 uh to uh uh five 4 to p.m. class um in management 3:10. Um um I am going to be so booked over the uh the fall break. Um so hopefully hopefully you accept accept this. Um so evaluate star uh Starbucks uh proposed roaster that requires you know 12 12 million startup and expected to operate for 10 years. um use the firm's uh whack to determine whether or not you know there's enough whack being the you know uh weighted average capital cost how much you know is it worth pursuing a project um if it's over you know said rate and the higher the whack is um the more it's going to cost you to do the project um but 8.5 isn't too high so pretty good. Um, and Starbucks is a big chain, so probably has a lot of money to spend to throw at this thing. Um, and when we're trying to see if we accept or reject the decision. So as we typically start off we define you know uh what what the situation is as well as you know what we have to work off of the initial investment the working capital the revenues the operating cost how like what you're making what are the all like the perceived costs and other stuff um so as we look um as kind of a point of reference um loose work that I did was calculate you know the years 1 through pen. Uh, so we kind, you know, we have this is I I guess you could call this a validation um as well as um, uh, a representation of what I should expect from my AI. Uh, so revenue start out with, you know, 8 million in year 1, 11 million from years 2 to 5, um, uh, 9 million in years 6 to 10. And so we have a total of around $97 million like almost almost like a hund00 million uh in terms of revenue. Of course this could be greater or lower depending on you know the actuality of things. You know there might be another co pandemic. Who knows? However this is the estimated amount of revenue that we have. We have the investment. Then we have the list of all the cogs. that being all the startup costs um as well as a what I'm assuming a flat uh.1 million thereafter um which again all of these things could be less or more um then we have the revenue uh for the taxes being 25% of corporate rate which is revenue minus cogs um and uh the depreciation which should be the the value that you initially invested in minus the salvage value. There wasn't any salvage value um left over. However, arguably I'm pretty sure there should be um divided by 10. So, the only reason why I say should be is when you buy a location like the flagship restaurant, even if you're, you know, like it's exploding after 10 years, there typically is you sell the land or you sell like the the area that you know you're working in. Um, and so that should be the salvage value. So there should be something, but uh let's let's go with zero for now. Um, arguably there should be more. I don't have a lot of practice with this. So this is what I have. I still there is a lot of uh money left over that being around 38 uh million uh which is much more than the revenue times uh the hurdle rate um which I don't think that's how it's supposed to work but uh let's either way you earn Starbucks will be earning a nice around like around 40 million bucks from from this roaster. So, I think me by myself in my limited knowledge thinks that it's a pretty good deal and I think that they should accept it. Um, and yeah, and they also have other things to support this flagship. Um, and so I asked Gemini to help me make uh a code. I was just like, \"Hey, you know, like help me with all the stuff.\" So, they gave me a code and I inputed it into Collab. installed financial um stuff. Put in our like our numbers um our revenue rates um what should look like and then it spits out um a nice big like this is probably the best result I've ever gotten from from Gemini. So downloading all of the stuff we have the initial investment of 12 million uh the working capital deployment that I forgot to include in my work. So like Gemini is correcting me. Um and has again however I don't think you should double do it. Initial outlay. Oh this mean the initial outlay means combining the two. Um so we got the revenues being similar to what I what I did. We got the operating expenses which should be uh cogs. I think I probably messed up or this uh this cogs is a little more than what it should be because it is not.1 million. Um but let's go with it. Or no or no it meant.1 million more. So probably my mistake. Um depreciation is the depreciation that I got. Um I I didn't include EBIT. I tried my best with taxes. I don't think I was accurate. Um operating cash flows and the recovery, the after tax terminal value, which I forgot, terminal cash flow, um and net cash flow. So Gemini has already kind of helped me out um with some of the math that I should be doing. uh the the net present value should be 26 uh 2.6 million. Uh the internal rate of return should be 12.84 which is higher than the whack. So that's pretty good. Um uh so you know you should accept a a pretty good rate of return. Profit index is 1.22 which means accept the hurdle rate again 8.5%. um we have uh the NPV being 5% revenue drop um of one like one around 1 million and this does not change our decision of accepting. So it gives us the executive recommendation of accept the ro uh roastery project um based on the core capital budgeting metric metrics the proposed Starbucks budget should be accepted based on again the rate of the return the net present value and the hurdle rate um a sensitivity analysis there is a 5% drop in projected revenues leads uh leads to a decrease in the NPV but the project remains highly positive with you know the work that we both did even though mine was pretty bad um with res with a revised NPV of 1 million this suggests that the project um is robust and moderate downside risks in the revenue forecast um and we have I I didn't even I didn't even teach the AI about driver but uh this is something different of defining the project of the 10 10year investment uh review uh the NPV is positive and the project's IRR exceeds the hurdle rate. Yep. Uh investigate sensitivity analysis confirms the project value holds uh under moderate stress. Um and all this jazz. So uh this should answer the uh the end. Something that I could have done better um in uh this project is I probably should have spent a little bit more time accurately uh setting up my Excel example uh to compare to um what was given. Oh uh this was some extra work that Gemini uh put in of the reason why you know the index should be accepted the benchmark um and then the N M N M N M N M N M N M N M N M N M N M NpV so yeah I didn't assume no S value um yeah thank you so much",
  "video_url": "https://youtu.be/GMcqdjB8jWM"
}