{
  "student_name": "Om Janamanchi",
  "org_defined_id": "037320344",
  "username": "ojanaman",
  "email": "",
  "transcript": "Hi, my name is Jermanshee. This is my session 8, Market Efficiency and Behavioral Finance assignment. So, here, sorry. Here's our assignment for the week. Investigate market efficiency using the GameStop short squeeze event of 2020-2021 as a case study. verify the accuracy of the stated facts below analyze the price behavior relative to efficient market hypothesis predictions and evaluate whether market anomalies constitute evidence market efficiency or can be explained within existing frameworks so our first critical step is verify that the statement uh gamestop traded at four cents in august 2020 against the actual historical data that we have and if this claim is false then we're gonna have to document the accurate figures and determine how appropriate communication approach for correcting our professor in this case so uh our we have the event timeline and key data points and required analysis so now let's go into our um collab notebook so obviously the imported libraries that we have um so we're gonna have to solve this with a driver framework so for d define and discover uh we basically have what is the context of our problem so we're taking the case study of the gamestop short squeeze where our time period is august 2020 to the present day and we're trying to test efficient market hypothesis for this this on this specific stock the critical fact that we're trying to verify that we've been given by our professor is that gamestop traded at four cents cents per share in august 2020 and if it's wrong we're going to prove that it's wrong based on the actual market data the event timeline that we have is august 2020 gamestop was near bankruptcy september 2020 ryan cohen acquires 13 stake january 2021 the price surges this is due to r slash wall street bets february 2021 congressional hearings about it and then 2025 the post event stabilization and key data points that we have from our problem are short interest 140 and afloat retail volume of 10x increase during the squeeze uh robin hood halted buying as a trading restriction there's a 50-30 loss with the required bailout and the fundamental value estimates was 10 to 40 dollars per share uh and assuming our um understanding of market efficiency there's three forms that we have for market efficiency the first one being weak where prices reflect past uh trading info semi-strong is where prices reflect all the public info that we have so like news and uh coverage and how strong is prices reflect all of the info the public info such as news outlets and stuff and private info and past info such as uh past financial uh cycles of how gamestop as stock did uh required analysis we're basically trying to find uh if the claim that we're given is true with our expected efficient market hypothesis predictions versus that what actually happened where our questions are what was gamestop's actual uh price in august 2020 uh did prices reflect available information that we have uh was the squeeze predictable or exploitable and does the event disprove um what is it efficient market hypothesis or fit in so next step we have is our represent uh so that's just we're gonna take in all our data we're still trying to go by the claim that gamestop traded at four cents uh per share in august 2020 uh see so the event timelines we have the price ranges we're still trying to figure that out as part of the problem uh we just have like the key events as like when it went bankrupt when it surged urged uh the congressional hearings because of it and whether it was verified or not the key metrics were also uh givens being our peak short interest our retail volume uh how much gain or like investors made and so here is our actual represent part which is our different market hypothesis predictions versus our actual behavior being, let's just take it for a weak form. Our prediction is that there's no patterns from the past prices and the actual observed is we are going to find that out in our implement step. So obviously we're trying to compare the prediction versus what actually happened essentially in this problem uh scenario is like a very basic return scenario is we buy in august 2020 price and then we sell at the peak 483 dollars per share so if four cents is correct that means we would have a one million two hundred seven thousand four hundred percent return so we're going to be verifying this in this problem obviously off the bat of that that doesn't seem very likely as that high of a percentage return but we're gonna see in our next step i implement so uh for implement and we're gonna say okay off the data that we uh pulled from my finance uh the august 2020 price of gamestop was actually four dollars not four cents per share as um proclaim in this problem itself january 2021 was the peak 483 dollars per share and then november 2025 which is the current uh share price which is 25 dollars per share uh and price correction more or less was 100x the factor that we claimed so let's just take this in terms of the return scenarios that i computed here if we buy and hold the peak short uh peak cohen entry and then the day peak the entry price more or less for the first two buy and hold were four dollars the exit price was either 483 at the week and then uh to current day it's 25 dollars so um if we sold at the peak we'd have a return of 11,975 percent while current day today it would be 525 percent so almost half the actual expected return and if we put in like a thousand dollars of investment uh if we sold at the peak we'd make roughly around 120 thousand dollars while today it's like six thousand dollars so obviously we would have been better at uh selling at the peak itself because that would have made us so much more money compared to what we have right now. And then if we think about it in EMH terms and like each form weak, semi-strong and strong, we're just testing the methods. And we can see that evidence shows that there's a clear upward momentum for the weak form. And it's very likely that there has been a violation of efficient market hypothesis. other factors to consider that we have was like behavioral factors like quantification that you know outside of fact factors that also impacted the stock price such as social media impact where our wall street bets increase the price of the share from like 2 million to 9 million and which is not compatible with expected market hypothesis uh hurting behavior just how um firms are hurting stocks and stuff fomo intensity so okay there's like a general investor who's like feeling very missed out so they also put their money into the stock the short squeezes that we have and then obviously the market restrictions and how the market will impact such things which are not all considered an efficient market uh hypothesis they all go against the norm. But more or less, our deviation would give us, since the average fair value range is like $10 to $40, and our midpoint is $25 per share, which is what it is currently today, our overvaluation would be 1,832% above the fundamentals, more or we have. So we're going to try to validate this. In our next step, we validate. So very simply, I just ran an explanation scorecard to check each of our evaluation criteria. I took, in this case, price predictability, information efficiency, and shorts, social media and like other factors where um we can see that there's a lot of things in this column that buy efficient market theory does not it goes against the norm so it does show x and it fails but in the actual behavioral world of what actually did happen all these are plus and they did make a very significant impact on the stock price of gm stop in this sense our emf emh validation basically followed with this and said that past prices don't predict the future which is very true where the past it was very linear and it was going towards bankruptcy while when we all pumped it up the stock up with all social media and everything the stock price shooted way high up and people made a lot of money off of this as a return last we have our e um evolve step so for e i just ran uh some sensitivity analysis and scenarios where um Scenario one, what if efficient market hypothesis held perfectly and they were as intended, our EMH prediction would be the fundamental price would be $4, which the actual reality is $4. So everything works in a real world. All is good. It's a scenario of $4 is $4. We're good. It's not $0.04 as in our flaw of the problem. scenario two price sensitivity analysis so um if we start at four cents and we have this insane one million percent return uh the current would be 62 000 but putting in whatever um if we put in a thousand dollars we get 12 million in return that seems very very unlikely it's very extreme so it's a clear violation of efficient market theory. Scenario three, ultra-angle market structures. What if something changes in the market? More or less, the pattern follows that it was unconventional to efficient market theory, as is, and that's proven in scenario four or five as well. Last, our step R for reflect. We're just going to be answering our critical questions. So what was GameStop's actual price in 2020? It was $4 per share, not $0.04 as was given in the problem, which is flaw. And this error doesn't change the core conclusion that this case was a violation of efficient market hypothesis. Second, which forms of market efficiency were violated um in this case weak phones with flash data was violated because the stock price went up while they were very close to bankruptcy semi -strong uh also was wrong because we tried to take uh the actual news data of how it was going and all the news said bankruptcy but all the social media impact from our such wall street bets actually inflated the price and strong form including all the data itself was inconclusive and did not work at all to influence this as what actually happened to the price of the stock real world uh could rational investors have profited systematically um i'd say no and the conclusion is no because nobody knew that um all the social media impact and the drive for the stock would shoot it up so much and make it such a profitable trade which that you can't really predict it's just a gamble you have to it's either you get lucky or you don't on this situation uh how did efficient market hypothesis predictions compare to observed behavior well they go against the observed behavior whatever actually happened goes against the entire theory it was a very interesting scenario to take last we have uh what behavioral uh finance explanations with the evidence Well, hurting behavior is one of them where when everyone started putting money in, everyone followed as well, which is very similar to FOMO if you're missing out, and it just follows as well. And more or less, once you finally see the pattern that the stock price is going up, a lot of people are messing, everyone jumps on it and continues to upheld and push up the price in this case. so at the end we just uh had to do like actually a true or false test was um a professor's claim that gamestop started at four cents in august 2020 correct well no it wasn't the actual price four dollars per share and the actual what happened was against the theory itself so So that was basically the end of my management 2 .10 session day assignment, so thank you.",
  "video_url": "https://983291-6.kaf.kaltura.com/media/t/1_0cqsns8g"
}