{
  "student_name": "Matthew Baratian",
  "org_defined_id": "034214748",
  "username": "mbaratia",
  "email": "",
  "transcript": "My name is Matthew Bishian and this is my session n assignment. So in this assignment we have to uh calculate the weighted average cost uh cost of capital for Netflix and its connection to a hypothetical $5 billion content investment. Um and in this analysis we must determine you know the current WAC uh evaluate the impact of additional you know debt financing and assess the project specific uh versus firmwide discount rates and finally compare Netflix's cost of capital to industry peers. So some for a financial planner to look at are things such as market capitalization, our total debt, you know, our debt of the market value, the equity beta, the bond rating, uh the corporate tax rate, and the current stock price for Netflix. Um some of the market conditions would be the risk-free rate of a 10-year Treasury being 4.5%, our market risk premium sitting at 5.5% and our media industry double or uh W or uh WACCC range uh 8 to uh 10%. um and a strategic context of a a Disney capital structure 7 equity and 30 cent debt as well as having Amazon Prime Video uses uh Amazon corporate you know WACCC at 9.5% and also in additionally Netflix is considering a $3 billion additional debt issuance for content investment. So the first thing of the driver framework is to define discover where we define our problem and discover the data and through this uh our you know the problem is to calculate the weighted average cost of capital for Netflix in connection with the hypothetical uh $5 billion content investment decision and our key questions that must be answered throughout this thing would be our um you know what is Netflix's current WACC what will the WACCC be after potential $3 billion issuance. Uh, you know, and next one would be should a project specific WACC be utilized? Uh, being US content versus international content. Additionally, you know, how does Netflix's WACCC compared to Disney's WACC? Uh, and what are the differences between them? Uh, and finally, uh, what is the optimal capital structure strategy? Uh and through this uh we defined our financial variables with the key inputs uh being our Netflix uh market cap at 200 uh billion. Yeah. Uh and our Netflix market debt sitting at 14 billion. Um you know equity beta being 1.3 cost of debt pre-tax 5.8 risk-free rate sitting at 4.5 market risk premium is 5.5% and the tax rate at 21%. So now we can move on to our represent uh you know stage in the framework. Uh for some reason it won't just print for me but you know I guess we'll have to roll with this. Um so in this we uh you know I just labeled out our objectives which I just listed out here and the framework uh for the analysis plan in order to do that which uh you know for the first thing for analyzing capital structure we need you know our current WACC for Netflix and our current uh Netflix equity. Um and we have to evaluate that current leverage the cost equity and the common you know debt components. Second thing you know being evaluate the impact of the increased debt. Um we got to assess a change in that WACCC our new leverage and a trade-off between that tax shield and financial risk. Third thing in the plan would be uh to compare with our industry periods of Disney and Amazon just compare the WACCC's and find anything discreet and leverage you know overall cost capital cost of debt or equity uh and maybe even consider if Netflix is underleveraged. Um so our fourth you know would a step you know in this financial plan would be consider optimal leverage points the fifth one being the qualitative factors business strategy so identifying them and see in integrating you know non-quantitive elements into the strategy uh and the last one being a recommendation for Netflix that we will come through at the end after going through this analysis um our next step the third one is the implementation stage after we've identified what we got to do now it's time to actually complete the analysis is um I'll move down here so you can see what's going on. Uh so for that first objective the for necklace is current WACCC our cost of equity sits at 11.65 and our after tax cost of debt is sitting at 4.58 the weighted uh weight of equity sitting at 93.9 weight of debt is at 6.1 and the current the WAC 11.22%. Um so then our we can calculate or we look the WACC after the three billion dollar debt issuance that Netflix did take it. Uh that new uh debt market value is sitting at 16 billion. Uh the new weight of that equity would be at 92.59 with the new weight of debt being at 7.41. Uh and Netflix's WAC after that issuance is sitting at 11.13. um which is a little bit lower than if it you know without it. Um so on to the next you know uh calculation would be a project specific WAC evaluation. So the hypothetical US content projection would sit at 8.71 with the international content project uh project uh sitting at 9.876. All right. And the conclusion here is that um you know finding it can vary a lot in finding structure and cost of debt. Uh and suggestion that firmwide WAC might not always be appropriate for these kind of investments. Uh our next you know uh calculation was the comparison uh with industry peers being Disney. Um Disney was sat at 8.2 while Netflix's current one is sitting at 11.22. Uh there's a 3 3.02 O2 difference. Netflix is higher. Potential reasons for this thing would be capital structure maybe uh onto you know things like equity beta uh cost of debt could be a little bit you know higher or lower depending on what you're trying to do as well as their business risk. Uh and the reason for that is that you know Netflix core values may perceive of having potentially higher business risk than Amazon's. Um and that may because they can just take you know a more of a aggressive approach to new kind of avenues uh because they're established brand and they know people will come back and continue to buy their stuff. Um so this down here is basically summarizing everything I just said with that. Now we can move on to the step four which is our validation stage. uh and where we had a a pure com comparison between Netflix uh Disney and Amazon. You know, like I stated previously, Netflix's current WACCC is sitting 11.22. Then we move on to just looking at Netflix versus Disney. Disney's is sitting at 8.2 and there's a 3.02 difference. So Netflix has a higher one. Reason for this capital structure, Disney employs, you know, a higher proportion of debt compared to Netflix. Um and you know debt generally does have a lower after tax cost than uh equity and it's tax deductible. So it ends up you know causing it to be a little bit lower. Uh that WACC moving on to equity beta uh like I said earlier taking bigger risks within there is why it would be a little different potentially. Yeah. Another reason potentially be a cost of debt or a business risk. Um so like you know even though Netflix is primarily focused on that streaming and content creation in home movie experience uh there could be you know it can maybe be seen as being having a higher inherent business risk and voluntary compared to Disney's you know product because Disney is in ESPN sports. They're in streaming. They're have their own park. They have movies. They have you know TV shows. They're everywhere within that stuff. uh as well as just selling their own merchandise where they can branch out and if one falls in, they know the others can pick it up and pick up the slack of the other branches. Um Netflix versus Amazon Prime. So Amazon's corporate, you know, WACC. Uh so we got it from uh there. So it's extremely high at 95%. And I didn't really know if it was going to be right or not. So I just uh I think it should might be you know 9.5 because it just doesn't seem like it'd be 95% be too high. Um so the reason for this potential difference is that Amazon's capital structure may also feature a different uh debt to equity ratio that contributes to a lower WACC. Uh another thing would be a conversation of business risks and like like Disney, Amazon uh has diverse diversified company with multiple dominant business segments and this uh diversification significantly lowers its overall business risk compared to a singly focused company focused on one avenue. So in summary through everything I just said uh Netflix has a higher WHC relative to both Disney and Amazon particularly driven by the current capital structure being that they don't utilize or they have a lot lower debt that's utilized and a higher perceived business risk um reflected in that data and potentially higher cost of debt. Now we move on to our evolve step where we can look at potential recommendations for this investment you know strategy. Um so a potential thing would be to employ project specific discount rates. Uh so this would be something like uh if so if Disney or if Netflix was going to you know go into Korea or Japan and start selling it offering its service and product there then it would probably be a good idea to vary in the genre that suits something that like genres that may be more popular over in different countries than it would be in the US to suit the viewers. Um, another thing would be to manage the business risk and diversification. So you could potentially with you know Netflix have the ability uh to diversify you know the streams of revenue. So something like potentially more advertising for uh potential movies you know originals that are coming out uh maybe like a gaming platform kind of thing or like a DVD box or even like physical consumer products uh of Netflix. just something that you can have an additional revenue stream to then have an additional blanket uh when looking at uh inflows. The last step, you know, would be that uh step six of reflection where we just take a look at what's been going on throughout this entire thing and summarize it. So, our current uh WACC and impact additional debt, Netflix's current WAC stands at 11.22. that hypothetical, you know, $3 billion debt issuance reduces it uh to 11.13. Um so this indicates that Netflix does have capacity to take on that additional debt. Um and moving on would be the project specific versus firmwide discount rates. Uh this this base demonstrated that uh the project project specific WACCC's can vary significantly uh as they are different between the US content and international content. Um, and it does, you know, basically just emphasize uh and the importance of tailoring your product to certain markets depending on where you're offering that product. And next thing would be our optimal capital structure strategy. Netflix appears to be under lever relative to its peers Disney and Amazon. Uh so a target capital structure is more aligned with this uh with industry averages. So this could be a strategic objective which would allowing Netflix to optimize its WACC while maintaining financial health. Finally, we have recommendations for uh their Netflix's future capital management. Venture strategic leverage could implement strategic gradual increase in debt financing to optimize the capital structure and further reduce that WACC. uh in terms of its product specific WCC adopting you know a framework that would suit it best uh you know for evaluating these content investments and certain discount rate accurate flex that risk of that individual project would be something to do. The other thing could be your business risk management which could be managing and monitoring your business risk through content portal and other riskation and potentially improving and and making your operations more efficient within the company. Another thing could be a financial flexibility. You know, maintain financial flexibility, support, you know, it's aggressive growth uh strategy and adopt market changes. This would ensure that uh increased leverage does not compromise our long-term strategic options. So by in in some by addressing your capital structure utilizing the project specific you know discount rates and proactive management business risk uh Netflix can significantly reduce that cost of capital and then enhance it shareholder value through there.",
  "video_url": "https://youtu.be/AAavdiqdJbc"
}