{
  "student_name": "Aaron Gorokhovsky",
  "org_defined_id": "037134002",
  "username": "agorokho",
  "email": "",
  "transcript": "Hi, my name is Aaron and this is my session nine assignment and I'll be walking through a full weighted average cost of capital analysis for Netflix using the driver framework. In this presentation, I'll calculate Netflix's current WACCC. Examine the effect of issuing an additional $3 billion of debt. Evaluate project specific discount rates for domestic versus international content. Compare Netflix to companies like Disney and Amazon. and then wrap up by com recommending an optimal capital structure strategy based on all the results. The first step for us is define our issue. So the decision context here centers around a hypothetical $5 billion Netflix content investment. The main question I want to answer is what is Netflix's true cost of capital today? How would additional borrowing change it? And how and what discount rate should Netflix actually apply to new content investments? especially when distinguishing between US projects and international markets. This matters because content investments are extremely capital intensive and factors like leverage, credit rating, currency exposure, and regulatory uncertainty all play into whatever whether that $5 billion project is financially sound. So to analyze this, I rely on the core information provided in the case. Netflix currently has around $200 billion in equity value and about 13 billion in market value debt. Its equity beta is 1.3. Its bonds rated are triple B plus with a yield of 5.8%. The corporate tax rate is 21%. The risk-free rate is 4 and a half and the market premium is 5 1.5%. The media industry's normal WACC is roughly 8 to 10%. Disney sits at about 8.2 two and 30 and 30% dead ratio and Amazon Prime Video operates using Amazon's carpet WACCC of around 9.5%. With that foundation, the define stage captures exactly what decision we're trying to support. Should Netflix fund said $5 billion of content and what return does that investment need to generate to make sense? Our next step is to represent this. So I translated the definition into the financial formulas we need for WACC. I use the weighted average cost of capital formula which is E over V times the cost of equity plus D over V times the after cost of the of debt. E represents the mark value of equity. D the mark value of debt. V is simply the sum of those two. The cost of equity comes from CAPM which is the risk-free rate plus beta times the market risk premium. And the cost of debt comes from net Netflix's triple B plus yield adjusted for the tax shield. It's important here that all capital structures structure weights are based on market values, not book values because investors care about today's valuation, not accounting numbers. I also note the main constraint we're working with. Netflix is heavily equity financed, meaning it reliance on equity while reducing credit risk tends to push his WACC higher than more balanced companies like Disney. Um, now I move it to the implement stage where I run all of the calculations necessary in Python. And here we can see I do that. First we set our immediate parameters. Then we move on to calculating current WACC's. Then WACC's after debt project specific situations sensitivity with WAC versus debt ratio and then converting it into a plot for us to analyze. And what all of this shows is that once the setup is complete, I can calculate the Netflix's current WAC. As I said, using CAPM, the cost of equity comes out to about 11 65%. The after cost, which can be seen here, the after cost of debt is about 4.5%. Um, since we apply the 21% tax shield with 200 billion in equity and 13 billion in debt, Netflix's capital structure is roughly 94% equity and 6% debt. Netflix's current WACC ends up a little bit above 11%. Um, that's noticeably higher than the 8 to 10% of the industry range, showing that Netflix's high beta and equity heavy structure push up its cost of capital. Next, I modeled what happen if Netflix issues $3 billion of new debt. After the issuance, total debt rises to 16 billion, which we can see here. Uh, I hold the cost of of equity and the cost of debt constant as its first pass assumption. Then I recomputee the WACC. and the WACC after the new debt is slightly decreased due to the text showing that modest leverage can be beneficial. Later I later this can be explained using the idea that higher leverage would eventually increase both beta and the cost of debt and you can see these the before and after WACC values right here. Um, next would is to model the US and international WACCC outputs which can be seen in this section of output right here. This this shows um this model shows the project specific discount rates. For US content content, I use a beta of 1.2% because domestic projects closely follow Netflix's core business risk. For international content, I assign a higher beta of 1.5 to capture regulatory, political, and currency related risk risks abroad. Um, what this does is it produces and you can see the two WACC's down here, 10.7 for US content, 12.25 for international. Um, and it produces a lower WACCC for US content and a higher WACCC for international, which confirms that Netflix should not use a single corporate WACCC for all projects. Um, our next step is to validate the content we've just developed. To validate the results, I compare Netflix's WACCC to the industry and to peers. Netflix's WACC is higher than both the media industry range and higher than Disney and Amazon, which aligns with its concentrated stream business model and equityheavy financing. Next, I validate the behavior of WACC under different leverage levels using a sensitivity analysis and that can be seen in this plot. So, the curve shows that the WACC initially declines as Netflix introduces more debt, but eventually rises again as financial risks pull pushes up both beta and the cost of borrowing. The lowest point of the curve is represented as a rough optimal leverage range which is helpful when forming the final recommendation. Um the next step is to analyze how this can be used in other information. So based on the analysis, Netflix's WACC is higher than Disney's because Disney is more diversified and benefits from a larger, more stable asset base. Disney's moderate use of debt also lowers its WACC by improving the tax shield. Netflix, meanwhile, relies heavily on equity, which increases its cost of capital. The sensitivity analysis suggests Netflix could increase its debt ratio from around 6% to something in the 10 to 20% range with gently increasing financial risk. Issuing the $3 billion of new bet is a reasonable step in that direction. However, adopting a Disney-like 30% debt level would be too aggressive right now given Netflix's earning volatility. Projectwide, I would use roughly an 11% discount rate for US content and something closer to 12% or higher for international content, reflecting their different risk profiles. To conclude, the most challenging part of this assignment was choosing realistic assumptions for how beta and the cost of debt change as leverage increases. That's where financial modeling requires judgments in addition to formulas. I also saw how important it is to use project specific discount rates rather than one companywide WACCC. Finally, following the driver framework helped me stay organized from framing the problem to modeling it uh to turning the result into actual strategic recommendations. Thank you. This has been my session nine assignment.",
  "video_url": "https://youtu.be/rtM0yehEwkU"
}