{
  "student_name": "Scott Robbins",
  "org_defined_id": "034079527",
  "username": "robbin55",
  "video_url": "https://youtu.be/UNe6uUTW8BI",
  "transcript": "0:00 Alright, so today we are doing the session 11 assignment. Uhm, this is the driver framework. Should Apple use the 90 billion for a buyback or something else?\n0:18 So we have to use, see if it's better for the shareholders, stockholders, and who the current players are. Players, the pros and cons of the high risk, low risk, what we should do for it.\n0:31 So this is the driver for it. I mean, I can just kind of go through and show the math and everything for it.\n0:37 So the assignment is evaluates Apple's hypothetical 90 billion share repurchase using driver as act as an indicator.\n0:48 You're going to analyst, you must, okay, liquidity. It gives us kind of everything we did to know the balance sheet proposal alternatives.\n0:56 Okay. So in class, we kind of did this with the case study and went through and did a low risk, medium risk and high risk and how we could get the most bang for our buck and how we would invest in our money.\n1:13 So return on equity. And then this is the variables, the shareholder outstanding, the share price, the buyback amount, the current net value, net income, average debt cost and tax rate.\n1:31 This is all assuming, assumptions for the average debt cost and tax rate. So return on return, and it shows us the math, buyback, share repurchased.\n1:53 Billion of shares, okay, shares repurchased. Okay. Uhm. Pre-tax, okay. So, that's the chart that it made going along with the driver.\n2:06 I also made code. Right here. So, the current, the buyback, and then the debt reduction. And it kind of gives us what the financial ad impact would be.\n2:27 So, it looks like the debt reduction would be the best. I think we should do four of this. The slightly lower EPS, okay.\n3:00 Yeah, so, I think we should do buyback amount. And we get more for our money. Yeah, so there's the current, the buyback, and the debt reduction.3:24 This is just a higher risk. So, yeah."
}