{
  "student_name": "Samantha Paguia",
  "org_defined_id": "036278125",
  "username": "spaguia",
  "email": "",
  "transcript": "Hi, I'm Samantha Pigia and then I'll be doing the cost capital analysis um from the section of the book and what they gave us was a little oversight about um that about what they want needs to evaluate the impact of additional debt financing assess project specific versus firmwide account rates and compare Netflix cost of capital to industry peers. So they gave us some parameters and data here that we would put into um the R of our driver framework which we will see later. um market conditions here some more context um comparison to Disney, Amazon and then um saying that Netflix is considering debt um and then putting in the specifics of our required analysis going through a driver framework and the financial concepts that we want to cover here. So I made sure to implement this um into a structure of my code. so that when it is checked by the open AI that these factors are all um within the code. Yes. And then a few more um criteria here, but these are the big ones I really wanted to focus on. Integration. Um yes. And then AI collaboration, don't let it do everything. Basically, just let it calculate. Um key components from the book, cost of equity, cost of debt, market values, target weights, special securities. Um the WACC is where finance theories meets corporate strategy strategy. Yeah. So, um, I formulated everything into a word doc instead of just showing my Google Gemini because I thought it would be a little easier to understand and I liked it better instead of having the analysis in my code to have it on a document instead. I thought that was a little bit more professional if I were to actually give this to someone um, in the finance world. So to start off I said I am a finance student conducting a high stakes corporate finance analysis. Um the final deliverable is a video presentation suitable for finance finance professionals covering all six stages of the driver framework. I first wanted to define the problem. Um so this is critical. I put it on there in the prompt um because it must be completed first. um some of the translations from specifically Google Gemini to a word doc um like messed up a little bit of the icons as you can see here but nothing too crazy and once we get to the analysis everything should be fixed. Um but after I identified the problem the hurdle rate for the um 500 or 5 billion investment required outputs current WACCC post WACC project WACC/MP peer comparison identify key variables and formulas list all financial inputs for the provided data. So for this I wanted to put the equations for market capital um debt market valuable beta tax rate um RF and then the MRP research and refine. So here we wanted to calculate the R E R D 1 minus T. Um and these mean the cost of equity and after tax of debt. um determine the current capital structure weights um EV and DV um using market values calculate current WACC's the calculated components and weights to find Netflix's current WACC so this is all finding this isn't comparison yet this is just finding um what is for Netflix and then you want to evaluate the impact of new debt calculate new capital structure weights after adding the three billion debts um to the current market value of debt keeping equity market value constant for a first pass analysis um but justify this choice calculate the new post uh issuance WACC and for this part I made um AI run through it again um because the post issuance for the WACC wasn't there and then pure data integration incorporate the clearly and clearly state the WACC and capital structure of Disney and Amazon Prime Video. This is where the comparison comes in. Um, and then under that I had the self-correlation refinement. Does the change in WACCC after issuing debt make sense? Tax shield benefit versus increased leverage risk. So, I wanted to make sure the AI had a prompt um to specifically answer. So, an issue to follow. And then going into the implementation and illustration um product specific WACC analysis explain why a firmwide WACC like the one calculated may not be appropriate for all projects um and why it's good for this one. basically recommend a qualitative approach to adjusting the a WACC or finding a divisional cost of capital for a new international um content project using a pure play approach by finding a beta for an internationalonly media company. The visual representation should demonstrate the sensitivity of Netflix's WACC as the debt to equity ratio changes fulfilling um the integration of finance and tech technology requirement. Um that's also just explaining when I put it into AI um to check for the requirements that I stated that were very important earlier. And then you want the pure comparison. Um, comparing Netflix's and Amazon's percentage. Sorry for all these miscellaneous icons when I pasted it over. Um, explain the difference by focusing on capital structure, demix, cost of equity, beta, risk profile, and tax shield benefit. And then here wanted to validate. So check the hurdle rate. this for the hurdle rate. It's very important to validate whether the calculated WACC is a logical hurdle rate um for 5 billion investment. um given the company's risk profile and the industry WACCC 8% to 10% range um formula verification double check all calculations again just being very thorough for WACCC CAPM formulas ensuring correct application of corporate rate 1 minus t assumption review review and confirm that all initial assumptions use of market values cost of new debt are justified and clearly documented and then evaluate and explain capital structure recommendations for the optimal um structure strategy for Netflix. Focus on trade-offs between tax shield debt and risk of financial distress. Um and then explain the strategic implications for WACC, the minimum required return for investors. Um again that 5 billion comes in for the content investment and the future growth from it and then key learnings and recommendations. Um I wanted to summarize and the most critical insights gained about the relationship between capital structure risk cost capital um from the Netflix case study specifically through comparison and then um next steps. So suggest analytical next steps um detailed projected level cash flow NPV analysis and then down here some things that I added throughout um and at the end of my prompt for AI. So I said make it a prompt that can become a code transferable for Google Collab in Python because sometimes it gives you JavaScript or other coding languages that are um necessarily the best for this analysis. I wanted something easy and simple to understand. So I told it to run through the KISS principle as well. Um I also told them to print the analysis but then I didn't like that so I took that out. Um, and then originally the code was all truncated. So I wanted the code to be all continuous, which you will see in a second. And then check if it satisfies the original criteria. So that original um requirements that I put in that I kept harping on were so important. And then if we take a look at my code here. Oh. Um so here is first the discover and define the parameters market condition. So everything it gave you from the text strategic contents pure data. Um and then the calculations that I also inputed using um the print f function to make those variable here and then research and refine. Um uh these are the formulas for cost equity again using the f function. Um using the after tax cost of debt formula and then using the f function again calculating current capital structure weights. Um so that's the e market over the vcurren then the dmarket over vcurren. Um and that is the current equity weight and then current debt weight using the f function calculating current WACC. Um and then using that formula and then the f function um these formulas are found in the book. So wasn't too hard to calculate or find. Um and then we wanted to implement and illustrate. So here is the new debt calculation. Um new weights calculation new WACC. then using those f functions to input those variables there. Visualizing that and comparing um Amazon and Disney to Netflix. Um and for here we had to import pandas. Um maybe one thing I would have changed is to import the libraries earlier on. It doesn't really matter, but that's kind of how I usually like to have it structured. um but it worked for this so I didn't want to change anything and then something looks a little different. So um create hypothetical leverage points so debt over equity ratio then noting that um re and RD are held um here with the simplified sensitivity analysis. So sensitivity analysis within the WACC calculation was important for this using the forin um function to get the um leverage points and then using that to make u a pandas data frame for WACC sensitivity analysis. um plotting this figure here which we'll talk about later um the line graph um and for that we had on the x axis the debt to equity ratio d over e and then the y ais um the wacc um and then using true just makes it cumulative and then here's the pure comparison all um drawn out so we're going to get to see the Netflix current WACC Netflix post 3 billion debt WACC industry WACCC range um Disney WACCC and Amazon Prime um WACCC. So for the current firm the value is at um 213 billion cost of equity is 11.65% 65% after tax cost of debt 4.58% current equity weight we is 93.9% and then current debt weight is 6.1%. Um Netflix current WCC is 11.22% total debt post issuance 16 billion um new debt weight 7.41% 41% new equity weight 92.59% Netflix WACCC after 3 billion debt is 11.13% and the key here has the current DE 0.065 as the green dotted line new D over E 0.080 080 which is a little bit more to the right from this um hitting um the decline here for um the blue. So the blue is the um WACC sensitivity to leverage um yes so the pure comparison comes out to be 11.22% 22% um for the current WACC post 3 billion 11.13% industry WACCC range 8% to 10% Disney WACC 70 over 30 would be 8.2% and then Amazon being 9.5%. Um what do all these percentages mean? Um so the meaning of code conclusions a high WACC Netflix's current WACC of 11.22% 22% is relatively high. This is primarily due to its heavy reliance on expensive equity over 90% of its capital structure and minimal use of cheaper debt tax shield benefit. The additional 3 billion in debt successfully lowers WACC by 10 um 10 um basis points um 11.22% to 112%. This demonstrates the value of the tax shield of RD1 minus 2 is cheaper than re and confirms. Netflix is currently under leveraged so it could be doing more in shorter terms. So the key takeaway is that Netflix's high WACC relative to Disney. It's direct result of its conservative capital structure. Um basically meaning Disney is just very big and broad and so um it can capture a little bit more of the market. Um,",
  "video_url": "https://www.youtube.com/watch?v=eHjJOP7MTXM"
}