{
  "student_name": "Spencer Beebe",
  "org_defined_id": "034593722",
  "username": "beebe9",
  "email": "",
  "transcript": "Alright, welcome to my what is this session 9 assignment? Umm, so this week we were talking about cost of capital analysis or the weighted average cost of capital WACC. Uh, and then for this assignment, uh, we're going to be looking at. Uh, just going over this defining discover. So the core decision problem, uh, is that $5 billion investment with the $3 billion in debt. So what's the current WHCC, uh, what it would be after taking, excuse me on the debt, uh, whether there should be project specific discount rates, umm, how Netflix cost of capital compares to major competitors like Disney and Amazon and then the, you know, the optimal capital, uh, structure strategy. Umm, so looking at all of those, so this is all of the Givens that we, uh, that were given to us, uh, in the, the problem here. So all of the capital structure inputs, cost of capital inputs, uh, the equation right there, umm, the after, uh, after tax cost of debt equation, umm, and then just the benchmarks that we were given the market conditions in the context. Umm, all that right there. And then project dimensions, whether it's, you know, US content or international content, how that, uh, applies. So we're going to discover the issues of, you know, this, more debt, reduced WACC or increased risk. Should Netflix use a single firm YWACC and then the competitive comparison to Amazon and Disney, umm. So Disney has more debt and a lower beta. So I'm predicting they'll have a lower WHCC. And then similar with Amazon, they have a a higher WHCC compared to Disney because of its broader business risks. Umm. So in turn, Netflix has to evaluate whether, you know, adjusting leverage improves their competitiveness or if it just improves their, you know, volatility. Um, so, yeah, moving on to the represent stage. So this is all of the equations with everything given. No actual, you know, math is being done yet. I'm waiting for the implement stage. Uh, but this is just everything laid out kind of a, a framework here. So this is the current capital structure, you know, the cost of equity, umm, the after tax cost, uh, with all of the numbers that were given to us. Uh, the WACC formula there. And then the after debt, how that affects the beta and then the US versus international imports, how that affects the beta as well? Um, so based pretty simple in the the represent stage, this is just everything that we're going to be finding through the Python code. Umm, so moving on to the implement stage, uh, we'll go over to the colab here. So this is what I created. Uh, it's a code that it's all the Givens from, you know, from the textbook here, umm, all of that information, just put it in here with the, you know, the equations that we wanted to find, uh, that I highlighted in the represent stage. So I just put all of that into the code here. So for example, the new debt and the equity markup cap, how that can change project specific adjustments? So you know, is it more feasible for different WAC's compared to international or domestic products? The sensitivity, uh, so if the debt yield rises 100 BPMS after issuance, how that will affect it? Umm. And then it'll just print all the results here. So running it, it just provides the current WACC of 11.22 Uh, after the debt, the WACC jumps to 11/20 and that's with the base Rd. If you were to bump that 100 BPMS, that jumps up .06% Umm and then for US content, the the project WACC is 10.55. And international is 12.56, so a much higher WACC for international uh content. And then when compared comparing to Disney and Amazon, Disney had a 8.2% WACC and Amazon had a 9.5. So both of them are much lower than the current uh, Netflix WACC of 11.22. Umm, so we want to, you know, double check all of these numbers here and validate everything. Uh, so we're moving on to validation stage, so. Doing all of the calculations by hand, umm cost of equity comes out to 11.65% after tax. Cost of debt is 4.5 uh. Capital structure weight is 93.9 uh. For exports or excuse me, for equity and then, umm, for debt it's 6.10%. Uh, the current WACC calculated is 11.22, so the exact same that we got with the code. So that is correct. Umm, so you can see the equity versus debt proportion there. And then with the $3 billion in debt? That new cost of equity is 11.73, so did get a little different answer than. Uh, what the code gave us. But we just wanted to validate it to make sure, but that is that's the new cost of equity. Excuse me. The new WACC is 11.21, so very similar to what was generated by the code umm. So overall everything looks correct here. Umm, so now we just want to evolve it and you know, how can I make this code better? Umm So I went ahead and created a separate code here, umm, very similar to everything that was provided in the. Code. The only difference is I added a results table and a sensitivity grid so it'll give a visual of, you know, what we're actually looking at here. So if you run the code, umm. It basically gives the same information as before with the W with the weighted average cost of capital um. Gives all the results here and how? Each is affected, so very similar results as to the first part of the code. However, it now creates this bar chart showing, you know, just the comparison between WACC, between Netflix, the new debt and how it compares to their competitors here. So as you can see, the much higher WACC compared to Disney and Amazon, however, with the $3 billion debt, umm, not a big difference between that uh, So as you can see, realistically, it would not be a bad uh, investment to take on this 3 billion in debt. Umm. On the other hand, uh, it is very smart to have different WACCS for US or international content uh, as you can see. International content WACC is much higher. So you want to make sure you're getting the most money for your products. And then this is a chart showing the WACC versus the debt, um. And how that is affected and how it does affect. So the additional debt is going to lower that WACC umm. As you can see by the chart and then this is the current capital structure here uh, with 6.1% debt with the $3 billion uh in debt that would jump up to 7.4. So overall, not a big increase umm. You know, it's, it's pretty solid. Umm, you're not taking on much risk, umm. So the overall the investment is good. So that was the evolve stage. Now let's go on to reflect and you know, review here. And we will kind of summarize everything up. So what we wanted to, you know, uncover here that we went in the Discover stage, Netflix's current WACC, which we found. Umm, it's about 11.2, uh, with the 3 billion dot 3 billion debt. It would uh. Excuse me. So normally, uh, the current ACC or WACC is 11.22 with the debt it uh, goes down. Umm, to. 11 point. 20 so it it decreases slightly. Um, 22 to 21%, uh, give or take there. And then evaluate project specific. And then compare it to Disney. So we'll just go over everything in the reflect stage here. It should answer all the questions. Uh, so Netflix is current WACC is high of about 11.22. Umm, this is because it's heavily equity finance, 94% equity as we saw in the, uh, pie chart here. Um, so you know, equity is expensive due to the high beta. Netflix behaves like a tech company with growth, which you know, comes with higher volatility, higher risk premium. Um, Disney's is much lower at 8.2% because it has a lower beta. It uses more debt, which is, you know, cheaper financing and it has more stable diversified cash flows. Umm, you know, Disney is in multiple industries. Uh, and they use that to their advantage to diversify their cash flows. So adding 3 billion in debt barely changes the WACC Umm, and why is that? Uh, that's because, umm, the change from the debt is only 1.3%, which is very small. So that, you know that tax yield helps slightly, but the, the beta increases equity costs slightly. So that kind of offsets the benefit there. Uh, so this means that Netflix has room to add debt without. Material materially increasing financial risk, uh, so they would much they would benefit greatly from. This $5 billion investment, so looking at, you know, project specific US versus international umm, so from, from the data, what I've concluded is that different Netflix projects should have different levels of risk. Umm, so with that, they shouldn't use the same WACC that US content is lower risk. Umm, so it should have a lower WACC uh, which is shown. By the, you know, the code here, it's a 10.55% umm, and an international is sitting at 12.56. So it's higher risk, uh, because you know, there's the regulations, the currencies, uncertain demand, umm, while in the US, you know, there's predictable viewers in a stable market. So using those different, you know, uh, weighted average cost of capital helps Netflix invest the right amount into each region and avoid over undervaluing, uh, you know, projects. And then looking at Netflix's cost of capital disadvantage, so as I've already stated, they have a much higher WACC with 11.2 compared to Disney's 8.2 and Amazon's 9.5. So what does that mean? Umm, Netflix has to generate higher returns, uh, or content investment to justify all of its capital costs. Uh, they need to take on more debt. Umm, in order to, uh, you know, have a more stable financial aspect. Similar to what Disney has done by diversifying. And, you know, having multiple cash flows instead of, you know, putting all your eggs in one basket. And then lastly looking at the optimal capital structure, umm, so like I've said all video, they want to add debt. Umm, so you know, they can have that leverage, uh, towards Disney similar to like a 7030 mix, uh, because right now they're, you know, at like a 9010, uh, so very high equity. Umm, so reducing the WACC by boosting the tax yield, umm, is, you know, one of one of my recommendations there and then. Secondly, they need to avoid large issuances of, you know, 10 to $20 billion. So $5 investment with 3 billion in debt is not bad at all. Uh, they should definitely jump on that, but the sensitivity plot shows that WACC rises again once that debt gets too large because beta spikes. Uh, so they need to avoid large issuances and then, uh, they also need to use project specific, uh, hurdle rates. So, you know. The US projects, uh. You know it's a 10.5% international is 12.56, so using those numbers to your advantage. For you know the different project specifics. And then lastly, consider hedging FX for international project. This reduces beta and WACC umm. So overall, those are my recommendations. Alright, let's go back here. I think we, you know, we went over everything. So it's 11.22 goes down to 1120. Umm, you know the USWACC is 10.5 while international is 12.5. Uh, so you know, using that to your advantage, uh, and then comparing to Disney and, you know, Amazon. Just for, you know, a little bit more. Now data. They need to, you know, increase their debt similar to Disney and diversify their cash flows more. And then with that would be the optimal cap capital structure of, you know, something like a 7030, you know. Hedging effects for international projects only using or only green lighting projects compared to their, you know, domestic or international WACC and then avoiding large issuances. Umm, you know, just in case that, uh, the sensitivity sensitivity plot doesn't rise too large where, you know, the beta spikes. So, yeah, I think that's gonna be it. Uh, we used the driver framework to go through everything, umm, use KISS principles on the, you know, the code here was able to create one code, umm, evolved it into a second one here with, you know, more charts and visuals. Uh, and then we used, you know, the driver framework to, you know, explain everything. Umm. So overall, umm. You know, the the, uh, hypothetical investment is not a terrible idea. Umm. And it would definitely help Netflix, you know, get more towards their, you know, industry average for WACC, uh, because it's a little too high right now, and that's because of the high equity to debt ratio. But yeah, I think that's going to be it. Thanks for thanks for watching. How do I stop it? Well. There we go.",
  "video_url": "https://www.youtube.com/watch?v=zl08EH6pX_Y"
}