{
  "student_name": "None None",
  "org_defined_id": "037202820",
  "username": "mcnama34",
  "video_url": "",
  "transcript": "Hi. Uh, I'm Ryan McNamera and tonight I'm going to be talking about my mini project 3. Um, so first off, sorry about the microphone here. I have to hold it. The mic on my laptop stopped working. So you get headset microphone now. But anyway, so for mini project 3. So for my mini project three, I decided to build an AI finance uh stock analyzer. Um so what this uh program is meant to do is it's meant to help you make a decision um on if you want to buy a stock or not based off of AI's prediction of that price in the future. So um yeah, let's just let's jump into it here. So I've got the program running right here and this is your first output with a input uh a user input. So what it's asking right now is the stock ticker which is how the stock is identified on the stock market. So Apple and Apple and Google right there. Um we can see so we're going we can just type in do Google this time. I've been playing with Apple a lot. Um, it's going to give us and then it's going to ask us how much we'd like to invest. Um, it's also so at this time it's giving us closing price for today. Um, and what it's predicting the the price will be in 30 days. So, it's getting all of this data from Yahoo Finance and then it's well actually you'll see in a second. So, we'll just say we're 10 grand. Here we are. So, it's getting all of this data from Yahoo Finance. Um, and then it's using a linear regression to kind of figure out what it thinks that price is going to be very soon. So, um, we're starting out uh with $10,000 here and it's predicting we're going to go down like crazy. Um, down nearly 27% or $2,600 by January 3rd. So, that's not very ideal. Um, but it's all right. That's what the tool is for. The tool is to help us learn about that. Um, so and then we can see down here our disclaimers. This is obviously not a professional grade tool. This is a college kid in his apartment with AI. So, this is not real advice, but it can what it's meant to do is help somebody get their foot in the door who's maybe trying to learn about investing. Um, so I think that's really cool is it's kind of like that gateway into the world where you can really start to step it up if you want to. Um, then below that we're going to see that this yields a loss. We know that. Um, so what it's going to do is it's actually going to give us four different stocks that it wants us to uh look at because we have a loss. So we'll we can scroll down here.\nWe can see the these different companies here. And then what we'll be able actually able to do is it gives us another text box to analyze. So I think Spotify was one of them. Boom. There we go. So and then we'll do the same thing, same investment. 10 $10,000 investment. we're going to get that similar output here. But today, closing price at just over $550, predicting in a month almost 800. That's a 42% gain um according to our analytics and that uh linear regression. So, that's really that's kind of like the cool part of all of this is that it's um it's going to make that decision. It's going to show you exactly what you want to do. Now, it's not super super advanced. It's still in the early stages of what I was able to do, but this went through several several um iterations. It started out with simply, hey, I'm going to tell you, hey, Gemini or Collab, I'm going to tell you a stock and I want you to retrieve the price for me. That was it. Then it went to uh just this first part of what's the price going to be in 30 days and then it slowly kept building um down the output. So now we have how much money do you want to put in and then what's that going to look like? Um if it's a loss tell me what I should do instead. So, um, it kind of built on itself like really fast once I got it going, which I thought was pretty cool. Um, and overall, I think it's really, really helpful. Um, I think we went through, geez, nearly there was a lot of development, probably five, six different full redesigns through AI to help make this um, whole thing possible. um from retrieving different data and uh even just like little errors that made it kind of hard to get it going. But at the end of the day, I think it's really really helpful um to have a tool like this, especially just start as somebody who's just starting out and like it's like I said, not a real model. So, we got to keep an eye on that. But, uh I believe that is it. That is my uh predictor here. Uh it's super super cool, super super helpful. And so just like our thing here, I do not need to analyze another stock. Type in no. It's going to give it's going to say thank you and goodbye. So I will say the same as well. Thank you so much. Um and yeah, have a good one."
}