{
  "student_name": "Connor Bakota",
  "org_defined_id": "035716300",
  "username": "cbakota",
  "email": "",
  "transcript": "Hello and welcome back to uh management 310. Um today we'll be going over section six assignment um 10 um or assignment 9. And today uh we're going to be looking a little bit deeper into um the capital investment for Starbucks new roaster and flagship store requiring 12 million initial investment. Um and then we're going to you be using these project parameters right here. As you can see on the initial investment of 12 million project life of 10 years um premium downtown location for high foot traffic um and the WACC of 8.5% for Starbucks um using revenue projections as stated right here um operating cost and additional assumptions to help uh prove our case. So once again um you guys are being filmed right here and I have another uh monitor over here. Um so the first thing that we're going to be doing is we're going to be um projecting um um uh we're going to be calculating the MPV and the IRRa for the project. Um so right here um we are implementing all the initial investment working capital and all the other assumptions um into our code. Um and then working down the line um we're doing um if base revenue um equals 8,000 and the marketing 300 um then it'll um give us other options as well as if base revenue is 11,000 marketing 100,000 um and then so forth. Um and then we have a uh a sensitivity modifier for base revenue times revenue um rev modifier um with other expenses. Um and then this calculation gives us the EBITDA um which is revenue minus cost of goods sold minus labor and then minus rent and minus marketing. Um this gives us a lot of different um a lot of different uh revenue cost sold labor rent and all that. These are all the equations for that. Um moving forward um we're using financial metrics. We want to know the cash flow options. We need to know the MPV um which is a sum of cash flows divided by 1 plus the project um parameters on the discount rate um times the DF index as you can see right there. Um and moving forward we just have more um of the irr um and then this prints all of this out for us with the um base scenario and the sensitivity analysis scenario. So, um, for this scenario right here, we have the base, um, base case scenario, and the MPV shoots out to be 2,690,800.79 with an IRRa of 12.84%. Um, and then the payback period is about 5.28 years. Um, and now for the sensitivity sensitivity analysis with the revenue of - 20%, our MPV would be -3,489, and then $6.36 with an IRRa of 2.41%. Um this also gives us um this is another thing that we put together um with the revenue, cost of goods sold, labor, rent, utilities gives us all this. Um then it gives us our change in the NWC um and then capex and then terminal value of 2 um 250 um,000 and the free cash flow right down here. So um for the cash flow projection for the base case um you analyze the project we first uh project the free cash flows for 10 years as you can see right here um so for year zero we outlay that is -12 million um minus for cap x as we can see over here -12 million um minus 500,000 which is our working capital um right here um which gives us to 12,500,000 Um and then working into our terminal cash uh our annual depreciation we do 12 million divided by 10 years which is about 1,200,000 per year. And then with our terminal cash flow of year 10 after tax salvage value the ATSV the equipment is sold for 3 million since its book value is zero and fully depreciated. This is a $3 million gain which is taxed at 25%. Um the ATSV which is 3 million time 1 minus.25% uh well.25 25 which is 25% equals to 2,250,000 and then our working capital recovery the initial 500,000 is recovered. So our total total terminal flow of nonoperate operating is 2,250,000 plus 500,000 which gives us 2,750,000. Um now we're going to move down um further in our code. Um and this is us calculating our um sensitivity analysis and the scenario analysis. Um we build a cash flow table right here with the years and columns of revenue, cost of goods sold, profit um and so forth. Um we do calculate annual depreciation. Um and then we do the same if function. Um cost goods sold revenue, gross profit, all these operating calculations. Um we have a tax calculation in here. Um and then we have this is populating the rows that we've created. Um year 10 terminal adjustments. Um and then we cover working capital um from previous um and then we print this out. So then our annual cash flow projections in USD uh is right here. So we have our revenue EBT EBITDA EBIT tax and then uh NOPAT their free cash flow assumptions right here. So we start off 12,500,000 um and then we move forward through this each year. Um, our detailed year 10 breakdown, the operating FCF is 1,800,000. Our terminal inflow is 2,750,000. Um, and then our total year 10 is 4,550,000. Um, and then for this um, this is our cash flow um, right here. And then right down here, it's the same thing, but we just, um, added in a print option to kind of show this for you guys. So, our cumulative cash flow and then our annual FCF. So you can see we start in the negatives right here when we purchase it on 00 and then there's a slowly reclaiming value over the years in our cash flow and payback uh timeline. So um and then this is our project year right here and then this is our cash flow in millions right here. Um now moving forward um we're going to be looking at our sensitivity analysis. Sorry that that was our cash flow one. I was wrong. Um this is now our sensitivity analysis right here. Um we have a dynamic MPV calculator. Um we use this um for other base parameters. Um and then this is our year zero outflow and then our operating years giving us our base revenues for that. Um and then we have a um we apply modifiers with our revenue and cost goods sold and so forth. Our terminal year logic is right here. Um and then we calculate our MPV through these values. Um then we execute sensitivity loop. um varying assumptions from negative 20 to positive 20%. Um and then we have our visualization. So we're plotting all this right here. Um this is our sensitivity analysis that we've created right here. Um and what drives up the project value. So for our sensitivity uh scenario analysis um sensitivity analysis revenue downside is the 20%, the worst case scenario assumes that revenues are 20% lower than projected in all years. Fixed cost, labor and rent remain the same. a new MPV of negative3, million81, um82. Um the new IR is 5.06%. Uh in this case, you know, the project is a clear reject. The IR uh falls well below the 8.5% WACC and the project would destroy over 3 million in firm value. This indicates the project is highly sensitive to revenue forecast. Um with a WACCC sensitivity, this tests uh how the MPV changes if our cost capital assumption is wrong. So for the base case, WACC would be 8.5% and MPV would equal to $2,982,774. Um, and then with our higher WAC at 10.5%, NPV would equal to 1,34,3334. And then our W uh our lower WACCC of 6.5% with an MPV equaling to $4,817,758. Um, with this analysis, the project remains MPV positive even if the WACCC increases by the 200 basis points to 10.5%. The break even with WCC is IRR at 12.04%. Um, this suggests the project is robust to moderate changes in the cost of capital. Um, now for a break even revenue analysis, this analysis finds the revenue level that makes the project MPV exactly $0. The MPV breakdown, the project breaks even MPV equals $0. Revenues are 11.3% lower in the base case forecast in all years. The analysis provides us margin of safety. Management must be confident revenues must not fall more than 11.3% below the initial projection over the project life. Um now after we've done all this and we've looked into all of um the statistics, now we kind of have to bring it into our non-financial strategic considerations. um for quantitative and metrics um for the quantitative metrics they don't really tell the full story of this case. Um and so for a brand driven company like Starbucks here are some strategic values um that could be critical brand enhancement. Roaster is a halo product is an immersive experience that reinforces Starbucks image as a premium artisal coffee expert um not just a commodity chain. The this enhances the brand for all other stores. Um also we have um competitive positioning. This flagship store creates a high visibility third place um and a tourist destination differentiating Starbucks from competitors like Duncan or local craft coffee shops. Real option values now um option to expand. If this roaster concept concept is successful, it serves as a pilot program that can be replicated in other major global cities um creating a new high margin business line option to scale. The facility can be used as a training hub for baristas, a test kitchen for new blends, or a center for premium reserve coffee distributions, and then option to aband if the project fails. The premium downtown real estate could likely be sublet or sold, mitigating some of the downside risk um with this um project. Now, for our final verdict, after we've gone through all this, we now understand um that we should probably proceed with this investment um subject to these following conditions. If the market cap um if the marketing spread is strictly capped at the projected amounts to project year one cash flows um we would um and then also the lease structure the real estate team must attempt to negotiate a percentage rent deal um to mitigate the downside of risk identified in the sensitivity analysis and then cannibalization review um confirmed that the 11 million revenue projection is largely new demand not just displaced demand from existing stores that already have this since existing stores don't have this um commodity um like um storefront. So today we've calculated our MPV and IRRa for the project. Um we've determined our payback period and discounted payback period. Um we've conducted a sensitivity analysis with revenue of negative 20% scenario. We also provided the accept or reject recommendation as we just now and then we also discussed some non-financial strategic considerations. Um after all this we have a better understanding of our MPV on RIR um and then also our payback period and also about just general um assumptions of how to assume what to do in a period of misunderstanding or unclear um risk um related to Starbucks a high um value company um and using these project parameters and revenue projections operating costs and then also other assumptions to help us create the best um decision for our business um and to retain the most revenue. Thank you so much for tuning in um another great and successful management 310 assignment. Uh and we'll see you next week for mini project number three. Thank you so much and have a great day.",
  "video_url": "https://youtu.be/P9hfOxc-0t0"
}