{
  "student_name": "Max Munkholm",
  "org_defined_id": "037076884",
  "username": "mmunkhol",
  "email": "",
  "transcript": "All right, here's my session 10 video assignment. I'm going to jump into the overview real quick before we get started. So, our um assignment is to evaluate Starbucks proposed flagship roaster that requires a $12 million upfront outlay and is expected to operate for 10 years. We're going to use the firm's 8.5% WACCC as the hurdle rate to determine whether the project creates value and to recommend and accept/reject decisions supported by uh driver documentation. We're given some project parameters here that I'm going to cover in the first section. So, let's just jump into driver. So um we discovered that or we're going to define our objective to be determine if the $12 million investment in the flagship roaster create shareholder value using 8.5% hurdle rate. In the project parameters, we're given the initial investment which is $12 million that the depreciation which is straight line over 10 years. Um we're given the working capital to be $500,000 upfront and to be fully recovered in year 10. We're giving the revenues from year 1 to year 10, which year 1 is 8 million. Years two through five it's 11 million. Year 6 through 10 it's 9 million. And then we're also giving a bunch of operating costs like the cost to get good sold is 40% of the revenue. The labor is 2.5 million per year. I won't cover all those but we're um all we're given the rent and utilities. The marketing um also then we're also given that taxes is 25% corporate tax rate. We're given that the terminal value is $3 million asset sale at the end of year 10 and we're given the hurdle rate again which is WACCC um being 8.5%. There's also some standard financial modeling rules that must be applied for the project to be valid correctly. So here's kind of like the modeling decisions discovered and documented. Um one is the depreciation is going to equal the straight line of the full initial investment which would be 12 million divide by 10 to get 1.2 2 million per year. Um the terminal value is going to be treated as the sale of a fully depreciated asset. So it's going to be taxable at the corporate rate. So the terminal after tax is going to equal 3 million times the 1 - 0.25 which is going to get 2.25 million. The working capital is a cash outflow at year zero and it's going to be recovered at year 10. And then taxes are applied to EBT allowing tax shields if EBT is negative. So now moving on to a represent stage. We're going to represent this by creating a strategic plan to tack this evaluation. And our plan is going to include four distinct phases that will be used to create our financial model. The first phase is construct constructing the incremental cash flow schedule that will map out a 10-year timeline um that isolates incremental cash only. is crucial um that we understand that we will incorporate the depreciation tax shield um to ensure we don't undervalue the project. In phase two, we're gonna um it's called the discounting mechanism. It's going to use the time value of money uh concept. So, a dollar in year 10 is going to be worth far less than a dollar today. And then we're going to apply um the 8.5% WACCC as the gravity force that pulls all future cash flows back to the present day value. The logic behind this is if the project cannot outrun this 8.5% discount rate, it's going to destroy its value. In phase three, we're going to look at different decision metrics like um we're going to calculate the NPV to measure total wealth created. We're going to calculate the IRR to compare efficiency against cost capital. We're going to calculate the payback period to measure liquidity risk and just, you know, how long is our money tied up. And then we're going to lastly calculate the profitability index to measure, you know, our bang for our buck. Um, we will calculate the ratio of the present value of future cash flows to initial investment. So, a PI greater than one means that the project is going to generate some value. And then lastly, we're going to do stress testing in phase four. And we're going to approach this by recognizing that forecasts are rarely 100% accurate. So we plan to build um toggles kind of into our model to test. So for example, if nobody buys coffee, uh that would be represent the revenue minus 20% test. And then what if interest rates spike? That represents the plus or minus 2% WACCC fluctations test. So now going into the implement stage um I use Google Gemini to um create a Python code that generates the cash flow schedule calculates key metrics that I just listed and performs the sensitivity analyst as long and as well as gives um a final recommendation. So I'm going to go to my code. Um here's a quick overview of the code. You can see here it has all the input parameters including the cost and the revenues and whatnot. Um and then over here it starts uh creating the uh chart or the schedule of cash flows. Here are the metric uh calculations. So it gives the NPV formula, how payback periods calculated, um how the discount payback period is calculated and whatnot and and the profitability index and the IRR. And then it goes into the sensitivity analysis doing two or three scenarios and then showing the results of those scenarios. and then it outputs the final recommendation. So let's go into our output. That's where um most of the data we're going to be needing here. So the first one is the cash flow schedule and um just to describe this chart um it's this the schedule details the incremental cash flows per year. So it starts with the 12.5 million initial outflow and then it explicitly adds um explicitity explicitly adds back the depreciation tax shield to operating income and captures the year 10 recovery of working capital alongside the after tax asset liquidation. As you can see our cash flows um are all right here. So it gives the year, the cash flow, the PV factor and the DCF for each of the for the cash flow schedule. Um now moving on uh the key metrics and managerial decisions. So our first metric NPV is calculated to be 2.69 million. And our decision rule here is if NPV is greater than zero, it it means the project creates value. And since the uh NPV is calculated to be 2.69 69 million. Um we can say that the project adds 2.69 million to shareholder shareholder wealth. Um the irr or the internal internal rate of return is calculated to be 12.84%. Um since the whack is 8.5% um having an IRRa of um 12.84% since it's greater than um the whack we can say that the return exceeds the cost of capital which is good. Um the profitability index is calculated to be 1.22 um x or times um and this just means that for every a dollar invested we're going to generate 1.22 in value which is also good. Um our payback period is going to be 5.28 years with the discounted payback being 8.21 years. And then this just shows uh the liquid liquidity of it all. And it shows that we're going to recover initial investment in about 5 years uh 5.28 28 years to be exact. Um, now let's go into the third one which is the sensitivity analysis or our risk assessment. So we calculate our base case MPV to be 2.69 million. So scenario A is going to um be a demand shock where revenue is going to uh decrease by uh 20%. So this is going to leave our new NPV uh to be aboutgative -3 uh 08 uh million and then our new IRR is going to be 3.13%. Um so this is going to give us an obvious risk alert because NPV um turns negative. Um and it this shows that the project is going to be highly sensitive to volume as we cannot afford a 20% drop in sales because that's turning our NPV negative. Uh scenario B um is going to be the cost of capital hike. Um this is for if the WACCC is 10.5%. Um that would mean that that would make the new NPV uh about 1.35 million and this shows that is stable because the NPV is remaining positive. So that means the project is robust against interest rate fluctuations. Scenario sneeze if the cost of capital were to drop. So that'd be the WACCC at 6.5% and the new NPV is 4.23 million which uh about 4.23 million which is a positive NPV. So um it shows stability again. So based on all this we're going to uh do a final recommendation. So we're going to recommend that accepting the flagship grocery project um we're going to recommend accepting the flagship grocery project with an NPV of 2.69 69 million and an IR of 12.84%. Um the project is going to comfortably exceed Starbucks 8.5% uh whack hurdle rate. Um the investment also pays back in under 5 years offering strong liquidity. Um but however sensitivity tests reveal that a 20% revenue drop destroys value. Thus approval must be uh contingent on securing the year one and two volume targets. So now that's we have our recommendation let's validate all this. So internal validation let's look for model sound soundness to just you know check the model did all of what we was needed and it did the cash flow schedule correctly incorporates um a lot of things. uh the 12.5 million initial outflow um is the capex plus WC which is right the year level operating cash flows including depreciation tax shields um is is correctly incorporated and then the year 10 inflow from salvage which is going to be your $2.25 to 5 million value plus the WC recovery is 0.5 million is included. Um discounting uses the 8.5% WACCC which is consistent with the Starbucks hurdle rate and then the MPV IRR PI and the payback are all computed using accurate and standard capital budgeting formulas. So now that we've done internal validation let's do external validation. So looking at you know like managerial stuff and you know the market reality of it all. So the profitability of the project is going to be highly dependent on the revenue volume in years 2 to 5. Um the sensitivity analyst confirms that a 20% demand shock will produce a negative 3.08 NPV which is unacceptable. Um reasonable WACCC fluctuations of plus or minus 2% do not throw in profitability however so that's good. Um so our recommendation is g depend critically on marketing validation of demand projections. Um and but overall the project's attractiveness aligns with Starbucks uh strategic move towards flagship high margin exper experiential stores. So um basically to include on all this u we can say that the decision logic holds provided revenue assumptions are externally validated. So as long as they're externally validated, we'll be good. Now moving into the involve, we're going to involve our decision robustness um by you know looking at things management should consider. We should look at the operational enhancements um that we could that's something we consider like dynamic pricing models for flagship locations to stabilize margins and low volume scenarios. We can also look at tiered service offerings like um season seasonal e exclusives to enhance the topline resistance. We can also um consider risk mitigation like volume hedging strategies or um doing you know stage investment approaches too would help uh mitigate risk. And then also we should consider um analytical extensions like Monte Carlos simulations to help quantify revenue of volatality impacts beyond the single negative 20% scenario. And we could also um build you know scenario trees to help us do that. Um now to reflect on everything. So what does this analysis reveal? Um it reveals that the project creates meaningful share shareholder value under base assumptions. So that is revealed by showing the 2.69 million MPV. The IRR uh comfortably clears Starbucks hurdle rates confirming strong cap capital efficiency. The investment is liquid too recovering its initial cost in over 5 years. And then revenue is the primary risk lever um far more impactful than the WACC changes. So um what should management internalize from all this? Um, one of those things is approval should be tied to validated market studies, not optimistic volume assumptions. Capital budgeting decisions must explicitly test worst case operational scenarios, not only financial ones. Um a sensitivity analysis is indispensable as a small shift in topline assumptions can uh reverse decision and Starbucks should institutionalize demand for feasibility assignments for all the flagship or reserve investments. So that's um what management should be internalizing. So now that we've done that um the final recommendation we're going to make is that based on the positive NPV um the 12.84% 84% irr and the payback in just over five years. Um, this all just indicates solid value creation. Um, the sensitivity analysis shows the project is highly dependent on achieving the 11 million revenue target as a 20% demand drop pushes MPV sharply negative. But because interest rate changes have minimal impact, revenue accuracy is the critical risk factor here. So, we're going to still recommend to accept the project, but just be contingent on the marketing team of validating the year two to five uh the year two to five revenue assumptions. Uh thank you for listening. That is the end of my assignment.",
  "video_url": "https://youtu.be/wz6DpeqiTzQ"
}