{
  "student_name": "Siri Surapaneni",
  "org_defined_id": "037411103",
  "username": "surapan2",
  "email": "",
  "transcript": "Today we are going to do our session 8 weekly assignment. So first we're going to go over what the assignment is about. I'm going to give you my final answer. I'm going to go over the math concepts all while using the driver framework to guide my analysis and my method. So first what we're solving today the topic is market efficiency investigation. Here we are investigating market efficiency using the GameStar short squeeze event of 2020 2021 as a case to study. We're going to verify the stated facts, analyze price behavior related to efficient market hypothesis predictions, and evaluate whether market anomalies can constitute evidence against market efficiency or can be explained within existing frameworks. So the first step is to verify the statement of GameStop traded at 0.04 $04 in August 2020. We have an event timeline here which I won't read out loud. We have key data points. And then our required analysis today is to verify all the stated historical price data and document corrections. Test which form market efficiency, weak, semi- strong or strong violated. evaluate whether rational investors could have profited systematically and compare the efficient market hypothesis predictions to observe behavior and assess behavioral finance explanations for observe an anomalies. The main financial concept today is the capital asset pricing model otherwise known as CAPM which we'll go into later in my analysis. So the answer is the GameStop event of 2021 represented a profound though temporary violation of the semi- strong form of the efficient market hypothesis. The market was inefficient because GME's price became completely decoupled from all publicly available fundamental information, company performance, analyst valuations, and e economic outlook. Instead, the price was driven by a behavioral social media campaign, technical market mechanic, a short squeeze, which are elements that the semi-strong EMH argue should not be able to systematically move prices away from their fair value shortages greater than 140% of float. The implication of this information, which we'll get into in more detail later in my analysis, is the breakout breakdown in rational pricing. This wasn't a small fluke. It was a clear sign that the stock price had completely disconnected from the company's real value. It proves that investors who were just following social media behavioral momentum could make huge profits which shouldn't happen if the market was rational and efficient. Key takeaways are behavioral finance is not a footnote to EMH. It's a core driver. Hurting sentiment and prospect theory can and do create bubbles and market structure itself can create an inefficiency. That finding means that the hedge funds had borrowed and sold 40% more shares than they actually existed for the public to trade. This created a p powder keg because all these short sellers were eventually forced to buy back shares that weren't easily available, creating a massive unstoppable spike when retail investors started buying. Okay, continuing on, we're going to start basing my analysis on the driver framework. We already let's go to that part. We already did the define and discover. We defined the objective test a semi-short form of EMH using the GME January 2021 anomaly as a case study. The hypothesis was if the EMH was violated, we should be able to quantify massive cumulative abnormal returns C that is explained by market risk data and the key assumptions that I already mentioned again was all the data we were provided but also daily adjusted closing price. This is from Y finance and then the market proxy. We have the S&P 500 is a valid proxy. The model is a simplified market model visual visualized by comparing cumulative returns is sufficient to illustrate the abnormal return. And then the event window is January to February 2021. R and driver framework represent our analytical plan. We already I already kind of went through this but to prove the semi-trong form was violated, we must show that the price moved independently of fundamental value and that we will conduct a simplified event study. The visual stat strategy to make sure it was easy for other people to understand was to plot the GME's price against a market benchmark, the S&P 500, and to show its massive deviation. Next, we had to plot GME's trading volume to visualize the retail frenzy and calculate and plot the cumulative abnormal return to quantify the inefficiency. The key formula is abnormal return. The core of an event study is the abnormal return, which is the actual return minus the expected return. Pretty self-explanatory. Here's the formula list out and of course A R is abnormal return. R is actual return for GME on day T. And then the E of I int is expected return of GME on day T. And the expected return is typically calculated using a model like CAPM the main financial concept of today which is the E of R of it equals R of FD plus beta of R of MT minus R of FD. And for the visual analysis we will use a simplified market model which where E of R of it which is approximately the beta of R of MT by plotting JM's key limit of return against the markets we representing the C on collab. So before I show you the the collab and the code we're going to talk about I and driver which is implement financial logic which is we're going to use Python and pull the data from Yahoo Finance. The step one was data verification. We'll first check the August 2020 price and correct it if needed. Step two, pro price and volume plotting. We will plot the GE adjusted close price and it's trading volume two separate subplots. The price chart will show the what the and the spike and the volume chart will show the how. Step three was to add more more turn visualization. We'll normalize the starting price of GM and the S&P 500 to one on January 1st, 2020. And by plotting this cumulative growth, it'll be a nice visual way to see the vast gap between the two lines. And that proves the price was not moving with the market. So here we're going to go into our our code at this point. Here's the code. Let me go all the way to the top. We have all our libraries imported. And then we have the configuration and assumptions. All this information was given through the assignment. And then we have the modular calculation blocks blocks. Sorry. Here we are downloading histo historical data and it helps us get the calculations ready. And then here we are validating the data. Very important. And then here there's several warnings and okays that the user can see to see if there's missing data. The data is in the event window if it's valid data. Very important. And the v and dryer framework is validate which I'll touch on a little bit after I finish showing the code. And then we have the professor's data check. And then we have the plot price volume which is where we are seeing the the code for how to plot and then we have the plot one code and the plot two code. Continuing on now we have the important calculations. We are calculating the C and that calculation is right here. And as you can see, it follows the same formula I mentioned in my analysis. And that's also plotted on the figure as you can see. And then we have the main exe execution right here. So now the output it runs all the validation guard rails. The data is complete. No nas validation is K. Event window data is present. Validation complete. All this data is ready. And now we have the decisive KPI calculation. The peak GME cumulative return is 55.07. CR7 the market S S&P return at peak is 1.17 and that means the peak cumulative abnormal return C the main financial concept is about 5390% which is a very abnormal here we have the two graphs that I'm going to go three graphs sorry that we're going to go further into an analyzing right now. So, we're going to go back to the top of our analysis. The first part, the peak GI cumulative return of 55.07%. This means $1 invested in G on January 1st grew to 55.07 at the very peak of the spike in January 2021. And you can see this in one of the graphs that I'll mention in a second. The market one is the exact same moment GME peaked at 55.07, 07 with the $1 invested in the rational overall market, the S&P 500, had only grown to $1.17. Very little growth. Now, the peak cumulative abnormal return of the 5,390%. This is the unexplained part or the proof of inefficiency. It's a massive difference between the GME actually did $55.07 and what the rational market expected it to do, $1.17. And that's where you see 55.07 07 minus 1.17 gets 53.90 and as a percentage that's the abnormal return and now the graph tells the same thing the price and volume graph shows why this happening you can see the gray GME volume bars here the GME volume right here let me move the screen a bit and Then going back exploded in January 2021 and that can be seen again right here. And that's why the retail buying and that was the retail buying frenzy. This massive volume is what caused the red GME price line to spike. Here's a visual proof. And the cumulative returns graph shows the result of that frenzy. The red line GM's growth completely detached from the blue line, the rational market's growth. And that's where the 5390% car is the size of that graph proving that price is driven by the volume frenzy, not by rational market fundamentals, which is the whole point of this exercise. And that can be seen right here. They're fully disconnected right here. It's fully disconnected. Very big gap between these two lines. Okay, going back down to validate. I showed you the validation framework in our code and the output of that but just logical validation. The charts will confirm the narrative and it did. It matched the numeric numerical answers. It considered all and it considered alternate explanations is the EMA proponent would argue if it was so mispriced why didn't rational arbitrators short it back to $40. And the reason I think that's not valid is the event is a perfect example of why inefficiency can persist. fundamental risk the rational short could have gone wrong implement implementation costs the cost to borrow GM shares to short becomes astronomical and then noise trader risk again now for E more sophisticated tests can always be done rigorous event study with GM's true alphas and betas this can calculate more precise calculations the sentiment analysis use NLP to scrape we correlate the volume of GE to other things like nextj trading volume returns just proving the social media impact and now reflect conclusion is the GI event is defining moment for behavioral finance. It proves that markets are not always rational. Behavioral concepts like hedging and prospect theory can create a collective voting machine. Those are very key concepts and terminology used in the financial word world. And likely key learning is market efficiency is not a binary state. True or false, but a spectrum. While markets are mostly efficient, the GI saga shows that a perfect storm behavioral factors, social media technology, and flawed market mechanics can create massive inefficiencies. So now before I go into my final answers for the questions to consider, I wanted to explain some of the parts of the math and financial concepts deeper because that is the ultimate reason we're doing these assignments. And for the efficient market hypothesis EMH the weak form all past sorry all past trading data prices and volumes already reflected in the price you cannot profit from technical analysis this the gen event likely violates this as a momentum self-sustaining the semi-rong form on the other hand all publicly available information as reflected in the price you cannot profit from fundamental analysis this is the form that was most clearly violated and that's why we did all of our analysis based on that strong form. All information public and private insiders reflected in this price. This one was wildly considered to be false though. Now, short squeeze. I know I use that term, but I want to explain it more. This is the mechanic that fueled the bubble. Shorting a hedge fund borrows one share of GME at 10 and sells it hoping to buy back for five. Return the share in pocket $5 difference. It's a squeeze. That's when retail traders like Wall Street coordinate to buy GME driving the price up to $400. Margin call. The short sellers broker demands their closer position. They must now buy back the share at $400 to return it realizing a $390 loss. And that's the feedback loop. Feedback loop force buying to cover shorts pushes the prices even higher which forces forces other short sellers to buy creating a cascade. This is what happened when short interest exceeded 100% on the floor. There literally were not enough SHs to go around and that was the problem and that was what caused the inefficiencies. Now just a little comparison EMH and behavioral human behavioral assumes investors are humans driven by psychology with hurting confirmation bias and sentiment those psychological concepts coming in. EMH is more rational assumes investors were rational objective econ who value assets based on their future cash flow. Okay, answering just quickly the specific questions we wanted to consider. Was the market efficient during this episode? No. The price became fundamental fundamentally unmed from any rational valuation. There's a clear representation of a market bubble. What type of efficiency was violated? Semi strong was definitely violated. Public fundamentals was completely ignored. Furthermore, the public information that 140% of the float was short. It was very um information retal retail traders used to trigger the squeeze. All those financial concepts I just talked about. The weak form was also probably violated. Should a rational investor have profited? This one's a bit difficult. A rational investor would have seen the stock $100 and concluded it was overvalued. Either shorted it or stayed away. This investor would have lost a fortune. But a different type of investor who understands the behavioral dynamics of market mechanics could have profited. The investor could have rationally identified the short interest as an unstoppable powder keg. And what does this say about market efficiency theory versus behavioral finance? It proves that behavioral finance is a critical lens for under understanding markets. It shows that efficiency is not a given. The market is a complex system for humans. Behavior and sometimes it's rational models breaks down completely. suggests that while markets may be efficient on average, they're highly susceptible to black swan events. And that's the primary thing I took away from this assignment. Thank you for listening.",
  "video_url": "https://youtu.be/oUmHWvSSh8Q"
}