{
  "student_name": "Isaac Timmer",
  "org_defined_id": "033105612",
  "username": "irtimmer",
  "email": "",
  "transcript": "Hello, my name is Isaac acting as a corporate treasure for Netflix. Today I'm presenting a critical analysis regarding our capital allocation strategy. Specifically, we are evaluating the proposed $5 billion investment in new content. The central question here that we must answer is what is the minimum return or hurdle rate this investment must generate to satisfy our investors? To determine this, I have applied the driver framework to calculate our weighted average cost of capital or WACC. We begin with the driver or sorry the discover phase of our driver framework where we define our financial inputs. Accuracy here is paramount. Our current market capitalization, the value of our equity, stands at $200 billion. For our debt, we have a c crucial decision, book value or market value. Our book value is $14 billion, but the market value is $13 billion. Our first assumption here is that we strictly use the $13 billion market value for this analysis. But why is that? Well, it's because WACC measures the cost of raising new capital in today's market, not historical accounting costs. Our risk profile is defined by a beta of 1.3, indicating that we are 30% more volatile than the overall market. Our cost of debt is based on our BBB plus rating with a yield of 5.8%. Finally, we operate with a corporate tax rate of 21% and face a risk-free rate of 4.5%. Moving to the represent phase of the driver framework, we map these inputs to our valuation formulas. First, to calculate the cost of equity, which is denoted as RE, we use the capital asset pricing model or CAPM. This formula risk-free rate plus beta times the market risk premium quantifies the return shareholders demand for bearing our systematic risk. Second, for the cost of debt, which we denote as RD, we must adjust for taxes. The key concept here is interest payments are taxdeductible. This creates a tax shield, effectively lowering the real cost of borrowing. We calculate this as the pre-tax yield times 1 minus the tax rate. Finally, the WACC blends these two costs based on their proportions weight in our total capital structure, which you can see the formula for that underneath three here for weighted average cost of capital. Before calculating, I want to reiterate the logic of our weights. You will see in my code that I calculate total firm value as market equity plus market debt. Many analysts make the mistake of using book value for debt because it's easier to find on the balance sheet. However, doing so would distort our hurdle rate. So, by using the current market price of our bonds, we align our analysis with the actual opportunity cost our investors face right now. Now we move to implementation. I've utilized Python to build a robust model for this calculation. As you can see in the first code segment, I have defined our variables. First, we have market cap equity which is set to $2 billion. Starting here, next we have market value debt which is set to 13 billion. Beta is set to 1.3 as we discussed earlier. Yield on debt is 0.058 or 5.8% and the tax rate is 0.21. Here's the execution of our current WACC calculation. Let's walk through these specific outputs. First the cost of equity using CAPM 4.5% plus 1.3 * 5.5%. This result is this results in a cost of equity of 11.65%. This is high but expected given our beta of 1.3. Secondly, the cost of debt. We take the 5.8% yield and multiply it by 1 minus21. This significantly lowers our debt cost to 4.58%. This demonstrates the power of the tax shield. Debt is cheap capital for us. Finally, we have the weights. With $200 billion in equity and $13 billion in debt, we are 93.9% equity and only 6.1% debt. Blending these together, we have 93.9% * 11.65% 65% plus 6.1% * 4.58%. And this gives us the current WACC of 11.22%. You can see these outputs here. The assignment asks us to evaluate a strategic shift issuing $3 billion in new debt. I modeled this scenario in the code which you can see here. By adding $3 billion to our debt load, our total debt rises to $16 billion. This shifts our capital weights slightly. Debt increases to 7.4% and equity decreases to 92.6%. The result because we are replacing a portion of our capital structure with cheaper debt at 4.58%. Rather than expect expensive equity at 11.6, 65%. Our overall WACC drops from 11.22% to 11.13%. This indeed confirms that optimizing our leverage creates value by lowering the hurdle rate for our investments. In the validate phase, we check our work against the market. Our calculated WACC of 11.2% 2% is higher than the IND industry average of 8 to 10%. It's significantly higher than Disney's WACC of 8.2%. Does this make sense? The answer is yes. Disney has a capital structure of 30% debt whereas Netflix only has 6 to 7% debt. Disney is a diversified conglomerate. Netflix is a pure play streamer with a higher beta 1.3. Our higher WACCC accurately reflects our higher risk profile and our decision to carry less debt. This indeed validates that the model is working correctly. Here again you can see the data of the Netflix WACC um the media industry range as we talked about the Disney WACCC and the Amazon ACC along with our analysis and conclusion that I just talked about. Moving to evolve, we apply these numbers to strategy. First of all, we have project specific risk. We cannot blindly apply 11.13% to every show. Established US content is lower risk and can be evaluated at a lower rate. However, new international markets are higher risk and may require a premium above 11.3%. And second, we have optimal capital structure. Comparing ourselves to Disney, who is 30% debt, Netflix is underleveraged. The data shows that every dollar of debt we add lowers our WACC. My recommendation here is that we have significant room to increase borrowing beyond just $3 billion. Issuance to further optimize our cost of capital. To repeat, my recommendation is that we have significant room to increase borrowing beyond just the $3 billion in insurance issuance to further optimize our cap cost of capital. To conclude, using the driver framework, we have arrived at a datadriven recommendation. the decision. We should approve the $3 billion debt issuance. It lowers our cost of capital from 11.22% to 11.12%. Second, the hurdle rate. For the $5 billion content investment to destroy no value, it must generate a return greater than 11.12%. And our validation, our analysis respects the tax advantages of debt and strictly adheres to market value principles. Thank you for your time.",
  "video_url": "https://youtu.be/2_WMiP2NFOg"
}