{
  "student_name": "Derek Seitz",
  "org_defined_id": "037482726",
  "username": "seitz23",
  "email": "",
  "transcript": "Hi, my name is Derek Sites and this is my session 10 homework assignment submission. And for define and discover, I'm deciding whether Starbucks should accept or reject the flagship roaster project. The project needs a 12 million upfront investment plus half a million in working capital and then runs for 10 years. And Starbucks's weighted average cost of capital is 8.5%. So that is my hurdle rate. So in plain English, my question is if Starbucks builds this roaster and the cash flows happen the way we expect, does the project earn more than 8.5% and create value for shareholders or should Starbucks walk away? So to answer that, I first needed to understand the pieces that drive cash flow, revenues by year, operating costs. So COGS, labor, rent and utilities, marketing, uh depreciation, taxes, the working capital, and the terminal value at the end. So I also needed to know how to use MPV, IRR, payback period, discount payback, and profitability index formulas to turn those cash flows into a yes or no decision. So to represent to represent the project we are going to or what my code will show is I will turn the Starbucks grocery store into a timeline of cash flows from year 0 to year 10. In year zero I'll have a big cash flow of $12.5 million. You'll see those are the two outflows that we brought up above. And once we run the code it'll show all of that in years 1 through 10. I plug in the given revenues, subtract the COGS, labor, rent, utilities, marketing, and include straight line depreciation, and I use the class formula for operating cash flow. And this is the formula that we used in class while we worked on our exercises in class. And in year 10, we're going to add back the.5 or half million of working capital and the 3 million terminal value. So putting this together will give me free cash flow for each year. And those cash flows are what feed into MPV, IR, payback, discounted payback, and profitability index. So first set of codes asks me for all the inputs. I have all the defaults already put in. So, we can just press enter a bunch of times and it's going to slowly but surely have everything inputed from the assignments um givens. So, bear with me. Okay, code is complete. And after we scroll down here to the bottom, it gives us the project inputs. So these are all the inputs we just put in and now we have all of our results. So first the code asks me for inputs the the whack the tax rate revenues costs and etc. But fills in the assignment numbers as default. So I can just hit enter if I don't want to change anything as you saw. Then the script automatically builds the year 0 to 10 cash flow table, the revenue, the COGS, the OCF and free cash flows. And it calculates the key metrics which are the MPV which we can see down here is 3.023 million and the RR is 13.25%. And if you keep going back and forth, you'll see that they're all matched up. So we can also run a sensitivity test where uh we there's plus or minus to weighted average cast capital. So or cost of capital. So with this MPV being our base we do the minus 2% and the plus 2% and we can see that there is a difference in the amount of cash flows. So again finally in the end the script prints a short recommendation because MPV is positive and irr is above the weighted average cost of capital in the base state. It tells me that from a financial point of view I should accept the project while still thinking about strategy and risk. So to validate my model I used chat GBT as an extra math check. I made sure everything lined up, everything checked out. After I build the cash flow schedule and run the Python code, I pick one or two years. Uh for example, we'll take year two and year 10 and asked Chat GPT to recomputate those years step by step using the same assumptions, all of the stuff we were given above. And then I compared it to ChatGBTs or I compared my output to ChatGpts breakdown to my Python outputs. When the numbers line up, it reassures me that my formulas, logic, encoding are absolutely correct, and the MPV, IR, and payback results I'm reporting are trustworthy. So, Evolve seeing the base case and sensitivity results down here. Where are they at? One moment. Ah, here they are. Right here. uh something we could do is we could have richer scenarios. So right now I mainly look at just the base case and the revenue uh going down 20% and the plus or minus uh 2% weighted average cost of capital. In the future what we could do is we can test or we could build a best case best case and worst case scenario that change multiple assumptions at once. So for example, revenue margins and marketing spend to see a full range of MPVS and IRRs. So we could also do a break even analysis since the project's MPV is 3.023 OT3 million at the base case as we can see right here. Uh and has the and at the base case the there's minus 2.753 million when revenues fall 20%. Which is as we can see right here with that sensitivity. So, I'd like to extend the code to find exact revenue levels where MPV can equal zero. That would tell Starbucks how much demand they need to break even on a value basis. We can also try risk analysis. The sensitivity results show the project is somewhat fragile to revenue drops. As we can see in this section, a step would be to add a simple Monte Carlo simulation. um randomly vary revenues and maybe operating costs and look at the distribution of MPVS that would give management a better feel for the profitability of losing money versus creating value. Uh we can also do clearer interface. Finally, I could wrap the code up in functions and maybe connect it to Google Sheets. Um again, this is all just jargon I thought up towards the end. Um a little bit unimportant. So reflecting on this project, working through this project taught me that capital budgeting is about telling a clear story and numbers then testing that story. So by building the Python model myself, I saw how each assumption like revenue levels, cost percentages, and the 8.5% weighted average cost of capital flows into cash flow schedule and then into NPV and IRR. The base case results with NPV at around 3.023 023 million and the IRR at 13.25% tell me that under the assignments assumptions the roaster looks financially attractive. At the same time though the revenue down scenario where MPV falls to minus2.753 million and IR drops to 3.88% reminded me that good projects on paper can quickly turn bad if demand is weaker than expected. So in the end overall this driver process helped me slow down, structure my thinking and move from just trust the calculator to really understanding how and why the Starbucks investment creates or fails to create shareholder value. And with that, that is my session 10 homework assignment submission.",
  "video_url": "https://www.youtube.com/watch?v=ypTjjK3IejU"
}