{
  "student_name": "Andrew Kuper",
  "org_defined_id": "036275825",
  "username": "kuper",
  "video_url": "https://youtu.be/KdxmF0oSMgk",
  "transcript": "0:00 Hello guys, and today I'm going to be talking about Apple's hypothetical, uhm, 90 billion dollar repurchase, and I'm going to be evaluating it using Driver, so.\n0:12 Pretty much, I need to evaluate their hypothetical 90 billion dollars repurchase, and I pretty much am acting as a independent analyst who must determine whether the buyback creates value relative to alternative uses of cash while balancing stakeholder incentives.\n0:32 Some of the information I'll talk about that in a second. So for my defined stage, I need to figure out if Apple's hypothetical 90 billion.\n0:40 million dollar share repurchase creates value relative to alternate uses of cash while balancing stakeholder incentives. So pretty much starts at $165,000.\n0:52 $165,000,000,000 cash and investments, $100,000,000,000 annual cash free or free cash flow, whoops. $185 share price, the P-E ratio is 30, the dividend yield is 0.5%, and the shares outstanding The balance sheet is pretty much $110 billion in debt.\n1:18 Berkshire owns 6% of the company, the CEO owns holds $3 million in shares, retail investors average $100 shares, employees have $170 strike options.\n1:31 So the proposal is $90 million buyback executed over one year, around 10% of the market cap. Some of the alternatives are a $60 million percent, or that we need to know, or the $6 dividend, strategic AI, VR, accusation, acquisition, debt reduction, incremental, R&D, and I need to deliver a recommendation\n1:56 that explains stakeholder impact, agency considerations, and value versus creation, value creation versus value transfer outcomes. So, how am I going to represent this?\n2:09 I'm going to need to calculate earnings per share and return on investment capital, EPS, ROIC. I am going to show the $9 billion buyback on shares.\n2:21 I'm going to show the calculations of shares are repurchased, shares outstanding, new earnings per share. I'm going to show the impact on stakeholders.\n2:31 So, how I implemented this is, I had Collab, and I created a code. So, this is the code, and I, when you run it, it creates a graph.\n2:44 It creates a table and a graph, pretty much, of the earning per share, the D-E ratio, and the W-A-A-C of 8 percent.\n2:52 And it gives you all the, uhm, all the stats that you need for everything, debt, new, E-P-S new, E-P-S changed, R-O-I signal, D-E ratio, B-H ownership new, C-E-O ownership new, P-P-M, And then it gives you a graph the E-P-S impact and value creation of $90 billion dollar capital allocation alternatives\n3:19 , which shows that earnings per share changes in percentage, which the acquisition is based 7% the debt reduction is 4% 3% for the buyback and the dividends and incremental are incremental Incremental RND is 0% and it pretty much shows everything that you need to know to, uhm, figure out this, the answer\n3:45 to this question. If it is worth it. So pretty much the stakeholders outcome under the buyback is what I'm going to be talking about first.\n3:54 So the retail stakeholders are shown by the increase in earnings per share of 3.24%. And the 3.24% is right here.\n4:06 And it also, it just shows the buyback, EPS change. And it's also right here, EPS change, 3.24%. And then the retail stakeholders are shown by the increase in earnings.\n4:20 Or sorry, that's what I just said. The model shows an increase in PPM from 193 to 199.8. It shows right here, the ownership, 193 to 199.8.\n4:31 That pretty much shows that the CEO has more risk in the company now because of this new, uh, $90 billion, uh, hypothetically, uh, And then the value creation has shown that the cash, return on cash is 3.21%, meaning that cash is being destroyed rather than being created, which is not good for the company\n4:56 . So the 3.21%... 3.21% is right here, ROIC signal, pretty much just shows that it's not going up and staying low for the buyback and the dividend.\n5:06 Uhm, the accusation creates value because it creates some value for the company because its return is 10%, which is greater than the firm's current cost of 8.06%, I believe, the WAC, and it shows 10% here for the acquisition, meaning that the acquisition is ideally the best strategy.\n5:30 So some of the signaling effects that were there is that the buyback signal shows maturity, pretty much meaning there's low innovation in the company.\n5:38 Pretty much the buyback's not really growing at all, which is showing that there's not much innovation in Apple anymore. Pretty much the best the same old stuff comes out, basic like iPhones and stuff.\n5:50 The acquisition signal shows growth because it returns more than 8.6%, 8.06%. It returns 10%. So, to validate this, the acquisition of 10% ROISC passed a value test because it exceeded the WAAC and the buyback failed.\n6:10 The buyback failed because it really didn't grow. I'm pretty sure it even lost a couple percentage points. Point, like, it's decimal places, but it lost a little bit.\n6:19 So, pretty much, that validated it because the acquisition should have been higher and that passed the test. The acquisition, and it means, like, everything is balanced in the company.\n6:30 Acquisition earnings per share is higher than the buyback, meaning that net income is not just the share amount. So, if there's less shares, it doesn't mean that the acquisition will have more earnings or other way around.\n6:42 It's just based on the buyback. The earnings per share is higher than the buyback by a significant amount, meaning that it is validated because of that.\n6:50 The acquisition was around 10%, and the buyback was 3, or no, sorry, the acquisition was like 7.2%, and the buyback was like 3.24%.\n6:58 And that's a significant increase meaning that it does validate that part. And then the CEO's ownership needs to increase for this because, are they?\n7:10 The PPM at least needs to increase because if it doesn't increase, it shows that the CEO never, uh, got any more risk, which they should have easily gotten more risk in the company.\n7:19 If they're going to have this $90 billion reap or share repurchase hypothetical. So. To evolve from this situation or scenario, the acquisition is the best choice because the buyback is a bad option.\n7:35 This because the acquisition outperformed the buyback in this scenario, pretty much the acquisition increased, meaning. Higher return on the company rather than the buyback because the buyback didn't even increase.\n7:49 I'm pretty sure it decreased, meaning, yeah, it decreased, which means that. They're losing money and destroying money. That's how it evolved.\n7:58 So how I would recommend, so I would advise against the proposed $90 billion share repurchase because the strategy that provides the most.\n8:06 The most valuable is the acquisition. The acquisition gave him 7.15% growth in earnings per share 7.15 earnings per share growth.\n8:14 And then this only happened once. At 3.24, which is not as high as a 7.15, which you would rather choose the higher growth in earnings per share rather than the lower.8:28 So this would lead into long-term growth. And that is my session 11 assignment of evaluating Apple's $90 billion share repurchase using the driver framework."
}