{
  "student_name": "Michael Powell",
  "org_defined_id": "037117204",
  "username": "powel281",
  "email": "",
  "transcript": "So this is my session 9 project for the week and um we're working on the cost of capital analysis and the assignment overview is to calculate the weighted average cost of capital uh for Netflix in connection with the hypothetical 5 billion content investment decision. Your analysis must determine current uh WACC, evaluate the impact of additional debt financing, assess project specific versus firmwide discount rates, and compare Netflix's cost of capital to industry peers. So, we have a lot of uh parameters uh marketing conditions and strategic context and I don't want to uh I'll get through that and it'll make more sense as I go through the video rather than just kind of resetting them several times. Um and then obviously uh I'll definitely state the required analysis which is to calculate the Netflix's current WACC determine WACC after 3 billion debt issuance evaluate project specific WACC compare Netflix's weight WACC to Disney and explain differences uh and thus recommend optimal uh capital structure strategy. So that is when I will uh kind of I started off with Gemini just saying what I'm working on and just give a little background of uh what to look for and it started kind of help me with the driver framework. But um yeah so uh that's the beginning um but yeah starting off with the driver framework for define and discover our problem and goal. Um again our problem is that Netflix faces a critical uh decision regarding a hypothetical 5 billion content investment and determine if this investment will create a shareholder value. Netflix must compare the expected returns of the project against its cost of capital. However, the company's cost of capital is not static. It is influenced by capital structure. Management is specifically considering raising three billion in debt, new debt to fund a portion of this investment which will alter the company's financial leverage and risk profile. And our overall goal with this is to perform a comprehensive cost of capital analysis to validate the financial vis uh viability of the 5 billion investment and the new proposed 3 billion debt issuance. And uh within this we'll must deliver the following outputs of current baseline which is calculating WACC for Netflix scenario analysis which is determining the new WACC uh which includes the 3 billion uh debt issuance and then risk adjustments whether uh firmwide WACC is appropriate for all projects or specific project beta adjustments are needed for international versus domestic content benchmarking. uh it's comparing Netflix's cost of capital to its closest competitor Disney uh to understand its strategic imp implications of their different capital structures um and then go on with the final recommendation kind of advising on the optimal capital structure strategy and whether that uh debt issuance is uh making a financial sense. So that is where we kind of get into the represent part where we get into the actual nitty-gritty of it and that is to create framework showing uh weighted average uh uh calculation methodology and based on the Netflix parameters uh I had a had uh Gemini kind of helped me create the um uh the model for me and that is starting with the capital structure analysis with the equity component which we have the equity uh market value at 200 billion. And that's where we're able to solve for cost of equity, which is the 4.5% plus the 1.3 uh billion time 5.5% to get 11.65%. And then we move on to debt component uh with market value of that 13 billion uh dollars with an after tax cost of 5.8% times the 1 - 0.21 to give us that 4.58%. And then we would take our total capital value which is the 200 billion plus that 13 billion which we were both used in equity component and debt component um for $213 billion. And that is where we get to the weighted average uh calculation of equity weight 200 billion divided by 213 billion equals 93.9%. uh which we can also solve the debt weight which is 13 billion by 213 billion equals 6.1%. So our current WACC result uh before the 3 billion debt issuance is 11.22% um and that's how we got uh by 93.9%* 11.65% and then adding the 6.1% time the 4.58%. And those are the uh we got those numbers from doing the um from the capital structure analysis with the equity component, debt component, total capital value uh and the WACC calculation and again that got got us 11.22% 22% 43 billion issuance there's 11.13 after and uh the calculation for that um let me find um the calculation for the after um is right here uh where there's 92.6% * 11.65% plus 7.4% 4% * 4.58% = 11.13 and you can see the new what uh where we see that is in the new WACC calculation we have new equity weight uh instead of 213 billion is 216 and the new debt weight uh we get a 7.4% rather when it was a 6.1%. And the result in this is the WACCC decreases by nine basis points uh due to the increased weight of cheaper debt financing. Um and I put this all into my code uh kind of to help me calculate that too. Uh kind of had to start off with the driver method. I put in all that information. And this is right here made it very simple calculating that total capital uh where we had again those numbers I just went through in the uh document I have to calculate the weights the components the tax and overall that calculated uh the WACC and it gave us a return. Um and then this is where I also had to implement the new uh debt issuance of the three uh billion dollars. Um, and that kind of helped us figure out the difference between it, which was uh the 11.22 versus 11.13. And the code just uh was able to break that down for me. Um, but yeah, I'll just make sure it works. Uh, that works. And I'll kind of get further into our code in a bit. But yeah, using the code, um, I was able to make kind of the conclusion that, uh, the WACC does decrease by nine basis points due to the increased weight of cheaper debt financing. And now this is where we get to the implement part uh the corporate WACC analysis. So step one is the WACC calculation model the uh market value of capital components uh capital structure weights component cost and WACC output. Um so I kind of had uh chat GBT kind of help me with this one. And um this is kind of like what I kind of went over with my code the WACC calculation model. That's where I had that up here. um kind of had this is this just has the variables in it. Uh while I had the numbers uh more organized on my document um and I kind of have that all throughout the uh market value, capital structure, component cost, WACC output where it'll just show the valuable uh variables um that we're using that and we get to step two which is project evaluation capital budgeting tool. uh decision rule is to accept uh the project if the return on investment capital uh is greater than the hurdle rate um in scenario one would be domestic content which is lower risk and low context as an established market uh more predictable cash flows with a hurdle rate of 11.13% um decision is if the 5 billion investment is purely domestic uh use 11.13 as the discount rate uh scenario two would be international content which would be a higher risk uh context behind that is currency risk uh regulatory uncertainty. Um the adjustment would be maybe add 2% risk premium uh which would hypothetical standard for emerging markets and that's where you get to a hurdle rate of the 13.13% by adding that 2% to the previous 11.13%. Um and that's where we get to competitive benchmarking with Netflix. Um a weight WACCC of 11.13 uh the higher cost of capital due to heavy reliance on equity of 92.6% which is much more expensive than the debt. Um and then with Disney's uh 8.2 two uh weighted average percent uh lower cost of capital due to significant use of debt 30% accum shield and lower cost of borrowing. Um and our overall uh for the implement our question is does this demonstrate proper application of cost of capital to uh capital budgeting and yes this is a strong applications for a couple reasons. uh first would be market based inputs. You uh correctly use market value of debt of 13 billion rather than the book value of 14 billion which is critical for accurate cost of capital calculation. Then we get move on to marginal cost of capital by uh calculating the post issuance um of the weighted average. Uh you are correctly looking at the marginal cost of the new funds but not just the historical average. Um this is where we get to now the validate part uh verifying that our calculations were correct and comparing them to uh Netflix Disney um um from pre-issuance to postissuance. So I kind of made a chart um with a low benchmarking kind of comparing our weighted average cost against uh the industry. So I had Netflix calculated and Disney benchmarked. As you can see, Netflix is a higher weighted average uh cable cost um percentage and the industry ranges about uh 8 to 10% within that industry and has a high status. Um and as we get to the debt rate, which uh Disney has a significantly a lot more, 30% while Netflix is at sitting at 7.4%. Uh it's kind of a low status. And lastly, you get to your beta, which is your risk. Uh Disney's was uh I couldn't uh was that wasn't provided with us but Netflix was a 1.3 but yeah Disney is about a 1.0 um they do pretty well um in their industry range um for Netflix or Disney is about8 to 1.2 too which is uh a high status and kind of our observation with that is Netflix is above the industry range um and this is reasonable Netflix is a pure playing uh streaming growth stock uh with very little debt compared to Disney uh where they have 30% in uh debt. Disney benefits from a subsidy of cheap debt in a lower risk profile uh diverse for the parks and linear TV. Therefore, Netflix should have a higher hurdle rate than Disney. Um, and then you get your market value accuracy. The proc stock price of $450. Um, at a 200 billion market cap, this implies roughly 444 million shares are outstanding. Uh, with a bond yield at 5.8%. Uh, you get your beta stability. Uh, that is your forward look your risk. So your current beta we have again at Netflix is 1.3 which reflects high sensitivity to market vol uh volatility um and you get your stability check um with the 5 billion investment does succeed Netflix stabilizes its content library potentially lowering uh volatility uh however if we do use a lower target beta for example I guess like 1.1 uh we risk underestimate the cost of capital and kind of in conclusion is sticking with 1.3 for the investment decision. It uh would be to be conservative and it is just a better uh it is just better to reject a marginal project than accepting a a value destroying one. Um and that is where we kind of get into uh back into the code. Uh the valid verifying uh this kind of just verified our data again. Just making sure um that the data was correct. But if I go below I can show uh yeah this was verifying uh kind of helped me make that graph. Um the debt kind of these two kind of were helping together. But uh the Netflix 11.13 um and then Disney had 8.2 WACCC and Netflix is higher due to lower leverage. Um and that's kind of how I was able to use this part into making my analysis uh and to use that graph and kind of giving that analysis on why Netflix has a higher uh WACCC but a much lower date wet than Disney. Um and so that is where we get into the evolve part the applications uh identifying WACC applications beyond basic project evaluation. So as we get into the final phase uh soon uh we kind of move calculations to the strategy part. We evolve the analysis from simply finding the number 11.13% uh to using it to drive corporate value. And here's the strategic get the strategic application of the WACCC analysis for Netflix. So that's your cost of capital establishing that hurdle rate. Uh the WACCC serves as the floor for the return on investment. It protects your shareholder value by ensuring management does not pursue growth for growth's sake. Um so you have uh domestic projects and your international projects. Um and your decision would be if the hypothetical 5 billion investment is predicted to return only 10% it must be rejected as it would technically destroy uh shareholder value uh despite it's still generating profit. Then you get your capital budgeting uh discount rate for the NPV value and the WCC is the denominator uh in the net present value formula determining the present value of future cash flows. Um I'll be able to show that in my trying to find it. Um that yeah tracker that PV equals the summation of uh time over the uh cash flows um from that time um over that denominator which is the WACC which I just talked about right there. You get the capital structure which is optimizing the financing mix. While the WACCC is not fixed, it is still a function of weight vert of debt versus equity and we do use it to find the optimal capital structure and this mix that optim minimizes WCC uh and maximizes firm value. So uh uh recommendation VR sensitivity analysis showed that matching Disney's 30% debt ratio would lower uh WACC to about 9.5%. Um then we kind of move on to valuation of our enterprise value maximization and the application of this is that the WACC is the primary driver in the discounted cash flow valuation models uh strategic insight even a small reduction in WACC has a small multiplier effect on the stock price. Um, and kind of in conclusion that is that optimizing the capital structure could theoretically unlock about $15 billion in enterprise value without selling a single subs single extra subscription purely by uh like financial engineering. Um, let's see. And then when I get to my code, that's kind of where I had the uh that helped me find that out why the evolve part which is value at the WACCC of about 6.84 24 billion where the new would be about 61.53 and uh like the optimized where I was talking about the 9.5 uh would lower the 9 to lower back to 9.5 we'd look at about 76.92 billion. So you're looking at from your current to new to optimize you're looking at about 14 15 uh uh 15 actually 15 16,000 uh sorry 15 16 billion difference and yeah uh optimizing capital structure could unlock uh significant value and that is where we get into the reflect part um and just kind of extract principles of how companies should think about capital costs And in this final step of the driver framework, we step back from specific numbers and just go into what we've learned and how can we apply this moving forward. And based on Netflix analysis, there are four universal principles on regarding how companies should think about their capital cost. And I've got that right down here. Um, actually I have a little graph uh that kind of goes along with it showing the value of stock versus debt level. Um I'll kind of get into this uh more my code shows better but yeah so first one would be cost of capital is a competitive weapon um calculating the WACCC is not just a math problem but also us as a strategy um to use uh towards companies lower WACC does allow a company to undertake projects that competitors cannot justify like Netflix and Disney um a takeaway would be that companies should actively manage their capital structure to keep uh their WACC low, giving them more flexibility to flexibility to outinvest their rivals. And then uh lastly, you get market reality trumps accounting history. Uh investors demand returns based on the current market value of assets, not what the company paid for them previously years ago. And the evidence behind this is that in our calculation, we did use the market value of that of 13 billion rather than the book value of 14 billion. Um and furthermore, we calculated the weight of equity using the market cap of 200 billion and not that shareholder equity uh produced from the balance sheet. And that takeaway would be when making uh decisions uh looking for the future, always using the market based inputs. Um book values are historical facts, but market values do reflect real opportunity costs at the same time. Um so that is now where I've kind of gotten through all the driver framework. Um but yeah, this is a little graph it also showed too with the WACCC benchmarking showing this is Netflix before the three bill 3 billion in debt. Um this is where they are after it at 11.13 and it only went down about 009 and we see Disney is sitting at 8.2. Uh so Netflix um their 3 billion did not make a huge difference. Um but Disney is still in a clear shot uh doing better with the WACC. Um and then Capital Structure Revolution the current was a equity of 93.9 with a 6.1% debt while after issuing that $3 billion uh their debt went up to 7.4% while lowering their equity to 92.6%. Um and uh these these are still beneficial but not to our current scenario to where it would really make a big impact right now. But yeah uh thanks to Gemini and collab I was able to easily organize uh everything and make an analysis using this uh clearly to um present it to you guys. So, um yeah. Um this was I had a great time doing this project and yeah, I think that's it. All right. Thank you.",
  "video_url": "https://www.youtube.com/watch?v=KfhOdeUL31w"
}