{
  "student_name": "Alexandra Garland",
  "org_defined_id": "035848624",
  "username": "garlana",
  "email": "",
  "transcript": "Transcript Hello, my name is Alexandra and today I am presenting a comprehensive capital structure analysis for analysis for session 9. So I have utilized the driver framework to structure this analysis ensuring we move from a clear definition of the problem to a verified strategic recommendation. So, so the strategic situation is Netflix is currently having a hypothetical yet very realistic decision. They have a $5 billion content investment opportunity in the streaming wars. Content is king. If they don't invest, they lose subscribers to Disney Plus or Amazon Prime. And the financial decision is the core question isn't just should we spend this money, it is how should we pay for it? And option A is to use um equity, which is money from shareholders. And option B is to issue $3 billion in new debt. Um the objective is to make this decision, we must calculate Netflix's weighted average cost of capital, also known as WACCC. So think of the weighted average cost of capital as the rental cost of money. So if Netflix borrows money or uses shareholder money, they have to pay a return. If this $5 billion investment earns a return higher than that cost, we create value. If it earns less, we destroy that value. So my goal today, my goal today is to calculate that specific number, the hurdle rate, and determine if the debt issuance makes financial sense. So the first part of the driver method is the discover and refine stage which is the inputs. So in finance your output is only as good as your input. So I've gathered the necessary market data and Netflix's specific financials. So the market conditions are we are operating in a high rate environment. The risk-free rate which is based on the 10-year US Treasury is 4.5%. And this is the baseline return for zero risk. The market risk premium is 5.5% and this is the extra return investors demand for putting money into the stock market rather than a safe government bond. Um the next part is Netflix financials. So this is where many analysts make a mistake. The assignment provided a book value of debt at $14 billion. However, I have chosen to use the um market value of $13 billion. And I use this because book value is just a historical accounting number and it's what they borrowed years ago. Market value is what it would cost to buy back that debt today. So in WACC analysis, market value is king and that's what um I'll be using. And um the next is the risk profile, which is just beta. Um, we are using a beta of 1.3. Beta measures volatility and a beta of 1.0 means you move with the market. A beta of 1.3 means Netflix is 30% more volatile than the average company. And this makes sense because they are a tech and a media hybrid. So they um dependent on a hit shows. And this high risk means equity investors will demand a higher return. And then moving on to the identify as well as represent um of our myth me mythology in the driver framework. So I want to now break down the WACC formula into three understandable parts. So part one is um the cost of equity which is K. And since we can't just look up a price tag for equity, we use the CAPM model. So cost of equity equals risk-free rate plus um beta times market risk premium. And essentially we start with the safe rate of 4.5% and add a premium for Netflix's specific risk. And part two is cost of debt which is KD. And this is the interest rate that the bank charges. However, there is a catch to this. The tax shield. So the US tax code allows corporations to deduct interest payments from their taxable income and this is a government subsidy for debt. So even though the bond yield is 5.8% our real cost is 5.8% times 1 minus um 21% tax rate. And part three of this is the weight. So finally we want to weight these costs based on how much of the company is funded by debt versus equity. So currently Netflix is very very big um $200 billion in equity. Um so they are heavily weighted toward that expensive equity side. And so now moving to implementation. So I have built a Python model to handle this analysis. um using Python allows me to easily change those variables as well as um like variables like the tax rate or debt amount and instantly see the impact on shareholder value. So let me switch to my Google Collab that I created with the Python code. So step one is the input. So here you see um that I defined our variable our variable variables sorry um equity_MV equals 200.0 and debt_MV equals 13.0. This ensures that I'm using the correct market values we discussed earlier. Um step two is the WA scrolling down here the WACC engine and we have the um calculate um WACCC scenario um function and it created also a function called calculate WACCC scenario. So this is the engine of my analysis and I'll show that here. This is the calculate WACCC scenario. Um so first it calculates the weights which are WE and WD and it sums the debt and equity to get the total capital PI and then slices it. So next it calculates the CAPM for the cost of equity and then it calculates the after tax um cost of debt. So this line here, the cost of debt shown here, the cost of debt pre times 1 minus the tax rate, this right here, um, is mathematically applying that tax shield benefit that I mentioned. And then step three, scrolling down here. So um, step three is the scenarios I run. So I run this function twice and first for the um current state just the existing $13 billion in debt and then second for the future state. So I add the plus 3.0 to the debt variable to simulate the new bond issuance. And then scrolling down to the net present value section right here. So um step four is the time value of money. So finally I use the output WACC to value the project. So, I've modeled the cash flows um an outflow of $5 billion today, which negative, and then followed by positive inflows of $1.4 billion for 5 years. The code takes these future dollars and discounts them back to today's value using our new WACC. And this tells us the net present value. So scrolling to the output after running this code. So let's um move on to the verify stage of the driver. So verifying these results. Um so at the component the component analysis cost of equity is 11.65% 65% and it's high because of the um 1.3 beta and the after after tax cost of debt is 4.58%. Um and just an observation is debt is less than half the cost of equity and this is a massive spread. Um looking at the WACC comparison shown in step three right here um we see that the current WACC is about 11.22% 22% and the new WA WACC is 11.13%. And so the result is very clear here that issuing debt lowers our um WACCC and because we are swapping expensive 11% equity for cheap um 4.5% debt the overall average cost does come down and finally the time value of money decision. So the um project NPV is um 0.158 billion which is shown in this line here 0.158 billion and because this number is positive the code shown here um outputs a green light. So this investment creates shareholder value and it shows the green light here the project creates value and then scrolling to the graph the visualization that um I created um it's just important looking at this that we shouldn't just trust one number we need to work on our evolve um in the driver method. So um with our thinking of a sensitivity analysis and what if so I plotted Netflix's WACC against potential debt levels ranging from um $10 billion to hundred billion. And looking at this curve right here um the red line slopes downward. So this illustrates the concept of optimal capital structure. And currently Netflix is way over here on the left with low debt. Um but as we move to the right adding debt the WAC does drop as we see and um this confirms that Netflix is underleveraged. So just giving a strategic comparison um if we compare this to Disney's WACCC is 8.2% and why this is because they have about 30% debt in their capital structure and Netflix only has about 6%. So by acting more like Disney and taking on more debt, Netflix can lower its hurdle rate and make more projects profitable. So going back to my setup, sorry, we have our implement and the green light decision and then the verify and and evolve which we discussed. And now we're on to um the reflection. So to conclude, I just wanted to reflect on the why. So like my aha moment was going into this, I assumed that debt was just bad because of the association that I have with debt and equity was good or a safe. But my analysis proved the opposite. And because of the tax shield, that 21% government subsidy, debt is actually the most efficient way for Netflix to fund growth right now. So, I was surprised to see that adding that $3 billion in debt barely increased the risk profile, but successfully lowered the cost of capital. And just um an overall final recommendation is approve the $3 billion debt issuance. Um one and then two, adopt 11.13% as the hurler rate for this content investment. And then three, proceed with the investment as it generates a positive net present value which we saw from the output. And Netflix has the cash flow to handle the interest and the financial math that we did um confirms that this is the right move to build shareholder value. And thank you so much. That will be all.",
  "video_url": "https://youtu.be/VIapG8f2wDI"
}