{
  "student_name": "Juan Antonio Sevilla",
  "org_defined_id": "033541051",
  "username": "sevillaj",
  "email": "",
  "transcript": "Slide 1 – Title: \"Applying the DRIVER Method to Capital Budgeting\" \"Hi everyone, my name is Juan Antonio Sevilla. In this video, I'm going to walk through how I used the DRIVER method to analyze a simple capital budgeting problem. We learned this in class using more complex examples, but here I'm using a smaller, made-up project to show the ideas clearly. I'll explain what I learned, how I set up the example, and then I'll show you a short Python script in Google Colab that calculates the NPV. The goal is to see whether this investment creates value or not, and to show how DRIVER helps me think through the problem step by step.\" Slide 2 – \"What I Learned This Session\" \"In this session, we focused on how to take a full capital budgeting problem and break it into pieces. I learned how to identify all the cash flows of a project, starting with the initial investment and then the yearly cash flows the project generates. We also talked about how projects often have different phases, like the startup phase and the operating phase, and how cash flows can change over time. We used the firm's WACC as the discount rate, and we used NPV to check if the project creates value. NPV felt important because it doesn't just look at profits in one year; it looks at the whole stream of cash flows and adjusts them for time and risk. The DRIVER method helped a lot, because instead of jumping straight to formulas, it made me slow down, define the question, represent the cash flows, and then implement the math in a structured way.\" ⭐ Slide 3 – \"D: Define the Problem – BrightScooters Example\" \"To practice, I created a simple example called BrightScooters. The question I want to answer is: Should BrightScooters invest in a new e-scooter station? The project requires an upfront investment of fifty thousand dollars. After that, the company expects to earn cash flows of eighteen thousand dollars in year one, twenty thousand in year two, and twenty-two thousand in year three. From class, I know I need to use the company's WACC to discount those cash flows. For this example, I assume a WACC of eight percent. So the defined problem is: using an eight percent WACC, does this project have a positive NPV, and therefore create value for BrightScooters?\" Slide 4 – \"R + I: Represent and Implement in Python\" \"Next, I move to the Represent and Implement steps. To represent the problem, I start by writing down a simple timeline: at time zero, there is a cash outflow of fifty thousand dollars. Then at the end of year one, there is an inflow of eighteen thousand, at the end of year two, twenty thousand, and at the end of year three, twenty-two thousand. In code, I represent this with one number for the initial investment and a list for the yearly cash flows. Here on the screen, you can see my Python script in Google Colab. I set the initial investment to negative fifty thousand, the cash flows to a list with eighteen thousand, twenty thousand, and twenty-two thousand, and the WACC to zero point zero eight. Then I wrote a small function called compute_npv that loops through each cash flow, discounts it by the right power of one plus the rate, and adds everything together with the initial investment. Finally, I call the function and print the base-case NPV. This is the Implement step, where the math actually happens and the numbers come out of the model.\" Slide 5 – \"V + E: Validate and Evolve the Analysis\" \"Now I move to Validate and Evolve. First, I validate the result by looking at the NPV that the code prints. If the NPV is positive, it means the project creates value and is worth considering. If the NPV is negative, it suggests the project destroys value and should probably be rejected. In my script, after the base case, I also added a simple sensitivity check. I calculate the NPV again using three different WACC values: six percent, eight percent, and ten percent. This lets me see how sensitive the project is to the discount rate. You can see the printed results here: for each WACC, the script shows a different NPV. As the WACC goes up, the NPV gets smaller, which matches what we learned in class about discount rates. For the Evolve step, I go one step further and imagine that the cash flows are ten percent higher than expected. The code calculates the NPV with these higher cash flows at the same eight percent WACC. This helps me see how changes in assumptions—like better performance—can turn a borderline project into a clearly good one. So Validate is about checking whether the result makes sense, and Evolve is about asking: 'What if things change?' and updating the analysis.\" Slide 6 – \"Reflection: What This Taught Me\" \"Finally, I want to reflect on what this process taught me. Before this session, capital budgeting and NPV felt kind of abstract. I knew the formula, but I didn't really feel comfortable using it in a real example. By applying the DRIVER method, the problem felt much more manageable. Defining the question clearly, representing the cash flows, and then implementing the analysis in Python helped me see each step logically. Seeing the NPV printed out for different WACC values and different cash flow scenarios also helped me understand how sensitive investment decisions are to assumptions. It made me realize that good analysis is not only about getting one number, but also about understanding how and why that number could change. Overall, this exercise made me feel more confident using capital budgeting tools, and it showed me how I can combine finance concepts with simple coding to make clearer, more structured decisions. Thank you for listening.\"",
  "video_url": "https://youtu.be/wcu15pF5YL8"
}