{
  "student_name": "Alexandra Garland",
  "org_defined_id": "035848624",
  "username": "garlana",
  "email": "",
  "transcript": "Hello, my name is Alexandra Garland and I'm going to pre be presenting the final capital budgeting appraisal for the Starbucks roastery flagship. Our objective is to rigorously test this investment against the firm's required rate of return, our 8.5% WACC. Our analysis is structured you strictly around the six steps of the driver framework. We begin with section one define and discover. The definition phase established the project scope a 10-year project life and a total initial outflow of $12.5 million. This is the initial initial capital requirement that we must justify. In section two represent, we translate these parameters into the financial model structure and we have detailed the key inputs that Python script uses. So under financial parameters, note that the $12 million capex and $500,000 NWC, which defines our initial cash flow. We are also employing the straight line depreciation method, resulting in a consistent annual depreciation of $1.2 million. Under operating and revenue assumptions, we defined um variable cost at 30% of revenue and fixed cost at $2.5 million annually. And these parameters create the full incremental cash flow model that the script runs that I'll show later. Moving on to our implement stage. Um this is where our Python financial model executes the calculations. So going into the code um that I use with Python as well as Google Collab. So the script's core implementation logic is in the primary cash flow function um named calculate_ICF. And this function takes the revenue data and all financial parameters as inputs. Its key role is calculating the operating cash flow or OCF. Um and OCF equals revenue minus cost minus depreciation um times the one minus the tax rate. And um this is then we add on depreciation at the end. And the implementation ensures the annual $1.2 $.2 million. Um, depreciation reduces taxable income first, lowering our tax liability before the cash is added back. And this forms the correct time value of money input stream. Um, so when discussing like our implementation, um, I wanted to while discussing this implementation, I wanted to, um, go to the Python console output that shows the 10-year cash flow array. um to illustrate the results of the calculate ICF function that we had. So here we have sorry let me scroll. So at the bottom here, the beginning is just showing our variables and everything. But here we have um the capital budgeting analysis which here shows the core holder rate, core hurdle rate, the total initial cash outflow and then the analytical method. And this is just showing um the implement and validate section which is calculating base cash flows and um metrics as well. So um this is our um cash flow array as well shown here. And then um so moving on to the section for validate. This confirms the um base case decision using the calculated ICF stream. And so our validation relies on um two distinct functions which is the calculate MPV which is shown up here in the actual code which I will show momentarily. We have these and then also the calculate irr or calculate IRR and the calculate MPV function takes the 10-year ICF stream and the 8.5% WACC to determine the exact dollar value the project adds to the firm. And then the calculate irr um function computes the discount rate at which the MPV equals zero um which we then compare to our 8.5% hurdle rate. And so then we have our results which are shown at the bottom after we ran the code um in the table 4.1 basease TVM um metrics. Oh, sorry. And we have those shown here and here. And then um these shown in the base case TV metrics clearly validate the model. The MPV is highly positive at 3 million um 22,514.85 which is shown right here. And um the internal rate of return is 13.25% which is significantly above our 8.5% hurdle rate. And the base case is sound which leads to an initial accept decision. So um looking here we also um well first let me go back to our evolve section. So we now p um go on to the evolve section. So our critical what if analysis this is what we're doing here. So we must stress test this $3 million NPV against potential risk. So this analysis is executed by a dedicated um run sensitivity function which is shown in our Python code shown up here and the run sensitivity shown here and here. And um run this run sensitivity function systematically loops through varying revenue multipliers like 1.00x 00x and 0.80x. In each iteration, it calls the calculate_f and calculate npv functions again with a new assumption compiling the final output table and the um majority vulnerability was exposed by the resitative sens sensitivity test. So going down here to show the calculation or the results of these functions, we have the sensitivity analysis as well as the um graph shown here for revenue sensitivity. Um and the major vulnerability was exposed by the revenue sensitivity test. And looking closely at the downside scenario, revenue times 80 in the table um shown up here. And then the um this test delivers our overall moment where um that like our aha moment that made sense in u my brain. So a mere 20% decline in projected revenue flips the NPV function from positive $3 million to a negative um $3,157,292.30 and the IRR collapses to 3.19%. And this is the project's critical breaking point. And it really de demonstrates an extremely low margin of safety against execution risk, which I didn't realize before that this would cause that much of a um um difference. And then um shown here we have just the MPV and IR sensitivity due to revenue reduction. and then also performed a WACCC sensitivity. Um just showing the MPV sensitivity to WACCC changes which we have here um example 6.5% 8.5% 10.5% WACCC's and then the um resulting NPVs net present values as well and this just shows this graph here um and then going to our um back to our reflect and recommend. So finally um for our reflect section we synthesize the validated metrics and the risk assessment. So um the base case is financially excellent but the sensitivity analysis shows a critical execution risk. Therefore, our final recommendation is acceptable, but it's also conditional and acceptance is granted only if management can demonstrate high confidence in achieving and protecting those base case revenue forecast. And without that commitment to risk mitigation, the project must be rejected because that's important to consider. Um, this structured approach using the driver method allows us to make a fully informed and cautious investment decision based off of the Starbucks case. And um although again I wanted to highlight that I recommend um to accept it needs to be conditional on management's ability to confidently achieve and protect the base case revenue forecast. And that would be all. Thank you so much.",
  "video_url": "https://youtu.be/NS22XOl2ZEE"
}