{
  "student_name": "Michael Gjorseski",
  "org_defined_id": "036015839",
  "username": "mgjorses",
  "video_url": "https://app.screencastify.com/watch/ElyGCIBIVyWKHfNlPyNU?checkOrg=6f011b1b-d4b6-4119-b7c9-d036b6594800",
  "transcript": "Hi there. So, this is my session 11\nassignment. So, just to kind of go over\nwhat we have uh for the assignment,\nwe're going to evaluate uh Apple's\nhypothetical 90 billion share repurchase\nusing driver method. Act as an\nindependent analyst who must determine\nwhether the buyback creates value uh\nrelative to alternative uses for cash\nwhile balancing stockholder incentives.\nSo the allocation snapshot is the\nliquidity\nsorry the liquidity that we have is 165\nbillion in cash investments we have $100\nbillion annually free cash flow uh the\ncontext of the market is the share price\nis 185 um uh the dividend yield is 0.5%\nthe shares outstanding are 15.5 billion\nthe balance sheet we have 110 billion in\ndebt Bergkshire owns 6% % the CEO owns\nholds $3 million in shares. The retail\nuh retail investors average 100 shares.\nEmployees have $170 in stock options.\nOur proposal is that uh we want a $90\nbillion buyback executive over uh one\nyear. And the alternatives that we have\nis a $6 special dividend and um a\nstrategic acquisition uh debt reduction\nand incremental R&D.\nSo that's what I that's just our\ninstruction overview. and I put it into\nGoogle Gemini uh and AI to help us. And\nthis is kind of what it gave me to look\ninto it deeper, which is pretty much\nabout the same. We have the same\nliquidity rate, the same um $1 billion\nuh free cash flow. The stock trades at\n30 times uh P over E to $185 uh share.\nUm, pretty much everything's the same\nexcept for our core question is is the\nbuying back stock at an earning of\nearning yield of 3.3%\na prudent allocation of capital compared\nto the 5% risk-free rate or the 15% R&D\nhurdle rate and the stockholder agencies\nthat we have are the CEO the one who\nholds $3 million um the high incentive\nfor buyback the EDPs the earning per\nshare accretion which means that the\nearning per share goes up drives bonuses\nthe dividends hurt option strike prices.\nShareholders are the tax deferral\npreference. They want to buy it back. Um\nor the income preference, the dividends.\nUm the bond holders, the risk of average\nuh leverage is low for Apple, but that's\ntheir biggest um interest. So yeah,\nmoving on from there after we have uh\nwhat we're going to do for the rest of\nthe video is our analytical plan, our\nmodel. We can construct a Python script\nwhich I did and I'll show uh throwing\nshowing the three scenarios. the\nbuyback, the special dividend, the debt\npayown, which I have, and then they're\ncalculating the earning per share\naccretion, the net debt, um or the\nearning earning before interest, uh\nsorry, earning before interest, taxes,\ndepreciation, and um\ncan't think of the last one. It's right\non my tip of my tongue. Uh\nI can't think of it. Uh which is the\nleverage, sorry. and the ROIC impact um\nthe return on investment invested\ncapital um and then the map which we'll\nshow at the end comparing the buyback\nyield versus the cost of capital so\nthat's our represent and then this is\nour implement which I will show the code\nfor that so originally when I put when I\nput in my output it kind of gave me um\njust this which was just kind of\ndefining the calculating impact defining\nthe net income which is the share price\ndivided by the current price um times\nthe current shares. Um the current uh\nearning per share the is equal to the\nnet income divided by the current\nshares. So that's that's how you solve\nfor that. And the shares repurchase\nequals the cash used divided by the\nshare price. New share account equals\ncurrent shares minus shares repurchased.\nUm lost interest of income equals cash\nused times interest rate of cash of 1\nminus the tax rate. So there's just kind\nof a lot of things that are in here. The\num\num new earning per share uh the\naccretion is in here and the um\ndividends per share dividend scenario is\ncash used divided by current share new\nprice dividend share share price minus\nthe dividend per share. Um, yeah. So,\nthere's just a lot of stuff in here. And\nthen it kind of just returns the\nbaseline earning per share, the buyback\nearning per share, the earning per share\naccretion, which means that it went down\n6%, which actually means that it\ndiluted. And then the shares retired,\nand the dividends per share, which was\n5.81%. Then I went in and made sure that\nit had all my um financial requirements,\nall my technical requirements. after\ngiving me that and it gave me a\ncompletely new um code which puts in all\nthe inputs of the share price shares out\nthe E to the 9 just is showing the\nbillions instead of just having a B\nbecause that's not how um collab works.\nUm so this is actually like the 15.5\nbillion 165 billion 110 billion. Um so\nyeah that's all this the baseline is the\nsame net income um earning per share\ncurrency the uh EVITDA\nproxy\nthat's just to use again that's for\nleverage to use again later the ROIC\ncurrent equals net income the leverage\ncurrent is um is the same as the net\ndebt it's a net debt current divided by\nthe EVAT EBIT TDA proxy and the ROIC\ncurrent is the net income divided by the\ncurrent plus the share shares times 10\nand then it shows all the shares. It\nshows the total dividend prices. It\nshows a lot of stuff on here and the\ndebt paid. Just kind of a more increased\nversion of what's above and just more in\ndepth. And then when that prints, it\nshows the scenarios that we talked about\nbefore. Three. So the buyback means the\nuh scenario means that the earning per\nshare would be $6.15.\nUm the earning per share change is zero.\nDoesn't change at all. The net leverage\nis 28. And this means that the CEO wins.\nThey said the opposite protects it. So,\nand is protected. So, for everyone\nthat's in this, the CEO has the best\noutcome of this. Uh, the special\ndividend has an earning per share of\n5.95. It has a um dilution of 3% and net\nleverage of.3, which means that the\nretailer wins the cash and then the CEO\nloses in this because it's a price drop\nfrom 16.5 to 15 or 5.95. And then the\ndebt payown is the uh E EPS is a six\n$6.19 or the 6.19. The change is zero.\nNet leverage is actually negative in\nthis one showing that the bond holders\nwin in this situation and the\nshareholders are just kind of neutral.\nSo yeah, so that's my code and that's my\ntwo versions of my code which also show\na little bit of evolution. And then um\nmy validation stage just to kind of show\nthe value created versus the value\ntransfer where we have um the buying the\nstock back at the 30 times shows the\nearnings of 3.3%.\nOur benchmark is the earning of 4.5\npre-tax 4 5% pre-tax. Um the verdict is\nthe buyback is uh diluted to intrinsic\nintrinsic returns. uh we're trading an\nasset earning 4.5 the cash for the asset\nearning of 3.3 Apple stocks. Um this\ncreates accounting value by reducing the\ndenominator but it doesn't um improve\nthe ROIC.\nAnd then this is just our um sorry I\ndon't know why it's not showing at the\nbottom. Um our agency or government\ncheck the CEO incentives. If Apple pays\na $6 dividend the price drops which I'll\nshow this part. the agency and\ngovernment check again later at the end\nchose the price will drop. Um the CEO\nholding $3 million in option uh sees the\nin money value or in the money value.\nThey have the options they see their\nmoney. Um this they this money drops\nthough as the strike of 170 and the\nbuyback result supports the price of 185\num $185 per share and the leverage\nsafety is the post buyback. The net\nleverage rises um to 28. Uh this is very\nlow as tech peers often run between one\nand two. And then the balance sheet says\nremains a fortress. And then I can go\nback here. Our evolve\num we're comparing the 90 $90 billion\nbuyback to the strategic acquisition\nalternative. The metric that we're\nlooking on is return on invested\ncapital. the buyback of 3.3% and the\nacquisition of or ROIC required to beat\nit says to beat the buyback in AIVR\nacquisition must yield greater than 3.3%\npost uh integration the risk adjustment\num\nfails 70% of the time the risk adjusted\nhurdle rate for M&A is likely 15%. uh\nwhile the buyback yield is low it is uh\nit is risk-f free and acquisition an\nacquisition is high risk in the absence\nof target with clear synergies the\nbuyback is the least bad option for the\ncapital discipline and then this is what\nI was talking about earlier our\nrecommendation here is to proceed with\nthe 90 $90 billion buyback and this is\nwhy this with the scenario showing the\nspecial dividend um the stock impact\nit drops by $6 um in comparison to the\n$90 million buyback which is supported\nuh and it's neutral and it supplies\nreduced not the dividend or the stock\nprice. The new share price if for uh\nscenario A is $179. The new stock price\nfor scenario B is 185. And then the CEO\nshares are valued at uh $537 million in\nscenario A and 555 million in scenario\nB. And the stock options are their\ninterest value are $9 per share in\noption A and $15 per share in option B.\nAnd the total valuation package is 27\nmillion in option A and 45 million in\noption B. And the CEO's personal loss is\nnegative 18 million in scenario A. And\nin scenario B, it's zero because they're\nnot losing any because this is the best\noption. So they're actually making\nmoney. So yeah, uh going through all\nthat, our recommendation um is to\nproceed with the $90 million buyback\nbecause overall it just gains more uh\nmakes more money on stock price and our\nnew share prices and our earning per\nshare increases our intrinsic value for\nthe CEO options that they have um go up\nand total package valuation that they\nhave and the personal loss is less in\nscenario B in the $9 million buyback\nthan it is in option A. So yeah, thank\nyou very much."
}