{
  "student_name": "Mauricio Echeverria",
  "org_defined_id": "036820322",
  "username": "echevem",
  "video_url": "https://youtu.be/Gm1JQM39tDM",
  "transcript": "Hi, this is Mauricio, and this is Session 11: Corporate Decisions and Incentives – Debt vs. Equity. In this session I'm using a Nike $3.2B expansion project to think like a CFO. Nike needs $3.2B to build a new manufacturing hub and must decide whether to finance it with equity, debt, or a mix. The big question is: How does this financing choice change the risk, returns, and incentives for shareholders, bondholders, and managers?\n\nD – Define / Discover\nAt first, the decision seems like a straightforward funding choice. But when applying DRIVER, the deeper issue becomes incentive design. Nike can issue equity, which dilutes ownership but avoids fixed payments, or use debt, which preserves control but adds interest obligations. A mix would split the trade-offs. The real question becomes: Who carries the downside risk and who benefits from the upside? Shareholders want high ROE, bondholders want safety and steady repayment, and managers want stability and targets they can realistically meet.\n\nR – Represent\nTo represent the problem, I focus on how financing affects outcomes even when the project itself doesn't change. More debt means higher leverage, which increases ROE in good times but makes losses hit harder in bad times. More equity lowers leverage and reduces the risk of distress but softens the potential upside. In simple terms: Debt = higher ROE + higher risk. Equity = lower ROE + more stability. This reflects the typical conflict where shareholders prefer more leverage, while bondholders favor safety.\n\nI – Implement\nIn the implementation stage, I compare two financing scenarios for Nike while keeping the project's operations constant. An all-equity structure provides a stable baseline for ROE, while introducing some debt raises ROE by shrinking the equity base—even though EBIT stays the same. This demonstrates that financing alone changes the return to equity holders, and the risks shift depending on the amount of leverage Nike chooses.\n\nV – Validate\nWhen validating the logic, the conclusions line up with finance theory: leverage amplifies returns and increases risk. This explains why shareholders push for more debt to raise ROE, while bondholders demand covenants or higher interest to protect themselves. The financing decision alters incentives even when the operations don't change.\n\nE / R – Evolve & ReflectTo evolve the analysis, I could include stress scenarios showing how fast equity can erode under high leverage or add bondholder-focused metrics like interest coverage. Reflecting on the session, I learned that capital structure isn't about picking the \"cheapest\" option. It's about designing incentives. The same project can feel attractive to shareholders, concerning to bondholders, or stressful to managers depending on how it's financed. That's the core of corporate decisions and incentives in Session 11.\nOverall, this session helped me understand that capital structure is really about balancing incentives and managing risk. Debt and equity aren't just financial tools—they shape how shareholders, bondholders, and managers behave when a company takes on a major project. By looking at Nike's expansion through the DRIVER framework, I learned how financing decisions can change returns, shift incentives, and influence the stability of a business. Thinking like a CFO means understanding not just the cost of capital, but how each choice affects the people who are invested in the company's future."
}