{
  "student_name": "Taylor Blanton",
  "org_defined_id": "037019479",
  "username": "tblanton",
  "email": "",
  "transcript": "Okay, so this is my session nine project. Um, our objective was to calculate the weighted average cost of capital to determine if a hypothetical $5 billion investment in new content is financially viable for Netflix. Um, some key assumptions, we're going to use market values for capital structure weights because they reflect the true economic claim of investors. Um, interest on debt is tax deductible, creating a tax shield that lowers the effective cost of debt. And we assume the current beta of 1.3 accurately reflects the systematic risk of the firm. So Netflix currently has a market cap of 200 billion and a market value of debt of 13 billion. With a beta of 1.3, the market views Netflix as significantly more volatile than the wild wider economy. So for the represent step um our goal was to map the financial concepts to mathematical models. So for cost of equity um the CAPM model we use capital capital asset pricing model to determine the recur return required by shareholders based on the stock's risk relative to the market. So as you can see here we have the formula for cost of equity. So it is cost of equity equals the risk-free rate plus beta times um the market risk premium. So then we also have the after tax cost of debt which is KD. Um because interest is tax deductible the real cost to the company is lower than the yield. So we have as you can see here um KD is equal to yield times 1 minus the tax rate. So then the WACC formula the weighted average of the two components above. So you're just taking the market value of equity divided by the total market value times the cost of equity plus market value of debt divided by total market value times the um after tax cost of debt. So for the implementation, I used Python to automate the calculation. So as you can see here, I inputed the risk-free rate of 4.5 and a market risk premium of 5.5. And you can just see Netflix financials are inputed here. This will calculate the cost of equity using the formula we just went over. It will also calculate the after tax cost of debt. We also just went over that calculation and it will calculate current weights which will then flow into the current WACCC. So then we also have the scenario analysis of issuing $3 billion in new debt and the new debt adds three billion to the debt pile and we assume the equity value remains constant for the isolation of capital structure effect. So, as you can see, we've now added three billion to the new debt value, which also increases our new total value, and it will also calculate the new WACC. So, as we run this, so as you can see, my analysis yields the following results. Um, Netflix's cost of equity is 11.65. Um, this is high and it's driven by that 1.3 beta. And the after tax cost of debt is only 4.58%. And waiting these together, Netflix's current WACCC is 11.22%. And as you can see here, we will also have the WACC with the $3 billion of debt, the added $3 billion of debt, which yields 11.13%. So for the validate and evolve step um we simulated issuing that $3 billion in new debt as seen in the code and the result was that the WACCC dropped from 11.22% to 11.12% and this confirms that replacing expensive equity with cheaper tax advantage debt lowers the firm's overall hurdle rate. However, when compared to Disney, whose WACC is only 8.2%, Netflix is at a disadvantage. Disney utilizes a capital structure with 30% debt, whereas Netflix is currently using only about 6% debt. Um, Disney is maximizing their tax shield and Netflix is not. So, some recommendations I had um for the hurdle rate, Netflix should use 11.22% 22% for the $5 billion investment. If the content cannot generate an ROI higher than 11.22%, it destroys shareholder value. Um, and then some just optimal capital structure. Um, Netflix is underleveraged. Um, because the KD is so much cheaper than K. Netflix can safely issue that $3 billion to lower their WACC further without significantly increasing bankruptcy risk. Um, this moves them closer to an optimal structure like Disney's and overall improves their business and capital structure. So that is session nine.",
  "video_url": "https://youtu.be/HH3okNI_DGA"
}