{
  "student_name": "Ana Martinez",
  "org_defined_id": "033961971",
  "username": "am156",
  "video_url": "https://youtu.be/IQacE8HU5CQ",
  "transcript": "(0:00) Okay, we will be going over the assignment overview, so we will do a deliver full evaluation (0:08) of Panera bread for a prospect KKR takeover using driver combined DCF, trading comms, and (0:14) prep and enter transaction to produce an informed bid range while contrasting financial buyer (0:19) discipline with strategic buyer synergies. (0:22) Here's our deal snapshot. (0:23) We have a scale, which is 6 billion revenue growing 8%, 900 million EBITDA, 50% margin (0:30) 400 million net income across 2100 stores and digital sales are already 50%.\n(0:38) Market references, industrial PE slash E is of 22% EBITDA multiplies by between 12 and 15 (0:51) of Chipotle trades at 35 and PE for McDonald's is at 25. (0:56) The capital assumption industry WACC, 9% management, wants 10% rollover, strategic buyer, Starbucks, (1:05) McDonald's are circling. (1:07) The growth lovers, 500 new stores in 5 years, digital mix, 270%, dinner slash catering expansion, (1:15) early stage international rollout, catering executive ready recommendation that states your (1:20) valuation range, winning bid strategy in rationale for choosing financial versus strategic positioning.\n(1:29) So we'll go for the math for this. (1:34) So we will do comparable company analysis. (1:40) So first we will do the enterprise value using the PE multiple.\n(1:43) So given our price to earnings, multiple is applied to net income. (1:50) So we have the given net income of the 400 million. (1:53) The industry reference is about 22, while the high end reference, which we know is McDonald's, (1:59) is 25.\n(2:00) The implied equity value, here we have, we just take the lower end, 400 million times (2:06) the 22, we get 8.8 billion and the 400 million times 25 to get a 10 billion. (2:13) We would like to note that the enterprise value, you would typically add the net debt, (2:19) but assuming for this example, we will, we just have a conservative baseline. (2:26) So far enterprise value using EV over EBITDA multiple.\n(2:33) So we have the given 900 million and we have our range, which we will subtract 10 by 12 (2:43) and we would get for the lower end, we would have 900 million times 10, we would give us (2:51) 9 billion and our 900 million times our 12 to get our 10.8 billion. (2:58) Now we will go to a person or president, president, transaction analysis. (3:03) We have the given 900 million, we would subtract the 12 by 15 and that's our range from 12 to (3:13) 15 and we would take the 900 million times the 12 on the lower end, we would get 10.8 (3:19) million and our 900 million to buy our 15 to get our high end 13.5 billion.\n(3:27) We would just count cash flows analysis. (3:30) We'll use, if the following formula is just EV equals FCFT over 1 plus WACC to the power (3:39) of T plus 2V over 1 plus 3ACC to the power of N. (3:45) So we have in our free cash flow in the year T that we did average cost of capital and (3:52) our terminal value. (3:54) So following these, we would have the following for year zero for EVITDA would be the 900 (4:05) million, the gross driver for that would be 8%, our tax rate would be 25%.\n(4:12) Now our EVITDA times 75% would give us 675 million, our capex are staying plus the (4:21) gross, that would be implied. (4:24) So now for our first year projected would be 100 million, 11.1%, 25%, 750 million, 350 million (4:35) and for our FCFT would be a percent of 400 million and our projected five years we would (4:42) have 1400 million with a gross driver 7.8%, a tax rate of 25% and our, uh, (4:51) no thought which would be 1050 million with our capex or 450 million and we would get (4:58) an FCFT of approximately 600 million. (5:01) For our terminal value calculation we would just, for our low class we would have approximately (5:08) 9.46 billion, for our high class we would have approximately 11.29 billion, discounting (5:17) we would get for our low case we would have 10.5 billion and for high school 12.5 million.(5:26) For our final valuation range we would have on our low end 9 billion, on our high end (5:34) we would have 10.8 billion and for presented to transaction 10.8 million on our low end (5:42) and on our high end 13.5 billion, our DCF analysis calculation we will have a 10.5 on (5:48) our low end and 12.5 on our high end and for that range we would have a 10.5 billion on (5:56) our low end and on our high end we would have 20.5 billion. (6:03) This actually supports that the recommended KKR bid should be of between 11.5 billion (6:10) to 12.5 billion."
}