{
  "student_name": "None None",
  "org_defined_id": "035964608",
  "username": "tsharat",
  "video_url": "",
  "transcript": "Hi everyone, I built a small finance AI coach for college students who are trying to decide what to do with their savings.\n\nThe specific decision I focus on is a very common one:\"I have ten thousand dollars as a college student. Should I invest in stocks or keep it in a high yield savings account?\"\n\nLoop 1 – Basic AI integration\n\nFirst, I used the DRIVER framework.\n\nD – Discover\n\nThe goal was not to just calculate a number. I wanted the tool to:\n\nCompare different options, not just one answer\n\nTalk about risk, time horizon, and tradeoffs\n\nExplain things in plain English for a student\n\nSo the decision I am explaining is: invest in a diversified stock ETF versus keeping the money in a high yield savings account.\n\nR – Reason\n\nThen I asked, how can AI actually make this smarter.\n\nThe AI should:\nAccept a natural language question like \"I have 10k, what should I do\"\n\nLook at a simple profile for the student: age, income stability, risk tolerance, time horizon, and goal\n\nUse rules of thumb from personal finance to reason about the choice\n\nReturn a structured explanation, not just a one line answer\n\nSo the reasoning is split between code and the model. The code sets up the situation and the model does the explanation.\n\nI – Implement\n\nTo implement this I used n8n with two main nodes.\n\nCode in JavaScript node\n\nThis node builds structured JSON that represents the decision:\n\nquestion: the text of the student's question\n\nuserProfile: age 21, low income stability, medium risk tolerance, five year horizon, goal is to build savings and start investing\n\nscenarios:\nScenario A is \"invest in a diversified low cost stock ETF\"\nScenario B is \"keep money in a high yield savings account\"\nEach scenario has expected return, volatility, liquidity, and key risks.\nreferenceRules: simple rules of thumb like \"build an emergency fund first\", \"do not put all money in one stock\", and \"higher return usually means higher risk\"\n\nsanityChecks and limitations: text the model has to use when it explains the answer\n\nThe code returns all of this as a single JSON object that flows into the model node.\n\nMessage a model node\n\nThis node calls GPT 4.\n\nThe system message tells it to act as a patient, beginner friendly personal finance explainer for college students.\n\nIt is not allowed to give specific tickers, promise returns, or pretend to be a licensed advisor.\n\nThe user message passes in all the structured JSON and tells the model to compare the scenarios, apply the rules, and explain everything in clear language for a student.\n\nSo for Loop 1 I already have multi step reasoning and structured outputs, not just a single raw prompt.\n\nV – Verify\n\nTo verify, I ran the workflow with the 10k question and checked:\n\nIt actually compares both scenarios\n\nIt talks about risk, volatility, and time horizon\n\nIt follows the rules, for example it mentions emergency funds and does not recommend going all in on one stock\n\nIt does not hallucinate fake products or guaranteed returns\n\nIf any of that looked wrong I would adjust the rules or the prompt, but the outputs were reasonable.\n\nE – Evolve and R – Reflect\n\nFrom Loop 1 the main gap I saw was trust. The explanation sounded good, but it was not very explicit about limitations or sources, and there were no hard guardrails in code. That is what I fixed in Loop 2.\n\nLoop 2 – Make it trustworthy\n\nLoop 2 is focused on trust and guardrails.\n\n1. Clear structure for trust\n\nI tightened the system prompt so the model must always use the same headings in this exact order:\n\nSUMMARY\n\nSCENARIO COMPARISON\n\nHOW THE RULES APPLY\n\nSANITY CHECKS\n\nLIMITATIONS\n\nHOW TO USE THIS EXPLANATION\n\nFURTHER READING\n\nIn the SANITY CHECKS section it has to label each check as PASS or FAIL with a one sentence reason.\n\nIn HOW TO USE THIS EXPLANATION it must be very cautious and remind the student to double check big decisions with a human.\nThat directly addresses \"make limitations clear\" and \"build sanity checks into the answer.\"\n\n2. Sources and further reading\n\nIn the JavaScript code node I added a sources array, for example:\n\nInvestor.gov introduction to investing\n\nInvestopedia article on risk tolerance and asset allocation\n\nFederal Reserve basics on interest rates and inflation\n\nI include that array in the JSON, then in the prompt I tell the model:\n\nYou can reference these sources\n\nIn the FURTHER READING section, list them in plain English\n\nNow every answer ends with a short reading list, which makes the AI feel more grounded.\n\n3. A real guardrail in code\n\nI also added a programmatic sanity check.\n\nIn the code node I compute redFlagShortHorizon. If the time horizon is less than one year, this flag becomes true and is passed into the JSON.\n\nIn the model prompt I say:\n\nIf redFlagShortHorizon is true, you must clearly warn that stock investing is probably inappropriate for such a short time horizon and you should emphasize capital preservation.\n\nSo even if the model wanted to push someone into stocks with a three month horizon, the guardrail forces it to verbalize that this is not a good idea.\n\nWrap up\n\nSo in summary:\n\nLoop 1 builds the basic intelligent tool: structured finance scenarios, rules of thumb, and an AI explainer that reasons over them.\n\nLoop 2 turns that into a more trustworthy tool by forcing a clear structure, explicit PASS or FAIL sanity checks, visible limitations, real sources, and a coded guardrail for short horizons.\nThat is the difference between just \"using an AI model\" and actually designing an AI component that behaves more like a careful financial coach."
}