{
  "student_name": "Jackson Montgomery",
  "org_defined_id": "035961927",
  "username": "montg126",
  "email": "",
  "transcript": "All right. Um, what's up guys? This is Jackson Montgomery and this is my session 10 section six assignment which is cost of capital analysis. So a basic overview of this is we need to evaluate Starbucks's proposed flagship roster um that requires a $12 million upfront outlay and is expected to operate for 10 years. Uh we're going to use the firm's 8.5 WACC as the hover rate to determine whether the project creates value and to recommend um an ex accept or reject decision. We're going to use a driver framework for that. And then some of our parameters for this are that the initial investment is 12 million. That's for building equipment and training um depreciated straight line over 10 years. Our working capital is 500,000 deployed at launch and recovered in year 10. Our revenues are 8 million in year 1, 11 million in years 2 to 5 and 9 million year 610. Um, our operating cost, cost of goods are 4% revenue. Uh, labor 2.5 million, rent utilities 0.8 million, marketing 0.3 million in year 1 and then 0.1 million there every year after. Um, then taxes we pay 25% corporate rate and we have a terminal value of 3 million at year end of year 10. So our goal for this is basically just to focus our analysis on producing a transparent cash flow model. Uh we're going to use core capital budget metrics, sensitivity test, and an exe executive ready recommendation. So I use Gemini to complete this assignment and I use driver framework. So I'm going run you guys through that. So just starting off um we have the find and discover which is which is just we set up our project parameters and assumptions. Um so right here we have our financial inputs, our operating cost inputs, our revenue inputs by period as well as our marketing cost inputs. So this will redefine and discover um calculate fixed parameters. So we have our project life, our depreciation, our years as well. This will all be stated later as well. Moving on, we represent which is our plan. So we're defining the core functions for the cash flow calculations and metrics. This is where we calculate cash flows. This calculates the uh incremental cash flows ICF for a given set of parameters. Our parameters given up here. We have our revenue and OPEX EBIT calculation components. uh tax calculations only tax positive uh EBIT operating cash flow OCF non-operating cash flows working capital outflow at y equals 0 and y equals 10 so year 0 and year 10 our terminal values our inflow at year 10 as well as our total incremental cash flows um and moving on we define and calculate our metrics So this our CS list, our whack, our investment outlay. This calculates MPV, IRR, PI, simply discounted payback periods. So here we calculate MPV and IRR uh profitability index, simple payback period and discounted payback period. the first element in the initial outlay CF0 which is not discounted. So everything's represented here and calculated and we have implement um this run the models and make the first assumptions. So at first we calculate base cash flows and calculate base metrics. Um we display year zero initial outlay year five peak rev and year 10 uh terminal cash flow. Everything's printed out here. Then we validate. So this is the V of the driver. So in scenario A, our revenue is reduced by 20%. And this is kind of where we calculate everything. Your DF revenue, CF revenue, MPV revenue um these are our results. Scenario B, our WACC is increased by 2%. Um to 10.5%. So we have our WACCC parameters. We have our DF whack up, CF whack up and FV whack up. They're all calculated here and they'll be stay later. And we also have scenario B where it's minus 2%. So 6.5% in the same thing, same answer. It's just different equation with the 0.2 or the minus 2% plus 2%. And then we summarize our sensitivity results. And this is where we visualize. So down low I have some charts I'll show you guys. They're just visually here and displayed there. So then we have evolve and reflect for driver which I'll just talk about you guys down here. So this is my code that I use the driver framework. Um and then moving down I have it here all everything given. So just run you guys through everything again. Define the find and discover our initial investment of 12 million our WACC or her rate of 8.5% and then annual Australian depreciation of 1.2 million. Um we represent we use model functions we define them and then we also implement them in the eye. um to our base case financial analysis and this is that right here. So our incremental cash flow schedule summary our revenue this is 0510 revenue total OPEX eBay taxes OCF changes WC um so yeah uh year one or year five peak revenue here we're at nothing um then we have our terminal CF and ICF which you can see right here and moving on uh we have our core Capital budgeting metrics and this is the base case. So net present value of 3,22,5425. Our decision is to accept this. Our internal rate of return is 13.25%. Decision to accept uh profitability index is 1.242 or 1.242. Our payback period is 5.28 years and our discounted payback period is 8.21 years. Um so after we implement it, we validate it, make sure our results are correct. So here's our sensitivity result summary. Revenue - 1% WAC of plus 2% and -2%. Our net present value of minus 2% is 4 million and our whack of plus 2% is 1.6 million. Um so these are both positive numbers. We're going to accept both of those. And then revenue minus 20% we're going to reject that because that's a minus3 $3 million the present value. And that you can see here our cash flow millions and then our years. So at year zero we're in the hole 12.5 million. Um but over the years as you can see it stays positive and then year five and year 10 it's at the highest. Um then moving on we have our net present value across key sensitivity scenarios. So our base case um net present value of three million this is a scenario where we subtract 20% of revenue that takes us to um less than less than minus 3 million. So this is this is the reject and our WACC plus 2% is 1.6 million and WCC minus 2% is well over four and a half million. So if we wanted to evolve this scenario um a strategic fit would be to maybe a strong alignment with Starbucks. Um premiumiza premiumization and experimental retail strategy. Brand implications high visibility flagship enhances brand image and justifies premium pricing. A key risk is revenue failure. A 20% revenue drop makes the project financially non viable. And then mitigation conservative sales forecasting and strong pre-launch marketing execution controls. So if you wanted to take this study even a step further, we could include we could include any of these just because this would give us a much better model. Um and just kind of reflect our project decision is to accept um our financial justification is that the project delivers a positive net present value of 3 million and an IR of 3.2 or 3 13.25% um exceeding the whack hurdle of 8.5%. Some risk consideration is that we accept is our accepted our acceptance is conditional on a high confidence level and revenue forecast. Uh the sensitivity analysis indicates that failure to achieve the sales target an example of 20% shortfall will would destroy our value. So our or if our revenue would fall 20% short it would not be acceptable. Um so our conclusion is the compelling strategic benefits and positive base case financials. Um they warrant acceptance. Um they provide rigorous risk management as applied and it ensures that our target revenues are met. So this is my driver model that just displays the scenarios with even frameworks and this was session 10 uh session section six assignment cost capital analysis.",
  "video_url": "https://youtu.be/Zn4Jby5Tdp0"
}