{
  "student_name": "Ryan McNamara",
  "org_defined_id": "037202820",
  "username": "mcnama34",
  "video_url": "https://youtu.be/M34wa9vDlbU",
  "transcript": "Good evening. I'm Ryan McNamera and we're going to be looking at our session 12, our final session before the capstone project uh assignment. So, what this assignment is saying is we are looking into an arrow um pretty well-known huge chain uh food company, but what they're doing is they're looking into um uh we're looking to take them over. We're looking at a takeover here. um to kind of uh just so we can start running the company from somebody else wants to run the company. So we are looking into what that might what that transaction might look like. So we are um going to we're going to get into that. We're going to look at their um their earnings as well as their um what we think that they might be worth based off of all of the information that we're seeing right here. Um their sales um different uh companies in the same se uh sector as well as their um weighted uh cap cost of capital um and a couple other different things. So, we're going to jump into our collab file. So, what I did uh is I used Google Gemini and it um kind of made this this program for us based off of the information that I gave it. Um it's going to give us a valuation and it's going to give us it's going to talk us through how we want to go in and bid on this company. So, um the first the easiest way to do it is off of the um earnings before interest, taxes, depreciation, and um amortization. That's what this is right here. Um so, what we want to do is we're going to take that number and we're going to use it to find out what the what we think the company might be worth. So what we're seeing here is we're seeing that um a lot of uh companies in similar sectors have traded in the 12 to 15 times their um earnings before all of those expenses. So what that range would put um those companies at like McDonald's, Chipotle, um stuff like that would put them in the 12 to 15 or sorry the in this range here 12 to 16 times that worth. So, for a company that's doing what was the number? Let's see I can find it here. Um, was doing 6 billion in sale. Let's set it here. 900 million. Um, we multiply that by by in this range and we're going to end up with our valuation somewhere between 12.5 and 13.5 billion dollars. So that's a 13.9 to 15 times multiplier. Um, which is a pretty good spot to be in considering what we've seen based off of our all of our uh information here. So what that recommendation comes out to be is that we're probably going to want to come in around 13 uh billion as our initial bid based off of what we're seeing here. Um, the reason being is that's going to be kind of the midpoint of that range. And we don't want to come in too low where they tell us to go away. We don't want to do business with you if you're going to lowball us. But we also don't want to come in too high and realize that we're actually at a point where they're going to say yes instantly and we're going to feel like we kind of got screwed because we could have got the company for cheaper. So, like with any good negotiation, you never take the first offer, but you know, so they know we're going to come in low and then bring it back up. So, that's why we have our maximum as well here at 13 and a half, which is 15 times that earnings um before everything else. So, that's what we're seeing. And the reason being is we're on the finance side. We're in this to make money, right? So, it ensures that we're not overpaying and that we're not avoiding our internal rate of return, which is very important for um a company looking to make such a large purchase. We want to make sure we're getting our money back. Now, moving down, we also have another code that's going to run us through a couple of different scenarios based on the growth rate, um our cost of capital, and yeah, so we're going to go we're going to look at the output for this section. Now it's a pretty uh we have so we have our year-over-year for the five for the first five years and we have our scenarios um the best case the worst case and somewhere right in the middle. So our right in the middle that's our uh our base is that we have 9% cost of weighted average cost of capital um which puts us at a enterprise value meaning the value of the company at about 11.4 billion implying a 12.6 times multiplier on that um earnings on those earnings. So it's going to output us a little rationale, but we can ultimately look at all sides of this. We can see if we have a lower cost, we immediately see that multiplier jump um and with it the valuation of the business and the amount of money um overall that's going to be worth. So, and then also on the low end, we have simply a uh 10 times multiplier and an enterprise v value of around 9 billion, which is not what we want to see. That's not where you're going to want to be at, where we're want going to want to come in for an offer. They're probably going to turn us away at that point. So, what our um revised valuation is telling us based off this information of the program is we're going to want to be more on the lower end of what we were before in the 11.4 to 14.3 billion range. Um, as we can see that right here and it recommends that again we do go for the middle of that segment which at this point is 12.8. So, this is going to be a pretty competitive um bid for this company, but we have that room. We can go up to 14.3 if necessary. Though, we're not going to recommend that off the bat because again, we are trying to make money and maximize our rate of return. So, ultimately, we think that 12.8 would get the deal done. um but pending any other um mishaps, but overall that's where you're going to want where we're going to want to come in. So yeah, thank you very much um overall. So yeah, thank you."
}