{
  "student_name": "Ryan Date",
  "org_defined_id": "037312318",
  "username": "rdate",
  "video_url": "https://youtu.be/YLZPxKaJXrA",
  "transcript": "0:00 Welcome to my capstone project, which is my final project for this class. Um, what I was able to create is a real-world, uh, uh, uh, AI tool, an AI final project.\n0:16 application. So what I created was a mortgage calculator, um, which is an advanced financing tool, which helps understand how inflation impacts the real cost of a 30-year commitment.\n0:28 Um, so what this does is it takes a series of parameters into consideration, and it calculates the loan amount, the total interest percent, um, and the total interest, your dollar amount that you'll pay, and the real monthly cost, um, adjusted for inflation even.\n0:47 And it also creates charts, which are with a balance schedule, um, it creates a chart for the inflation impact, and a chart with the payment breakdown.\n0:55 And then, with, it also gives, um, financial insight at the bottom. Um, so you can see here the parameters it takes into consideration are, uh, our home price, which we've set at $450,000 for this specific example, downpayment of 20%, which is fairly standard, um, but it's also, that's another adjustable\n1:14 parameter, um, interest rate, which I set at 6.5% for this simulation, but it's also adjustable. And the inflation rate at 2.5%, um, as well as annual salary, which is the final parameter.\n1:27 And these are all adjustable parameters. And that goes into calculating the final output. And what it calculated was a monthly payment of $2,800.\n1:36 $325, which is fairly risky because the debt to income ratio is 35.7%. Um, it also calculates the loan amount, which is $360,000.\n1:47 Um, the total interest, which comes out to $459,000. And the real monthly cost, um, that's the value in 30 years adjusted for inflation, which is $1,300, $1,362.\n2:03 And it also gives financial insight at the bottom. So for this specific situation, um, with a 20% down payment. And a salary of 95%, which are both fairly standard statistics.\n2:12 Um, this home is stretching your budget based on the 28% rule. Over 30 years, inflation will effectively reduce your monthly payment.\n2:20 Birding by 52% in real purchasing power terms. Um. And just to prove that this works in a plethora of different scenarios, uhm, we can adjust the annual salary here.\n2:30 Let's say it is now for an individual making $150,000 a year. Um, should we get input like this? Um, let's leave the inflation rates at the same.\n2:39 Let's say the interest rate is going to be a little. Higher at 7%, or 6.8%. Um, and let's say this individual wants to buy a home that's $550,000.\n2:49 Um, so this still calculates the loan amount coming out to $400,000 a total interest, $592,000 through monthly costs adjusted for inflation in the 1697.\n3:05 Um, and the financial insight for this specific application with a 20% down payment in the salary of $150,000. This home is stretching your budget based on a 28% rule.\n3:15 And over 30 years, inflation will effectively reduce your monthly payment burden by 52% in real purchasing power terms. So, that just goes to show the variety of situations that this tool can.\n3:28 And be helpful in. And so, I know personally, I would, if I was thinking about purchasing a home, this is the tool that I would use, and this is, um, sort of the epitome of all of the AI.\n3:44 Information I've learned in this class, and I think this is an excellent application of the different ideas that we've learned in this class.\n3:52 And I think it embodies the, the work that we've done in this class, and I'm very proud. Um, and I'm very satisfied that I was able to create something mis-advanced based on the information I learned in this class.4:07 And yeah, that's my real world, too."
}