{
  "student_name": "Arianna Dilling",
  "org_defined_id": "036049965",
  "username": "dillinga",
  "email": "",
  "transcript": "analysis must employ capital budgeting techniques including net present value, internal rate of return, payback period, and its sensitivity analysis to determine project viability and provide an investment recommendation. We have some project parameters including the initial investment. Project life is going to be 10 years. It is um a premium downtown location with high foot traffic and the discount rate is going to be the WACCC of 8.5%. We have some revenue projections. For year 1, it's going to be 8 million. Years 2 to 5, it's going to be 11 million. And year 6 to 10, it's going to be 9 million. We have some operating costs such as the cost of goods sold which is going to be 40% of revenue. We have labor labor of 2.5 million annually rent and utilities and marketing. Some additional assumptions are the terminal value of 3 million corporate tax rate is going to be 25%. Depreciation is going to be a straight line over 10 years and working capital requirement is going to be 500,000 but recovered at the end of the project. um including calculating the MPV, the IR, payback period, discounted period, we also want to do some sensitivity analysis for a hypothetical scenario where revenue was a negative 20%. We need to provide an accept slashreject recommendation with justification and discuss any non-financial strategic considerations. So in order to decide whether we would like to accept or reject this project um we are going to work step by step through the driver framework which is going to help us lead to our solution. To begin we're going to start with the define and discover stage. Should Starbucks invest the 12 million plus the.5 million working capital in a 10-year flagship roaster given that 8.5% WACCC based on NPV and irr and other strategic considerations. We would like to determine whether this project creates or destroys shareholder value using that NPV, irr payback, discounted payback, and a profitability index as supporting metrics. Our man managerial objectives are to provide an executive ready recommendation that combines our quantitative results, our cash flows and metrics as well as the strategic fit, brand/ flagship value and project risks. So there's a lot of information here. Let's kind of break down what a lot of these acronyms mean. NPV is the net present value, the present value of project cash flows minus the initial investment. So in order to calculate for this, we're going to be needing to calculate all of the cash flows for this project over the 10 years. The IRR is the internal rate of return, which is the discount rate that makes NPV equal to zero. Payback period is the time required to recover the initial investment. Profitability index is the present value of cash flows divided by the initial investment and hurdle rate is the minimum acceptable return typically the WA WACC which is that 8.5% given to us. The key idea here is that we want to create shareholder value or we just want a project that's going to be profitable. In that case, irr needs to be greater than the WACCC of 8.5% and the NPV needs to have a pro a positive value in order for us to accept this project. Another key idea is that we are using capital budgeting which uses incremental cash flows. um we are going to ignore any financing structure because the WACC already incorporates the cost of debt and equity. So there would be no need for us to involve any interest payments or borrowing borrowing inside of these cash flows that we are going to be um uh calculating over the 10 years because that would double count financing costs because we are using the WACC. something to keep in mind when we take a look at the implementation stage. So again, for year zero, we have that initial investment. Um, when it comes to depreciation, that's really going to be easy. It's just going to be 12 million / 10. We have the working capital, which is originally going to be an outflow at year 0, but because we're recovering, it's at year 10, it's going to be an inflow. And that's another thing you're going to be able to see in the implementation stage. So we again have our revenues, we have those operating costs, we have our taxes and um these are all going to help us when it comes to calculating some of those things above. Now we can move on to the discover stage. Um the cash flows is going to have calculating the cash flows is going to have a lot of components. It's going to um have some operating it's going to have those operating costs. It's going to have that depreciation. It's going to have something called earnings before interest and taxes as well as the taxes which we described as 25%. Um the operating cash flows is the cash generated from operations before considering any capital spending or financing effects. And I've given the formula for that right here. And then the working capital outflow, as I said, it's later going to become an inflow. Terminal value, that's going to be an inflow at year 10. And then the FCF timeline, um, that's just our cash available to investors, the debt and equity after accounting for all cash needed to run and sustain the project. Again, we need to calculate the NPV, the IRRa, profitability index, the simple payback, discounted payback, and then we are need we need to create um two different scenarios here. That's how we're going to do it. Um originally we have our base case but our second our first scenario is going to be that negative 20% revenue hypothetical as well as for sensitivity analysis. We are going to consider what um the NPV would look like if we had a WACCC of 6.5 versus 10.5. um and we're going to implement that in the next few um steps. The next thing we're going to do is move on to the represent stage. Um the initial investment is going to be a outflow and then we have the working capital outflow. So for year 0, it's just going to be that combination here. For the annual cash flow components, years 1 to 10, we are going to need revenue, operating costs, depreciation, that EBIT formula I described above, um, which is the revenue minus all of those costs. We're going to need to calculate the taxes and the operating cash flow. And then there's that formula for that as well, which just adds back adds back the depreciation as a non-cash expense. We also are going to need to calculate the working capital in the terminal value for year 10 which um creates some inflows and then we need the free cash flow formula for all years. So, we're going to do that for 1 through nine, year 10, year zero, and then of course we need to calculate the NPV um and then the the IRR profitability in index and then the payback periods. And as I said uh above, finally we need our scenario A, which is going to be revenue at - 20%. and then our scenario B which is the 6.5 our base case 8.5 and then um our 10.5. So now we can finally move on to the implementation stage. So the first thing we want to do is um add in all of our variables. So we have our base case um WACCC our tax rate. We've got our initial investments and then our outflow and inflow for working capital. We have our terminal value. We have our depreciation. And then we can start to calculate um the cash flows overall 10 years. So as you can see we're calculating that here. We've got all of our costs. We've got the BIT um taxes, operating cash flow, free cash flow. Then we can calculate the NPV, the IRR, we have our profitability index, our simple payback, our discounted payback, and then we can um start to this is just summarizing some of the information as it's calculating it. And then here's our scenario A for the negative 20% revenue. And then here's our scenario B for the different W Acc scenarios. And then I also created some plots. Um this is going to be really helpful to us for us to kind of see visually um the difference between the base case and some of these scenarios we um calculated for. So, here's all of our free cash flows over the 10 years. And I'm going to quickly just go through these results and point out some of the key things, but um we are also going to take a deeper look at and analyze them um in a moment. So, for the base case, the NPV is a positive 3 million. um for a revenue at -20% it is a -2 million. So for that base case, we would be able to accept and for a negative revenue with a negative NPV, we would want to reject. And I'll explain why in a in a moment. For a WACCC of 6.5% is going to be 4 million, which is greater than our base case. And then for a WACC of 10.5% that's going to be one one million which is less than our uh base case. And then here you can see that when we for our cash flows during that year one we have a lot of outflows that that negative initial investment but as the year goes on we're going to be making some more money. And then key idea here that I'm going to explain is that um a lower WACCC results in a higher NPV value and you were able to see that with the N uh the WACCC of 10.5% was actually a NPV of 1 million versus the WAC ACC of 8.5. 5% which turned out to be around 3 million. So, and then for the obviously for the 6.5% that had the highest NPV because it had the lowest WACC. So, now we can move on to the validate stage. Um, and I'm going to summarize some of these results that I've kind of discussed above. Um so Starbucks obviously spent the 12.5 million upfront. The um roaster generates steady positive cash flows strongest in years 2 to five then weakening um slightly weakening in the later years. The reason year 10 is higher due to the working capital recovery and terminal value inflows. This is just the usual heavy upfront investment which turns into stable midlife returns and then a final year recovery. As well, we saw that the NPV was a positive 3 million. This just means that the project creates 3 million of value today above the required return of 8.5%. Therefore, because it has a positive NPV, we couldn't accept. The IRR was a 13.25% 25% which means that it is well above the WACCC of 8.5% and indicates project clears Starbucks hurdle about five by about five percentage points and then the profitability index was actually 1.2 which um basically means that anytime it's the profitability index is greater than one it's creating value. So for every $1 invested, the project returns 1.24 in present value terms. The simple payback period was 5.28 years. Um so it just takes a little over 5 years to recover. Um in regards to the undisounted investment, but even for the discounted payback, it was 8.21 years, which means that when the cash flows are discounted at the 8.5%, it's only going to take it 8 21 years to break even, which is um great because we actually have a 10-year project life. So based on this so far, um the project creates value and we would accept. When it comes to scenario A, the revenue being at - 20%. Like I said before, the NPV is a -2 million. It's going to destroy value if revenues fell that far below. Um the IRRa is 3.88% which is way below 8.5. And then um the profit profitability index is 0.78 which is less than one. So um it only returns 0.78 in present value. the discounted payback was not recovered even over 10 years. So for that scenario, we would want to reject um especially because of that negative NPV. And then I kind of discussed this with the graph as well. Um for that 6.5% we've got a positive 4 million versus a positive 3 million. So again, when you have a lower WACCC, you get a higher NPV value. And then when you have a higher WACC, we have a lower NPV value, which this is reassuring um for the Starbucks company because even an unfavorable financing envir environment does not p push the NPV below zero. So, if Starbucks hypothetically had an a WACCC of 10.5%, they would still be able to accept the project because the NPV is still positive. So, overall interpretation and summary in order to come up with our um recommendation, the strengths are a positive NPV, a healthy IRR, and a favorable profitability index. Cash flows are steady and predictable. The project remains value creating even when the discount rate increases. Paybacks periods occur uh paybacks occur well within the project life. Our risks is going to be that revenue sensitivity. A 20% revenue drop makes um the project financially unattractive. performance is going to rely heavily on that store traffic, premium product mix, and a brand driven experience revenue. We're also going to want to think about that strategic fit. Um, we want to make sure it's brand enhancing. There's tourists and media drivers showcase innovation space spaces consistent with Starbucks global brand identity and um the strategic value is going to be meaningful but it should be weighed against the downside revenue risk. So our final recommendation based on the base case results the Starbucks flagship roastery project should be accepted. It generates a positive NPV of 3 million and an IRR of 13.25% 25% that exceeds the 8.5 hurdle rate, a solid profitability index, and achieves both simple and discounted payback in the project's 10-year life. However, the project is highly sensitive to revenue valu performance under a 20% decline in revenues. NPV becomes negative and IRR falls well below the WACC. recommendation is to approve the project conditional on confidence and projective revenue drivers, marketing performance and brand strategic benefits that mitate mitigate a downside demand risk. So we want to make sure that our internal logic is consistent here. Um, we were able to tell that as WAC increases, the NPV decreases. Um, that's just how that usually works. The IRR remained consistent across the WACCC scenarios and the signs of cash flows support a single IRR route. So, our results are stable. Um the operating cost structure resembles a premium retail roastery concept. The labor and rent fixed mounts reflect a flagship location. The depreciation um schedule was reasonable and we also had some no we had no reg uh red flags such as a negative EBIT for multiple years. Cash flows um weren't refusing to cover the IR didn't contradict the NPV and the sensitivity results behaved consistently. So I would say that these results are appropriate and behaved as expected. Now we can move on to the evolve stage. Um and these are just some ways that Starbucks could um move on from this analysis and kind of expand upon it if they would like to. So they could do some portfolio level capital allocation. Um they could rank projects by value creation, allocate capital to the highest NPV or highest strategic impact opportunities, balance their risk, geography and brand strategy. Um so they could this is that way they could create a capital portfolio and not just one single decision making. Um they could apply this framework to other corporate decisions such as new product lines, sustainability initiatives, technology uh investments, acquisitions or partnerships. They could also involve the sensitivity to more risk analysis such as scenario analysis, price sensitivity, more simulations, um other real options to take this simple stress test into a full risk assessment. And then there could be more technical evolution in regards to the Python model. Um they could add some more dashboards, evaluate for for dozens of other projects, integrate real Starbucks performance data and then turns this that would turn the single analysis into an ongoing decision tool. And finally um this they could take some strategic evolution beyond just the numbers and evaluate brand elevation tourism and social media draw innovation test bed for new products and this way they are able to combine more of that financial value as well as the strategic value. And finally we can move on to the final stage reflect. So for this we are going to kind of summarize um the entire project and also how we could um improve. So in summary the project's financials show a positive NPV IRR above WACC a reasonable payback period. This supports accept recommendation under expected conditions. However, the revenue and negative 20% scenario sharply turns NPV negative, showing that demand assumptions are the project's biggest vulnerability. This project is financially attractive, but only if Starbucks is confident in the projective sales volume and brand driven traffic. The numbers support approval, but the decision should include conditions. Make sure there's lots of people going into their store course demand product mix and this is something that you would want to monitor yearly early yearly performance because revenue drives viability. The finance here is going to provide clarity but execution risk still matters as well. If I was wanting to improve from this project, um I could do some better risk analysis, add multivariable scenarios or more simulations to cap uh cap try to capture that uncert uncertainty of real life scenarios. Um I could do some more uh detailed cost assumptions such as inflation, labor growth, or rent changes. um some benchmarking, compare assumptions from existing Starbucks locations or industry averages. I could integrate real options such as brand value, innovation benefits that aren't captured in the pure pure cash flows that we um calculated. And lastly, um, this project really improved my ability to build increment incremental cash flow models, apply MPV, IRR, and WACC correctly, test sensitivity to key drivers, and combine financial out uh, outputs outputs with strategic judgment. The driver proc uh process really forced me to think strategically starting with clarity, modeling rigorously, validating carefully and evolving the analysis beyond a single project.",
  "video_url": "https://youtu.be/QyILBhOaoXo"
}