{
  "student_name": "Kevin Sales",
  "org_defined_id": "033940131",
  "username": "kfsales",
  "email": "",
  "transcript": "Hello everyone. My name is Kevin Sales and this is my market investigation uh market efficiency investigation. So a quick overview um this presentation will follow the full driver framework which means I'll walk through how I defined the problem. presented the analytical results um implemented um data using Python. I validated the results and evolved the insights into real investment lessons and reflected on what this all means. I used real data from Yahoo Finance and new sources and I generated visuals such as abnormal returns volume analysis and a short interest graph. And my goal is essentially to explain um to just anybody like it could be your friend or it could be someone who knows nothing about finance and to understand why the GameStop event was so unique. So the main question that I'm trying to answer was does the GME short squeeze represent a violation of market efficiency or can the price enemies be explained with EMH model plus behavioral finance frameworks? To explore this, I asked several practical questions and first was a statement was is the claim that GME traded at 4 cents in August 2020. How quickly markets incorporate major events did rationale risk adjusted X anti-profit opportunities exist and what did behavioral biases contribute and which EMH forms were violated? So to perform this analysis, I had to gather the right data. This includes the GameStop prices from August 20, the squeeze, trading volume data, short interest percentage to understand how heavily the stock was being bet against, and the spy index data so I could compare the stock's moments against the over market. I also needed to identify all major events dates using new sources such as when uh Brian Cohen increases stake or when Wall Street u activity started to spike and when trading restrictions uh began to appear. And all this is essential because efficiency testing depends on knowing exactly what information that the market had at the time and when they had it and how they used it. So, one of the first things we were told to check was the claim that GameStop traded at since August 2020 using Python and Yahoo Finance which is essentially just using Python to get Yahoo Finance data. I downloaded the actual price data for the month and found that the stock traded between $1 and two to $2 and not just 4 cents. And this is extremely important because if your analysis starts with bad information, everything just begins to become unreliable. So the facteing just ensures that I'm working with accurate data. And as you can see here, the graph shows exactly what I'm talking about. So you can see that at the highest it was trading at a dollar and at the lowest it was trading at a dollar. So it never once broke down to around 4 cents. So now that I had the data, I moved on to the represent stage. And here I laid the event study framework I would use to test market efficiency. An event study basically looks at returns before, during and after key event to see whether prices adjust immediately or approximately. I use the 10 days before the event the event day itself and 10 days after. If the market is efficiency, especially in the semi strong sense, most of the price should happen on the event day. If prices kept drifting up at the event, that just suggests that the market did not incorporate information quickly, which might be pointing to inefficiency. and the EMH test we can see that a weak form will test for productivity semi- strong form is test the speed of the reaction to public news and the strong form will just examine private information signals so now keeping into the represent stage and before I can measure whether games behaved unusually during the short squeeze I first need a baseline in other words I need a model that tells me what games should have returned on the normal day and based on the market movements to To build this baseline, I use something called the CAPM model. CAPM basically says that a stock's daily returns depends on two things which is the alpha and for those of you who don't know is essentially the stock the stock's average performance unrelated to the market and beta which tells us how sensitive the stock is to the overall market movements. To get the values, I downloaded daily returns for both GameStop and the S&P 500 and then ran a simple linear regression in Python. In my results, Python estimated Games beta at around -15, which is massively negative. And this means that during this short squeeze period, Gamestop was not behaving like a typical stock at all. Instead, it was moving slightly with the market and it was moving in the opposite direction and with extreme movement. This regression also gave me alpha, which is GameStop's average daily return after removing market effects. And once I have have alpha and beta, I can comput's expected return for each day. And the formula on the slide shows that expected return equals alpha plus beta times the market return. And this is expected return. And this expected return is crucial because it lets me calculate abnormal returns. Basically, the portion of GameStop's movement that cannot be explained by normal market behavior. Without this step, I would have no way of knowing whether GameStop's surge was genuinely unusual or whether it was simply moving in line with market conditions. So this CAPM regression is the mathematical foundation that makes the entire event study possible. So now we come to implementation. So using the alpha betas I calculated I got the expected return for the day and then I subtracted from the actual return to get abnormal return which tells me how much of the movement cannot be explained by the over market. When I cumulative sum these abnormal returns, I get CAR or in other words, cumulative abnormal returns. And this is one of important measures in event because it tells me whether the price drifted in a way that violates efficiency. And as you can see here in my graph, you can see that there was unusual movement during this time. So when I plotted the trading volume during the squeeze, the spikes were massive. And sometimes, as you can see here, it jumped more than 10 times the normal activity. And large volume spikes usually reflect hurting behavior. And you know, this is really something that you would expect during the GameStop. What happened with the GameStop stock at that time was actually unexpected. I remember when that was going on in my own personal life and how I was thinking to myself that I should hop into this and that I should buy in now. But, you know, this is really again just goes to show that this information that I'm showing here is actually very valid and it's something that I've been going through myself where I almost feel like I'm missing out and I need to get into it. And again, this again what was going on with GameStop at the time is shown through these large volume spikes. And it's just basically a lot of people pile into the stock just because others are doing it. And it often means that investors are not making decisions based on fundamentals but based on emotion, hype, or social pleasure. And this is a clear sign that behavioral forces were at play. And I can myself attest to that. So I looked at short interest next. So short interest shows the percentage of shares being borrowed and sold by people betting the stock would fall. GameStop short interest reached around 140% of the available shares. And this just means that the shares were shorted than um that more shares were shorted than actual existed in the market. And when the buying pressure suddenly increased, short sellers were forced to buy shares to cover their positions which pushed the price even higher. And this is just an example of what we call um this is just an example where even sophisticated investors can't correct mispricing because the risk are just too high. So to check whether the normal returns were meaningful, I ran a statistical test comparing the normal returns to zero and the results showed that normal returns were significantly positive during the squeeze, meaning they were not random noise. I also looked at whether the prices drifted after the event day and it did which shows that the market did not incorporate information immediately and this just helps to build a case that semi strong efficiency was violated. So to make sure that the results were independent on the exact model dates I used. I ran several robust checks and first I just compared my estimated betas to values published by outside financial resources and second I tested multiple different estimation windows. So 30 days, 60 days and 90 days and the cumulative abnormal returns were similar each time. And third, I tried to um use alternate models like the FMA French um three factor model and the Carheart momentum model. And even with these advanced results, GameStop still showed large abnormal returns. And finally, I just checked um the look ahead and the um to just make sure that I wasn't accidentally using information that investors wouldn't have had at the time. And all these validation steps make the findings more reliable. So what does this all mean for real world investing? So the main takeaway is that prices are mostly efficient most of the time. Prices reflect available information, but behavioral dynamics can create temporary mispricing, especially during moments of hyper panic. For most people, the best approach is a barbell strategy. Keep around 80 to 90% of your portfolio and passive index funds, which rely on long-term efficiency of the market, and then just use 10 to 20% for selective active bets only when you have a strong understanding of the situation. And it's just a way to balance safety with opportunity. So finally reflecting on this project, my personal investment philosophy has become clear. Markets do a good job at pricing assets most of the time, which is why passive investing works so well. But events like GME show that prices can sometimes detach from fundamentals due to human behavior, emotion, and structural limitations. From GameStop, I learned the importance of understanding investor psychology, respecting how risky markets can become, avoiding hindsight bias when looking at dramatic price moves, and just never confusing short-term luck with actual skill. Overall, I now see markets as mostly efficient, but you know, occasionally irrational, just like with many things in life. And successful investing requires recognizing which environment you're in. Thank you so much for listening, and I hope you enjoyed.",
  "video_url": "https://youtu.be/DN2vWEvlio0?si=iDVtxzTqM9plgnCO"
}