{
  "student_name": "Sid Jain",
  "org_defined_id": "037209991",
  "username": "jain789",
  "email": "",
  "transcript": "Hi everyone, this is session 10 assignment and in this assignment we're going to define which is the problem to determine whether Starbucks needs to decide whether to accept or reject a proposed 10-year $12 million flagship grocery project. And my goal is to determine if this project creates value for the firm. And for this we're going to use the metrics of determining if it's recommended for acceptance if the NPV is positive and if the IRR is greater than 8.5% the hurdle rate. I'll also calculate the payback periods and profitability index to support this decision. So what information do we have gathered? So we know that our WACC/hurdle rate is 8.5%. We know the project life is 10 years and the tax rate is 25%. and the initial investment for year zero. We know that the upfront outlay is 12 million. The working capital is 5 million negative 5 million and the total year um FCP is -12.5 million. Now years 1 to 10 is operating. So we're going to take depreciation divided by 10 years and get 1.2 per year and that is non-cash expense that creates a tax shield. Revenue for year 1 is 8 million. Year two is to five is 11 million and year 6 to 10 is 9 million. Our operating cost 40% of COGS of annual revenue. Labor is 2.5 million fixed. Rent and utilities is 8 thou 800,000 fixed. Marketing is 300,000 for year 1 and 100,000 from year 2 to 10. Year 10 our terminal year. The NWC recovery is plus 500,000 cash inflow. Terminal value is 3 million. Book value is at year 10 12 million cost minus 12 million depreciation which is $0. Gain on sale is terminal value minus book value and after year at tax terminal is 3 million - 750 which is 2.2. So we have our formula that we're going to use and now we're going to go to the code. Make sure our code runs through. Perfect. We can see our code run through our 12 million, 500,000 investment, 10 years tax, terminal value, all that. Now we go back and from there we can see all of our numbers. That is the code that I ran through. From the code we can see that the NPV is 3.889 3.8 call it 3.9 million. Our IR is 13.97%. Our profitability index is 1.31. Our simple payback period is 6.83 years. And our discounted payback is 8.68 years. The valid validation check we found out that the NPV is positive 3.89 million signaling to accept. Our IRRa is 14% almost which is greater than our original WACC of 8.5% signaling the NPV positive value. The PI is 1.31 which means for every dollar invested the project is in expected to return 1.31 in present value terms and the discounted payback is 8.68 years within 10ear life which is acceptable. So the models appear to be working correctly and from all these financial metrics we're able to determine that we should accept. Now here's a better outlay of all of our signals. base case 8.5 100% revenue 3.9 13.97% revenue and this would happen okay so then we have scenarios of what would happen if we have 20% less revenue 2% more WACCC and 2% less WACCC key finding the project is high sensitive to revenue at 20% reduction would drop the NP NPD NPV negative and drops IR below our 8.5% hurdle rate achieving revenue targets as a signal most significant ificant risk. So our final recommendation is to accept. Based on the detailed financial analysis, I would highly recommend Starbucks to accept this proposal. It generates a positive NPV of 3.9 million signaling it significant value for shareholders. The IRRa is close to 14% exceeding the 8.5% hurdle rate and the PI is 3 1.31. This flagship aligns perfectly with Starbucks premium brand strategy a brand halo reinforcing quality craft and experience. The primary risk as we talked about is the performance revenue. So as long as that is doing well and continues to go have a growth trend that it'll be a fantastic investment for um Starbucks to accept. And yeah that is my recommendation and yeah thank you so much for listening. I hope you have a wonderful day.",
  "video_url": "https://youtu.be/fAyBlHGLWgM"
}