{
  "student_name": "None None",
  "org_defined_id": "034175099",
  "username": "ueki",
  "video_url": "",
  "transcript": "Hi, this is my demonstration for my tool class called the finite advisor through AI studio in Google. This version that I'm showing here is my second version or iteration which is designed to provide personalized intelligent analysis that answers the crucial question financial why instead of just the what. And this tool goes beyond a single prompt by using a complex multi-step workflow that I will now go into. So first at the top here you could see that it highlights that it is market aware as you can see with my cursor which highlights the requirement to include external data in the analysis through this machine. So first I went in and created a prompt that states the user profile which has like the risk and time horizon that is captured and passes the system instruction in every API call as this ensures the analysis is personalized to the user's goal and isn't just to the average uh user and it's more personalized. So, as you can see in the end of every single prompt, it's just the immediate response to the profile that the AI states it's moderately risk operational framework. This is a built-in guardrail to prevent the AI from giving overly aggressive or harmful advice showing that I address safety and accuracy. So third, the tool uses the Google search tool or a similar function call to retrieve a real-time market sentiment grounding the scenario analysis and current financial reality. And then this AI also performs the scenario comparison incorporates the market data and synthesizes the final contextual output in one complex. So as I mentioned earlier, I stated the profile of this individual which is a high to medium medium to high risk tolerance and the main goal of retirement in 20 years. After I do this, the AI enforces the guard rule by setting the moderate risk framework transparently addressing the constraints of the tool.\n\nAnd then as it says here, it goes through all the details as it basically confirms what you had just confirmed in terms of what your profile is. Let's see. So the second prompt that I had given it was to I I asked for a comparison between a high growth tech focused versus a diverse balance strategy.\nSo the first real good thing that it does is that it um clearly breaks down the pros and cons for both specifically tying them back to the moderate risk profile which shows that the AI is reasoning and not simply just generating. And then as we go down deeper down here, you can see the pros and cons and the pros and cons both of each. So while by looking at that profile, you can see that it gives us certain percentages, allocation percentages for diversified bond strategy, which is like the 50 to 60% in stocks, 25 to 35% in bonds, and then 5 to 15 in alternative investments. Um let's see which does that all shows the structured output that would be parsed into a chart later on and the analysis goes beyond simple numbers by giving the why fixing provides diversification against US specific risks for instance and crucially the tool uses real-time information to inform its uh recommendation noting the AI bubble concerns and the slowing global growth projections this is the market capability in action. So again, this has the market sentiment and then it has um again another disclaimer and then at the very end it just gives you two um strategies again pros and cons again for both as I scroll and then a different set for the other strategy down here as well. And as you can see here, the latest market sentiment. This is a tool that uses the real-time information as you can read here to inform of the recommendation which is again the marketware portion of the capability of this engine. And then the end again another disclaimer that every output ends with the mandatory clear disclaimer satisfying the safety requirement. And then in terms of a reflection, my version one was very general in terms of the allocation recommendation that didn't have much if any market context or risk assessment. So in this version two, my improvement was to add the guardrail, the market sentiment data and the contextual scenario comparison. This transformed the tool from a basic calculator into an intelligent revisor that provides genuine contextual value. Um I think the hardest part was of the financial prompt engineering was the tension between user input and the need for safe regulated advice which is why I created the guard rail. Uh next in terms of the ethical consideration I'd say that the primary one was transparency and we addressed this in this model by ensuring the AI explicitly states it limitations and includes the mandatory clear disclaimer on every single output protecting both the user and the tool right down here. Then in terms of trusting the tool I say I would trust the analysis for comparing broad investment scenarios and understanding the why and the trade-offs between risk and growth. But I would not trust it with real money. That is an AI as it is an AI model. tool's primary purpose is to make the user smarter and better prepared for a professional consultation where they will actually trust that indiv individual to look into investment scenarios so they can invest in certain ones that they wish to invest."
}