{
  "student_name": "Anthony Kwon",
  "org_defined_id": "036288518",
  "username": "kwon273",
  "email": "",
  "transcript": "Hi everyone, this is Minhyuk, and in this video I'm going to walk through my full capital budgeting analysis for the proposed Starbucks flagship roastery project. I'll be following the DRIVER framework step-by-step and showing how I built my Python model to evaluate whether this ten-year, twelve-million-dollar investment creates shareholder value. Let's start with the Define stage. The question I'm trying to answer is simple: should Starbucks invest twelve million dollars today to build a roastery that will generate cash flows for the next ten years? The company's weighted average cost of capital is eight-point-five percent, and that becomes our hurdle rate. The central idea behind capital budgeting is: does the present value of the future cash flows exceed the upfront investment? If the answer is yes, the project creates value. If not, it destroys value. That's the decision we're trying to make. Next is the Discover stage. Here I collected all of the information I need before modeling anything. The initial investment is twelve million dollars, and Starbucks also commits five hundred thousand dollars of working capital at launch, which we recover at the end. Depreciation is straight-line over ten years. The tax rate is twenty-five percent. There's a three-million-dollar terminal value in Year 10. Revenues start at eight million in Year 1, rise to eleven million in Years 2 through 5, and then level at nine million in Years 6 through 10. Costs include forty percent COGS, two-point-five million in labor each year, eight hundred thousand in rent, and marketing which is three hundred thousand in Year 1 and one hundred thousand thereafter. The Discover stage ensures I fully understand the economic drivers before creating any formulas or code. Now moving to Represent. Before writing any Python code, I mapped out how the cash-flow model needs to work. Each year I calculate revenue, apply COGS, subtract labor, rent, marketing, and depreciation to get EBIT. Then I apply taxes to get NOPAT, and add depreciation back to get operating cash flow. Year 0 includes the initial investment and the working-capital outflow. Years 1 through 10 include operating cash flows, and Year 10 also includes the terminal value and the recovery of working capital. For evaluation metrics, I decided to compute NPV, IRR, profitability index, simple payback, and discounted payback. For sensitivity analysis, I planned to test revenue decreasing by twenty percent and WACC increasing or decreasing by two percent. Represent is the blueprint that ensures the model is clean, transparent, and accurate before I start implementing. Now I'll move into the Implement stage. Here I'll show parts of the Python model. I structured all key assumptions as separate variables so they're easy to change later. I built a cash-flow function that automatically creates all eleven years of free cash flows, including Year 0, the operating period, and the final year adjustments. Then I created custom functions for NPV, IRR, profitability index, payback, and discounted payback. The IRR function uses a Newton-Raphson approach because newer versions of NumPy don't include np.irr anymore. After building the engine, I ran the base case and printed out all the metrics. I also generated a table for Year 0 through Year 10 cash flows, and created two visualizations: a bar chart of cash flows and an NPV sensitivity chart based on WACC changes. All of this runs automatically once the model is set up. Next is Validate. This is where I check whether the model behaves logically. First, depreciation is consistent: one-point-two million dollars each year for ten years. Working capital is deducted in Year 0 and added back in Year 10. Terminal value is correctly included only once. Year-to-year cash flows are reasonable and turn positive immediately, which fits a premium roastery concept. Discounting is applied at eight-point-five percent across the entire period. And most importantly, the sensitivity analysis behaves exactly as expected: lowering revenue reduces NPV, and increasing WACC also reduces NPV. With these checks, I'm confident the model outputs are reliable. Now let's move to Evolve. Here I think about how this analysis could be extended. Capital budgeting isn't just about NPV numbers—it's a decision-making framework. This project could be expanded by layering in scenario ranges, inflation, geographic risk, or uncertainty in operating costs. The Python model I built makes it very easy to run those variations. One thing I learned is how scalable this modeling approach is. With a few changes, Starbucks could test multiple locations, different store formats, or different pricing assumptions. Evolve helps me think about the bigger decision context, not just the math. Finally, Reflect and the recommendation. Here are the financial results from my model: the NPV is positive, the IRR is comfortably above the eight-point-five percent hurdle rate, and the profitability index is greater than one. The payback period is reasonable given the project size. When I run the sensitivity analysis, even revenue decreasing by twenty percent still results in a relatively strong performance, and the project remains attractive at discount rates close to the base WACC. Based strictly on the financial results, the roastery creates shareholder value and should be accepted. Beyond the numbers, Starbucks' flagship roasteries strengthen the company's brand identity, enhance customer experience, and reinforce Starbucks' global \"third place\" strategy. The financial case is strong, but the strategic case is equally compelling. So my final recommendation is to move forward with the project. That concludes my DRIVER walkthrough and capital budgeting analysis. Thanks for watching",
  "video_url": "https://youtu.be/3J7i3KwvXsA"
}