{
  "student_name": "Andrea Typaldos",
  "org_defined_id": "036748997",
  "username": "atypaldo",
  "video_url": "https://youtu.be/LECmtJiuPc8",
  "transcript": "Hi, this is Andrea and this is session 11 assignment. In this session, I'm using the Tesla 5 billion gigafactory example to think like a CFO. Tesla needs $5 billion to fund a big expansion in Europe and it can raise that money with all equity, all depth or some mix of the two. The big question be behind all the math that I'm w wanting to answer is how does financing with equity versus depth change risk returns and incentives for shareholders, bond holders and management. So I'm doing it with the driver method like we've learned in class first to define and discover. On the surface the decision is just how should Tesla pay for this factory but with driver I define the problem a bit deeper. Tesla can either issue a new equity by del diluting existing shareholders to avoid fixed payments or issuing debt by keeping ownership concentration but adding fixed interests or choose a hybrid structure that splits the difference. The real issue is not only which is cheaper but who bears the downside risk and who captures the upside. So in define and discover I focused on incentives which are shareholders care about OEE and upside bond holders care about getting paid back and avoiding distress and managers care about stability growth and performance targets. Then I represent the problem with a simple logic. More depth means more financial leverage and in good times ROE can be higher because equity is a small a smaller slice. In bad times, equity gets a hit harder because interest is fixed. More equity means less leverage. So, it's a lower risk of bankruptcy and more flexibility, but returns to equity are less amplified. So, I summar summarize it as depth equaling amplified roe plus higher risk and equity equaling lower R or OE plus more safety and flexibility. That's the classic agency conflict that shareholders often like more risk and upside while bond holders prefer safer projects and stable cash flows. Then to implement I have a tiny leverage example in Python that you can see on screen. To make this concrete I coded a an example that keeps the business the same and only changes the financing same asset same EBIT only capital structures move. So when I run this, okay, I'm first going to explain the code. Here are the business in both scenarios which doesn't change. And then here is scenario A and scenario B. And here is what the um code prints. So uh when I run this scenario A which is the one with no depth has a certain base ROE with all equity and scenario B with 500K of depth at 8% shows a higher ROE even though EBIT is exactly the same business. That's the point that operations didn't change but the financing choice changed the return to equity holders. This is exactly why Tesla faces the Gigafactory. With more depth, shareholders can earn higher ROE in good times, but the firm moves closer to distress in bad times and bond holders take it take on more risk. Then I validate my code. I ask, does this simple model match the theory? The answer is yes. The code shows that leverage amplifies equity returns. No depth means lower or or OE and lower risk. And with depth, there's a higher ROE and a higher risk. That supports the idea that capital structure isn't neutral for incentives. Shareholders might push for depth to boost ROE and bond holders might push back demanding convenants or higher yields. Then I evolved. uh and to evolve I if I wanted to extend it I would add a bad EBIT scenario to show how quickly equity gets wiped under wiped out under high leverage and add an interest cover ratios or distress flags from the bond holders point of view and finally to reflect this session helped me stop thinking of capital structure as is debt better or is equity better and started seeing it as incentive design problem. The exact same project can look attractive to shareholders, terrifying to bond holders, or risky to managers depending on how it's financed. That's the heart of corporate decisions and incentives in session 11. Well, that's all for my session 11 assignment. Uh, thank you."
}