{
  "student_name": "Disha Rathod",
  "org_defined_id": "037279221",
  "username": "rathod3",
  "email": "",
  "transcript": "Hi, so this is my session nine assignment. So for the overview, so we want to calculate the weighted average cost of capital for Netflix in connection with a hypothetical $5 billion content investment decision. Your analysis must determine current WACC, evaluate the impact of additional debt financing, assess project specific versus firmwide discount rates, and compare Netflix costs of capital to industry peers. So our first stage is a define and discover. This stage focuses on clearly understanding the investment decision, validating the financial parameters and defining the strategic scope of the capital structure analysis. So for the problem, so Netflix is evaluating a hypothetical $5 billion content investment and considering funding $3 billion of this through new debt. To assess the viability of this investment in the efficiency of the funding strategy, we must determine the company's weighted average cost of capital. The analysis must determine if the returns justify the cost of capital and how increasing leverage impact shareholder value compared to peers like Disney. The goal, the objective is to produce a rigorous quantitative calculation of Netflix current and pro-form WACCC providing a strategic recommendation on capital structure optimization based on the trade-off between tax shields and financial distress costs. So for fact verification, so there's an analytical error in using book value of debt instead of market value when calculating WCC weights. So we need to verify that. So we need to verify this and utilize the market value of debt of $13 billion provided in the hypothetical parameters rather than the book value of $14 billion and in order to reflect the true opportunity cost of capital. So given that the high equity beta of 1.3 Netflix cost of equity will likely be high driving the WCC upward. However, the additional of $3 billion in debt at a relatively low cost of 5.8% 8% compared to the equity will likely lower the overall WCC due to the tax shield effects provided the added risk does not spike the beta or credit spread significantly. So um we want to confirm that the current risk-free rate of 4.5% and market risk premium of 5.5% aligns with the provided market context to ensure the CAPM calculation is consistent. So if the calculated weighted average cost of capital differs significantly from the media industry range of 8 to 10% the variance must be explained by analyzing specific risk factors rather than assuming calculation error. So some key questions to answer is what is Netflix current of equity using the provided cap inputs? How does the inclusion of the tax shield impact the effective cost of debt? How does the issuance of $3 billion in new debt lower the weighted average cost of capital enough to create shareholder value? Or does it introduce excessive financial risk? Why does Netflix WACCC differ from Disney's 8.2% and Amazon's 9.5%? And is this difference justified by their business models? And then lastly, should the $5 million investment be evaluated against the firm YWCC or a project specific discount rate? So the second is represent. Um so this stage outlines the analytical and technical steps required to calculate the WACC components and evaluate the strategic implications of the new debt issuance. So this analysis will be centered on the weighted average cost of capital formula to determine the hurdle rate and it'll be supported by the capital asset pricing model for the equity component. So cost of equity which is also capital asset pricing model. So it's risk free rate plus equity beta times the market risk premium. Then for your after tax cost of debt the formula for that is your pre-tax yield times 1 minus tax rate. And then for your weighted average cost of capital formula, it's your market value of equity divided by your total market value times the cost of equity. And then plus your market value of debt divided by total market value time cost of debt time 1 minus corporate tax rate. So for the analytical process, we have um multiple steps. So for step one, it's the component calculation and waiting. So calculate the cost of equity using the provided parameters of 4.5% plus 1.3 * 5.5 and then calculate after tax cost of debt. So which is 5.8% * 1 -21 and then determine current capital structure weights using market capitalization and market value of debt. Step two is a baseline weighted average cost of capital determination. So compute the current firmwide weighted average cost of capital and compare this result against the industry range to validate if Netflix is trading at a premium or discount to peers. Step three is your sensitivity analysis. So adjust the total debt to reflect the new $3 billion issuance and then recalculate the weights based on the new capital structure. um calculate the new weighted average cost of capital assuming the cost of debt in beta remain constant for this marginal issuance. And then you have step four and for this step we want to compare the calculate Netflix average cost of capital against Disney's 8.2%. Um then we want to deconstruct the difference. So is it driven by capital structure? So like Disney's 30% debt versus Netflix lower leverage or business risk or Disney's diversified revenue streams versus Netflix pure play streaming model. Then we have step five which is project specific risk assessment. So evaluate if the $5 billion content investment matches the firm's average risk profile and differentiate between domestic content versus international content. Then we have step six and that's a strategic recommendation to synthesize findings to recommend whether Netflix should proceed with the debt in issuance with the debt issuance and then address the optimal capital structure. So does adding debt move Netflix closer to an optimal point like lowering cost of capital or push it towards financial distress. After that we will go to the implementation step. So for this step, I have written a prompt in Gemini and I sent it in and it provided me with this code and then I exported it to Collab. So here's the code in Collab. So here you can see it gives you your market um uh capm your total debt equity beta bond yield tax rate um it shows the new debt issuance Disney uh WCC Amazon WCC media indust industry WCC both the lower and upper bounds and then it says calculate cost of equity so it gives you the formula of risk-free rate plus beta times market risk premium. Um then cost of debt after tax. The formula for this is pre-tax yield time 1 minus tax rate. Then it says to calculate WCC. So here it gives you formula. So total value equals market of cap E plus total uh cost of debt and then you have weight equity um which is market cap E divided by total value. Um so that's a CCC. And then for part two is the required analysis. So we want to calculate cost of equity then calculate after tax cost of debt and then calculate the current WCC. Um and then we want to determine WCC after $3 billion debt issuance. And then um assumption is that cost of equity and cost of debt remain unchanged. Um and then we want to recalculate WACCC with a new debt. And then um step three, so we want to evaluate project specific WACC um hypothetical beta adjustments based on the project risk. Um and then um we'll have a couple more steps and then um so we want to like um do the comparison to industry peers and then also recommend optimal capital structure strategy. So after running this code you get this output. So this shows Netflix with average cost of capital analysis. So cost of equity using CAPM is 11.65% 65% cost of debt after tax is 4.58%. For current capital structure, market value of equity is $200 million which is the weight of it is 93.9%. Market value of debt is $13 million and the weight is 6.10%. So Netflix current WACC is 11.22%. Then we want to calculate calculate the WACC after the $3 billion debt issuance. So the new debt weight is 7.41% 41% and new equity weight is 92.59%. So Netflix WACC after the $3 billion issuance is 11.13. So this WACCC actually decreased because the cheaper debt increased its share of the total capital. Then we want to evaluate a project specific WACC. So for the US content project when you have a beta 1.15 cost of equity is 10.82 to project specific WCC is 10.44. For the international content project beta of 1.45, your cost of equity is 12.47%. And project specific WACC is 11.99%. So the conclusion is that the international project has a higher discount rate um reflecting it higher systematic risk compared to the core US business. Then you have comparison to industry peers. So Netflix current WCC is 11.22% 22%. Disney's WACCC is given to us which is 8.2%. And Amazon Prime WCC is 9.5% which is also given to us and the media industry range is 8 to 10%. So Netflix WCC is higher than Disney's as we can see and this is because Netflix equity beta of 1.3 is significantly higher than Disney's estimated beta. So Disney uses a higher proportion of debt compared to Netflix which means that Disney um benefits more from the lower tax advantage cost of debt. Then we have the optimal capital structure strategy recommendation. So Netflix current WACC is your current WACC times 100. Um so the new $3 billion debt issuance lower the WACC. Um so recommendation leverage the analysis shows that the increasing debt lowers the WCC because debt is cheaper than equity given its strong um BBB plus ratings. Netflix is likely under level relative to its capacity for content investment. Using his cheaper debt to finance a $5 billion content investment is financially sound as it lowers the firm's overall cost of capital making more projects like the international content WCC economically viable. Um and then we have target. So Netflix should explore a higher long-term target debt to value ratio perhaps closer to Disney's 30% debt way to further minimize LBCC provided um the increased debt does not significantly raise the cost of debt. So that's the code and stuff. So back to the implement stage. So our goal was to execute the WCC calculation for the current state and the proforma debt ins issuance scenario. and we want to determine appropriate hurdle rates for the investment decision. Um so we made a Python code for it and ran it. So um the analysis established the cost of equity and debt. So using the CAPM formula um it got 11.65% and using the um cost of debt formula it got a 4.58%. So the um the significant spread between the cost of equity of 11.65% and cost of debt of 4.58% indicates a strong potential for lowering the overall co overall cost of capital by increasing the proportion of cheaper debt. So for the current WCC calculation using the market value of equity of 200 billion and market value of debt of 13 million. So equity your amount is 200 billion. The weight would be 93.9%. Cost is 11.65% and contribution is 10.94%. For debt the amount is 13 billion. The weight is 6.9% cost is 4.58% and contribution is.28%. So in total that is 213 million. The weight is 100% the cost um is your WCC and your contribution is 11.22%. So for scenario analysis the $3 billion debt issuance the model stimulated raising $3 billion in new debt to fund content. So new total debt is 16 billion new WCC is 11.13%. So the WCC decreased by 9.2 um basis points which is 09%. Then for a strategic comparison so for Netflix the WACCC is 11.2%. So it's approximately 6% debt which is underlever. Then for Disney you have a 8.2% WCC. So it's approximately 30% debt which is optimized leverage. And then for Amazon you have a 9.5% WCC which is a diverse business model. So analysis Netflix WCC is significantly higher than Disney's. This is primarily due to the capital structure. Disney utilizes a 30% debt load allowing them to replace expensive equity with tax advantage debt and Netflix uh relies on 94% equity financing keeps their hurdle rate high. Then we have V which is validates um so this stage checks for analysis and making sure everything makes sense and math is correct. So for logic checks, so the rule is that the cost of equity should be higher than the cost of debt and 11.65 is higher than 4.58. So it is correct. And then the other rule is that the WACC must fall between the cost of equity and cost of debt and 11.22 is between 4.58% and 11.65%. So that means that it's correct as well. And then for sensitivity logic check, so adding debt should lower WACC assuming the beta doesn't um deteriorate immediately. So WACC drop from 11.22 to 11.13. So this confirms the taxual benefit is functioning correctly in the model and then just some extra stuff. So um external benchmarking. So Netflix is a high growth tech um stock with a beta of 1.3. Uh WACC of 11.22% is consistent with this high growth um peers whereas Disney 8.2% represents a mature diversified um Kong array and the speed makes intuitive sense given the risk profiles. Then step five which is evolve and so this stage critiques analysis and suggests how it could be improved using dynamic variables rather than static assumptions. So the critique of static assumptions. So the constant cost of debt. So the current model assumes that bond yield remains 5.8% after issuing $3 million in debt. So in reality, increasing leverage might jeopardize the BBB plus ratings and a drop to BBB or BBB minus will increase the yield potentially erasing the WCC benefit. Then for the constant beta, so the model assumes that beta stays at 1.3%. So taking on debt increases financial risk for stakehold shareholders and we we should use the hammada equation to unlever the current beta and relev structure to see if the cost of equity actually rises offsetting the cheap debt. So for some project specific stuff so the model currently applies a flat international risk premium. So instead of a flat 2% adder, we should calculate a specific WCC for international regions by using country risk premiums for specific target markets like South Korea versus India versus France. Then the last stage which is reflect. So these are key takeaways and lessons that we learned through this. So the first key takeaway is that leverage is underutilized. So Netflix is currently inefficiently capitalized with only approximately 6% debt and it is paying a premium for its capital. The analysis proves that increasing debt levels um even by $3 billion lowers the hurdle rate and creates shareholder value through the tax shield. The second key takeaway is that one rate does not fit all. So the analysis highlights the danger of using a single corporate WCC for all decisions. Um so if Netflix uses the 11.22% firm YWCC to evaluate risky international projects, it may accept value destroying investments. So the recommendation is that adoption of a um hurdle rate um 11.22% for domestic content and approximately 13.22 for international expansion. The third takeaway is that the Disney gap is structural. Netflix cannot simply become Disney by borrowing money. Disney's lower WCC of 8.2% is driven partly by leverage, but also by lower business risk, which means it has lower beta. So, Netflix must accept a higher cost of capital as the price of being a pure play growth competitor, but it should still optimize its debt mix to narrow the gap. So, that is my session 9 assignment. Thank you.",
  "video_url": "https://youtu.be/EgMf-IaF54c"
}