{
  "student_name": "Jaime Lee",
  "org_defined_id": "037547486",
  "username": "lee4972",
  "email": "",
  "transcript": "Hey everyone, it's Jamie. And for this project I analyze Netflix's weighted average cost of capital using the full DRIVER framework. And I wanted to understand not just what Netflix's WACC number is today, but also how it shifts if they add more debt, how it varies from different types of content investments, and how it compares to their biggest competitors. And so starting off with the D stage, define the problem. I frame the core problem. Netflix is considering a big content investment and needs to know the expected return if the expected returns clear the WACC. That includes figuring out the current cost of capital, what happens if they raise an additional $3 billion in debt, and whether the discount rate should change depending on if the project is domestic or international. And because capital structure is always relative, a key part of the problem is stacking Netflix against peers like Disney and Amazon. Moving down here to Represent, which is where I organized all the inputs. I pulled together Netflix's hypothetical financials. A $200 billion market cap, $13 billion in debt, an equity beta of 1.3 as you can see over here, a 5.8% bond yield, and a 21% corporate tax rate. And for the market condition I used a four-and-a-half percent risk-free rate and a market premium of five-and-a-half percent. All of those got fed into the notebook. So calculations ran clearly and once I ran everything, I moved on to Implement. And in Implement, this is where I got the actual code. And the code actually starts doing the financial math as you can see. So the first thing I did was compute the cost of equity using the CAPM model: risk-free rate plus beta times the market risk premium, which makes sense for a high-beta, high-volatility media company. And then I calculated the after-tax cost of debt. Since the bonds yield 5.8% and the interest is tax-deductible, their effective cost of debt comes out to be around 4.6%. And that's important because the tax shield is a huge reason why debt can bring the WACC down. And next I implemented the scenario and I found that Netflix raises an additional $3 billion in debt, and that increases the debt weight from about 6% to a little over 7%. Because debt is cheaper than equity, the WACC actually dips down a little bit — 11.13%. The drop is small, but the key idea is that the debt is pulling WACC down despite the added financial risk. And then I calculated the project-specific WACC by adjusting its beta. And as you can see, for U.S. content, which is more predictable, I used a lower beta of around 1.1. That pushed the WACC down to about 10.119%. And for international content, which comes with more uncertainty — I used the beta of 1.45, and that brought the WACC up almost 12%. That difference is actually really meaningful because it shows that Netflix shouldn't evaluate every single project with the same hurdle rate. Risk varies by region as we know. And after implementing everything, we get to V — Validate — where I checked the calculations in the table just to make sure the math did make sense and the weights added up correctly. The CAPM output was consistent, and the after-tax debt cost lined up with the actual tax rate that we wanted, and nothing looked out of place. And moving down to Evolve here, I added the leverage sensitivity analysis to see how the WACC curve behaves as Netflix increases its debt ratio. And the graph shows a steady decline in WACC as you can see — as debt rises — up to a point, because debt is cheaper than equity. But once the debt ratio gets too high, the curve starts flattening out, implying the risk of financial distress offsets some of the benefit of cheap debt. And it shows exactly why companies target a sweet spot instead of just loading up on leverage. And finally I wrapped it up with R — Reflect — and this is where the code prints out the full summary. So I walk through results here. The cost of equity comes out to be around 11.65%, which reflects the high beta. The after-tax cost of debt was 4.58%. Current capital structure is basically 94% equity and 6% debt, which is extremely equity-heavy. And the current WACC is 11.22%. After the $3 billion debt issuance, the debt weight rises slightly and the WACC drops down to 11.13%, which shows the benefit of the debt tax shield. You know, the U.S. content comes out to around 10.19% while international content jumps around 12%. And then the peer comparison helps contextualize everything. Disney sits at about 8.2%, Amazon uses a corporate WACC of 9.5%, and the general media industry is usually around 8–10%. So that means Netflix is operating with a higher hurdle rate because investors view it as riskier and more volatile. And to end this reflection, I included a short personal takeaway down here. Working through this made WACC feel a lot more real than just a formula, as you can see. And seeing the way Netflix WACC shifts when it actually helped changes. And it has helped me understand why companies don't avoid debt and why they try to stay in that positive range. They use strategy, and breaking out U.S. versus International WACC also made it clear how different projects carry different risk premiums. And that helped me connect everything to actual corporate decision-making instead of just treating it like textbook math. Because everything has a different price. And we have seen these ranges fluctuate significantly through the DRIVER framework. And yeah, the DRIVER framework really helped me keep the analysis clean. The structure and the code helped me quantify every single step of the story — from capital structure to risk to strategic implications. And that wraps up my analysis. Thank you for watching.",
  "video_url": "https://youtu.be/Gq74MVC-EW4"
}