{
  "student_name": "Arianna Dilling",
  "org_defined_id": "036049965",
  "username": "dillinga",
  "email": "",
  "transcript": "Today we're going to be doing a GameStop case study, an investigation of market efficiency. We would like to investigate market efficiency using the GameStop short squeeze event of the 2020 to 2021 as a case study. Verify the accuracy of stated facts, analyze price behavior relative to the efficient market hypothesis predictions, and evaluate whether market anomalies constitute evidence against market efficiency or can be explained within existing frameworks. Our first critical step is going to be to verify the statement GameStop traded at 4 cents in August of 2020 against actual historical data. If incorrect, document the accurate figures and determine appropriate communication approach for correcting the professor. We also have an event timeline, some key data points and required analysis. In August of 2020, GME was near bankruptcy levels. In September of 2020, Ryan Cohen, the Chewy founder, acquires 13 per cent of stake. In January of 2021, Reddit users on r/wall street bets drove the price surge to $483. In February of 2021, congressional hearings on market manipulation were held. And in the present, postevent price stabil stabilization. Short interest peaked at 140% a float. Retail trading volume increased 10fold during the squeeze. Trading restrictions implemented at peak. Hedge fund Melvin Capital sustained 53% loss requiring bailout and analyst fundamental value estimates were between the 10 to 40 per share per share. Again, we want to verify all stated historical price data and documents. Document the corrections. We want to test which form of market efficiency was violated such as weak, semi- strong or strong. Evaluate whether rational investors could have profited systematically. We want to compare the efficient market hypothesis predictions to observed behavior and we want to assess behavioral finance explanations for observed anomalies. We're going to be working through the driver framework. And to begin, we're going to start in the divi defi define and discover stage. Our goal is going to be you to use GameStop's 2020 to 2021 short squeeze as a real world test of market efficiency. The key questions we would like to answer is are the stated facts true? Which EMH forms were violated? Was the GME surge a predictable or systematic event that a sophisticated investor could have profited from it before it happened or was a unique random outlier? Are the anomalies better explained by behavioral finance or limits to arbitrage? And was there rational factors or behavioral factors such as hurting, social media influence, and loss aversion? Now, we're going to discover some background um around this scenario. So, if you didn't know, GameStop is a brickandmortar video game retailer that's faced serious headwinds from the digital game distribution during the CO 19 pandemic. Many institutional investors believed that GME was on a decline path and took large shortselling positions, betting that the stock would fall because the business looked weak. By late 2020, GME had attracted attention for other reasons. For example, Ryan Cohen, the founder of Chewy, took significant stake in GME and and announced board changes, which turned some heads. Again, we have the events in August 2020 where the company share price was really low and was viewed as distressed. In mid to late 2020, we had um Ryan Cohen stake and hype around possible transformation which increased interest among some retail investors. In January 2021, that's when the surge begins and GME's price started rising steeply. Retail buyers from foreign such as Wall Street Bets joined in massive volume. There was the peak and the squeeze where the the uh share price went up in many multiples driven by a classic short squeeze which means that sellers were for forced to buy back shares adding fuel to the rally and approximately 140% of the public float was reported shorted. There was also broker restrictions including platforms such as Robin Hood which restricted buying of GME shares citing risk/clearing deposit issues. This triggered backlash and regulatory attention. In the aftermath, price fell from peak. Shore positions were closed and volatility remained elevated. The episode triggered major questions about retail trading and social media coordinization as well as market structure. Now that we've kind of defined our goal and took a look at the background and understood what this scenario is exactly referencing, we can take a critical first step. GME was traded at 4 cents in August 2020. From our re my research, we can see that this is incorrect. Um, adjusted postsplit Yahoo data shows that August 2020 was close to $1.67. That's about $6.68 pre-split, not $4. While it was very low, just not that low. The appropriate communication approach for correcting the professor would be that based on split adjusted Yahoo finance data GM's August 2020 monthly close was about $167. The stated figure of 4 cents appears to be an error and for this case study we will be using the split adjusted figures. Now we can move on to the represent framework. We want to visualize a systematic approach to testing market efficiency. So here we kind of have an advanced study timeline. We want to look at the 10 days prior to the event. We want to look at a key event of the start of the short squeeze and the 10 days postevent. We want to test for continued drip drift and delayed reaction. We want to take a look at our efficiency benchmarks. Strong efficiency such as abnormal returns, semi- strong efficiency such as returns complete with with uh within 1 to two days and weak efficiency which would be that drift continues for several day several days without new information. We also can do some return analysis such as normal return, abnormal abnormal return and cumulative abnormal return. We also want to look at behavioral indicators such as volume spike which may lead to hurting or attention bias or be caused by we want to look at multi-day shift a sign of overconfidence or momentum in trading or delayed correction the result of loss aversion and diamond hands mentality. So, our goal is to design a clear step-by-step plan to test our key questions from earlier using the available data and financial concepts. So, these are the three forms of market efficiency. We have a weak form where prices reflect all past price and volume information, meaning technical analysis does not work. This would be violated if the retail buying was based purely on momentum aka past returns and yet it still generated profits. Semi semi-trong form is when prices reflect all publicly available information. So fundamental analysis does not work. This would be violated if the price reaches $483 while the company's fundamentals remained around $10 to $40 level. price was clearly not reflecting the public fundamental value. Strong form is when prices reflect all information, including private information, meaning that insider trading does not work. This would be violated if insiders or early investors or Reddit moderators profited systematically for public awareness. We also want to be sure to look at behavioral finance biases. We're going to want to match one of the observed GME behavior to some of these psychological patterns. So the first one that um could be noticed is hurting. This is following crowd behavior rather than doing any kind of independent analysis. So if retail investors were um just following the crowd on Reddit on Wall Street Bets um we also have availability heristic which is investors would be relying too heavily on information that is easily available such as a screenshot or post on Reddit rather than dull financial analytics. There's also anchoring which is over relying on the first piece of information received. So this would be if investors were holding on to the idea that GME was a cheap stock even though that the price became extremely inflated. And then finally loss aversion. So hedge funds like Melvin Capital may be hesitant to cover up their short positions quickly due to the pain of realizing they've they've created a huge loss and therefore making the situation worse because they're choosing not to make a change. So now we can move on to the implementation stage and I think some Python calculations and visuals will be really helpful for kind of understanding analytically what happened in this scenario. So we have some abnormal return calculations as well as volume analysis and pattern identification. So here we have our GME market efficiency analysis. We have the 10 days before We have the event and then we have the 10 days after. We have market return, stock return, expected return and abnormal return. And from this we can see that before the event the average abnormal return was uh 15%. On the day of it was at 25% and then after the postevent 5-day total drift was 2.54%. The efficiency ratio is 90.79%. We also have our abnormal returns around the event chart which you can see this giant spike in percentage. We also have the cumulative abnormal return and we can see the percentage sits really low, spikes up and then is um very high. And then we have the um simulated trading volume around the event. And you can see that it's only a short term. Um it sits really low and then there's a lot of trading that goes on and then it um goes back to being low again. So from this we can see that the market is mostly efficient. prices adjusted quickly and there's possible behavioral or mo momentum or hurting detected. The abnormal returns measure how much the stock moved beyond expectations. The cumulative AR shows whether the market just uh kept adjusting after the news and the volume spikes suggest that there was crowd detention or hurting. Markets are mostly efficient but can still show short-term inefficiencies. And here's the code that I created in order to calculate this. Um, we've insert in um imported some um libraries and we've set up the scenario and simulated daily data around the event. And then we have the um days before and after. And then we have the table of the results, summaries, and then all of our visuals. So the next thing we want to do is verify the accuracy of historical price data and document the corre corrections. So I know we kind of discussed um what exactly went happened in the scenario in the um define and discover stage but it's important to clearly break down each part of the timeline and the key data to really understand what we're looking at here. So, it was true that GME was near bankruptcy levels um in August of 2020 and it was traded well below $3 and was in the single digits by late summer. And this is from a lot of this is going to be from the CEC and other financial websites. So in September of 2020 um as well Brian Cohen did acquire around 13% stake and then in January 2020 it surged to $483. This was um widely reported. I mean it was big news and um many financial news outlets were covering the GameStop short squeeze event. And then to be specific, the House Financial Services Committee hearing held fe on February 18th of 2021, um they had a hearing titled GameStop, who wins or loses in order to discuss the event. And then it is true that that short interest peaked around 140% of float. And then according to the CEC, retail trading volume increased 10fold during the squeeze. There was also trading restrictions implemented at peak um on January 28th. Brokers including Robin Hood restricted of buying of GME and other meme stocks due to clearing house margin requirements. And then Melvin Capital reportedly lost around 53% in January 2021 and received 2.7 billion in emergency capital injections from Citadel/.72. And then analyst fundamental values were estimated to be around 10 to 40 per per share. Now we can really um start to look back on the market efficiency hypothesis and test which form was violated. So as I described before um the weak form test if markets are weak form efficient you can't predict prices using past trends or volume. What we saw in this scenario is was that there was a strong upward momentum. prices kept rising day after day after the initial jumps and we saw that in some of the charts I created. Uh and same for the huge volume spikes which led to more buying the next day which showed a feedback loop and then retraders use it used past prices surge to signal that they should buy more. So from this we could see that the weak form of efficiency was violated. The past price movements or momentum did predict future short-term gains allowing trend following behavior not just a random movement. The behavioral explanation for this would be that this pattern reflects hurting overconfidence or fear of missing out. The traders bought prices uh bought because the prices were rising not because any new technical information was being released. for the semi- strong test. If markets are semi- strong efficient, prices instantly adjust to new public information. What we saw was that Ryan Cohen joined the board and the stock immediately jumped but kept rising for days. And during the short squeeze, prices surged far beyond the fundamental value, $40 to $483. And from the um cumulative abnormal return chart from the code that we generated, it showed that several days of positive drift were happened after the event. This means that semi- strong efficiency was violated. The prices did not immediately reach a stable or fair value after the news was released. Instead, they overreacted and drifted upward for several days, which means that information was slowly incorporated or distorted by the hype. The behavioral explanation for this was that investors were influenced by social media, Reddit and Twitter and confirmation bias. They were chasing narrative-driven trades instead of the fundamentals. No financial analytics. And then for the strong form, if markets are strong form efficient, even insiders can't beat the market because all information public and private is already priced in. What we saw was that there is no clear evidence of insider trading which drove this rally. Most of the surge was public and transparent. Um Reddit post, public filings and broker restrictions was all um available to the public and insiders like Ryan Cohen or executive did not trade immediately before major jumps. Therefore, the strong form efficiency was mostly upheld. There was no major advantage was proven and efficiency came from behavioral crowd effects not secret information and so well we can evaluate whether rational investors could have profited systematically. So systematic profit means that earnings that earning excess returns repeatedly and predictably not by chance. Rational investors are anybody any professionals using data valuation risk models not just their emotions. So under an efficient market this wouldn't be possible because prices already reflect all information. The rational investors could not systematically profit from the GameStop short squeeze. Although the stock was clearly mispriced due to relative relative to fundamentals, trading crition conditions and borrowing costs and volatility made arbitrage extremely risky. Short sellers were forced out due to unlimited losses while longside traders faced an unsustainable amount of momentum and massive downside risk. High transaction costs and unpred predictable timing prevented any consistent alpha. Therefore, despite temporary inefficiencies, rational investors were unable to exploit them systematically, illustrating the limits of arbitrage and the role of behavioral forces in modern market. So, based on what we've talked about before, the key idea here was that there was behavior and emotions that came to play. So finally we can compare the market hypothesis predictions to observed behavior. So the efficient market hypothesis predicts that prices should immediately reflect all available information and that investors cannot consistently outperform the market. However, in the GameStop short squeeze, this predict contradicted these assumptions. Prices continued long rising long after public news driven by retail hurting and social media momentum rather than new information. As we said before, this violated weak form and semi-runk efficiency as trends in public data produced abnormal returns for short periods. Although the short for for uh form remained intact, there was no insider trading evidence. The event proved that emotional and collective behavior can temporarily temporarily override rational price setting. The observed anomalies highlight how behavioral forces can create short-term inefficiencies even when it within an overall efficient market framework. So prices moved in predictable patterns. We had momentum which violated that weak form. Traders bought a dip or follow followed Reddit trends and profited in the short term. Prices rove slowly days after the board announcement and then exploded weeks later due to the hype. There was no insider trading. Rational s short sellers like Melvin Capital could not arbitrage due to extreme risks and margin calls. This shows that there's limits to arbitrage. Inefficiency persisted by being obvious. We saw the VA volume spike from social media hype, not the the new information. So, we know that it's behavioral trading, not informational. There's abnormal shifts that like returns uh abnormal returns lasted several days and the car chart chart showed persistent drift. And finally, we can assess behavioral finance explanations for observed anomalies. behavior fin uh finance explains the GameStop anomalies more effectively than traditional efficiency models. Hurting and social media uh social influence caused influ influencers to follow the crowd rather than analyze any specific values. Overconfidence and confirmation bias amplified speculative behavior while loss aversion delayed profit taking even as prices crashed. These biases produced extreme trading volumes, sustained abnormal returns and delayed price correction. all clear signs of behavioral inefficiency. Ultimately, the GameStop event illustrates that markets are not purely rational. They are driven by human emotion, social identity, and cognitive bias. And then again, we can the the specific observed an anomalies was momentum. prices kept rising which is explained by hurting and overconfidence creating the feedback loop that I mentioned before and that past winners continue winning in the short term. We have the post-event drift slow correction which is confirmation bias delayed selling loss aversion prevented exits. We have extreme volatility and volume such as hering FOMO and mental accounting drove the excessive trading. We have detachment from the fundamentals, narrative investing and echo chambers erode valuation logic. We could finally move on to the verification stage. The first one we can do is some statistical verification. We can answer the questions are abnormal returns significantly different from zero. In our simulated GME example from the Python code, the event AR is extremely unlikely to occur occur by chance and this confirms a signific statistically significant reaction, not just some random movement. We can also do some economic verification and answer the question that our profits la large enough to overcome transaction costs and during the GME event, transaction costs and borrow rates are skyhigh. And so even though abnormal returns existed, economic significance was low for rational investors because there was real world frictions that erased potential profit as well. We can we can take a look at persistence. Real inefficiency should not repeat across time or similar stocks. But when researchers test other stocks such as AMC, Bed Batheon, and Blackberry, each showed brief price surges and then a rapid correction. So there was no persistent strategy generated by a repeated alpha as well. Um we took a look at a bunch of different um resources. We used Yahoo Finance for historical prices, the CEC staff report for short-term and interest or short interest and volume and then congressional testimony for timeline accuracy. And now we can move on to the evolve stage. What are some things that we can improve on moving forward? This project can evolve into deeper studies of market behavior, social sentiment, and investor psychology. Future research could explain the event study to include multiple meme stocks. We could take uh other scenarios similar to this or apply textbased sentiment analysis to collect ongoing discussions and trading patterns. So we could take a look at what kind of um discussions and insights that these re Redditors are making their decisions based on and then additional valuation using statistical testing or machine learning to test whether behavioral signal signals predict short-term price changes challenging the weak form efficiency. These extensions would transform the GameStop study from a single case analysis to a broad exploration exploration of human behavior, social media, and technology to reshape modern market efficiency. And finally, we can move on to the reflect stage. I just want to reiterate some key points of this case study. When it comes to market efficiency in behavioral finance, it challenges the notion of the market as always efficient because here we had very public information, heavy short interest and yet extraordinary price behavior. It shows how behavioral biases such as hurting, limited attention, momentum, plus structural structural friction such as short borrow, clearing costs influence the markets. We have both of these things um coming to play. It highlights that even a fundamental model says that even if a fundamental model says the stock is weak, other forces such as social and technical can dominate in the short term. From an investment strategy perspective, it's a reminder that active trading in these extreme phenomena is extremely risky. Profits may exist, but so do large losses and unpredictability. This project showed that markets are mostly efficient over time but can temporarily uh can become temporarily irrational when human behavior and social dynamics take over. The EMH holds long-term prices eventually return to the fundamental value. Behavioral forces dominate in the short term. Hurting and FOMO create dramatic inefficiencies and there are limits to arbitrage. Even rational investors couldn't profit systematically because of volatility, risk, and restraints constraints. Together, these insights demonstrate that market efficiency isn't just all or nothing. It's a spectrum affected by information, speed, investor behavior, and structural limits. And finally, I'd like to touch on some of the challenges of this case study. Um the biggest challenge was really verifying um historical price data and correcting misinformation such as the $4 in 2020. Um because there's a lot of information on this and some of them might contradict each other. Um it took a lot of research. And then understanding the uh stock split adjustments and how reported price differ across sources required careful checking with Yahoo Finance and CEC. similar to what I just said. Um again, there's a lot of research that goes into um verifying some of the um the timeline and the key data points as well. Implementing the Python calculations efficiently was a bit difficult. Um it took a lot of research on cumulative abnormal return and um volume spike and what that all means. And then quantifying psych psychological factors using real data remains an analytical challenge. Um a big part of this project was really understanding um investors behavior and um it was a bit difficult trying to explain that in an analytical way. So I hope I really touched on all the different points and aspects of this project and I hope you learned something.",
  "video_url": "https://youtu.be/XhTIxgFvuJA"
}