{
  "student_name": "Noah Azevedo",
  "org_defined_id": "036596149",
  "username": "nazevedo",
  "email": "",
  "transcript": "Hi, my name is Noah and uh for this assignment we're going to focus on session 10 which is capital budgeting and investment decisions and specifically for this assignment uh we are going to do an analysis on the cost of capital. So the context and objective of this assignment as a whole is that we have to evaluate Starbucks proposed flagship roster that requires a 12 million upfront outlay and is expected to operate for 10 years. So to do this, we're going to use the firm's 8.5% walk as the hurdle rate to determine whether the product creates value and then use that to recommend an accept or reject decision supported by uh the driver framework. And um specifically for this assignment, we have to focus the analysis on producing a transparent cash flow model, core capital, budget metrics, sensitivity test, and an executive ready recommendation. Uh as you can see here, we have all uh the project parameters, but I will go into detail using the drive method. Uh so I'll go in more detail as we go through this video. So in the first method we have to define and discover and uh the objective is to tell the executives at Starbucks if spending 12 million today to build a flagship grocery is a smart financial move. So this is the the the yes or no question and the decision will be based on the net present value rule. So also known as the MP rule. So what is that? Uh essentially if the project generates more value in today's dollars than it costs we will accept it. If not we reject it. So um really basic uh as a whole and in the define and discover stage we have to kind of know what we know what we don't know and um and yeah so here we have the parameters of the known so this is every piece of data that we have to catalog. So we don't miss anything before we actually start coding. So we have the the timeline and investment. So we have the project lifespan, the upfront cost, uh the working capital for zero year zero, the working capital recovery for year 10 and uh the depreciation and uh we have operations which is uh money coming in versus going out. So this includes uh revenue uh cost of goods sold, labor, rent and utilities and of course market. And uh we also have the financial rates and value. So the tax rate uh the discount rate so the the weighted average uh cost of capital which is the walk and which serves as our hurter rate which the the project must return more than this. And uh at at the end we have also the terminal value. And then we also have the unknowns which is uh the free cash flow for years uh 1 through 10, the net present value, the IRR which is the internal rate of return, the payback period uh simple and discounted and uh the profitability index and the sensitivity analysis. So uh considering if revenue drops or if the hurdle rate uh were to to be higher or lower and uh why do we need this? So what is the point of all this? So imagine you're buying a very expensive lemonade stand. The fine phase is where we list the price of the stand. So the initial investment, how much lemon and sugar cost, so the operating expenses and how much we plan to sell it. So the revenue but there is a catch. So a dollar earned 10 years from now is worth less than a dollar uh today due to inflation. So we need to define our discount rate the one which acts like an exchange rate to translate future money into today's value. With all of this already defined and and uh kind of set up, we we have it perfect to to move on to the represent stage where the objective is to structure our logic into three distinct blocks. So we have the inputs, the cash flow engine and the metrics. In uh the case of the logical formula which serves as the engine, this is the most critical part of the assignment. So if this formula is wrong every metric that we mention so the the uh net present value in the irr will be wrong and uh for every year we have to calculate three things. So the operating profit as you can see here the net operating profit after tax and uh the free cash flow which represents the actual spendable cash the project generates. But we have two exceptions. So we have uh year zero and year 10. So the first and last year uh and why is that? So in year zero we only have the initial investment and the initial working capital. So no there's no uh actual revenue yet. And in year 10 in addition to the normal operations, we add the terminal value. So selling the building and the the working capital recovery. So getting getting the money back. And with this all defined, we can already start structuring the Python code uh without actually starting to code yet. And um we would do it the following method. So we would have the setup so the data dictionary. So we store all our nodes so all the inputs from step one uh in a dictionary or variables and this allows us to change one number uh like walk later and then everything will will update um automatically. We have the the schedule construction. So the arrays where we will create a list uh representing uh your zero through year 10 for each uh line item. And as you can see here, this would be the the the arrays that we would use. And uh we would have the calculation route for where we would calculate the tax bill and then find the final FC FCF for each year using the formula above. And um then with um the last phase would be actually what I mentioned about uh the the time value of money. So discounting it So it is put in today's um dollar. So once we have the the FCF for all 10 years, we apply the discount factor which would be the following. And now with this all kind of defined, we can then go to the implement stage uh where I can show the code right now. And essentially and essentially it kind of just repeats what I what I talked about. So we have the nose uh the the arrays the the cash flow engine and then uh the cash flow the free cash flow calculation you know all the metrics and and and how we're going to do that. And uh the first part here we would get this this would be the original um information that we would get. So here we get the cash flow for each year uh and uh fundamental things to know about and we would then get a a whole graph which shows the free cash flow where uh in the first year we spend a lot of money but as the years go by uh we get a positive flow of cash. And now this kind of uh evolves because um once I enter the validate um point of my my actual code, I started thinking to myself, well, is this project fragile? And as I mentioned, we can see a mass massive outflow in year zero, which represents the red color. And then consistent positive cash flow green in a large liquidity event in year 10 where we sell the assets and the numbers you could have seen in the graph but I I wanted to separate it here the document where the net present value is positive uh the IR is higher than the box. So theor theoretically with that we would already approve of the project and um what I I wanted to to to focus on also in the the original code is my aha moment in year one. So uh EB EBIT is zero taxes are zero and um the free cash flow is positive and why so in year one the operating profit exactly matches the depreciation expense. Starbucks made accounting zero where every expense must be justified from a zero starting point. So Starbucks paid no taxes but still generated 1.2 million in cash because depreciation is a non-cash expense. And um with this original code uh executives will will ask uh the following potentially. So what if nobody likes the coffee in the sales job and um what if interest rates go up and the original code doesn't uh really consider that that's where the sensitivity analysis part comes in. So I performed a stress stress test model uh against scenarios requested in the prompt. So what are these scenarios? So we have one scenario which is the revenue scenario. So what if uh revenue is 20% lower than expected and the walk scenario is what if the walk is lower or higher. So in the second part of the code we add that and uh we kind of test that as you can see here in this analysis part. So running the the actual scenarios and then recalculating everything where this would be step four where I kind of skipped on the first part. That's why I did that because I I essentially changed a little bit of the code uh in my validate stage when I started thinking about how sensitive the project actually was. So uh essentially we get this second part of the code here where we we have the best case scenario uh revenue at u lower than 20% than what we expected walk being lower and walk being higher and here we get the net present value the IRR and then uh essentially the decision where the only rejection would be if revenue were lower. So here you can see how uh that would how specific things would have a very direct impact on the net present value. So going back the best case scenario uh we make 3.02 02 million and uh in the worst case so in the revenue being 20% less we lose uh 2.75 billion and uh this kind of reviews that the project has high operating high operating leverage. So because the fixed costs so labor rent and appreciation are high and do not change when sales drop a small drop in sales can cause massive drops in profit. So essentially what what does this all mean? So based on the financial uh data where we go on the evolve step I recommend accepting the project but with a strict warning regarding revenue volume. So in the financial value in the best case the project clears our 8.5% hurdle rate and generates 3 million in value. In the strategic value, as a flagship grocery, this location acts as a billboard for the Starbucks brand. Even if it breaks even, the market value is significant. And the only risk is that the project is highly sensitive to revenue. So, a 20% drop in sales could turn it into a 2.75 million loss. So in conclusion, we should proceed and um we should proceed as uh three out of the four um simulations that we did the the project or the decision is to accept the project but we must lock in long-term marketing strategies to ensure foot traffic does not dip below 8 85% of our target. So we have to be very careful uh in the marketing part of it to really uh be able to reach a a a revenue that is acceptable. Lastly in uh reflect essentially what I did was a reflection on analytical learning and uh highlighting the power of the driver framework by defining the inputs first. I avoided hard coding numbers and this made the sensitivity analysis very instantly. So instead of having to change the code as a whole and having to update it, I simply had to add a second part to it uh that me and Gemini produced just really copy and pasteed and all the numbers automatically uh work together. And uh when considering whether this problem could be solved using Python or Excel, Python was superior because it allowed me to simulate the 10 years of complex tax logic in seconds. And then uh and in comparison, doing the sensitivity uh analysis manually in Excel would have taken an hour and here it took four lines of code. So yeah, this has been my work. I'll uh just show again the the whole the numbers but and also mention that we installed uh numi financial to be able to actually use the formulas that I mentioned below. So uh here we can even see the uncomment the line if running collab for the first time because before it was with uh the hashtag which u acts as the comment. So yeah, thank you so much and this has been my work.",
  "video_url": "https://youtu.be/dk1UN-M6ZCo"
}