{
  "student_name": "None None",
  "org_defined_id": "038014499",
  "username": "eliban",
  "video_url": "",
  "transcript": "0:00\nHi everyone, I'm Liz. I am a accounting\n0:04\nstudent in management 310 and this is my\n0:08\nmini project 3 submission building an\n0:10\nadvanced AI finance tool. So again this\n0:13\nassignment is comprised of building a\n0:16\nmore advanced AI finance tool using N8N\n0:19\nor another platform. I was not able to\n0:22\nuse N8N mainly because of uh my free\n0:26\ntrial ending from mini project 2.\n0:28\nHowever, I also thought that Replet\n0:31\nwould be a better platform in terms of\n0:34\nhaving more control over the logic\n0:36\ninstead of just connecting things\n0:38\ntogether. So, I chose Replet for this\n0:42\nassignment.\n0:44\nAnd um here we're looking at a mini\n0:48\nproject progression, right? So, first we\n0:50\nwent um you can build things with mini\n0:53\nproject one. Number two is you can build\n0:55\nuseful financial tools. And mini project\n0:58\nthree is more in the I'll be able to\n1:01\nprovide advice and decision making\n1:05\nthrough AI. So\n1:08\nwe're going to get started with the\n1:10\ndriver framework once again and the\n1:12\nfirst stage is the discover phase. So, I\n1:16\npersonally realize that most finance\n1:18\ntools just give you raw numbers like a\n1:20\nPE ratio, but they don't really tell\n1:22\nbeginners why that ratio or that number\n1:25\nmatters or even the story behind that.\n1:28\nSo, I wanted to build a tool that uses\n1:31\nAI to provide that context. So with this\n1:36\nI was able to build first more on the\n1:39\nimplement stage a python\n1:43\nmore in the represent stage rather um a\n1:46\npython\n1:48\ncode that also integrated streamllet and\n1:52\nthis is kind of the base of what I'm\n1:53\ngoing to put into replet in order to\n1:55\ngive replet more context of what I want\n1:59\nthe page to be. So here we go. uh how\n2:04\ndid I integrate the advanced AI\n2:06\ncapabilities required for this\n2:07\nassignment? First was external data\n2:10\nintegration. So if you look here at the\n2:13\ncode, I used Y finance and I imported it\n2:17\nas YIF. So I'm not really asking the AI\n2:20\nto guess stock prices. I am\n2:23\nprogrammatically\n2:25\nfetching real-time market data. So this\n2:27\nreally prevents hallucinations from the\n2:29\nAI. And then second is the reasoning\n2:32\nloop. So down here is my prompt\n2:35\nengineering.\n2:38\nI'm injecting that real-time data into\n2:40\nthe prompt and instructing the AI to act\n2:43\nspecifically like a value investor. I\n2:46\nforced it to give me a structured\n2:49\noutput,\n2:50\na business model summary, a valuation\n2:53\nanalysis, and specific risks.\n2:57\nAnd with that, we're able to create a\n3:00\nmore concrete base that I'll be able to\n3:03\nput into Replet. And that would be my\n3:05\nmain implement stage.\n3:09\nAnd here's the rest of my code uh that I\n3:11\nwas able to do. And for the rest, it's\n3:14\nmore on like calling the AI. I am using\n3:18\nGemini instead of Open AI. And that's\n3:21\nmainly because I'm not able to test the\n3:23\nOpen AI key. I'm only able to test the\n3:27\nGemini key due to my subscription with\n3:30\nGemini. Again, if I had um the means to,\n3:35\nI would be using OpenAI just because um\n3:37\nof its prevalence as well. However, I\n3:40\nthink Gemini is a great option to use.\n3:43\nSo, moving forward, this is when um I\n3:47\nput that code into the value investor AI\n3:50\nfor um in Replet. So now we're moving on\n3:54\nto the implement stage and really going\n3:58\nto see what our app could look like. So\n4:01\nagain, I put that um represent into\n4:05\nimplement and with the help of replet\n4:08\nassistance, I was able to create a more\n4:12\nstreamlined and visual web app. And\n4:17\nagain, this would be the value investor\n4:19\nAI. And now we'll verify it to in\n4:24\naction. So I'm going to open it in a\n4:27\nseparate tab. This is my Google Gemini\n4:30\nAPI key that I put separately just\n4:33\nbecause again this is not something that\n4:35\nyou would want to share. Um and then I\n4:38\ncan put any symbol. Let's start with\n4:41\nMicrosoft.\n4:42\nI click um analyze stock and you can see\n4:45\nthat it was able to fetch the data from\n4:48\nY Finance um of what the Microsoft\n4:51\nCorporation's current price looks like,\n4:53\nthe PE ratio, plus a more in-depth\n4:57\nanalysis of um Micros of Microsoft's\n5:00\ndetails. So there's that value investor\n5:03\nanalysis that we're looking for and AI\n5:06\nis telling that their take on Microsoft\n5:08\nis number one again the business model.\n5:12\nSo it says here that imagine Microsoft\n5:14\nas a giant toolbox in a mass massive\n5:17\ndigital landlord. The toolbox is you can\n5:20\nread it from here and it basically says\n5:23\nthat Microsoft helps people and\n5:25\nbusinesses be more productive and\n5:27\nentertained. So that's correct as you\n5:29\nknow as everyone knows Microsoft is that\n5:33\nhas that business model. And then for\n5:35\nthe valuation analysis, that's number\n5:38\ntwo on the prompt engineering that we\n5:40\ndid. Um we look at the trailing PE ratio\n5:43\nof 34.60. And again, because this is Y\n5:46\nfinance, we're also able to integrate\n5:49\nthat verify stage um into this implement\n5:52\nstage because we know that all of this\n5:54\ninformation is correct. And knowing\n5:56\nMicrosoft as well, we know that all of\n5:58\nthis information with the business\n6:00\nmodel, with just how Microsoft is,\n6:02\nthey're all correct. So this is kind of\n6:04\nimplement plus verify stages together.\n6:07\nSo with this we are also able to see\n6:10\nlike from a value investors perspective\n6:13\nthe price isn't screaming bargain. It's\n6:15\nnot necessarily absurd for a company of\n6:17\nMicrosoft's caliber. Um however it\n6:20\nleaves little room for error. So if\n6:22\nyou're paying a premium for quality and\n6:24\nanticipated growth and that growth\n6:26\nfalters or if competition intensifies\n6:29\nmore than expected, then you could\n6:31\nprobably face that stock downward\n6:33\npressure and it must mean that you're\n6:36\nbuying some great business, right? But\n6:38\nit's not necessarily at a great price.\n6:41\nSo that's the valuation analysis. And\n6:43\nnumber three on our prompt engineering\n6:45\nthat AI perfectly shows is the major\n6:48\nrisks. So with major risks we're able to\n6:52\nsee that for Microsoft here are some key\n6:55\nconsiderations and it lists down\n6:57\ndifferent considerations or risks that\n7:00\nuh we were able to identify um with AI.\n7:05\nSo again, um this is basically what AI\n7:09\ndoes. And of course, um thinking about\n7:12\nAI and kind of moving into that\n7:14\nreflection stage. Really to wrap it up\n7:17\nwith evolution and ethical\n7:19\nconsiderations, I address the risk of\n7:22\noverrusting AI by hard coding this very\n7:26\nclear disclaimer at the bottom. And even\n7:29\nwhen you don't put the stock t stock\n7:33\nstock ticker symbol, you're able to see\n7:35\nthis very clearly. And I'll show that\n7:37\nfor you right now.\n7:40\nSo remove that. You're able to see this\n7:42\nyellow bright disclaimer. It says this\n7:44\ntool is for educational andformational\n7:47\npurposes only. It does not constitute\n7:50\nfinancial advice, investment\n7:52\nrecommendations, or an offer to buy or\n7:54\nsell any securities. While obviously AI\n7:58\nhas given a lot of good recommendations,\n8:01\nit is still up to you to consult with a\n8:04\nqualified financial advisor before\n8:07\nmaking any concrete investment\n8:09\ndecisions. And if you do\n8:12\nmake any decisions based on what AIS\n8:15\ntold you, that's in your own discretion\n8:18\nand it is not the liability of my web\n8:21\napp um in case anything happens. So\n8:25\nagain, this tool is for education, not\n8:28\nfinancial advice. The hardest part of\n8:30\nthe prompt engineering was getting the\n8:31\nAI to be critical. And that's because AI\n8:35\ntends to be too nice, right? By telling\n8:37\nit to look for risks, I made the tool\n8:40\nmuch more objective. That's kind of\n8:42\nanother side. Not just telling the\n8:44\naudience that, oh,\n8:47\nwatch out for AI. I'm also telling AI to\n8:50\nbe more objective by looking at the\n8:52\nrisks. So overall, this project showed\n8:56\nme that the future of finance isn't just\n8:58\nabout calculating numbers, but it's also\n9:00\nabout using AI to interpret them and\n9:02\nbeing able to get a lot of information,\n9:06\nput those into more consumable words of\n9:09\nadvice. So I would say this is a very\n9:13\nfruitful project. I saw the progression\n9:16\nof my mini project one to mini project\n9:19\ntwo to mini project three. and I'm\n9:22\nlooking forward to what's next,\n9:23\nespecially for the capstone project.\n9:26\nThank you very much."
}