{
  "student_name": "Priya Gaddam",
  "org_defined_id": "037145385",
  "username": "gaddam10",
  "email": "",
  "transcript": "Today we'll be looking at the weighted average cost of capital for Netflix. So the first step to find discover we're going to define our goal. So the primary goal is to calculate the current and revised weighted average cost of capital for Netflix to determine the appropriate discount rate for a hypothetical 5 billion content investment. And this analysis will also assess the impact of additional debt, evaluate project specific risks, and compare Netflix's cost of capital against key industry peers such as Disney and Amazon Prime Video since they're a good um indicator of how Netflix is doing since they're also very big in the content streaming market. So, we were also given some data. We were given um Netflix's market capitalization value, their total debt and their equity beta. And we were also given their corporate tax rate, the market risk premium, but some of the other things um that had to be searched for um and this was like provided pure data. So next we have to identify requirements. So this analysis must satisfy four major requirements. The WACC calculation to compute current um current rates, market weights and the weighted average cost capital and also capital structure analysis. We have to calculate WACC's after debt using beta relevering and we also have to assess optimal structure. Third is project specific WACC. We have to evaluate risk adjustments for international content. And then four peer comparison and strategy. We have to compare WACC to Disney and Amazon and recommend an optimal financing strategy. And then five technical we have to implement all calculations in Python including sensitivity analysis and visualization. So the second step represent so first is a model formulation the discount rate framework and so this analysis relies on two fundamental financial models. So cost of equity, we have the formula for that here. And so this is a capital asset pricing model. And then after tax cost of debt, here's the formula for that. And this incorporates the debt tax shield benefit. And then the weighted average cost of capital, which is the main thing, um the formula for that, and then the weighted average of the cost of all capital sources. And here's the Python code. This also includes all the parameters that we were given and the data for the other streaming platforms that we're going to compare Netflix to. Um, we just have this there so the code knows what values to use when it calculates the equations. And so here is the cost equity formula, the after tax formula, and then WACC that formula as well. And so second, the capital structure adjustment. So we're going to assess the impact of the new debt insurance, but we also have to calculate the asset beta to see if the business is risky or not and then relever to find the new equity beta as well. But before we do that, we can find the values of these metrics with code. So scenario one, the cost of equity would be 11.65% 65% and the after tax cost of debt that would be that would be 4.58%. And then the equity equity weight would be 9390. The debt weight would be 0610 and the current WACC would be 11.22%. So yeah, so we have asset betas and then there's a formula for that and this isolates the business risk from the financial risk and then equity beta the formula and then this incorporates the risk of the new capital structure. So again in the code we have those formulas implemented in the code asset beta would be 1.2365 2 365 and then the third scenario the Python code will find these. So scenario one, the current WACC. So we're going to calculate it using the initial um investment and then um 13 billion. And so scenario two, the post at WACC, we're going to be calculating using the new values and then the unlevering and relevering beta. And then the project risk assessment, we're going to be assuming a risk premium is added for international content projects. And then we'll rele relever that. And then sensitivity analysis. So we're going to vary equity beta from a dollar to a dollar60. And then the market risk premium from 0.45 to from 4.5 to 6.5. And then for optimal structure modeling, we're going to model the WACC for debt levels. and then visualization we can plot the values to see how they interact with each other. So here were the different scenarios and then the values for each scenario so we can see how it differs. So the first scenario that be the cap the current capital structure and then scenario two the WACC after 3 billion debt assurance and then scenario three project specific WACC for international content. So we can see how those differ using the formulas we had and then the different values the different inputs for each formula. And then the peer comparison we can see how the weighted average cost of capital differs with Netflix's being the highest and Disney's being the lowest. And we can also plot these. And then here is the graph that um shows the WACC's and plotting that against the debt to capital ratio. We can see how it's downwards curving and then the current debt to capital ratio is plotted up here and then the post debt is um down the implementation was executed in the Python script. And so this is just a recap of the results we got from the Python code that I just talked about. Next, verify the calculation checks. So the weights, the cost hierarchy, the leverage effects and pure comparison, we can compare that to existing data and our calculations match the existing data. And then sensitivity analysis, the output summary. The Python script demonstrates that the WACC is highly sensitive to the equity beta. And so a $10 increase in the beta would increase the WCC from 11.21 to 11.80. And this confirms that Netflix's valuation is primarily driven by market perceptions of its business business risk as reflected in its high equity waiting and high beta. Now evaluate. So we're going to compare it to industry peers. So again, we're going to compare it to Disney and Amazon Prime video. So Netflix's WACC of a dollar.21 versus Disney's WACC of a dollar.2. The difference is that Netflix's WACC is significantly higher. And the explanation for this is that Disney has a more mature, diversified, and stable business model because they have parks, media networks, and studio. And so the explanation for this is that Disney has a more mature, diversified, and stable business model. For example, they have parks, media networks, and studio entertainment. And so their costs are spread out over a lot more objects than Netflixes is. And so this also leads to a lower business risk. And furthermore, Disney operates at a lower WACC partly due to a higher utilization of the debt tax shield. And so now Netflix's WACC versus Amazon Prime Video's WACCC. Um the difference is is that Netflix's is higher again. And so the explanation for this is that Amazon Prime Video uses the massive highly diversified Amazon corporate WACC and Amazon's core retail cloud business provides a significantly lower beta and overall cost of capital than Netflix's focus streaming business. So both Disney and Amazon have multiple platforms, not just streaming. And so as a result, they can spread their costs out over all their platforms, whereas Netflix, it's primarily just streaming. And so all their costs go to that one um enterprise. Two, the optimal capital structure assessment. The visualization in the Python script confirms that the WACC is currently near its minimum or still declining at the current leverage level and adding the debt had a negligible sly positive impact. It did lower the WACC a little bit but it was mostly negligible. And so the conclusion is that Netflix is severely underlevered and is missing out on substantial cost savings from the tax deductibility of interest payments. And the current leverage is far below what would be considered the optimal structure uh which for this industry is likely in the 20 to $30 debt range. And so three, the divisional cost of capital concept. The analysis correctly identified that a firmwide WACC should not be used for all content projects. For US content um which is a lower risk since that's where Netflix um became popular in the domestic market. A discount rate close to WACCC $11.20 20 might be more appropriate, but for international content, which is a higher risk, the higher project specific WACCC of $1242 must be used. Um, and using a firmwide WACC would lead to the underdiscounting of riskier international projects, which could potentially result in value destroying investments. So, finally reflect. So, first the discount rack recommendation. So the recommendation is to use the WACC's calculated after the debt insurance but apply a a project specific risk adjustment. So for the content investment um the base rate for domestic $1120 and then for international content $1242. Um, and so the principle here is to use the divisional cost of capital and a single firmwide rate would incorrectly favor high-risisk projects while penalizing real risk projects. And then two, the optimal capital structure and financing strategy. So Netflix should proceed with the $3 billion debt insurance and the optimal financing financing strategy. Um, the content investment should be financed primarily through debt until Netflix reaches a target debt to capital ratio of approximately $20 to $25. And so the trade-offs here is that they benefit from a tax shield. And so the primary benefit is the interest tax shield which lowers WACC and as a result increases firm value. Um, but there's also a risk of financial flexibility. And so by adding by only adding $3 billion, Netflix maintains significant financial flexibility and avoids triggering higher cost of financial distress like a credit rating downgrade which would sharply increase um the rate. And so finally the strategic conclusion. The $3 billion debt is a sound strategic step and Netflix should continue to gradually increase its leverage towards the industry benchmark to maximize the value of the firm by minimizing its WACC. So this was my driver analysis of Netflix's weighted average cost of capital. Thank you.",
  "video_url": "https://youtu.be/4tnJggNiUOw"
}