{
  "student_name": "Jaime Lee",
  "org_defined_id": "037547486",
  "username": "lee4972",
  "email": "",
  "transcript": "Hi everyone, my name is Jamie Lee, and for this project I investigated the nature of market efficiency by studying one of the most famous events in modern financial history — the 2020–2021 GameStop short squeeze. My goal was to test whether the extreme price movement in GME aligned with or violated the Efficient Market Hypothesis (EMH), which is one of the cornerstones of finance. The EMH essentially states that stock prices reflect all available information. It comes in three forms — weak, semi-strong, and strong. The weak form says that past prices are already reflected in current prices. The semi-strong form says that all publicly available information is priced in, and the strong form says that even private, insider information is already reflected in market prices. So the question I wanted to answer was: did the GameStop short squeeze prove that markets are inefficient, or was it simply a temporary distortion that still fits within the theory? I began by verifying one of the viral online claims — that GameStop traded for as little as 4 cents in August 2020. If that were true, it would suggest total market failure. To test that, I used real data from Yahoo Finance, which showed the actual price was around $1.04, not 4 cents. That means the viral post was simply wrong. This verification step matters because it shows how misinformation can easily spread and distort investor perception. Moving to the Represent stage, I structured the problem analytically using an event study design and selected four key moments in GameStop's timeline: August 2020 – when the company was near bankruptcy. September 2020 – when Ryan Cohen, founder of Chewy, announced his 13% ownership stake. January 2021 – the Reddit-fueled short squeeze peak when GME reached over $400. February 2021 – congressional hearings examining trading platforms and hedge funds. For each event, I used a 120-day estimation window ending 10 days before the event to estimate a baseline CAPM model for GME returns relative to the overall market. Then I observed a 20-day event window (10 days before and after each event) to calculate abnormal returns — the difference between what the model predicted and what actually happened. In the Implement stage, I ran all the analysis using Python in Google Colab, importing YFinance, Pandas, NumPy, and StatsModels. I pulled daily GME and SPY data from January 2020 through the present. Using those datasets, I computed daily log returns to standardize price data and remove scaling issues. After aligning trading days between GameStop and SPY, I fit a CAPM regression model where the dependent variable was GameStop's return and the independent variable was the market's return. This allowed me to calculate expected returns for GME and measure abnormal returns as the difference between actual and predicted performance. I also computed a 30-day rolling Z-score of trading volume to detect spikes — moments where retail trading activity was significantly higher than normal. The results showed over 50 extreme volume spikes, concentrated almost entirely around January 2021. This perfectly aligned with the height of the short squeeze, when traders from Reddit's WallStreetBets community coordinated massive buying pressure that sent prices soaring. In the Validate stage, I examined the CAPM model output and cumulative abnormal returns (CAR). The regression results showed that the overall market, represented by SPY, explained very little of GameStop's return variation during the event period. In other words, GME's price movements were almost completely detached from general market conditions — a strong sign that something unusual was happening. When I plotted the cumulative abnormal returns, I saw massive spikes in late January 2021 followed by sharp reversals shortly after. This pattern of rapid overreaction followed by correction demonstrates semi-strong market inefficiency — prices temporarily deviating from fundamentals before reverting. The volume data reinforced this interpretation. Z-scores above 3 indicated extreme retail activity, aligning with behavioral finance theory — a textbook case of herding and attention-driven trading overwhelming traditional valuation models. In the Evolve stage, I connected the data back to financial theory. We saw herding behavior, as thousands of retail traders bought simply because others were buying. Overconfidence bias appeared as investors believed they could outsmart institutions. Representativeness bias showed up as traders viewed the event as a \"retail versus Wall Street\" victory. And loss aversion came into play as short sellers were forced to cover at any price. Beyond psychology, structural factors also played a role. Limits to arbitrage, short-borrowing costs, trading halts, and platform restrictions (like on Robinhood) prevented rational investors from restoring equilibrium quickly. That combination created a perfect storm that temporarily overpowered market efficiency. Finally, in the Reflect stage, I looked at what this event means for the theory of market efficiency. Markets are efficient most of the time, but not always. When information flows normally and incentives are balanced, prices reflect reality. But when emotion, technology, and coordination collide, efficiency bends. The deeper lesson I learned is that market efficiency isn't just about data — it's about behavior. Financial data reflects human psychology and collective decision-making. The GameStop saga shows that behavior can overwhelm fundamentals for a short period, but eventually, rational pricing returns. Efficiency isn't static; it's dynamic, imperfect, and deeply human. In summary, through the DRIVER process, I defined the research question, represented it with an event study framework, implemented the CAPM and volume analysis, validated the results with real data, evolved the discussion with behavioral insights, and reflected on what efficiency truly means in modern markets. Thank you for listening — that concludes my GameStop Market Efficiency analysis.",
  "video_url": "https://youtu.be/cRTu48-JtCM"
}