{
  "student_name": "Daniel Verachtert",
  "org_defined_id": "037038927",
  "username": "dveracht",
  "email": "",
  "transcript": "Hi, my name is Daniel Verachtert and this is my session 10 cost of capital analysis. Uh so to start, what problem are we solving? Should Starbucks invest 12 million in a 10-year flagship roaster? Um the objective is maximize shareholder value using capital budgeting. The hurdle rate uh which is the whack is 8.5%. Does the roaster create value after covering Starbucks 8.5 cost 8.5% cost of capital that's like what we're trying to find. And then um initial cost is 12 million plus the 500k in working capital. So key project uh project inputs and assumptions. So the revenues in year one it's 8 million. Year two through five it's 11 million. Year 6 through 10 it's 9 million. The operating cost, the cost of goods sold is 40% of revenue. The labor is 2.5 million. Rent and utilities is 800,000. Marketing is 300,000 in year one and then 100,000 every year after. Um depreciation is 12 million and over the 10 years that makes it 1.2 million per year. It's straight line depreciation. The tax rate is 25% working capital is 500k for year zero and then it's returned uh on in year 10 and then terminal value is 3 million in year 10. So to start these are the revenue projections I have. So what we can learn from this graph that I have is uh well one revenue drives almost every part of the uh free cash flow model. So because it has an effect on the cost of goods sold EBIT taxes and operating cash flow. It's the primary value driver. Two, the roaster behaves like a flagship retail plus tourism asset. You could see that because in year one there's a large jump because of the high like touristy like hype and then it peaks around two to five years and like stays there and then uh finally in the long term it uh normalizes at 0.9. Um finally or sorry uh the revenue curve explains why sensitivity analysis matters. Since revenue rises in the dips, one the project generates large cash flows early on and two uh long-term value depends heavily on sustaining year two through five performance. Uh when revenue is cut 20% across all years, it destroys the uh NPV. So operating cost and depreciation. Uh so some of the values that we need to know here the cost of goods sold is 0.4 4 times the revenue for the year. Down here we can see um so year one 8 million in revenue that times point4 would be 3.2 million and then you could see the same for the rest of the years. Uh the depreciation is 12 million and that over the 10 years is 1.2 million per year. So right here depreciation 1.2 2 million per year. Uh depreciation tax shield is uh depreciation times the tax rate. So it's 300,000 in tax savings each year. Um EBIT EBIT's the revenue minus cost of goods sold minus labor minus rent minus marketing minus depreciation. So in year 1 it's zero. Year two through five it's 2 million. And then 6 through 10 it's 800,000. um these. So that that's more on the depreciation factors. And then as for operating costs, we can see the variable cost is just cost of goods sold, which is 40% of the revenue per year right here. And then the fixed costs are labor, which is 2.5 million each year, rent and utilities, which is 800,000 per year, and marketing, which in year 1 is 300,000, and then 100,000 year two through uh 10. Uh my free cash flow model. So taxes equals EBIT*.25 operating cash flow equals EBIT * 1 - 0.25 plus depreciation. working capital adjustments. So year one it's minus 500,000, year 10 it's plus 500,000 and then the final free cash flow is um operating cash flow plus the change in working uh cash flow and uh then plus the terminal misspelled terminal. Uh we can look at this graph and see that the first year there's a big decrease. It's a It's $12 million down and then you could see as it grows and then goes down and then grows again because of the return of the working capital adjustment. Uh here's like the numbers per year. So you could see that uh the revenue for each year is here. The operating costs and then depreciation EBIT taxes, operating cash flow, working cash uh or change capex and then the terminal value and then the free cash flow which is the big thing. So you can see the free cash flow increases each year and it's always positive which is what you want to see comes out to 5,300,000 at the end. So NPV and IRR NPV is the sum of free cash flow over 1 plus the whack to the power of T which time discount it discounts all future uh sorry future cash flows at Starbucks uh by its 8.5% whack. So the NPV would be about positive 3,30,000. Since the NPV is greater than zero, that means the present value of future cash flows cash inflows exceeds the cost of the investment. This shows that the royary is financially acceptable. And then irr uh is the discount rate that makes NPV zero. So you just plug in zero for NPV and use this equation and solve for IRR. And so you get I got 13.3%. Since IR is greater than the whack, the project creates value. It earns more than its cost of capital. IRRa represents the project's annualized return based on its cash flow. This shows this also. So NPV and IR show that the roster is financially acceptable. Uh payback period and profitabil profitability index. The the payback period. uh the simple payback period is 5.3 years. You can see this down here at just barely or after after five years they're only down five or 500,000 and then by year six they're up 1.3. So somewhere in between there you'll find and you just solve for it. Uh so this shows how how long it takes to recover the initial investment using raw on discounted cash flows. uh it's not as reliable of a measurement because it does not account for should say for uh time value money risk and cash flows after break even. Uh the discounted cash or the discounted payback is 8.2 years. So that shows how long does it take to recover the initial investment after discounting the future cash flows by the whack. Uh both period or payback periods occur comfortably before 10 years. So they both are fine. The profitability index is equal to the present value of future cash flows over initial investment and that comes out to be 1.24. Uh since the profit profitability index is greater than one, the project generates value per dollar invested. So you would accept it. Every dollar invested produces 1.24 in present value returns. Especially, it's especially valuable because Starbucks is capital constrained. 24, it has a 24% value margin, which is considered healthy for a flagship uh experiential retail investment. So, this is the NPV whack sensitivity analysis analysis. Uh the NPV remains positive even if the discount rate rises. So when the discount rate rises, we can see that all of these values remain positive. Uh seeing that even at 10.5% whack, NPV is still at 1.6 million. This means that the project, you could see that on this graph too. Uh this means that the project is robust to moderate changes in Starbucks cost of capital. IRRa doesn't change with whack because IR is based only on cash flow. So it remains at 13.25. Uh as for the revenue sensitivity when there's a 20% decrease uh NPV would drop from positive 3 million to negative 2.8 million which is a substantial drop. IR would drop to 3.9% which is way below the hurdle rate. Um this shows that revenue is most the most significant risk factor. Um, a moderate drop in revenue wipes out all value compared to the base case every year is noticeably weaker. You could take a look at this chart I made. And then I'll go back to the original. See, all of these were positive over a million each year. And then now it's um sorry now it's barely breaking a million for a few years and much lower values. Um so as for my final recommendation uh the base financials the NPV is positive the IR exceeds whack and then the uh uh sorry the the profitability index is greater than one. Uh the strategic fit uh it strengthens Starbucks premium brand. It enhances customer experience. creates a tourism tourist destination and serves as an innovation lab for coffee technologies. Uh as for the risks revenue impact, it has a high impact, high fixed cost and construction and timing risks. Uh my final decision would be accept the project with conditions on demand validation and cost control. Now I'm going to switch the screen that I'm sharing. Uh, so this is the um the code that I used. Let me just full screen this real quick. Okay. Uh, it doesn't seem to be able to full screen. Uh you could see this is what I use to solve for all my like revenue, cost of goods sold, labor, uh NPV, irr. Yeah, pretty much everything is on here. Um so when I run the code, you get the final values. So it builds the cash flow here and then down here gives me. So free cash flow right here NPV IR simple payback discounted payback profitability index. Then scenario A which is the negative 20% revenue free cash flow and NPV IRRa. Uh and then scenario B which is the lack sensitivity shows the NPV for each whack point and that's what I used in my presentation. That's the how I got the values for that. Uh yeah, thank you.",
  "video_url": "https://youtu.be/RM-wJQIBHKM"
}