{
  "student_name": "Jasvika Patil",
  "org_defined_id": "036591563",
  "username": "patil173",
  "email": "",
  "transcript": "Hello, this is my session nine assignment and my task is to determine the financial viability of this investment and the optimal way to fund it. To ensure that my recommendation is data-driven, I conducted this analysis using the DRIVER framework. This means I will define the outputs, represent the financial relationships, implement the calculation model, validate, evolve the model for sensitivity, and finally reflect on the path forward. Stage one is Define and Discover. An output is only as good as its input, so we must be precise about the variables entering our WACC model. First, market conditions: we are operating in a higher-for-longer interest rate environment. We defined the risk-free rate at 4.5%, pegged to the 10-year US Treasury yield. This is the baseline cost of money. Second, as shown in the code, the market risk premium is defined at 5.5%, standard for current S&P 500 volatility. Next, we examine Netflix's financials. Netflix shows a book value of debt at $14 billion, but rising interest rates caused the bonds to trade at a discount. The market value of this debt is actually $13 billion. For WACC, we should use market value. Using book value would artificially inflate the leverage ratio and distort the results. Next, we define equity risk. Netflix has a beta of 1.3, shown in the code. This indicates that for every 1% move in the market, Netflix stock tends to move 1.3%. A high beta means equity investors demand a higher return. The definition phase conclusion is that Netflix is funded 94% by equity and 6% by debt. Since equity is more expensive than debt, this shows a major inefficiency in Netflix's capital structure. Stage two is Represent. Here we choose the correct mathematical models to represent the financial reality of the proposed $3 billion debt issuance. We cannot simply plug in new debt; we must represent the relationship between leverage and risk. We use two primary models: First is CAPM, representing cost of equity. With a risk-free rate of 4.5% and high beta, the formula yields a double-digit cost of equity, representing the shareholders' hurdle rate. Second is the Hamada equation, the most critical part of this stage. Because we are proposing adding $3 billion in debt, financial theory tells us beta cannot remain at 1.3% due to increased financial risk. We unlever the beta to isolate pure business risk, then relever it to reflect the new capital structure including the additional debt. This captures the tradeoff: debt is cheap, but it increases equity risk. Stage three is Implement WACC. I translated these formulas into Python using Google Gemini. Looking at results, Cost of Equity - Using CAPM, cost of equity is 11.65%. This is expensive—every dollar of equity must return 11.65% to satisfy shareholders. Cost of Debt - Pre-tax cost of debt is 5.8%. After applying the 21% corporate tax shield, effective after-tax cost of debt is 4.58%. WACC - Weighting based on current market values, 93.9% equity at 11.65% and 6.1% debt at 4.58% results in a WACC of 11.21%. The takeaway is that we are funding the company with 11.6% equity when 4.6% debt is available. This confirms that our hurdle rate is artificially high due to the capital mix. Next is Validate. We ask: does an 11.2% WACC make sense? Is it competitive? To validate, we benchmark against peers like Disney and Amazon. Disney operates with a WACC of 8.2% while Netflix is at 11.2%. The 300-basis-point gap is due to Disney's 30% debt and 70% equity structure, which pulls their WACC down. Netflix relies almost entirely on equity, pushing its hurdle rate higher. The implication is if Disney and Netflix evaluate a project returning 10%, Disney accepts it because it exceeds their 8.2% cost, while Netflix rejects it because it falls below 11.2%. This proves Netflix's capital structure is a competitive disadvantage and forces rejection of profitable projects competitors can accept. Next is Evolve. A single WACC number is static while the real world is dynamic. In this stage, we stress-test our model. Sensitivity Analysis: Using Python, we generated a heat map adjusting tax rates and debt costs. Even if corporate taxes fall to 15% or cost of debt rises to 7%, WACC still decreases as leverage increases. This proves the benefit of debt issuance is robust and structural, not dependent on current rates. Project-Specific Hurdle Rates: We calculated adjusted rates for the $5 billion investment. Domestic content is baseline risk. International content carries currency and geopolitical risk, so we added a 200-basis-point premium. The result is international originals justify a 13.2% hurdle rate, U.S. content 11.2%. This prevents poor investments in risky markets that do not offer adequate returns. Finally, Reflect. Based on the DRIVER process, here are my strategic recommendations. First recommendation is Proceed with the $3 billion debt issuance. Even after accounting for increased beta, the weighted cost drops from 11.21% to roughly 11.17%. For a $200 billion company, even a small WACC reduction unlocks millions in shareholder value. We effectively replace expensive equity with tax-advantaged debt. Second recommendation: Target an optimal structure. $3 billion is a start, but it only slightly increases our debt ratio. To reach a competitive WACC close to Disney's 8.2%, we should plan to increase leverage further over time. However, we must consider our BBB+ rating. We must not lever up to junk status, where rising interest costs would offset the benefits. Conclusion Netflix has grown into a mature media giant, but its capital structure remains in a startup phase. By adopting a more efficient, debt-inclusive structure, Netflix lowers the hurdle rate for content teams and unlocks value. Based on the analysis, we should approve the debt issuance. Thank you.",
  "video_url": "https://youtu.be/u0x5JK4ds1s"
}