{
  "student_name": "Ryan Swann",
  "org_defined_id": "037338799",
  "username": "swannr",
  "email": "",
  "transcript": "Hello, my name is Ryan Swan, and today I will be presenting my Session 8 assignment using the Driver Analytical Framework. I will begin with the Define and Discover stage. The primary objective of my analysis is to investigate market efficiency using the 2020-2021 GameStop GME Short Squeeze as an empirical case study. My goals are to verify all new, Numerical claims, especially the statement that GameStop traded at 4 cents in August 2020, evaluate how GameStop's price behavior aligned or conflicted with weak-form, semi-strong, and strong-form efficiency. Determine whether rational investors could have earned systematic or risk-adjusted abnormal returns. And assess behavioral finance explanations, including hurting, overconfidence, and fear of missing out, and limits to arbitrage. To begin the discover stage, I gather data from Yahoo Finance, SEC filings, and historical reporting about the event. I also outline the key event timeline. August 2020, GME trades between roughly $1 and $5, near long-term lows. September 22nd, 2020, Ryan Cohen discloses a 12.9% stake via Skype. January 2021, massive Reddit-driven price surge, $483 on January 28th, February 18th, 2021 Congressional hearings on the market event. My success metrics include verified factual accuracy, especially price history, clear classification of which EMH forms were violated, and success. Statistically meaningful abnormal return analysis, integration of behavioral finance insights as well. Getting into my represent stage, I will represent my analysis plan behaviorally. Before implementing any code, uh, data acquisition plan. I will download the following data from Yahoo finance, the daily OHLC prices for GME between August, 2020 and February, 2021, the daily trading value. benchmark returns for the S&P 500, volatility measures, short interest data from FINRA and market reports, event study design. I will, define event windows around major public announcements, Cohen 13-D filing which took place on September 22nd, 2020, rocketing of retail volume in January 2021, trading restrictions on the on January 28th, 2021, and congressional hearing February 18th, 2021. For each event, I will calculate expected returns using the market model, abnormal returns, the AR, and cumulative abnormal returns. E&H testing framework, weak form, auto-correlation of daily returns, volatility patterns, and momentum patterns. Reversals, semi-strong form, speed of price adjustment after public announcements, and then for strong form, evaluate whether insiders of privileged agents earned persistent returns. And then for behavioral finance, I will examine hurting and social contagion, overconfidence, and narrative bias, limits to arbitrage faced by the hedge funds, and short squeeze mechanics due to, due to greater than 100% short interest peaking near 140%. Moving into my implement stage. Now I will move, uh, into implementation using Python code, uh, that I will create with the help of AI. Uh, so to start we're going to verify the 4 cents in August 2020 claim. And using Yahoo Finance data from August 1st, the lowest closing price was $1.04 and the intraday low was $1 on August 3rd. This was found using this code. It pulls in information from Yahoo Finance and looks for, uh, game stops, uh, close, high, low, open, and volume for the dates of August 3rd through August 4th. As the code shows, the low on August 3rd was $1, not $0.04, which disproves the original statement that it was $0.04. Therefore, the GameStop traded at $0.04 in August 2020 is factually incorrect by two orders of magnitude. Weak form EMH test. I calculated daily returns from 2020 and 2023, and examined the autocorrelation function, uh, and using this configuration. I was able to use numbers from Yahoo Finance, and the code created a graph, multiple graphs that I could use to evaluate if the weak form, uh, occurs. efficiency was valued, was, uh, valid, violated. So, looking at our autocorrelation of GME graph, which can be shown here, the first several lags exceeded the 95% confidence bounds, and this indicates several dis-dependence, uh, violating weak form efficiency, uh, GameStop's extreme momentum, and, and mean reversion patterns are inconsistent with a random walk, uh, what this means is that the weak form EMH was violated. For the semi-strong EMH test, using event windows, I calculated abnormal, normal return surrounding major announcements. So, showing my code, here is the code that I created with the help of AI, if you need to you can pause and look through it, uh, however I cannot read through it. So, I each line of it in time, so pause and read through. So, it created me this graph, which shows the price during the time we are evaluating and how it, moved with information. What this shows us is that during Cohen's 13-D filing led to a delay multi-week drift rather than immediate adjustment. In January 2021, prices exploded. Far beyond even the most optimistic fundamental values estimates of $10-40, and public information did not incorporate instantly. Instead, speculative dynamics dominated. What this means is that the Semi-Strong EMH test was violated. Moving into the Strong Form EMH test. Strong Form requires that no insider or privileged party can consistently earn abnormal returns. In the GameStop case, there is no evidence of insiders systematically profiting, or, systematically profited. Hedge funds with, uhh, sophisticated- data, like, short interest ana-analytics and order flow signals actually suffered massive losses. An example is Melvin Capital with a minus 53 percent, and retail order flow routing through holes- er, sellers, did not convey unfair insider profitability. Thus, strong form EMH was not violated. Moving into our validate stage, to validate the robustness of my results, I re-routed multiple date windows to ensure consistent AR and carve values. I verified price, history, agent, multiple sources to estimate data sourcing artifacts. Auto-correlation results were stable across sampling frequencies. Carve remained significantly positive and abnormal across all event windows confirming reproducibility and Thanks. Bye. This can be shown in this code that we created. Uh, my results are therefore statistically and conceptually validated. Uh, moving into our Evolve 2.0. Evolve analysis beyond the base assignment extended the event study by estimating GameStop's beta relative to the S&P 500. GameStop displayed a low, unstable, and sometimes negative beta, meaning market risk could not explain itself. GameStop calculated expected returns and compared them to realized returns. Cars spiked massively during January 2021, confirming that price movements were discoupled from fundamentalism. This evolution step shows that even sophisticated risk adjustment models failed to explain GameStop's behavior, supporting behavioral explanations. GameStop clearly violated weak form, and semi-strong EMH. Information incorporation, uhm, and speculatation blow-off. Uh, the strong form EMH held as insiders did not consistently earn abnormal returns. Uh, behavioral health. Uh, emotional hurting, social signaling, fear of missing out, overconfidence, and limits to arbitrage explain most of the anomaly, and no rational investor could have achieved systemic excess returns. X and Z. Uh, enormous profits were large, luck, and timing, not skill. Using the driver framework forced me to structure my research, verify data early, and avoid premature conclusions. This case study of offered powerful insights into how real-world markets can diverge sharply from theoretical efficiency, especially when behavioral forces overwhelm fundamentals. Thank you.",
  "video_url": "https://youtu.be/dLzvGzhA9Ew"
}