{
  "student_name": "Krish Bansal",
  "org_defined_id": "037304971",
  "username": "bansa128",
  "email": "",
  "transcript": "Hello, my name is Krish, and I have conducted a full financial evaluation of Starbucks's proposed flagship Roastery concept. My goal was to determine whether this project creates value for shareholders using a rigorous capital budgeting model built around discounted cash flows, sensitivity analysis, and the NPV decision rule. To structure my analysis clearly, I walk, I will walk through the DRIVER framework. To begin with the D part of the DRIVER framework, the objective of this analysis was straightforward: to determine whether Starbucks should invest $12 million upfront to build and operate a flagship Roastery that would run for 10 years. So this required projecting the Roastery's future free cash flow, discounting them using Starbucks's 8.5% WACC, and applying the NPV rule, which states: if NPV is greater than zero, the project adds value and should be accepted, or if the NPV is lesser than zero, the project destroys value and should be rejected. Because I'm evaluating a project within Starbucks's existing business, using the company's WACC as the hurdle rate is the correct approach. WACC represents the blended requirement's return from shareholders and lenders for projects of comparable risks. My goal was to compute these financial metrics and also generate a clear business recommendation grounded in numbers, supported by sensitivity analysis, and communicated in a way suitable for decision-makers. Moving ahead for the R where I outlined the core requirements and assumptions that defined the project's operating and financial structure. These assumptions serve as the backbone of the model. So, first I looked at the Initial Investment and Depreciation. So Starbucks would spend $12 million upfront on the building, equipment, and training. This amount is depreciated straight-line over 10 years, producing a $1.2 million in annual depreciation, which is important because it creates a depreciation tax shield that improves after-tax cash flows. The second is the Working Capital, which shows that the project requires $500,000 of working capital at launch. And working capital is not an expense but an investment that is fully recovered in 10 years. The third is the Revenue. In the first year, Starbucks is expected to have $8 million in revenue, then from Year 2 to 5, $11 million each year, and then in Year 6 to 10, $9 million each year. The Operating Costs was something which I looked into. Then the Taxes, how Starbucks uses a 25% corporate tax rate. Then the Terminal Value, like how at the end of 10 years the Roastery has a Terminal Value of $3 million, which is added to the final year's cash flow. The seventh is the Discount Rate. The project cash flows are discounted using the Starbucks's 8.5% WACC, which is the correct rate because we are evaluating a long-term operating project with similar risk of Starbucks's core business. Next, moving on to the I part where I have to Interpret... I evaluated whether the Roastery creates value. I did this by building a detailed annual cash flow model that translated these assumptions into Free Cash Flows, the actual economic value generated for Starbucks. So the steps to build this were: first, to take the project revenue and the operating operating costs, then incorporating depreciation and taxes, then adding back the depreciation for the depreciation tax shield, and then the fourth thing is to include the working capital adjustments, then the terminal value, and the discounting cash flows at the last. To Validate my model, I took the results from the base case financial model, which is: NPV is + $2.69 million, IRR is 12.84%, Profitability Index is 1.22, Discounted Payback Period is 8.2 years, and Undiscounted Payback Period is 5.3 years. Furthermore, to Evaluate the Sensitivities... I ran a sensitivity analysis on the variables most likely to change. First, the Revenue Sensitivity was the most volatile assumption in detail, so I tested the NPV change if revenue is 10% higher or lower. And then the WACC Sensitivity, then the Labor Cost Sensitivity. And I interpreted the sensitivity results. So, across all tests, the project continues to produce a positive NPV. This means the recommendation is robust, even if costs increase or demand underperforms, the Roastery will still create value for Starbucks. And lastly, the Recommendation says, while I bring all this together, my recommendation is to accept the project. Because my decision is supported by a positive NPV of $2.6 million, an IRR well above the 8.5% WACC, a strong Profitability Index of 1.22, and a consistent positive result across multiple sensitivity scenarios. I feel that the Roastery is not only financially viable but strategically aligned with Starbucks's brand building approach and resilient under practical downside scenarios. So in summary, based on a rigorous capital budgeting analysis, the Starbucks's flagship Roastery value is... the Roastery is a value-creating investment, and Starbucks should move forward with the project. Looking at my code, we can see here how the cash flow table is shown for every year, year by year, for 10 years. We can see the core capital budgeting metrics: the WACC, the NPV, the IRR, the undiscounted payback, and the discounted payback. The sensitivity for the selected scenarios. And we can see how the year-by-year cash flows are shown in a graph or table, which helps visualize better. Moving forward, I have also included the DRIVER summary in my code to make it easier to understand. So the first Define part shows how Starbucks's flagship Roastery has a 10-year life, initial outlay, then the working capital, WACC. Then the R part shows the depreciation, terminal scale, operating assumptions. The Input is shown, the Validation is shown, the Execute is shown where the decision rule is to accept if NPV is greater than zero and if IRR is greater than WACC, and my recommendation is to Accept. I have also given the Risks and Next Steps. So the top risks is that revenue shortfall, labor cost will escalate, and higher financing costs or larger CapEx. Then the suggestions for the next steps are to run a stress test, an alternative terminal assumption, or a phased investment plan. Thank you.",
  "video_url": "https://youtu.be/fab6J9-3Nm0"
}