{
  "student_name": "Cody Teteak",
  "org_defined_id": "036030190",
  "username": "cteteak",
  "email": "",
  "transcript": "Tech and for today's assignment, the session 9 assignment, I will be presenting a comprehensive analysis of the weighted average cost of capital or WACC for Netflix. So there are two goals here. first to determine the appropriate discount rate for Netflix's upcoming capital budgeting decisions and second to provide a recommendation on whether Netflix should proceed with the massive $5 billion uh content investment specifically looking at how they finance their operations compared to competitors such as Disney or Amazon. So for this we used the driver framework um to ensure our calculations were rigorous and aligned with our financial theory. So to start is with our define and discover phase. Let's start by defining our core metric. WACC is essentially the average rate of return a company must pay to all of its investors both that and equity holders to finance its assets. It is a it is a it is the critical hurdle rate. If Netflix invests in a project that returns less than its WACCC, it is destroying shareholder value. To calculate this, we need we need two main components. the cost of debt which is the interest paid but uh on bonds adjusted for taxes and then the cost of equity which is which we calculate using the capital asset pricing model or CAPM which is shown on the screen up there in the bottom right. This formula links the expected return to risk. It takes the risk-free rate and adds a premium based on beta which measures how volatile the stock is compared to the overall market. Next here is the data that we actually put into our model for Netflix. We are looking at a market value of equity of 180 billion and a debt of only 20 billion. I want to highlight Q fee a few key inputs here. Equity beta is 1.2 indicating Netflix is 20% more volatile than the market. Uh yield on debt is 4.5%. And the corporate tax rate is 21%. We also have peer data for benchmarking. Note that Disney has a WACCC of 6.5% and Amazon Prime Video is at 7%. We'll explore why Netflix is higher than these two later in the presentation. Next, we get to our reper represent phase. So here we use the uh Python script to process these inputs into um to minimize the uh calculation errors. First we calculated the cost of equity using CAPM with a risk risk-free rate of 2.5% and a market risk premium of 6%. Netflix's cost of equity comes out at 9.7% and this is the return shareholders demand. Next, we calculated the after tax cost of debt. Uh because interest is taxdeductible, the effective cost is not the 4.5% yield, but rather 3.55%. When we weight these based on Netflix's current capital structure, which is 90% equity and 10% debt, we arrive at the current WACC of 9.09. This 9.09 09 is the baseline number Netflix needs to beat on its investments. See here for our implement stage um is the code that we actually did to um calculate all of that math that I did just set. Um so you're after co tax cost of debt um being four uh the 3.55% and then Netflix's WACCC of 9.09%. Now, let's look at the strategic scenario. Issuing an additional $3 billion um in debt to fund operations. We adjusted our model to increase the total debt to 23 billion. Uh because debt is significantly cheaper than equity, 3.55% versus 9.7% calculated in the last slide, adding more debt should theoretically lower the WACC. Our calculation confirms this by slightly shifting the weight of debt from roughly 10% to 11%. Netflix's WACC drops from 9.09 to 9. While a 0.09% drop seems small on billions of dollars of capital that represents a significant value creation. Here is our deep dive um with the actual implement. There's a lot of words here. So this brings us to our critical nuance of project specific WACC. Not all content is created equal. We must distinguish between US content and international content. Our analysis suggests that uh international projects especially in emerging markets carry higher risks. Um some regulatory risks would include censorship laws. Currency risks would include fluctuating exchange rates. Um and then execution risks would be like cultural nuances. Therefore, while the cop corporate WACCC is 9%, international projects should likely be discounted to a higher rate to account for this added risk. Um, just the pure uh comparison, why is Netflix's WACCC of 9% so much higher than Disney's of 6.5% or Amazon's of 7%. Our analysis points to two different drivers here, those being capital structure and business risk. Capital structure, uh, Disney and Amazon carry much more debt. Disney's debt to equity ratio is 0.35 compared to Netflix is 0.13. Since debt is cheaper, their average cost is lower. Business risk. Uh Disney has diversified. They have parks, cruise lines, TV, etc. Amazon has AWS and retail. Netflix is a pure play streamer. Investors perceive this as a lack of diversification as higher risk resulting in that higher beta that we discussed. Then we get to our validate phase. In the validate phase, um we sanity checked our numbers. Does 9% WACC make make sense? Yes. The typical media industry range is about 8 to 10%. Does the drop in WACCC after issuing debt make sense? Yes, it aligns with financial theory regarding the tax field. We can confidently say the model is accurate and the outputs are reliable for decision making. Then moving to evolve. Uh this is just what is our strategic recommendations. Currently Netflix is being underleveraged with a debt to equity ratio of only 0.13. They are playing it very safe compared to the industry standard of 0.25 to 0.35. Our recommendation is that Netflix should pursue a gradual strategic increase in debt financing by moving their debt to equity ratio closer to 0.2 2 or 0.25. They can further reduce their WACC. Uh they can benefit from the tax deductibility of interest and they can use that capital to fund $5 billion um in content spend without diluting current shareholders. Lastly, we wrap up with our reflect phase. To conclude, let's tie us all back to the $5 billion content investment uh mentioned in the beginning. Netflix's WACCC is 9%. This is the magic number. Any portion of that $5 billion allocated to standard content must generate a return higher than 9%. However, for the portion allocated to international expansion, we must apply a risk premium likely likely requiring uh returns of 10% or 11% to justify the investment. So, our final verdict is that Netflix is in a strong pred uh position. Their cost of capital is healthy but higher than their competitors due to a reliance on expensive quality. By strategically increasing debt, they can lower their costs and more aggressively fund the content war uh against Disney and Amazon. Thank you.",
  "video_url": "https://youtu.be/6UVx9FnccvI"
}