{
  "student_name": "Caleb Piekarski",
  "org_defined_id": "037218585",
  "username": "cpiekars",
  "email": "",
  "transcript": "Okay, so today I'm going to be going over the um session 10 assignment which is the cost of capital analysis. So just looking at the assignment overview. This is going to be our um define discover stage in the driver analysis, but we're going to be going over um just defining and also discovering our inputs and data that we'll be using for today's video. So, first we're going to be evaluating Starbucks proposed flagship roaster that requires requires a 12 million upfront uh outlay and is expected to operate for 10 years. Use the firm's 8.5% uh WACC as the hurdle rate to determine whether the project creates value and to recommend um and accept reject decisions supported uh by driver. So looking at the project parameters that we're going to be looking at. Um the initial investment would be $12 million. Uh this is the building equipment and training. Depreciation straight line over 10 years. The working capital is 500,000 deployed at launch and uh recovered in year 10. Revenue is 8 million in uh year 1, 11 million in years 2 to 5, 9 million in years 6 to 10. Operating cost. Cost of goods sold is 40% of revenue. Labor 2.5 million. rent utilities uh8 million uh marketing.3 million in year 1 then.1 million thereafter taxes 25% corporate rate terminal value three 3 million at the end of year 10. So we're going to focus uh analysis on producing a transparent cash flow model uh core capital budget metrics sensitivity test and an executive ready recommendation. So, we're going to be using the driver framework um to find and discover, which we just went over up here, defining our variables. So, these are our specific requirements for this video. So, um the financial analysis requirements are looking at building a year 0 to10 incremental cash flow schedule that u includes revenue, operating costs, depreciation, tax shields, taxes, working capital changes, and terminal value. Um it'll also calculate NVB um irr discounted payback period, simple payback period and profitability uh index using Starbucks WCC. Um the third one we're going to be looking at is run sensitivity analysis for a revenue reduced by 20% BWC uh ACC plus or minus 2% and summarize the impact on NPV and IRR and then providing a recommendation that weighs financial results strategic fit brand implications and key project risks. So using Python um we have all the information here for this um assignment. So just going to run over the code quickly. Um here we have helper functions define MPV using rate and cash flows. um define our both these functions giving you these and then uh looking at the parameters that are given in the um um inputs and define a discover stage WCC tax rate um all these values as you can see here and then the cash flow construction as you can see just defining variables using four statements using equations isions defining more variables here by using other variables. Revenues minus operating costs uh minus depreciation. And then down here we have working capital and then terminal value in year 10. Uh the final cash flows and then some print statements. And then here are your uh the metrics and the payback and discounted payback following um some print statements and then the sensitivity for revenue of minus 20%. All right here with print statements and the sensitivity for WCC plus or minus 2% is right here. So looking at our outputs down here, we have the yearly cash flows for year zero being uh negative 12,500 uh,000. Year 1 700,000, year two, 2 mil, and then as you can see just um well these stay the same down and then goes up in year 10 to 5 million. And then looking at the metrics, NPV 2,561, um 685.36, the IR uh.1245, profitability uh index 1.213, the payback period being 6 years, discounted payback being 9 years, and then sensitivity of revenue uh for - 20%. looking at MPV and IR um negative um 7 million uh $63,58060 and then or just yeah and then Z negative.0378 0378 and then looking at for WCC plus or minus 2% we have NPB at negative and plus and these are the values for those. So just reflecting on what we just went over um or like from these values what we can learn is uh the WCC drives discounting um along with uh depreciation creates tax se uh shields working capital matters and cash flows sensitivity analysis um shows the project risk that is all I have We're",
  "video_url": "https://www.youtube.com/watch?v=wAKhl2r0qGo"
}