{
  "student_name": "Caleb Piekarski",
  "org_defined_id": "037218585",
  "username": "cpiekars",
  "video_url": "https://www.youtube.com/watch?v=vk9OqqDvFGo",
  "transcript": "00:00:03\nSo today I'm going to be going over the session 13 um build your AI powered financial innovation um which is the capstone project. So just getting right into it. We're going to be looking at the model that I built using Replet and Open AI. So what I used or built was a renter by decision maker. um for financial decisions. And as you can see down here, we have all the inputs really easy to put in and it is all displayed nicely. So, it is easy to follow. And just an example here, we have the um\n\n00:00:47\nhome purchase details with the home price, the down payment, the mortgage rate, and the loan term. And then we have the ownership costs here um including the property tax, the annual home insurance, annual maintenance, and the monthly HOA fees. Uh looking at the rental details, we have the monthly rent and the annual rent increase with personal factors of how many years you plan on staying in the home with the expected home appreciation uh and the invest the investment return rate. So just down\n\n00:01:16\nhere, we're going to use press this button to uh calculate what my model is going to give you. And as you can see here, it clearly states um that you should be the recommended option here is to rent rather than buy. And it gives you um total cost over the amount of years that you plan to be there with the total rent payments um well for rent and that cost. And over here we can see the mortgage payments, property taxes, maintenance, insurance, HOA fees, and the home equity gained. Right here we have graph showing how\n\n00:01:52\nmuch you're going to be paying over time, showing uh money and years with both renting and buying. Now down here we have what Open AI gives you. And how I got this to work was I used an AI API key to um get the AI to be incorporated into this model. But basically this part right here um has AI tell you what you should do. So as you can see based on your number or numbers renting appears to be more financially sound uh choice over. So in your timeline basically just saying how much you're\n\n00:02:30\ngoing to save um by renting and then some key considerations for um making this decision. Um, as you can see here, it just says investing your 80,000 down payment could yield 48 uh,463 in returns and whatnot more down here. And down here, it shows the break even timeline being one years, um, the opportunity cost and the monthly difference. So, I'm going to go back up here. I'm just going to change some numbers around just to show this changing numbers and to show that it works. So, we have\n\n00:03:14\nthat. Let's change this to 10%. Keep that loan term be 20 years. Um, property tax rate. Let's have this be um 2.8. The annual home insurance as 2000. Keep annual maintenance. Move down HOA fees to $50. monthly rent can change to 3,000 while keeping the annual rent increase and to put years to stay up until 10 years. Let's keep the appreciation and return rate. So, let's press this again. As you can see, it now shows that instead of renting um with these new numbers, it is recommending that you buy\n\n00:04:30\nshowing that total cost over 10 years for renting would be um 412 and this over 10 years would be 6 um 46 423. But as you can see, the net cost down here would end up being making sense to buy rather than to rent. So it also shows you how much you would be saving from buying or the 10 years. And then this is just another graph showing the difference between buying and renting. Just so you get a visual at what you're looking at here for numbers. And down here once again, we have what AI would give you. Based on your\n\n00:05:14\nnumbers, buying a home appears to be the better financial decision over a 10-year timeline. Just explaining how much you save and what makes most sense with more key considerations. Also showing the opportunity cost down here with the monthly difference and the break even timeline."
}