{
  "student_name": "Colin Crean",
  "org_defined_id": "037433259",
  "username": "creanc",
  "video_url": "https://youtu.be/1iDjOHm4EWY",
  "transcript": "0:00 How's it going? My name is Colin Crean and this is my Capstone project. So, for my Capstone project, I built a private equity analyst AI tool.\n0:09 And, in the real world, private equity associates spend hours taking raw data from companies and formatting it into investment memos.\n0:16 So, I want to solve that problem. So, let's say we are looking at a deal for a company called Cloud Logistics, which is a supply chain software firm.\n0:24 So, you can see here in my tool, we put in Cloud Logistics and for the industry, there's supply chain logistics.\n0:32 So, we look at the key financials. They have 15 million annual recurring revenue ARR. They're growing at 45% year over year.\n0:38 They've 85% gross margins. They're currently burning 2 million a year, EBITDA negative, and the customer churn is low at 3%.\n0:48 So you can see, um, they're growing fast, but they are losing a lot of money. Now for a bull case, uh, their proprietary AI routing algorithm saves trucking, uh, fleets 20% on fuel.\n1:01 Uh, they're recently signed a five year contract with Walmart. Walmart and Target. And, um, there are high switching costs for customers.\n1:11 So they have great tech and big contracts, but now for the bear case, they have heavy reliance on Amazon web services, uh, the platform.\n1:20 Risk competitors like Oracle are entering the space and sales cycle is along six to nine months. So they have risks like competition from Oracle too.\n1:30 So if we generate the memo here for the cloud logistics company, press that strafting memo. So we can see the AI instantly drafts an executive summary for us.\n1:44 So we'll look at the summary. So it says investment memorandum generated analysis for Cloud Logistics, Inc. So the executive summary Cloud Logistics, Inc.\n1:52 analysis. SAS company focusing on supply chain logistics, boasting a 15 million annual reoccurring revenue with robust 45% year-over-year growth, 85% margins.\n2:00 The company currently EBITDA negative with an annual cash burn of 2 million, but maintains a low customer churn rate of 3%.\n2:08 Key strategic goals. Strategic parameters have been secured with retail giants Walmart and Target, supported by a proprietary AI routing algorithm that offers significant cost savings.\n2:20 So we can see, uhm, I'm not going to go through and read the whole thing, but you can see, you know, platforms.\n2:24 It talks about platform risk, competitive threats, long sales cycle. And it gives us, uh, this tool, drafts, you know, an executive summary for us instantly, which saves, you know, private equity firms a ton of time from drafting these memos.2:39 So that was my Capstone project, and thank you for listening."
}