{
  "student_name": "Kevin Sales",
  "org_defined_id": "033940131",
  "username": "kfsales",
  "email": "",
  "transcript": "All right. Hello. Good afternoon, good evening people. Um, welcome. Today I'll be walking through my full um, capital budgeting evaluation of Starbucks proposed flagship roaster using the driver analytical method. I'll cover the financial model utilizing Python automation sensitivity analysis and finally a strategic recommendation on whether Starbucks should move forward. So the big question here is simple and we need to clarify a couple things. So what do we need to ask and what do we need to know? Should Starbucks spends 12 million on a flagship roaster and run it for 10 years? This is the big question here. And to answer that, we need to know whether this investment creates value or destroys value for shareholders. We'll do that by estimating future cash flows from the grocery and then discounting them using Starbucks weighted average cost of capital or WACC for short. which this assignment gives us a 8.5% um value of the weighted average cost of capital. So if the project's net present value or short for short NPV is positive at that discount rate it means that the project expected to create value but if the MPV is negative it is expected to destroy value. So the driver framework overview and here's a road map. So as you guys all know and I don't need to dive too much detail into this. So define is just where we set up the business question of what success looks like and discover. We're going to be listing out information, assumptions, uncertainties. We need to handle and represent. We need to design the structure of cash flows over time and implement. We translate that structure into a working Python model and validate. We check our results to see if they make sense and evolve. We play with the scenarios and ask what if scenarios and finally and reflect. We step back and see what this taught us and about making financial decisions. So defined so what counts as success. So as I mentioned earlier here are the main financial tests. So the net present value NPV think of this as the project's value in today's dollars. So if the MPV is positive at the 8.5% weighted average cost of capital the project expected to create value and also by looking at the internal rate of return this is the project's own um rate. So, if the irr is higher than 8.5%, it passes the hurdle. And now we're going to be looking at the probability index. And this is essentially a bang for your buck ratio. So, anything above 1.0 is good. We also want payback within the 10-year life. And we want the project to make sense for Starbucks strategy and brand, not just the calculator. So, discover and inputs. So, in discover stage, I put together all the numbers assignment gives us. So, we know that the investment is $12 million. And we depreciate that annually over 10 years, which essentially gives us $1.2 million of depreciation every year. There's also a $500,000 in working capital, which is like the money that is tied up in the inventory and operations, and we pay that in year zero and get it back in year 10. So, revenue grows early, levels off, and then steps down the later years. Cost include cost of goods services sold at 40% of revenue plus fixed labor, rent, utilities, and marketing. And finally, we pay a 25% in corporate taxes. And at the end of the year, we assume that the project has a terminal value of $3 million. Like a this is essentially like a resell or a continuation value. So represent how we build cash flows. So in the in the represent stage, this is where I turn the word problem into a timeline of cash flows. For each year, we start with revenues, subtract cost and depreciation to get EBIT or in other words, earnings before interest in tax. We then apply taxes on the earnings before interest in tax, get after tax income, and then add depreciation back. Depreciation is a non-cash expense, so it lowers taxes, but doesn't actually use cash. So that will essentially give us the operating cash flow or OCF for short. From there we construct the free cash flow or FCF for short. And a year zero is just the big investment and working capital going out. In year 1 through nine is the OCF or in other words operating cash flow. And a year 10 is the operating cash flow plus the terminal value and the working capital recovery. So now the summary of base Case free cash flows. So this is the shape of the project cash flows. We pay 12.5 million up front. When you include working capital as a store grand sum, we get 1.2 million in year 1. Years two to five. When the rotary is in his prime, we earn 2.7 million of free cash of free cash flow each year. And later in years 6 through 9, the cash flow actually drops to 1.8 million per year. And finally, in year 10, we still get the 1.8 8 million of cash flow plus 3 million terminal value and 0.5 million of working capital back giving about 5.3 million. So implement collab code. So before we dive into it, I did have to set up the collab notebook to make sure everything was working properly. And essentially what you see on the screen is not very important here. I was just importing Numbi and Matt plot lib and I was setting up the parameters and defining the functions. I built cash flow structures um the free cash flows for years 0ero through 10 and this was all using information that was found in the assignment and this just included the NPR IRR simple payback discounted payback probability index um that are just essentially going to be utilized to c or to calculate the key capital budgeting metrics. So once the cell runs successfully and it did we can reuse these functions to evaluate the base case and sensitivity scenarios. So now implement so this is going more into depth and after we set up our code and this is essentially cell two of my collab notebook and here I call the build cash flows with a revenue scale of 1.0 which just means we're using the original revenue numbers from the assignment and then I calculate MPV at 8.5% IRR simple and discounted payback periods and the probability index. Next, I run the revenue minus 20 or yeah, next I run the revenue minus 20% scenario to see how sensitive the project is to weaker skills. And finally, I will test the WACC at 6.5% 8.5% and 10.5% to see how changes in the weighted average cost of capital affect the project's MPV. So, the printed outputs are exactly what I'll summarize in the next slides. So again utilizing the collab code and after we set up all our coding and the information that needed we started to create chart and this is essentially where I was creating the visuals and the first chart it shows that free cash flow over time as bars and you'll see that the big negative at year zero a ramp up in year one strong midlife cash flows and then a final bump in year 10 from the terminal value and working capital recovery. The second chart shows how NPV changes as WACCC changes. And this just essentially will give you a visual sense of how sensitive the project value is to Starbucks cost of capital. So now moving on. So from the base core outputs, the net present value of the project is about 3.02 million which is positive. This is a good thing and that means the project is expected to add that much more value in today's dollar. And this is above the required 8.5% return. The internal rate of return or the IRR the project's own return is around 13.25% which is comfortably above the 8.5% weighted average cost of capital or WACC. The simple payback period is about 5.3 years meaning the project's earned back is initial investment in just over half its 10year life. Discounted payback is about 8.2 years taking into account the time value of money. And the profitability index is about 1.24 24 which means that for every dollar invested the present value of returns is about $1.24. So essentially although these point strongly toward this being a financially attractive project altogether with this information that we got this just shows that this is um or it just showcases that this is a financially attractive project under these assumptions. So now going back into deeper into the charts that I utilized Google Collab to um to input. So this is going back to These are talking about these slides here and I'm going to go into more depth of them now. So this chart just helps us see the story visually. So we see a huge bar going down in year zero and that's expected because that's the 12.5 million total outflow between the capital and working capital. From year one onward the cash flows are positive and they rise strongly during the strong years and they level off and drop slightly later on. In year 10, the bar jumps higher because this is where we're going to be adding the terminal value and recovering the $500,000 worth of working capital. And this is essentially a pattern that's not strange or out of the ordinary. And this is typical for long long-term investments and which essentially involves spending heavy on the top and then really seeing investment payoff over the years. So sensitivity revenue at 20%. So now let's test a bad case scenario where revenues are 20% lower than expected in every year. When I scale revenues down in the Python model, the MPV drops to about -3.16 million and the IRR falls to about 3.2% which is way below the 8.5 weighted average cost of capital. And this just tells us very important thing. The project is high highly sensitive to revenue performance. If Starbucks can't achieve close to the planned sales level, this rotisserie would actually destroy value instead of creating it. So, sensitivity walk at plus or minus 2%. So, now we're going to see what happens if Starbucks cost of capital changes. When I lower the cost of capital to WA or when I lower the weighted average cost of capital to 6.5%, the NPV becomes even more attractive at $6.64 64 million at the original 8.5% NPV is around 3.02 million and even if WACC rises to 10.5% the NPV stays positive at about $1.63 million. So the project is reasonably robust to change in WACC financing conditions would have to get much worse before this becomes a bad investment. And that's essentially good news if you're looking at this from a risk perspective. So chart MPV versus WACC. So the MPV versus WACCC chart is another way to visualize risk. On the horizontal axis, we see that WATC the weighted average cost of capital and on the vertical axis is the MPV. So as WACC goes up, NPV would naturally go down because we're discounting future cash flows more heavily. In this chart, you can see that MPV is still positive for a fairly wide range of WACCC values and it only gets close to zero at the higher discount rates. And that just tells us that financing risk is not the main problem. And again, the major concern is revenue risk, not WACCC. So, what does this mean and how do we double check? So, the free cash flows line up with the revenue and cost schedules from the assignment. Depreciation is correctly set at $1.2 $2 million per year for about 10 years and taxes are only applied when EBIT is positive. So when we don't accidentally get negative tax bills, the terminal value and the working capital recovery are correctly added in year 10. And most importantly, the metrics are consistent. A positive MPV pairs with a pairs with an IRR above WACC. And the payback periods and probability index all tell a coherent story. And all of this just gives me confidence that the model is just working as intended as intended. So evolve what else could we explore. So in the evolve stage we ask how could we use this framework more broadly? We could for example add inflation to wages and rent to see how cost pressure affects MPV. We could try higher or lower marketing spending and see how much sales would need to move to justify it. We could run a monto carlo simulation on revenues to get a distribution of possible MPVs rather than just a single number. And we could compare this rotissery to alternate uh projects in Starbucks that they could invest in like for example more drive-thru locations or more digital incentives or initiatives. And the nice thing about everything in Python is that we can tweak assumptions and reun the model quickly. So reflect key takeaway and what I learned. So my biggest take my biggest takeaway for this is that capital budgeting is about discipline. A flagship roster roaster sounds nice and exciting but it's experimental. Is it great for the brand but we still have to ask does it actually create financial value? So using net present value and weighted average cost of capital, we anchor the decision to the returns shareholders require. We also see why cash flows are more important than just accounting profits because cash flows are what investors actually receive. Finally, sensitivity analysis shows us where the project is fragile and in this case it's highly sensitive to revenue shortfalls but fairly robust to changes in WACC. So my final recommendation, so putting all this information together, my recommendation is to accept the project under the base case assumptions. Financially, it shows a solid positive MPV and an internal rate of return well above the weighted average cost of capital. The profitability index is comfortably above one and strategically a flagship grocery fits Starbucks brand story and experimental positioning. However, the sensitivity analysis clearly warns us if revenues are significantly lower, about 20% lower across all boards, the project turns value destructive. So, I would recommend moving forward, but with a strong focus on location, quality, marketing, and execution to make sure that the revenue side of the story actually materializes. Thank you so much for listening. I hope you enjoyed my PowerPoint. Thank you.",
  "video_url": "https://www.youtube.com/watch?v=FWwYeegsaHQ"
}