{
  "student_name": "Jarrett Evans",
  "org_defined_id": "037163659",
  "username": "evans596",
  "video_url": "https://youtu.be/Sy1Xnz_grls",
  "transcript": "0:00 Alright, hello, today, we are- We are going to evaluate a, uh, massive capital allocation decision for Apple. So it's a proposed, uh, 90 billion dollar share, uh, repurchase program.\n0:14 So we're kind of acting as an independent- analyst, and we're using, uh, the framework that we've been using for the semester to kind of determine, uh, if this kind of creates genuine value, or just transfers it.\n0:30 So, the kind of context that we're dealing with. Uh, initially is unique in the sense that Apple is, uh, definitely cash, cash-rich, with 165 billion in liquidity, and generates about 100 billion in, uh, in- I'm sorry.\n0:50 So, however, the, the stock is, is trading at a premium, which is, uh, 30 times earnings, and growth is kind of slowing.\n1:03 So, the proposal is to deploy 90 billion in, uuuh, into a buyback. So, we kind of need to, first, as we always do, kind of, uh, confine our, our, our strengths, or define our, our strengths, and, usually, you know, 90 billion dollars is not, you know, 10% of the market cap, uh, as the initial brief suggested\n1:31 , as, or at, like, $185 per share, with 15.5 billion. in. shares, the market cap is 2.8 trillion. So this buyback actually kind of represents about a little over 3% of outstanding shares.\n1:49 So our goal is to kind of compare this 3% retirement against. Three alternatives. So, uh, a special dividend, a strategic AI acquisition, or simply holding the cash.\n2:05 So we're kind of mapping within the initial code that we use with Gemini. Uh, the- logic that we want to use, um, throughout this process.\n2:15 Um, so, for the buyback, um, we are kind of using mechanism that is, cash goes out, uh, share. Count drops.\n2:28 And if net income remains stable, earnings per share must rise mathematically. So this is the, uh, numerator-denominator effect. So, uh, for the kind of alternative, the l- project sort of changes a little bit.\n2:44 So, this is a, a value neutral, uh, regarding op- operations, but triggers on immediate tax event for shareholders and drops of stock price by the, the dividend amount.\n2:58 Uh, so this kind of assumes that we spend about $90 billion on AI and VR assets. Um, and then kind of here, we're, we're not reducing the share count.\n3:09 We're kind of adding to the numerator, uh, which is the net income. So, we'll- kind of assume a 10% return on invested capital for the acquisition scenario.\n3:20 Uh, and we're kind of also representing agency costs. Uh, we need to track how this decision specifically benefits the CEO, holding $3 million.\n3:33 So, we kind of implement, uh, the model with the parameters of the $90 million, uh, billion, uh, bill, uh, allocation across our scenarios.\n3:48 So, we kind of look at the different, different models, uhm, that we have, uhm, and, uh, I guess we'll get to the results there a little bit.\n3:59 But, there's some of our different, uh, functions and models. Uh, we initialize with, you know, the provided snapshot of the $185 share price.\n4:12 Look at the things like the $110 billion in debt. And then we kind of run our scenarios. Um, functions and you can kind of see the engine at work.\n4:22 Um, so, in the certain function that is, we can find the analyze stakeholders. Colders. Uhm, we're kind of seeing here, oops, I guess we'll go back to that.\n4:39 Analyze stakeholders. Uhm, we kind of model the incentive structure. So, we kind of calculate the value of, employee options with a $170 strike price.\n4:56 So, this is kind of, this is vital because buybacks increase the stock price, uhm, while dividends lower the stock price.\n5:03 So, we'll kind of, we'll run the code, which I, I've already done previously, and we kind of looked at, uh, each analysis starting with, like, the, the stakeholder analysis is where the, the agency problem appears.\n5:20 So, because the- the CEO owns 3 million shares and employees hold options at $170. They represent a leveraged bet. So, the model kind of shows that a buyback increases the value of employee options, uhm, significantly- significantly before it really pushes the price away from the start, uh, strike price\n5:43 . So, a dividend would kind of crush the option value. Thus, management is highly incentivized to choose the buyback, perhaps ignoring the- long term strategic value of an AI acquisition.\n6:00 So, we can kind of conclude that while the acquisition kind of creates the highest theoretical earnings per share, uh, Apple's sheer size.\n6:10 This makes integrating a $90 billion acquisition incredibly risky. The dividends is, dividend is tax inefficient efficient for many holders so we can kind of, we approve the $90 billion buyback as our, our recommendation, uh, but with a gun, like, uh, a governance, um, kind of overview.\n6:39 Um, so it kind of, in that Yes. Since we'll safely return excess capital increasing earnings per share by about 3.3% with, without operational risks.\n6:55 And we kind of signal confidence here. We're in the current valuation, which kind of, uh, stabilizes profit and expenses. So, we kind of recognize this, this benefit management option package.\n7:10 Uh, we kind of recommend the board to, the future executives to grant, uh, the return on investment capital rather than just earnings per share to ensure they don't really rely solely on buybacks or bonuses.7:25 So, this kind of balances, uh, shareholders, shareholder returns today. With capital disciplines, um, for the future. So, I kind of wraps up, uh, our assignment today, and we'll see you in the next one."
}