{
  "student_name": "Lahari Bikkavilli",
  "org_defined_id": "035990933",
  "username": "lbikkavi",
  "video_url": "https://youtu.be/shGCzxPpbMw",
  "transcript": "Hi, how are you?\nMy name is Lahari Bikavilli and we\ndid it. Session 11 assignment, the last\none. So here we go. As always, I have\nmy notes to the left here that\nkind of help me understand it a\nlittle bit more. Comments within the\ncode and the actual code and then the final\noutput that I'm going to have. I think this\ntime we might switch it up a little bit and\ninstead of spending a copious amount of\ntime going through the code, we'll start with\nat least going section by section to make\nthis one a little bit quicker. So starting\nup with, okay, the Apple buyback. This is\nmy driver cheat sheet that I have on the\nleft side here. So for short breakdown, first\nthings first, define. So the task that's\nat hand, this is what was in the textbook,\nis to decide if Apple's $90 billion buyback\ncreates value compared to dividend, acquisition,\ndebt reduction, and R&D. My goal is\nto quantify their financial impact and\nstockholder impact. So retail, CEO, Berkshire\nemployees, bondholders, et cetera. And then\nusing key metric, EPS, price, DE, ROIC,\nownership, percentage, et cetera, et cetera. So starting with the code here, if I open it up, I see obviously our\nimport statements those are pretty standard\nat this point here are our base case assumptions\nor our parameters as we know every time\nwe do a different situation like this we\nhave to have some sort of parameters that we can\nassume the information on so for this case\nwe're going to say that our initial share\nprice is going to be the 185 shares\noutstanding 15.5 billion that's why it's e to\nthe ninth it's all those decimal places total\ndebt cash and investments proposed cash allocation\nthen financial assumptions so constant\np.e multiple for valuation such signaling.\nThe effective tax rate, average interest\nrate on debt, which is 3.5%. Moving older\nto our stakeholder assumptions, we have the\nBerkshire initial stake or percent of their\ntotal shares, which is 6%. CEO share ownership,\nwhich is 3 million shares. Again, you see\nthat to the E there. Typical retail holder\nshare count is 100. Assumed employee options\noutstanding is 10 million. Employee option\nstrike price is $170. And then back solve for\nnet income and earnings before interest and\ntax this is our EBIT we're assuming the\nnet income in billions so we're assuming that\namount in the net income for billions and then\nwe have our interest zero which is going\nto be the debt zero times our debt again\nusing all of the different things that we've kind\nof put out here to do the EBIT what is it\ngoing to be so use for baseline interest coverage\nthis is the basics of the beginning of\nour math so we have all of the different\nparameters down so that we're able to figure\nout okay one what math do we have to do two\nwhat numbers do we use to do that math moving\nforward now we have our print statements\nthis is the basic stuff to make the output\nlook really clear to everyone so baseline\nfinancials and we're going to print out what the\nbaseline financials are for apple then moving\non to number two we have our scenario\ndefinition dictionary so this is like what the\ndifferent scenarios are and where to look at\nwhat is going on in that scenario so baseline\nbuyback dividend acquisition debt reduction\nr&d i'm actually going to switch back over\nto my cheat sheet here and see discover so\nbuybacks raise eps by reducing share cows not\nby increasing the ni or value transfer r d\nacquisitions raise ni so value creation\npotential debt reduction improves risk credit\nmetrics dividend gives immediate cash but no\nlong-term improvement so let's go through and\nsee that a little bit more here here are\nour core metric and calculation functions so\nwhat we discovered is a result of what the\ndifferent calculations kind of put forward so\nmoving back into our core metric calculations\nwe have calculate metrics scenario data so\ncalculate core financial metrics for a single\nscenario that's what we're essentially\ndoing so this is shares change debt change then\nyou have the ni and ebit adjusted for\nstrategic investment slash debt reduction and\nwhat's that going to be so this is the uplift\nhere eps and notational share price is simulating\nmarket reaction signaling we're going\nto see the equations for those excuse me also\ni'm a little bit sick so nose is a bit stuffy\nhere leverage and roic so market cap one\nprice one and one and then we have assume ni\nis a close approximation for notepad or for\ncapital charge calculation this code was honestly\nvery difficult for me to understand\nat first just because there were a lot of\nabbreviations and a lot going on after reading\nthrough the chapter it was a bit more clear\nbut the code was still really difficult so\nwhat I did that I have been doing at least for\nthe last four or five weeks is I got my code\nput it into my collab from Gemini but then\nI've re-prompted Gemini to give me as many\ncomments as possible and to kind of explain\nwhat I wanted those comments to look like\njust so if I for example a year from now was\ngoing back through the code to understand what\nwas going on I'd be able to understand\nwithout being like well what are all these different\nacronyms and feeling like i needed to\nsearch everything up separately so moving\nforward we have the bond bondholder metrics here\nso interest is going to be the debt times\nthe r debt and so if we look at here we can\nsee what this value is so this is going to be\n0.035 representative the 3.5 percent and\nthe debt one is just going to be a variable\nthat we have so a note that i added here interest\ncoverage should be infinite if debt one\nequals zero and ebit one is greater than zero\nso interest coverage one we're checking\nthe EBIT one and then interest one if interest\none is not equal to zero float etc then\nwe're returning all these values we're returning\nexactly what decimal we want or excuse me\nwhat form we want it in so e to the ninth\nis going to be in that millions billion section\nagain e to the sixth same concept so I\nactually think e to the ninth is billions and e\nto the sixth is millions if I'm correct so then\nwe're applying the core calculations to\nall scenarios the fix two cog function once\nso for name data metrics equals calculate metrics\nessentially doing the same thing and\nwe're using all of those to our um all those\ncalculations that we did previously for our\nscenarios specifically number four we're adding\ndividend column for stockholders cash flows\nfix what is creating the column first so\num i also always try to do some sort of a\ndiagram or visual display because i think\nthat for me helps me personally understand\nthe information better so we're slowly going to\nstart building that down here and you'll see\nthat a little bit later as well then we have\nthe stakeholder metrics quantification common\nderived variables so uh the results here\ninstitutional holder berkshire and ceo\nagency and ownership concentration essentially\ngoing through and doing all the different\ncalculations that was outlined in the textbook\nretail shareholder similar concept going through\nand doing the math then we have employee\noptions so the 170 strike the retention\nslash their incentive intrinsic value per\noption is going to be max their price one minus\nstrike and then zero so results option intrinsic\nvalue in millions then uh display columns\nright so we're going to have the different\ndisplay columns dividend per share retail\nvalue change like that stakeholder and scenario\ncomparison matrix so finally we're going to\nprint the key findings that we find ceo stake\nincrease and this is kind of what we were\ntalking about a little bit more in my cheat\nsheet which i will go back to visualization\none this is what i was talking about\nearlier as you can see we have the x label the y\nlabel uh the different ticks on the graph\nthings like that i won't spend too much time\ngoing through the actual code but it is here\nif want to be reviewed again you can see the\nbars for my bar chart that i use i just going\nthrough the code is not nearly as useful\nas going through the actual graph visualization\ntwo is the ownership concentration option\nvalue again i use a chart for this as well\nso similarly i'm not going to be heavily\ngoing through the code um moving forward and\nthen we see um up here this is going to be\nour baseline financials that we calculated\nstakeholder and scenario comparison the matrix\nthen we're gonna have our first bar chart and\nthe second bar chart but before we get into\nthat i am going to whoops if i can scroll\nback down here i'm going to cut back out here\nto again so we discover right so with all the\ndifferent calculations this is my interpretation\nso what does that really mean so the\nbuybacks raise eps they were by and they do\nthis by reducing the share cal and they don't\nincrease ni which is the value transfer\nso r&d slash their acquisition raise is a\nvalue creation potential and then debt reduction\nimproves risk credit metrics so dividend\ngives immediate cash but no long-term improvement\nand that's kind of what i think personally\nis the most important thing to note here\nspecifically then next i have the rest of the\ndriver here So discover, represent, implement,\nthings like that. Moving through the\nnext for represent, I use structured\nmodel using a baseline assumption, the\nscenario dictionary, and then one metric\nfunctions for the EPS, price, DE, ROIC, and\ncoverage. And then I added stakeholder\noutputs to the ownership, options, and retail\ncash just to help make this a little\nbit more detailed. For implement, I\ncalculated all the scenarios. So I built\ncomparison tables and the two graphs. And\nI used EPS versus DE. And then I did\nownership versus option incentives. and then\nto validate this i had the baseline eps slash\nmath made sure it checks out kind of did\nthat multiple checking back and forth there\nand then i saw that the buyback decreased\nshares so the eps increased and then debt\nreduction decreased interest expense\nplus increased cover increased coverage so\nbaseline option value is 150 million which was\ncorrect that's what we originally saw so\nevolve i added dividends ownership concentration\noption values bull holder metrics\nand essentially all these other things one\nto meet the assignment requirements but\ntwo also and more importantly to make\nsure that the data was understandable and that\nit was giving me all the information that it\nshould be the different graphs i made would\nnot be nearly as useful if they didn't\nhave a proper x-axis a proper y-axis and\nother things needed to excuse me other things\nneeded to make sure that there was actually\nthe proper information in the graph itself\nso reflect here just says buyback helps\nshareholders immediately but increases ceo\nsuch berkshire power are in the acquisition\nsame kind of similar concept death reduc\nuh not debt sorry debt reduction strengthens\nfinancial capability now moving into here\nthe baseline financials so we know that\ntheir market cap is currently sitting at\naround 2867 billion right their baseline eps\nis 6.45 on the dollar and their baseline\nde ratio at the p0 is going to be 3.84\npercentage now moving into stakeholder and scenario\ncomparison metric excuse me um we're\ngoing to have their n1 this is going to be\nuh the billions EPS in dollars, price in\ndollars, DE in percentage, and then ROTC. As we\ncan see from buyback, the baseline buyback,\ndividend acquisition, debt reduction, R&D is\nwhat's going to be on the left hand side.\nAnd that's going to be going down here a little\nbit too. So we can see the N1 going to\nbe fairly similar for everything, maybe increased\na little bit here. EPS maybe increased\na little bit around the acquisition here\nin dollar amount, but also fairly\nstandard. And the rest of these numbers look\nfairly consistent except for debt\nreduction here dropped to six seven which is\ndefinitely very low on the percentage scale\nso moving forward very low in comparison\nto the others excuse me so interest\nexpenses and then their dividend per share\nthings like that similar concept here we see the\nconstant 3850 except for debt reduction which\nwent to 700 and you can see debt reduction\nis going to be the number that's a little\nbit different going into this this category\nas well and then here for a dividend per share\nwe're to see six for the dividend which is\na little bit different at least going through\nthe numbers are here as well honestly for\nme i think the numbers are there and they're\nuseful to have but overall i don't really\nthink that they help me understand the\nconcept of the problem as much so i won't spend\ntoo much time getting into the thick of\nit um moving forward retail value change\noption intrinsic value so this is going to be in\nmillions this is going to be in dollars and\nthe key finding this is the important part\nso the agency risk the ceo stake increases\nfrom 0.09 0.019 to 0 .020 under the buyback\nso we see there's a little bit of an increase\nhonestly barely any but it's still notable\nenough for us to account for it now the\ngraphs so what this first graph shows here if\ni can maybe shrink it down a little bit\nperfect that looks better so the first graph\nhere is going to be the visualization one which\nis eps and leverage impact the value\ncreation um and then protection metrics we're\ngoing to say the blue bars eps after each of\nthe scenarios so those are these bars here\nthat my cursor is on so the blue bars red bars\nis the debt equity ratio after each scenario\nis that DE ratio. And then the\ninterpretation, the buyback, biggest EPS jump because\nshare count falls. So financial engineering,\nnot operational improvement, DE stays\nabout the same. So the biggest change here is\nthat the DE we're going to see in this debt\nreduction is obviously fairly lower. But the\nmain thing to kind of keep in mind and look\nat here is that the biggest EPS jump because\nshare count falls. Next, moving on, we\nhave dividend, which is EPS and DE don't change\nbecause dividends don't affect the nir\nshares that's fairly given so as you can see\nhere this pretty much stays constant acquisition\nr&d both increase eps because ni increases\nthis is real value creation not anything\nthat's cosmetic or just for the show of the\nmarket debt reduction eps barely moves\nbut de drops sharply apple becomes financially\nsafer bondholders benefit most so as we can\nsee the debt reduction has gone down in that\nsense um takeaway buyback improves\neps the most but not fundamentals. R&D slash\nacquisition improve fundamentals. Debt\nreduction lowers risk. Now moving on to graph two\nhere. Visualization two kind of picked a\nlittle bit different colors and added a\nlegend in the top left. Stakeholder concentration\nand option value analysis using agency\nslash incentive metrics. So dark green is the CEO\nownership percentage. Medium green is going\nto be the Berkshire stake here. And then\nwe're going to see the blue is the employee\noption value the gray line is going to be\nthe baseline option value interpretation\nthe buyback ceo and berkshire stakes rise\nbecause fewer shares exist so there's more\nconcentrated control and agency risk option\nvalue rises because the price goes up r d slash\nacquisition ownership stays stable but option\num yes sorry so the but the ceo such\nberkshire uh rates rise because fewer shares\nexist so it's\nmore concentrated control and agency\nrisk option values rise because the price\ngoes up R&D slash acquisition ownership\nstays stable but option value increases due to\nNI improvement which this is good for\nincentives without you increasing the CEO\npower and finally debt reduction dash dividend\nno ownership or incentive effects and that's\nhonestly what we can see here in the graph\non the right sorry I didn't scroll all the\nway down so you couldn't see the x-axis here\nand then the takeaway from this is that the\nbuyback shifts power towards the insiders\nthis innovation scenarios rewards employees\nwithout changing control overall so the final\nrecommendation i tried to do something that\nwas short strong and assignment friendly\nso do not allocate the full 90 billion dollar\nto buybacks was my final recommendation\nbuyback raises eps and stock price mechanically\nbut does not create fundamental value and\nincreases ceo slash berkshire control\ncreating a governance risk of having too much ceo\ncontrol r&d and strategic acquisition scenarios\nincrease ni and roic driving real long\n-term value creation debt reduction improves\nstability but doesn't add any growth dividend\nis cash neutral long term best strategy\nblend a moderate buyback signaling here's my\nrecommendation for best strategy sorry is blend\na moderate buyback so signaling slash\ncapital return with a meaningful investment\nin r&d or strategic ai vr acquisition this\nwill drive long-term ni and roic growth this\napproach balances shareholder returns\nstrategic growth stakeholder incentives and\nstakeholder incentives and the risk management\nso overall this is my total claim and my code\nfor the assignment um I definitely appreciated\ndoing these throughout the semester uh yeah\nbut I enjoyed but this is my final and\nthese are my graphs just for a final look\nand my code one more time but yeah that'sall for me thank you"
}