{
  "student_name": "None None",
  "org_defined_id": "036767359",
  "username": "gmultan",
  "video_url": "",
  "transcript": "So, here we have mini project number three. Loop one, it's all about financing a car, buying a car, however you want to do it. Loop one, I made it simple to a point where I made it simple but difficult at the same time. So, it's not easy to use. And then second loop, I made it easier to use. I added a chat version in this. But in this one, you have to go into user input and you have to manually type in all these different things. The down payment, the months, the APR rate, the total price, and then what question you wanted to answer instead of just typing it into a chat over here. But once you execute that workflow, it would give you an answer, give you the amount of loan that we took out, a monthly payment, how much we'll end up paying over time, um, with interest and other fees. Then it tells you how much you'll paying you'll be paying in interest alone. And then it gives you something like at the end the interest is essentially the cost of borrowing the money which is important to understand and budgeting your finances. So that's that right there. And now we got the second loop we have right here. So I asked it a question. said, \"I want to buy a car for $35,000 with down payment of $5,000 with a trade in value of $3,000. APR rate is 7.5% for 72 months, and I'm looking to pay about 400, 600 a month.\" So, it would calculate this automatically once I typed it in. Loan amount minus the down payment and the trade value. That's that with the APR 7.5. It calculated the payment. I said I was looking for between 400 to 600. It became 450 to 470. Now the total is 32. But with the loan principle and interest, it tells you the total 33800.\n\nGives you the total interest that will be paid roughly. So then it fits your target monthly payment for 4 to 600. Then it gives you limitations as well. This is an estimate that may not include taxes, fees, dealer add-ons, and exact credit profile. Confirm details with your lender dealer. Now if I say what if my credit score is 660, dealer fee is 2,000\n\nand Taxes and fees range at about range estimate at about $700.\n\nNow, see, that's going to calculate that for me. I just type it in. just ask a question and and then\n\nOkay, see hold on. So I got to redo this because\n\nI got this this right here. I got I got list the price\n\nand then ask this question along with it.\n\nAnd now we will get our answer once we type it in all together.\n\nSo I guess it's still working.\n\nThis also took me a while to figure out. It was giving me a hard time. I thought I had it, but it looks like there's still something going on with this.\n\nSo, now it's still trying. So, let's see what it comes out with.\n\nMaybe I can try asking with a different price.\n\nSee 30,000\n\ndown\n\nsame API\n\nsame thing. Okay. So\n\nguess I can stop. Is that the stop button? Okay, stop button. So just reset that. Oh, but look. See? Okay, it also answer it.\n\nIt did answer it. Okay. I don't know why it was taking so long, but yeah. See, look. It did answer it. It's currently not responding properly, but based on your inputs with the taxes and fees, the dealer fees, it came with the total price, the down payment, the trade in. Okay, so I guess the app is working slow,\nbut I guess it's working slow on the output, but it replies in the chat with everything. So I asked that change the numbers on the car price, no trade in value, change the number on the down payment. They calculated my monthly payment 72 months and calculated the loan and the interest that would be added on top of the loan and it still fits within the $400 600 monthly payment range. then provides me limitations the same one as last time. But yeah, this was kind of annoying and difficult to make, but somehow some ways still kind of got it done."
}