{
  "student_name": "Hector Silen",
  "org_defined_id": "036247734",
  "username": "hsilenri",
  "email": "",
  "transcript": "Hello, my name is Hector Selen and this is my video submission for the session 10 assignment. So for this assignment I'm presenting a capital budgeting analysis for the Starbucks flagship roaster. So for uh this assignment I use the driver framework to guide my analysis and a Python script to help me with my financial calculations. So moving on to my first stage of the drive framework which would be the define stage. I establish the financial objective. So basically Starbucks is considering a $12 million upfront outlay and my goal is to apply the net present value rule which is basically if the present value of future cash flows exceeds the cost or creating value for shareholders we accept. And for this we we're using an 8.5 whack as our hurdle rate. So for this uh I isolated the key inputs from the project uh parameters and from this two things stood out to me. The first is that is the asset life. So the project creates a tax shield through depreciation over 10 years. And the second thing that stood out was the cost structure. Basically we have high fixed costs especially the 2.5 million in labor and the 0.8 million in rent annually. So basically this indicates that we have a high operating leverage. So before writing the code I also represented the logic of my plan right here. So as you can see I mapped I mapped out a standard free cash flow model. So I started with revenue uh then subtracted operating expenses and taxes to find the N oat and adding back non-cash depreciation. Finally, I also plan for a 10-year logic gate to handle the working capital recovery and the taxable terminal value. So uh moving on to the implement stage. As you can see here, it's the code I use to do all my financial calculations. And uh right here is the uh output. So uh first uh as you can see the financial financial schedule I generated uh we can uh see that the FCF or the free cash flow uh tells a really uh important story for us. Uh since in year zero we see a negative $12.5 million and basically this this number captures the 12 million capex plus the $500,000 working capital injection. In years 2 through9 we see stable positive cash flows of $2.7 million. And finally in year 10 uh the cash flow jumps to $4.55 million. uh which reflects the terminal value recovery. So uh my code also visualizes these numbers as you can see in these graphs. So the large the large red bar right here in this in the base uh case free cash flows uh graph uh represents the initial 12.5 million outflow and the series of green bars uh seen consequently uh represent our positive operating returns. So as you uh as you can see from the schedule uh we have first the negative uh $12 million and then we go on to see positive trends. You can see that the consistent um years 2 to five of $2.7 million is represented right here in the graph with the uh these green columns and the final 4.5 uh in the last column. Um so yeah on the right you can also see the uh sensitivity chart and basically these line graph plots are MPV on the y ais against the discount rate on the x x axis. So the purple line uh right here shows that as the cost of capital increases our value decreases. And the red dotted line right here is the uh break even point. And since our purple line stays above the red dotted line all the way to uh 10.5% we know the project is uh robust. So now that we understand the output uh we must validate it and um so we move on to the validate section of the driver framework. So uh for this uh stage I manually uh calculated the year one uh numbers. So uh the revenue is 8 uh $8 million. the operating costs uh which would be the fixed labor random marketing uh I got a total of 6.8 million uh for the depreciation uh I also got 1.2 million and uh the and this all of these numbers result in an EBIT of exactly zero. So uh with a zero tax uh our free cash flow is simply the depreciation added back. So 1.2 million. So my model output uh matches this perfectly. Therefore uh the logic of these uh calculations is uh valid. So uh finally uh we move into the well not finally but now we move into the evolved stage. So I evolved the model to stress the to stress test our assumptions. So uh if we go down here first uh looking at the base case the MPV is 2.69 million the IRR is 12.84% 84% and the profit profitability index is 1.22 uh times. So the project is financially attractive. However, uh when I ran the sensitivity analysis I previously showed so right here um I found uh a critical risk. So in scenario one where uh you can see uh my calculations here for scenario one uh when I found sorry for scenario one where revenue drops by 20% the MPB crashes to negative uh 3 uh 3.08 million and this confirms uh uh my earlier suspicion about the operating leverage. So because the fixed costs which would be the labor and rent are so high the 20% miss in sales wipes out more than 100% of the project's values. Also as we saw in the line chart uh right here the project uh is less sensitive to the cost of capital. So even with uh uh WAC uh even if WAC spikes to 10.5% the MPV remains positive at 1.35 million. So finally we move on to the reflex stage. So I synthesize these findings into a recommendations. So my own personal recommendation for Starbucks is that they accept the flagship roaster. This is because it clears the 8.5 uh% hurdle rate with 12.84 uh% irr and it also adds uh $2.69 million uh dollars to firm value. However, uh these recommendations uh also comes with uh strict warning regarding the revenue risk. So because this negative downside is so severe so uh -3 million in NPV management must be certain of the demand forecasts. So if there is doubt about hitting that 11 million uh dollar revenue target we should delay the project or re rene or re re ne renegotiate the fixed labor contracts to lower the break even point. So, thank you for watching.",
  "video_url": "https://youtu.be/aRZAGdePkiM"
}