{
  "student_name": "Robert Dinn",
  "org_defined_id": "035870380",
  "username": "rdinn",
  "email": "",
  "transcript": "Uh hi guys. Uh my name is Robert Den and in this video uh I'm going to be walking through my full WACCC and capital structure analysis for Netflix using the driver framework. Um so I'm going to be referring or referencing my labeled Python cells in Google Collab as I go through the stages define, represent, implement, validate, evolve, and reflect. All right. So uh define and discover um in the define and discover stage stage I need I needed to uh understand the strategic problem Netflix is facing. So Netflix is current Netflix currently has a 200 billion market cap and about 13 billion of market value debt. They are considering issuing an an additional three billion in debt to finance a major content expansion. The key question I need to answer is how will this new financing affect Netflix's weighted average cost of capital and which capital structure structure is strategically optimal? I also need to determine whether the same discount rate should be used for different types of content investments such as US content and international content which have different risk characteristics. Finally, I need to compare Netflix's WACCC to its industry peers, uh, specifically Disney and Amazon Prime video, and discuss competitive implications. To support this analysis, I must calculate cost of equity using CAPM after tax cost of debt, market value, capital structure weights, current and post debt, WACC, project specific WACCC adjustments, sensitivity to leverage leverage and beta uh peer comparison. All these requirements shape the analytical and technical plan I build in the next stage. All right. So that next stage is the represent stage. In the represent stage, I designed my analytical structure and mapped the work to the Python cells. Uh my plan uses a mod modular approach. Uh cell A imports uh libraries like uh numpy, pandas and mattplot liib. Cell B centralizes all financial parameters in one dictionary so that the analysis entirely configurable. Cell C defines the CAPM formula for cost of equity. Cell D calculates the after tax cost of debt which incorporates the tax shield. Uh cell E contains the full WACCC computation using market value weights. Cell F and G uh implement beta under unlevering and relevering uh using the Handanda Hamada equation to to model how additional debt affects equity risk and the cost of equity. Uh cell H applies project specific risk adjustments for for US versus international content investments. Cell I builds a peer comparison table against Disney in Amazon. Cell J's cells J and K run a sensitivity analysis and create a visualization of WACC as debt changes. So by the end of the represent stage, I had a fully mapped computational workflow that ties directly to the financial concepts I need to evaluate each Python cell corresponds to an explicit part of my analytical design. So in the um in the in the implement stage um I executed the analysis step by step following my plan. First um in in cell C I compute uh Netflix's um cost of equity using the uh the CAPM formula. um R sub E= R subf plus beta time the uh beta of the market risk premium. Um so using the provided risk-free rate of 4.5% uh beta of 1.3 and market risk premium of 5.5% the cost of equity comes out at 11.65%. So next in cells D calculates the after tax cost of debt um using the formula of return bond yield times 1 minus the tax rate. Um so with a yield of 5.8% and a tax rate of 21% the after tax the after tax uh cost of debt is 4.58%. Um so then in cell E I compute Netflix's current uh WACCC using market value weights uh market cap of 200 uh billion and market debt of 13 billion. This gives us uh WACC of approximately 10.8%. or 11% um which reflects Netflix's heavy reliance on equity financing. Uh next in cell F and G I implement um beta on unlevering and relevering into uh account for the the new 3 billion in debt. After relevering beta, the new cost of equity rises because financial leverage increases equity risk. As a result, the post debt WACC changes slightly. The new WACC after issuing the additional $3 billion in debt ends up being around um uh the uh the 11.2 um showing that the capital uh structure does not materially reduce WAC and might slightly increase risk. So in cell H I um I calculate project specific WACC's. I assume international content carries a 2% higher risk um premium due to greater uncertainty. This gives us this gives US content WACCC um 11.2186%. Uh international content WACCC around 13.21%. uh this supports the idea of using a divisional WACCC approach instead of one company uh wide hurdle rate. Next in cell I I compare Netflix's WACC to to industry peers Disney uh 8.2%. Um Amazon Prime and Video of 9.5% and Netflix was around 11%. This tells us Netflix's uh busyiness or business model is riskier riskier and its capital structure is more equityheavy leading to a W or leading to a higher WACCC. Finally, in cells J and K, uh I run sensitivity analysis over beta values and debt levels. The plot in cell K um visualizes how WACC uh changes as Netflix adds more debt. The chart shows that beyond a certain point additional leverage increases WACC because higher equity risk outweighs the task the tax benefit of debt. So in the validate stage I verify my results against benchmarks and uh reasonability checks. First, the the cost of equity and cost of debt are consistent with market expectations for companies with Netflix's beta and credit rating. The WACCC values also fall within the typical media industry range of 8 to 10%. Uh with Netflix slightly above that range. Um so yeah which makes sense because uh given its growth focus and pure play streaming model. Uh the pure companies um and and cell I also validates that Netflix should have a higher WACCC than Disney because Disney's uh diversified revenues reduce risk. Similarly, Amazon's WACCC is lower because Prime Veno uh benefits from Amazon's overall corporate diversification and lower cost of capital. My sensitivity analysis and sales uh JNK confirms that uh the relationship between leverage and WACC uh behaves as expected under capital structure theory. Moderate leverage can lower WACCC but excessive leverage increases equity risk enough to push WACC upward. Uh the these checks ensure that my outputs are consistent with the financial theory and real world benchmarks. Um all right so the next stage is evolved is evolved in this uh in the evolved stage I consider how this analysis can be extended. So the capital structure model can easily incorporate macroeconomic interest rates changes uh different credit rating scenarios uh stochastic simulations of beta uh Monte Carlo valuation of content investments forecasting future WACC under strategic plans. Uh, additionally, project specific discount rates could be expanded by estimating uh, betas for individual content categories or by applying the pure play method to international markets. Uh, the flexible uh, structure of the notebook makes these uh, extensions straightforward. All right, so reflect. Uh to conclude the um to conclude working through this analysis using driver framework helped me engage deeply with um both the financial concepts and the computational implementation. I learned how capital structure choices uh directly affect equity risk borrowing cost and ultimately Netflix's weighted average cost of capital. I also saw why Netflix's WACCC is uh naturally higher than companies like Disney and Amazon due to uh its con concentrated uh uh business model and lower diversification. The $3 billion in debt insurance only slightly affects WACCC because Netflix already has a very equityheavy structure and the marginal tax shield benefit is limited. The project specific WACC analysis shows the international content carries significantly higher risk and requires a higher hurdle rate for investment justification. Overall, this assignment strengthened my understanding of how WACC connects to investment decisions, valuation, and strategic finan uh financing choices within a competitive industry. Um yeah, that is everything that I have. Uh thank you guys so much for watching.",
  "video_url": "https://youtu.be/J4gMZOXVAlM"
}