{
  "student_name": "None None",
  "org_defined_id": "034365943",
  "username": "rgilber",
  "video_url": "",
  "transcript": "Hello everyone, my name is Ryan Gilbert, and today I'm going to walk you through my project: Finsight, an AI-powered finance intelligence system I built from scratch. This demo is designed to be simple, less than fifteen minutes, and I'm going to show you exactly how Version 1 and Version 2 of the tool behave when asked real financial questions. Everything you will hear today is made-up data intended to simulate the tool's actual capabilities.\n\nBefore I show you anything, here's the problem Finsight is built to solve. Most people don't struggle with math—they struggle with interpreting financial decisions. Budgeting apps show graphs but not meaning. Investment apps show numbers but not implications. People know their paycheck, their savings, their bills, but they don't know what to do with that information. That's where Finsight comes in. The tool takes any financial question and produces clear, reasoned guidance that explains what's happening, why it matters, and what action makes the most sense.\n\nI'll start by showing you Version 1. Version 1 was my baseline: a very simple, stateless model with no memory and no retention. It only sees the user's question and nothing else. It's designed to be fast, direct, and deterministic. The architecture is straightforward. There's a manual trigger, a text input node, a formatting node that structures the question, and then the OpenAI node that handles the reasoning. Finally, the response is returned through a simple output node.\nLet me show you how V1 answers a typical one-off question. I'll type: \"If I invest $400 a month at a 7% return, how much will I have in fifteen years?\" And here's the response Finsight V1 generates: \"At a $400 monthly contribution earning an average annual return of 7%, you would accumulate approximately $126,000 after fifteen years. Roughly $72,000 of that is contributions and about $54,000 is investment growth.\" Pretty simple. No memory, no conversation history—just straight math and explanation.\nNow I'll ask another V1-style question. Something slightly more qualitative: \"Should I lease or buy a car if I drive 10,000 miles per year?\" The model responds: \"If you drive 10,000 miles annually, leasing is usually cheaper upfront and avoids long-term depreciation risk, but buying becomes more cost-efficient over longer ownership periods. Based on typical lease limits, 10,000 miles per year fits within standard contracts, but buying may save money if you own the vehicle for more than five years.\" Again—V1 just answers the question directly and stops there.\nI'll show one more V1 example. \"What percentage of my income should I save if I want to retire at 60?\" The tool replies: \"To retire at 60, a common target is saving 20–30% of gross income, depending on expected lifestyle, investment returns, and current savings. Increasing your savings rate or delaying retirement both significantly change the probability of success.\" And that's V1. No context. No memory. No personalization. Just clean analysis.\n\nNow let's move to Version 2, which is where things get more interesting. V2 adds state. It stores memory, uses past messages, and carries forward context throughout an entire session. This transforms Finsight from a one-off calculator into a conversational financial advisor. In this version, the workflow includes a memory node that logs previous messages, a custom logic layer that looks for patterns, and an improved AI prompt that allows reasoning over context rather than isolated questions.\nTo show the difference, I'll restart and ask V2 a first question: \"I make $85,000 a year and spend about $3,200 a month. Am I saving enough?\" The system responds: \"Based on an $85,000 salary, your take-home pay is roughly $5,300 a month. With $3,200 in spending, you're saving about $2,100 monthly—or roughly 40%—which is excellent. With that rate, you're on track to exceed typical retirement benchmarks.\"\nNow I'll ask a follow-up that depends on memory: \"What if I want to buy a house in five years?\" And here's where the context kicks in. The model replies: \"Given your savings rate of roughly $2,100 per month, over the next five years you could accumulate around $140,000 including moderate investment growth. That's enough for a strong down payment on a $450,000 home, assuming standard lending guidelines. If you want to reach a higher purchase price, increasing your monthly savings or diversifying your investment contributions would help.\"\nNext, I'll ask another linked question: \"Should I keep my emergency fund in a high-yield savings account or invest it?\" The model remembers the earlier details and answers: \"Because you're saving $2,100 monthly and planning a major purchase in five years, you should keep your emergency fund—typically three to six months of expenses—in a high-yield savings account for stability. Your long-term savings, however, may benefit from investment exposure given your high savings rate and relatively low expenses.\"\nNow I'll ask something that intentionally tests deeper memory: \"How would buying a car affect everything we've discussed so far?\" V2 answers: \"A vehicle purchase would reduce your short-term savings capacity. If, for example, you financed a $25,000 car at standard rates, your monthly payment might be about $480. That would lower your savings rate from $2,100 to roughly $1,620. Your five-year down payment target would shrink from around $140,000 to closer to $115,000. If home ownership is the higher priority, delaying the car purchase would keep you better aligned with your existing plan.\"\nNow I'll show how V2 handles a more involved scenario. I'll ask: \"If I switch jobs and get a salary of $100,000, what changes?\" And the model automatically incorporates everything it knows up to this point. It says: \"With a $100,000 salary, your monthly take-home pay increases to approximately $6,000. Assuming your expenses remain $3,200, your savings could increase to around $2,800 monthly. This would put you ahead of your five-year home savings target even if you chose to take on a moderate car payment. You'd also have flexibility to invest more aggressively or accelerate your retirement timeline.\"\nI'll ask another contextual question: \"Does it still make sense to buy a home in year five?\" The system replies: \"Yes. With the improved income and sustained discipline, you would be financially positioned to purchase within four years instead of five. Your projected down payment by year four could reach roughly $135,000. If you raise your investment allocation from 30% to 50%, that number could exceed $150,000 depending on returns.\"\nTo show how V2 reasons across multiple previous queries, I'll now ask something more strategic: \"Which investment allocation matches my goals?\" The model replies: \"Based on your current profile—strong savings rate, moderate expenses, long-term focus, and a goal to purchase a home soon—you should maintain two buckets. A short-term safety bucket held in high-yield savings or short-term treasuries for the home purchase. And a long-term growth bucket allocated roughly 80% to equities, 20% to bonds for retirement. This preserves stability for near-term goals while optimizing long-term compounding.\"\nNow let's add one more twist. I'll ask: \"What if the market drops 20% next year—how should I adjust?\" The tool responds: \"A 20% drop would not materially damage your long-term plan because your high savings rate allows you to continue buying at discounted prices. For your home fund, avoid exposing those dollars to market volatility if the purchase is within five years. But for your retirement investments, continuing to contribute during a downturn historically leads to stronger long-term results.\"\nAnd finally, I'll wrap up the V2 demonstration with one last composite question: \"Given everything we've talked about, what would you define as my three biggest financial priorities?\" The tool answers: \"First, preserve your emergency fund in a stable account given your upcoming major financial goals. Second, maintain a consistent long-term investment strategy that reflects your increased income. Third, stay focused on your down payment target, as you are financially positioned to purchase a home within four years if you continue your current habits.\"\n\nThat's the power of Version 2—context-aware financial reasoning that remembers what you said twenty questions ago and adapts the entire plan as your situation changes.\n\nTo finish the demo, I'll summarize the difference between the two versions. Version 1 is fast, simple, and clean—designed for isolated questions that need immediate answers with no memory. Version 2 acts like a living financial advisor. It understands your income, spending, goals, time horizon, and trade-offs. You can talk to it the same way you'd talk to a human advisor, and it recalculates dynamically as circumstances shift.\nThat's the full demonstration of Finsight. Thank you for watching, and I hope you enjoyed seeing how the tool evolves from a basic AI calculator to a contextual financial decision engine."
}