{
  "student_name": "None None",
  "org_defined_id": "034593722",
  "username": "beebe9",
  "video_url": "",
  "transcript": "All right, welcome to the Mini Project 3 Umm, Spencer Beebe. So for this project, we're building an advanced AI finance tool. Umm. So many project one, we build something mini project 2 we used finance, a finance tool and this one really intelligent finance tool. Uh, So what makes us different? We're gonna understand the context, explain the concepts, provide personalized insight, and explain why, not just what. Umm, so I didn't use NAN because my free trial had expired umm, so I created this on a different platform called base 44. Uh, it's, it's basically an AI app generator, very similar to Nan umm, but a little easier to uh. To work with. Umm, and it's free. So that's that's basically why I went with that. Umm, so. I uh. I guess we'll start with discover here what financial decisions need explanation, not just calculation. Uh, and basically I, I went with uh. You know this external data via API calls, price rates, news and incorporate into analysis as well as structured or excuse me, as well as a multi step reasoning tool. Uh. To kind of break down everything. So these are the two capabilities that I went with right there. Umm. But it it does also have, you know, guardrails and sanity Sani sanity checks to prevent bad advice. So I guess I'll show you. So this is my loop 1 um. Is basically the exact same as the loop 2. So what I have now is technically the loop 2. Umm, that's just because I added in the sources sanity checks and uh, you know the limitations. Umm, so this is technically loop 2, but it's also loop one at the same time. Uh, only difference is the, you know, the sources and everything like that. Umm, so I I can probably go back to version history here, so yeah, uh. Loop one versus loop 2 here, uh, exact same thing, only difference is the sources in in everything umm. So I'll give you a look at that umm. So I guess, uh, I can just show you how it works here. We'll test it with real scenarios. Umm. You know, I I programmed the AI to. You can put in any prompt and then it'll it'll. You know, recall the data? Umm. And it'll give you a good analysis and possible recommendation of what to do. So I have some some questions here from ChatGPT. Just, you know, for example, uh, so we'll take this one, compare Tesla and NVIDIA stock performance over the last week using real data, then give me a summary. So that's all we're going to put in here. I'm going to press submit and now it's analyzing external data streams. Something went wrong. Here, let's try that again. An embedded page. Alright, well, let's try a different question then see if. Some Ramon. There we go. OK. So I'll have to double check and maybe that's how I'll make the loop 2 better. So this is what will happen here. Umm, only difference is for loop 2, this orange box here limitations insanity checks would not be there as well as all of the you know, the dot coms, all the web pages where the sources are from umm. So basically the question was what's the current price of Bitcoin and what major news events might be affecting it today? So it said to provide the current price of Bitcoin and identify major news events affecting it. Today I access real time financial data and recent news articles. The financial data was obtained from a cryptocurrency market data provider and the news articles were sourced from reputable financial news outlets. Uh, and then the limitations sending checks. The cryptocurrency market is highly volatile and prices can change rapidly. The information provided is accurate as of the latest available data, but may not reflect real time changes. Additionally, the news articles reference may not cover all factors, including Bitcoin's price. So just a little, you know, cautionary tale there. And then this is basically what it what it spat out for us. So as of December 2nd, Bitcoin is trading at 90,000 little over 90,000, reflecting a 7.36 increase from the previous close uh. The day's high was 91,000 and a low of 84,000 umm. So all good information to know, but how how does it uh, you know affect? The the market how is the this analysis? Or so basically it's saying umm. Recent market volatility has influenced several factors such as global bond market sell off. So, concerns over potential interest rates hike hike in Japan have led to sell off in global bond markets, affecting investor sentiment across various asset classes including cryptocurrencies. Uh bitcoin's role as a risk indicator so uh recent price fluctuations under score its status as high risk, high volatility asset, serving as a barometer for broader market anxiety uh. So basically that's saying you know. Bitcoins, one of the first. You know, Major. Investments, you could say that uh is most likely to you know fluctuate in price uh, so it's a good indicator of you know how the market is doing umm on a broader sense, umm, so you know if, if crypto is up, good chances at the S&P 500 are also up just something like that. And then the corporate cryptocurrency holdings, so a company like Strategy, which has a significant cryptocurrency holdings are facing financial challenges due to declining Bitcoin prices impacting their stock valuations and financial strategies. So these developments highlight the interconnectedness of global financial markets and the sensitivity of cryptocurrencies to macroeconomic policies and corporate financial health. And then it just created a chart here with the price of Bitcoin over the last month, and you can see it's been on a steady decline. Umm, so I guess we can just go off of this question. Umm. Using historic. Data and real time data. When is the best predicted? Time to buy Bitcoin? I'll see if it'll expand on this. Excuse me? Hello. I'm not sure what just happened here. OK. Well, it looks like it just crashed, so that's great. I guess I'll just, you know, I'll ask it the same question here. Um, using. Historical. And real time data. When is the best predicted time? You invest in Bitcoin. And it crashed again. So yeah, that's one of the issues with, you know, the free sites like base 44. Umm, I've had a lot of issues with this where it just, yeah, you know, you're trying to build it or, you know, ask a question and it just completely. Shut down, Umm. Yeah, kind of frustrating. Alright, let's just forget the. Damn Bitcoin question. Let's go to something else. All right, here we go. This is a good one. Pull the newest housing market numbers. And forecast short term, what was it short term price direction? Should be able to easily do that. Oh my God. Is it my Wi-Fi? What is going on? This has not been happening the entire day and now when I want to record it's just gonna disappear. What is this? Refresh. God. OK, well how about you just compare? This is the question. Compare GDP growth across the US and China in the last 10 years. Oh, finally. Jeez. Alright so basically created this this chart. Uh, give us, you know, the GDP growth rates, uh, both China and the US, umm. And then it gave us a little analysis here. So this trend highlights China's rapid economic expansion will be the last decade with gradual slowdown in recent years. In contrast, the US economy has experienced more moderate growth but a noticeable decline in 2020 due to the COVID-19 pandemic, followed by strong recovery in 2021. It's important to note that while China's growth has been robust, it has also been faced challenges such as trade tensions, structural structural economic adjustments, the US economy, and on the other hand, has been influenced by other factors like trade policies and global economic conditions. How have tariffs from the US? Affected. Chinese economy. So, you know, just expanding off of the first question here, how have terrorists from the US affected the Chinese economy? Umm, recent analysis indicate the US terrorists have had measurable impact on China's economic growth. Goldman Sachs estimate that the cumulative increase in tariffs on the Chinese goods since 2018 could reduce China's real GDP by approximately 2.6% or percentage points, with 2.2 points, uh, of that occurring in 2020. 5 And that's according to Goldman Sachs. And then similar similarity, uh, US, China Business Council projects that further increase in tariffs could lead to a loss of 744,000 American jobs by 2025, with a peak impact of 801,000 or 100,000, excuse me, uh, net job losses if China retaliates. And that's according to the uschina.org. These projections suggest that while China's economy has shown resilience, the ongoing trade tensions and tariffs have continued to slow down in growth. So that's just an example of, you know, what this financial tool can do. You know, you just ask a question, pretty simple basic question, and it'll give you, you know, a good analysis of everything. Um, and then with the Loop 2, only difference, like I said, is it, I added this limitation and sanity checks and it also shows the sources there of where it's actually getting the information from. But other than that, pretty much everything is the same. Creates a chart and then it, you know, compiles the data and creates an analysis for it. Uh, but basically. Verify. Is the AI actually helpful? I would say yes. You know, this is stuff you can't. Somewhat fine, I mean. It, it's kind of hard to measure how the tariffs have affected the economy, especially just finding one article. So having a tool like this, it can be very nice to see the actual measurable impact on, you know, some things that you hear about, such as the loss of potential jobs here. Umm, what makes the AI more useful? Uh, I'd say. Uh, not crashing, being able to actually run consistently is probably the biggest thing. Umm, it does. It does run well, It's just I, I don't know what's going on, if it's my Wi-Fi or if it's base 44 or something. Umm, what's still what's different about building with AI as a component? Umm. Honestly, it's a lot easier using AI as a, you know, a tool to help you because it it can do a lot of the. Behind the scenes research. For you such as, I mean like all of this analysis, you know, finding. Gold, what Goldman Sachs said about the tariffs. Would you know uschina.org this stuff that I would have had it done on my own, But you know, having AI to do it in a split second is very, very helpful. It's definitely the the most different thing about using AI to help you. Uh, loop 2? Make your board trust the trustworthy. I showed you how I did that. Umm loop 3? It's kind of just the the graphs and visuals that I added there. But yeah, this is basically it. I mean, I can give you another question here. Umm. I guess we could do this. Let's see if this one works. There we go. So all I did was I said retrieve the top ten trending stocks and group them by sector. Which sectors are the most active today? Uh-huh. So it gave us all of this information just off of that. So December 2nd, the US stock market experienced moderate gains with NASDAQ approaching a three-week high. Umm, top ten trending stocks though we have Boeing, Intel, MongoDB, United Natural Foods, NVIDIA, Dell, PNG, Warner Bros, Airbus, FDG United. Um, technology, industries, industry rules, financials, so those are all the sectors here, but it gave us, you know, top ten trending stocks there. How they rose or fell or, you know, what they've been doing in the market today. And then just, you know, one sentence analysis basically. Uh. But if you go down here into the sector sectors, so it grouped all the companies and so you know either technology industry or financial, customer discretionary, customer staples or healthcare. Basically gave us the rundown on all of the sectors and you know, so technology lead gains with almost a 1% increase driven by strong performances from NVIDIA and Dell. Industrials rose, you know, half a percent due to Boeing significant gain of. Um, 7.9% so very high, high rise in a day. But then you, you know, you look at. Customer discretionary, which declined by 0.33% uh, which was influenced by a 2 1/2 drop in P&G stock. So it kind of just shows you how everything's interconnected umm and and you know how. I I mean it basically just answered the question and showed you how everything you know. Effects one another, Uh, and then it just created a graph here of, you know, the stocks. What's doing well and what's not? Uh, so as you can see, technologies over here, uh, and this big dip is consumer staples, which fell by 1.35%, reflecting broader market concerns. So that's basically, you know, my, my financial tool here, um. You just ask a question and it'll give you, you know, the rundown and break it down a little bit for you here. So here's analysis of the, you know, tariffs on China. Umm. But yeah, I think that's gonna be it. Umm. We went through, you know, the driver framework. I used base 44 for my my project. Umm. And you know, we were able to.\nTo, uh, to build.A financial tool that can, uh. Do multiple things here. So that's going to be it. Thanks for watching."
}