{
  "student_name": "Benjamin Engels",
  "org_defined_id": "037980105",
  "username": "bmengels",
  "video_url": "https://www.loom.com/share/640695abd1e1488bb69011300db9337c",
  "transcript": "0:02 Alright, there we go. Good evening, and welcome back, ah, to our final assignment here, our capstone, um, submission is session 13, so it's building our AI tool, tool, you can say.\n0:14 So, for my tool. I, uh, built it on, um, the idea of making a tool for, to explain variance, um, requests and inputs to non-finance individuals.\n0:29 So, like, new CFOs, or, um. Scenarios, such as that, that are starting out in finance. So, I use mine, um, my tools, um, setting I used, um, Creo, uh, to divide it, and I, um, designed a variance data input.\n0:48 Um, so that is, um, the problem is, yeah, for new people getting into the world of finance, this is a great tool to use, and, for example, here we have, um, so this is the translator, it's a translator for, uh, variance inputs and, like, Okay, if someone's new to variance, and they don't understand what\n1:07 a, yeah, Q4, 2024, budget variance means, um, what the variance date is, then they can translate what that means, and understand about it as a new CFO.\n1:17 So, as you can see here, um, off to the side, I had a couple different runs that I had to adjust some things, edit a couple things.\n1:26 Here, I had a lot of editing that I checked on, made check marks, and had it go well, and then it was, uh, complete.\n1:33 So, let me run it for you. So, we're gonna do, uh, let's see, we'll do Q4 2025, um, budget variance, we'll just go with that.\n1:44 And then, so we'll have our sales, revenue, um, let's say our budget was, um, 200,000, in our actual budget for this, um, let's put an equal sign in there.\n2:06 Was, let's say, Okay. Uh, 215,000, and then our marketing, ah, let's, we'll say our budget for that, equal, um, we'll just go.\n2:22 Oh. 40,000, actual, equal, um, let's say 38, 500, and then let's say salaries. Allories Our budget for that, oops, equaled, though, ooh, 60,000.\n2:49 And our actual, equal, let's say, Yay. 62,000, we'll go with that. So, we have our information here, and now if we click Analyze our variants, it'll analyze it.\n3:05 Give it a minute. This is our, our tool here. Um, so once it's done, it'll, it'll pop out down here.\n3:12 So, and then it'll explain it. So that's, this is the, um, explain part of the tool. So it'll explain what each category means, um, you know, in broad terms, what we expected for your budget, what actually happened, uh, the difference, what caused the difference, what's very- vulnerable or unfavorable\n3:29 . So bring in more moneys, favorable. It explains it for each scenario, and it helps really break it down so that the, um, individual can understand and really learn from it.\n3:39 And then our salary's here. Um, it causes it, and then it gives you an overall summary as well, which is, Umm, really nice to see it kind of sums everything up.\n3:47 So our sales revenue in this case would be favorable. Marketing nods, also favorable, but then our salaries would be unfavorable, since it's the actual is more than the budgeted.\n3:56 Um, so the bottom line, we have made more money than planned and saved a little on marketing. However, we spent a little bit on salaries over all these results are good for the company.\n4:03 So this is the, the variance translator here. And so this is my session 13 capstone. Um, so you can use this in a lot of different scenarios.\n4:14 And, uh, it's a great resource. Many, this is obviously an action here. You can have a lot of different, um, inputs in here and it works.\n4:24 I've tested it multiple times, tested it here, obviously. And, um, overall building this, I've learned. That, using, uh, Google Gemini, using Craya, you can build a lot of these really cool apps that help out individuals with all kinds.\n4:39 This has helped me out, um, cause I've actually had a couple questions that I've been able to answer. Just using this, um, this app that I created so, um, along with Craya.4:48 So, but this is, uh, my capstone project. Thank you so much for watching and, thank you for a great semester."
}