{
  "student_name": "Krish Aggarwal",
  "org_defined_id": "036289409",
  "username": "aggar117",
  "email": "",
  "transcript": "All right, so this is my session 10 assignment. All right, so the objective is pretty straightforward for this assignment. Management is considering a $12 million upfront investment with a 10-year operational horizon, and my goal is to determine if this project creates shareholder value using the firm's 8.5% walk as the hurdle rate. To ensure that there was a rigorous analysis, I applied the driver framework, which I'll walk through now. So first, we would define Discover. This is the most crucial step. So I defined the problem as an incremental cash flow analysis. We're not looking at total company revenue, but specifically the new cash entering and leaving the firm solely because of this draw straight. During the Discover phase, I isolated the specific parameters from the as described right here. We have an initial $12 million capital expenditure for building and equipment. It's a 10-year project. We're using straight line depreciation, which means we will expense $1.2 million annually. This is a non-cash expense, but crucial for calculating the tax yield. I also mapped out the operational assumptions. Revenue follows a ramp-up peak and stabilized pattern, starting at $8 million, peaking at $11 million, and settling at $9 million. Costs are a mix of variable and fixed. The cost of goods is variable at about 40%. Labor and rent are fixed at about $3.3 million combined, and this indicates high operating leverage, which is a risk factor I noted to test later. Finally, I discovered two specific cash flow adjustments after working capital. We deployed $500k at year 0. This is a cash outflow now, but we treat it as cash inflow at year 10. We expect to sell the assets for $3 million in year 10. However, since we depreciated the assets at $0 over 10 years, the full $3 million is taxable gain at a 25% tax rate. The net cash inflow is actually only at $2.25 million. With these variables defined, I moved on to the next phase. I structured the analysis to solve for unlevered free cash flow. The logic is calculate EBIT, which is just revenue minus operating expense and depreciation. Apply the 25% tax rate to get the net operating profit after tax, add back depreciation, and subtract capital expenditures and changes in working capital. This gives us the true cash that's distributable to investors, we can discount back to year 0 using the 8.5 MOC. Now moving on to the next step. As you can see in the code here, I created a flexible function called calculate cash flows, which is right over here. It takes inputs like WOC, revenue modifiers, and tax rate at parameters. It iterates the years 0 to 10, and then automatically handles the logic for marketing budget drop-off after year 1 and the WOC recovery in year 10. Then I also implemented separate blocks. Here we can see NWC, discounting different datas, and then jumping out to some other calculations, calculating the NPV, IRR, simple payback, discounted payback, and profitability index. These are all shown here. This allows me to change one revenue-like variable and instantly see the impact on all five metrics. I also did some sensitivity analysis over here, and then added some visualizations over here. But having said some of that, here this comes for the validation part. So I ran base case scenario to ensure that numbers align with the financial situation and the results are positive, which we can jump down to right over here. So the NPV, we can see that after doing the actual calculations, the value comes out to about 2.6 million down there. And since that value is greater than zero, the project creates value. The IRR came out to about 12.84%, which comfortably clears the 8.5% hurdle rate. And the payback, the firm recovers its initial cash investment at 5.28 years and then recovers the present value of that at 8.21. Given the 10-year horizon, a six-year discounted payback is acceptable, and the base case is financially round. Here, there's also the cash flow schedule from years zero to 10. These visualizations just shows the actual cash flow schedule between all the years that we have and millions of dollars. We can see year zero is quite negative, and then it slowly goes up back up to positive for the rest of the years. And we can see that this is the payback trajectory. So when the investment comes back to breakeven, we've got a breakeven. Breakeven will be roughly around year eight, roughly right about there. So it's roughly about eight years, which I said earlier as well. That's about where the breakeven is. And then this is just a sensitivity analysis to see how, according to the NPV impact, how sensitive are these different metrics of the walk at two different parts of revenue. And for the base case, you can see the different sensitivities there. Now moving on. So as I mentioned before, we are using the base case saying it's financially sound. However, that is just a best guess. I also stress tested it. Here we could see that that's kind of exactly what that sensitivity analysis exactly. So even if the cost of capital spikes to 10.5%, the NPV remains positive at roughly, yeah, even if it goes up, it comes out to still above positive number, which is still zero. It's right about there. Revenue shock. This is a critical finding and model scenario where revenue drops 20, where it drops 20%. The NPV drops to a negative 3 million and IRR falls below the hurdle rate right here at 3.13. This confirms the early suspicion about operating leverage because rent and labor are fixed, a drop in top line sales for its profitability disproportionately. Finally, we arrive at reflect. And based on this analysis, my recommendation is to accept the flagship grocery project. The rationale is threefold. The base case NPV and the profitability index indicates efficient use of capital and the flagship grocery likely provides a halo effect for the brand driving traffic to standard stores, a benefit not even captured in these numbers. We must also acknowledge the revenue risks since a 20% miss destroys value. I recommend approval only if the marketing team can provide high confidence in year one sales targets of 8 million. And if year one sales trend below 7 million, cost cutting measures of labor must be triggered immediately. Thank you.",
  "video_url": "https://youtu.be/QIsPe_wMsgs"
}