{
  "student_name": "Princess Meshram",
  "org_defined_id": "036277056",
  "username": "pmeshra",
  "video_url": "https://youtu.be/jf_38RkAzGA",
  "transcript": "Hi, I'm Princess Meshram. Today I'll analyze Apple's $90 billion share repurchase using the DRIVER framework. So what's the problem here? Apple is sitting on a massive pile of cash and needs to decide what to do with it. Should they buy back shares? Pay a dividend? Pay off debt? Make an acquisition? Or invest in R&D? Each choice affects stakeholders differently. A buyback benefits shareholders who hold onto their shares because their ownership percentage increases. But it hurts bondholders because Apple is spending cash that was protecting them. This is why corporate finance is interesting. There's no perfect answer. Every decision has winners and losers. My job is to quantify those trade-offs and make a balanced recommendation. Let me walk through the numbers and explain what they mean. Apple has $165 billion in cash. That's huge. Most companies don't have that much. They also generate $100 billion in free cash flow every year, meaning they keep adding to this pile. The stock trades at $185 with a P/E of 30. Why does P/E matter? Because a P/E of 30 means investors are paying $30 for every $1 of earnings. That's a premium valuation. The market expects Apple to keep growing. They have 15.5 billion shares and $110 billion in debt. So net cash is $165 billion minus $110 billion equals $55 billion. Positive net cash means Apple has more cash than debt. A very strong balance sheet. Now the stakeholders. Berkshire owns 6%. That's Warren Buffett's company, a massive institutional investor. The CEO has 3 million shares, so he personally benefits from stock price increases. Retail investors average 100 shares. And employees have options with a $170 strike price, meaning they make money when the stock is above $170. The proposal is $90 billion buyback. That's 10% of Apple's market cap. A huge capital allocation decision. Now, what are we comparing the buyback against? First, a $6 special dividend. Instead of buying back shares, Apple could just give cash directly to all shareholders. Everyone gets $6 per share. Second, $90 billion debt reduction. Apple could pay off most of its debt and have an even stronger balance sheet. Third, a $90 billion acquisition. Apple could buy an AI or VR company and grow through acquisition. Fourth, $90 billion in R&D spread over 3 years. Apple could invest in innovation and build new products. Each option has different effects on EPS, net cash, and stakeholders. That's what my model calculates. For assumptions, I'm using 21% tax rate which is the U.S. corporate rate, 4% interest rate on cash and debt, and 9% WACC. WACC is the weighted average cost of capital. It's Apple's hurdle rate. Any investment must return more than 9% to create value. Here's the prompt I used to build my Python model. I asked for code that calculates EPS and Net Cash for each scenario, quantifies stakeholder outcomes, runs sensitivity analysis, and creates a visualization. Let me switch to Colab and show you how the model works. Let me explain the key calculations. First, how do I get EPS of $6.17? I take the stock price of $185 and divide by P/E of 30. That gives earnings per share. Net income is EPS times shares. $6.17 times 15.5 billion equals $95.6 billion. Net cash is simply cash minus debt. $165 billion minus $110 billion equals $55 billion. Now the buyback calculation. If Apple spends $90 billion at $185 per share, how many shares do they buy back? $90 billion divided by $185 equals about 486 million shares. So new share count is 15.5 billion minus 486 million equals about 15 billion shares. But here's what people forget. When you spend $90 billion cash, you lose the interest you were earning on that cash. At 4% interest, that's $3.6 billion per year in lost interest income. After tax, it's about $2.8 billion. So buyback EPS equals net income minus lost interest, divided by new share count. That's why EPS only goes up slightly to $6.18. Yes there are fewer shares, but there's also less income. Net cash after buyback is $165 billion minus $90 billion spent, minus $110 billion debt, equals negative $35 billion. Apple goes from positive net cash to negative. That's a big change. For stakeholders, Berkshire's ownership math is simple. They own 6% of 15.5 billion shares. After buyback, there are fewer shares but Berkshire still has the same number. So their percentage increases to 6.19%. Same logic for CEO. 3 million shares divided by smaller share count equals higher ownership percentage. For retail investors, I calculate portfolio value as shares times EPS times P/E. It goes from $18,500 to $18,531. A modest $31 increase. For employee options, intrinsic value is stock price minus strike price. New stock price is new EPS times P/E, which is $185.31. Minus $170 strike equals $15.31. Bondholders don't own shares, they own debt. They care about whether Apple can pay them back. When net cash drops from $55 billion to negative $35 billion, bondholders get nervous. There's less cushion protecting them. This chart makes it visual. Red bars are negative net cash. Buyback, Dividend, and Acquisition all put Apple in net debt. Green bars are positive. Debt Reduction keeps the strong balance sheet. R&D uses less cash. The sensitivity analysis answers what if questions. What if Apple's stock price rises while they're buying? They buy fewer shares for the same $90 billion, so EPS improvement shrinks. At 10% higher price, EPS is only $6.16 instead of $6.18. What if an acquisition earns different returns? At 8% ROIC with 9% WACC, the spread is negative 1%. You're actually destroying value. Only when ROIC exceeds WACC at 10% or higher does acquisition create value. This is the key insight. Just because EPS goes up doesn't mean value is created. You have to beat your cost of capital. Let me summarize what the numbers tell us. Debt Reduction has the highest EPS at $6.35 AND keeps net cash stable. Why? Because when you pay off debt, you save interest expense. That savings flows directly to earnings. Acquisition has the highest EPS at $6.53, but only if you achieve 8% ROIC. And it puts you in net debt. Buyback barely moves EPS. Only $6.18 versus $6.17 baseline. But it dramatically weakens the balance sheet. R&D crushes EPS in year one because you expense it immediately. But it's an investment in the future. The stakeholder table reveals the conflict of interest. Shareholders benefit from buyback. Ownership goes up, value goes up slightly. Management especially benefits. CEO's ownership increases AND if his bonus is tied to EPS, he gets paid more. But bondholders get hurt. They lent money to a company with $55 billion net cash. Now suddenly it's negative $35 billion. The risk of not getting paid back just increased. This is agency theory in action. Management may prefer buyback because it benefits them personally, even if it's not the best decision for all stakeholders. The sanity checks confirm our math makes sense. Buyback: EPS up because denominator shrinks, cash down because we spent it. Check. Dividend: EPS flat because share count doesn't change, cash down because we paid it out. Check. Debt Reduction: EPS up because interest expense goes down, net cash stable because debt decreases with cash. Check. Acquisition and R&D: These only create value if returns beat WACC. Otherwise you're investing $90 billion to get back less than $90 billion in present value. That destroys value. Sensitivity analysis tests how robust our conclusions are. The buyback price sensitivity shows that timing matters. If Apple buys when stock is cheap, they get more shares and bigger EPS boost. If they buy at high prices, they get fewer shares and smaller boost. At 10% higher price, EPS gain almost disappears. The ROIC sensitivity is crucial for the acquisition decision. Apple's WACC is 9%. That's the bar. If an acquisition only returns 8%, you're better off not doing it. The value creation formula is simple. ROIC minus WACC. Positive spread creates value, negative spread destroys value. At 10% ROIC, spread is positive 1%. Marginal value creation. At 12% ROIC, spread is positive 3%. Solid value creation. So if Apple can find an acquisition target with 12% returns, that's a better use of cash than buyback. Now the qualitative factors that numbers don't capture. Value creation versus transfer. This is subtle. At P/E 30, is Apple overvalued, undervalued, or fair? If overvalued, the buyback transfers wealth from remaining shareholders to those who sell. Apple is basically overpaying. If undervalued, remaining shareholders benefit because Apple is buying cheap. Agency considerations. There's a conflict of interest. The CEO benefits from buyback through higher ownership and EPS-linked pay. Bondholders get hurt through reduced cash cushion. When analyzing management's recommendation, ask who benefits. Signaling. What message does each choice send? Buyback says we think our stock is undervalued or we have no better investment ideas. Dividend says we have excess cash and want to share it equally. R&D says we're focused on long-term growth. Debt reduction says we're being conservative. Markets interpret these signals. A massive buyback might make investors wonder why can't Apple find good investments. So what's my recommendation? The buyback gives only 0.2% EPS improvement. That's almost nothing. But it costs Apple its strong balance sheet. Net cash goes from positive $55 billion to negative $35 billion. Is that trade-off worth it? I don't think so. Debt reduction gives better EPS improvement AND maintains financial flexibility. Acquisition could give even higher returns IF Apple can find targets with ROIC above 9%. R&D hurts short-term EPS but could drive long-term growth. My recommendation is don't do a pure $90 billion buyback. Instead, use a balanced approach. Some debt reduction for the EPS benefit and balance sheet strength. Some R&D for long-term growth. Smaller buyback only if stock is genuinely undervalued. Keep cash available for opportunistic acquisitions with ROIC above WACC. The key lesson is EPS accretion alone doesn't mean value creation. You have to consider all stakeholders, signaling effects, and opportunity costs. Thank you for watching."
}