{
  "student_name": "Sherry Zhao",
  "org_defined_id": "037659129",
  "username": "zhao1398",
  "email": "",
  "transcript": "Hi, I'm Sheri Jia and this is my session n assignment. Um, so as always, let's start from the scenario. Netflix is considering a massive $5 billion content investment to fund this. Management is evaluating a strategic capital shift issuing 3 billion new Dub. The core objective is to determine the correct hurdle rate to evaluate the investment's profitability. So our hypothetical financial data are the market value of equity is 200 billion. Market value of debt is 13 billion. Risk environment is uh for the risk-free rate is 4.5%. The market risk premium is 5.5%. The comp for the company risk beta is 1.3 which is uh 30% more volat than the market and the cost of debt is 5.8% pre-tax yield. The corporate tax rate is 21%. The benchmark is Disney versus industry average. For our define discovery uh define discover we establishing we establish the financial reality. So to determine the financial visibility of the five um billion investment. The analysis first isolates the current market signals. A critical distinction is made between historical accounting which is the book value and the current investor demands. So um our key inputs are market capitalization or equity which is 200 billion. The market value of deb is 13 billion. The risk profile is 1.3. The cost of debt is 5.8. The risk-free rate is 4.5. basically um getting directly from our given uh scenario uh for represent we have our wacc which is the weighted average cost of capital and that is the industry's hurdle rate which is the minimum return required to satisfy all stakeholders. Um the cost of capital is derived by blending two distinct sources of funding which is equity cost and dep cost. The strategic tension is that t Netflix Netflix is currently capitalized with 94% equity and only 6% debt. So this indicates that Netflix is underleveraged relying which means it's relying heavily on the most expensive form of capital rather than the utilizing cheaper tax advantage dep. Okay. So for implement uh we have four charts or um graphs that I want to present. The first one is the core WACC calculation engine which is basically um I asked Gemini to calculate the general data for me and then after we run it this is what it gets. So we have our cost of equity, cost of debt, current WACC proforma at WACC and efficiency gain. So this what does this do? This confirms our hypothesis that um capital structure optimization creates immediate value. By introducing three billion in tax advantage, we lower our firmwide cost of capital from 11.2 22% to 11.13%. While um uh approximately nine bias point reduction pierce modest on a 200 billion valuation, this represents a significant um efficiency gain. And uh block two is of course our sensitivity analysis. So we basically generate a visualization showing how WACC changes as Netflix adds more depth and um this is what we got. So visualize our leverage efficiency currently it's on the left side which is low DB and high% of WACCC and the lower slope indicates that we are under leveraged. We can safely add significantly more debt to our balance sheet to lower our WACC before cause of financial distress begins to tick upward. This validates that the proposed 3 billion insurance is in conservative safe move. And then for three we have a visualization uh which compares the calculated hurdle rate against the specific ROIs of domestic versus international projects visually demonstrating why a blank WACCC is dangerous. So this is what we have and then it prevents a strategic error. The red line represents our firm YWACC which is 11.13% as you recall and the trap is that um the international expansion project return is 12% which is above the red line. So normally we will say yes but however because of international risk the true hurdle is the gray bar which is 12.5%. So the finding is that we must reject the international project despite it being the firm white WACC as it does not compensate us for the specific currency and regulatory risks involved. And then four is uh peer benchmark. By the way um block three and four are the validation parts. So this final block validates our numbers by placing them in the context of broader market fulfilling the computer Netflix to industry. So um basically we can see that we are paying a premium for capital compared to Disney. This gap is not an error. It's structural. Disney utilizes five times more leverage than we do. So to close this gap and complete on a level playing field. We must gradually shift our capital mix away from pure equity and towards efficiency efficient D exactly as this proposal suggests. So as we can see this is Netflix current this is Netflix optimize Disney and Amazon. So um for validation we already did the peer and the uh industry benchmark and then for evolve um a single WACC must not be applied bluntly to all investment. The five billion investments spans different risk profiles. The hurdle rate must define the risk of the project not just the firm. So uh I would recom uh for domestic content which is involves a lower risk mature mark it has a mature market with predictable cash flow. So our recommended hurdle rate will be 10%. And then for international content since there's high risk due to exposure to currency fluctuation and regulatory instability our recommended hurdle is 12.5%. which is a premium too from WACC and the implication is that we used a flat 11.13 risk rate risks rejecting prof profitable US projects while accepting dangerous international projects so it has to adjust due to the recommendation according to the recommendation and our final strategic recommendation is that uh based on the driver analysis we found The following course of action is recommended. First of all, exe for executive financing, we have to proceed with the three billion dev assurance. This is a good deal. Optimize the capital structure leveraging the tax shield to lower the aggregate cost of capital to 11.13%. And then we have to set a policy to adopt 11.13 as the firmwide baseline hurdle rate. And then finally the investment criteria will be um to uh green light domestic content returning above 10% and international content returning above 12.5%. And then takeaway is that DAB is not merely a funding source. It's also a tool for value creation. And by moving slightly away from all equity structure, Netflix lowers lowers the performance threshold required to generate shareholder value.",
  "video_url": "https://youtu.be/mtMyGpnGLQg"
}