{
  "student_name": "Shane Shuman",
  "org_defined_id": "036088017",
  "username": "sshuman",
  "email": "",
  "transcript": "Hello, my name is Shane Shuman and today we're going be going to be going through the section 9 or session nine assignment for this chapter about u weighted average cost capital. Um we have assignment overview here where um calculate the whack for Netflix in connection with hypothetical $5 billion content investment decision. Um, it must analyze the current whack, evaluate the impact of additional debt financing, assess project specific versus firmwide discount rates, and compare Netflix cost of capital to industry peers. Obviously, we have a lot of parameters or hypothetical parameters. We have 200 billion in market capitalization, 14 billion in book value, 1 13 billion in market value with a 1.3 equity beta, a triple B+ bond rating, so about 5.8%. We have a two uh 21% corporate tax rate and $450 is our current stock price. We have these marketing conditions here. 4.5 on the risk-free rate for a 10-year treasury, 5.5 on the market risk, and we have our media industry weighted average cost of uh capital range of 8 to 10%. We have strategic context required analyzation. We'll go through all that in our um Python And back to the Python, we went we um obviously had some AI help with making the Python. And I thought with driver using this, it was really really interesting because I had to make multiple iterations of the Python to get it fully um having all this information I had or I wanted. And even in this scenario, I thought it was really really um interesting because I had to make two separate codes for collab for Python to get whole basically the full answers of what I thought would have been correct. um in the scenario obviously give me a lot of information and I had to make it into Python but from defining it and the process all the way to the E and evolving it took of refining and a lot of evolving to get it to the final stage for this question about Netflix and weighted average cost of capital um obviously they're like the basics uh keep it simple keep it simple stupid and a lot of other things to get to analyzation so going through the code here as we move to collab. We'll go through the second code first. Obviously, we have a lot of the all the parameters are here. The ones we enter through micro capitalization, debt, equity, cost of debt, tax rate, and obviously it has all the information basically from the question, additional debt issuance, cost of equity, and it's going through all the um questions here. And then it has our output results. Um so from there going through all this information I kind of explained we have cost of equity of 11.65%. We have our current capital structures for question two which um is equity weight of 939 and then our debt weight of 061. And obviously our weighted average cost of capital of 11 11.22%. We had a post three bill debt issuance. We had at 16 billion with the equity weight of of 0.9259 and then the new debt weight of 0.741. And then our new from there it was really really similar to the current one. The new one was just barely below it at at 11.13% order previous was 11.22%. And going through the second one, let me just for the second one, we have a lot of the same information, but it just added on more that I feel like we needed. Um, so from there, we have 11.21, 11.1, and then for the valuation, we have um the findings that it has of the firm's widespread weighted average rated average of cost of capital of $1121. uh the correct discount rate for the uh investment decision. The $5 billion investment includes projects with diverse risk profile is using a single firmwide rate is incorrect because it ignores project specific risk obviously of US content and international content. uh US having a higher discount rate uh due to the higher risk from the market saturation and then obviously international has a lower one because lower uh market saturation and lower competition more long-term growth for the next part which is what was not included we have um obviously comparison to the industry we have um it being higher than Disney has 11.21 Disney 8.2 2 and above the average of 8 to 10 which is incredibly impressive from Netflix for cost capital standpoint significantly more debt which obviously is cheaper then um for business risk Netflix is a growth company obviously the beta is really really high so it has a cost of equity and then Disney's obviously kind of I mean they're not just in the streaming platforms obviously they have movies and they have their um all the stuff around the world, merchandise, royalties, they just make a lot of money. It's kind of a conglomerate, stable cash flows. And then for part five, we have recommendations. Oh, Netflix should pursue a strategy to increase it debt to capital ratio to target about 20% to minimize its weighted average cost of capital and then the rationale is the current structure is insufficient increasing debt to expenses. So after going through all that, let's go through analyzation I've gathered later down here going through some of these parts um going through a lot of the whack formulas here um we were able to gather um a lot of information this is kind of just some of the calculations where they got them from in not Python essence but actual like formulas that we recognize and obviously we see where they got the answers for multiple of the questions here and obviously we even have a we have a graph here to visualize the value of stock. We have our optimal debt level. We have obviously the the present value of interest tax shield which is very interesting to look at and this is why debt's cheaper which obviously we we didn't really need the visualization but um since a lot of us already know that debt is always cheaper than doing than anything else but um going through this one I always thought was really interesting going through the weighted average cost of capital as a hurdle rate um it uses capital budget for investment decisions. The project should only be accepted if the expected rate of return is greater than or equal to the weighted average cost is less than and destroys from value. This is kind of what we went through in class obviously where um we talked about difference between 9 and 10% and whether or not or how you would advise like your boss basically how would you advise them? It's like um technically with the stats say that this is losing uh firm value but I don't know you guys have to phrase it weird. So it's a lot of nuance obviously nuance and it shows that 11.21% should not be this the hurdle rate. Um and obviously we have a little more visualization here with debt and equity with the multip percentages here the 11.21 21 11.13 all these percentages. Obviously going through all of that from from the weighted average cost of capital sense is um incredibly interesting especially cons comparing it to uh what we learned in class how it's so new how the numbers can say something and then you calculate it using this um weighted average cost of capital formula which we obviously went through and it shows you a completely different thing that you do not see from like looking straight the d or looking at the information, you kind of have to use a formula. Um, going all through all that is really, really interesting. We have all that in here. We have formulas, we have visualizations, and we have the disadvantages. We see here 11.21, 11.65. And going through that's all incredibly interesting. It reminds me of this project reminds me kind of what we went through in class talking about the differences except there's different nuances than we went through in class that I can't really go from Python because it's so rigid and not as uh fluent but other than that that's this project um weighted average cost capital is incredibly interesting how can tell multiple stories of debt and all the information which is contrary to what might it might look like on the side. And that's important when going through Netflix as a company and all this information because it tells a different story than what the information looks like it tells us. So, thank you",
  "video_url": "https://www.youtube.com/watch?v=4jhSjLcBjSo"
}