{
  "student_name": "Tanmayi Sharat",
  "org_defined_id": "035964608",
  "username": "tsharat",
  "email": "",
  "transcript": "D: Define and Discover First I set up the problem. Netflix is thinking about a five billion dollar content investment. To judge if that is a good idea, I need a discount rate. In corporate finance that is the Weighted Average Cost of Capital, or WACC. My goals are: Find Netflix's current WACC from its market capital structure. See what happens to WACC if Netflix issues three billion dollars of extra debt. Decide whether to use the firm WACC or a project specific WACC for US versus international content. Compare Netflix to peers like Disney and Amazon. Turn that into a capital structure recommendation. All of the inputs come from the case: Market value of equity: 200 billion dollars Market value of debt: 13 billion Possible new debt: 3 billion Equity beta: 1.3 Bond rating BBB plus with a 5.8 percent yield Tax rate: 21 percent Risk free rate: 4.5 percent Market risk premium: 5.5 percent Benchmarks: Media industry WACC: 8 to 10 percent Disney WACC: 8.2 percent, with about 70 percent equity and 30 percent debt Amazon corporate WACC (for Prime Video): 9.5 percent Key assumptions: I always use market values for weights. In the first pass, when I add the extra debt, I hold beta and the debt yield constant. Later I will relax that in the Validate stage. The 10 year Treasury is my risk free rate for CAPM. R: Represent Before I write any code I lay out the formulas and plan. The cost of equity comes from CAPM: I will apply this to two capital structures: Scenario 1, current Netflix: Equity 200 billion, debt 13 billion. Scenario 2, after the three billion of new debt: Equity still 200 billion, debt rises to 16 billion. For each scenario I will: Compute the cost of equity. Compute the after tax cost of debt. Compute the equity and debt weights. Compute WACC. That full set of calculations is Loop 1. Then in Loop 2 I extend the work: Use Disney and Amazon as pure play comparables, unlever their betas, and relever them at Netflix's structure. Tie debt yields to rating bands as leverage rises. Build a 3D surface that shows WACC as a function of both the debt ratio and beta. Only after all of this planning do I move into implementation. I: Implement Loop 1: Core WACC and Assignment Requirements In Loop 1 the Python code calculates the current WACC, the post debt WACC, project hurdle rates, and basic sensitivity checks. From the code I get: Equity weight today is 0.9390, or 93.90 percent. Debt weight is 0.0610, or 6.10 percent. Using CAPM with a beta of 1.3, a 4.5 percent risk free rate, and a 5.5 percent market risk premium, I get a cost of equity of 11.65 percent. The after tax cost of debt is the 5.8 percent bond yield times one minus the 21 percent tax rate, which gives 4.582 percent. Putting these into the WACC formula: Current WACC is 11.2186 percent. Then I add the three billion of new debt. Debt rises to 16 billion. Equity stays at 200 billion. New equity weight: 0.9259 New debt weight: 0.0741 If I keep the same cost of equity and debt, I get: New WACC of 11.1264 percent. So with that simple assumption, extra debt lowers WACC a bit because of the stronger tax shield. I then set project hurdle rates: For US content, I use the firm WACC: 11.1264 percent. For international content, I add a 2.5 percent risk premium, so the hurdle is 13.6264 percent. The code also compares these numbers to the media industry and to peers: Industry range is 8 to 10 percent. Disney is at 8.2 percent. Amazon corporate is 9.5 percent. Netflix is clearly more expensive, mainly because of its higher beta. Next, still in Loop 1, I run sensitivity checks on the market risk premium: At MRP of 5.0 percent, WACC is 10.6083 percent. At 5.5 percent, WACC is our base 11.2186 percent. At 6.0 percent, WACC jumps to 11.8289 percent. So a one percentage point swing in MRP moves WACC by more than 1.2 percentage points. Then I run a financial distress stress test. I assume the market reacts negatively to higher leverage: Beta rises to 1.35. The debt yield rises to 6.2 percent. Recomputing with the post debt weights gives a stress WACC of 11.4045 percent. In other words, once markets demand higher returns, the benefit of leverage disappears and WACC actually goes above the original level. Loop 1 also creates a plot of WACC versus the debt ratio from 0 to 50 percent, and places markers for current Netflix, post debt Netflix, and the industry range and Disney line. This is the basic visualization for the assignment. Loop 2: Evolving the Assignment In Loop 2 I extend the project beyond the minimum requirements. First, I implement a pure play method using Disney and Amazon. I unlever their betas using the Hamada formula, then relever them at Netflix's post debt capital structure. From that I get: A Disney based project beta, which leads to a cost of equity of 8.87 percent and a project WACC of 8.55 percent. An Amazon based project beta, which leads to a cost of equity of 10.41 percent and a project WACC of 9.98 percent. This shows that content projects can have hurdle rates that are much closer to the industry range than Netflix's full corporate WACC. Second, I link debt yields to rating bands as leverage rises. I define BBB plus, BBB, BBB minus, and BB plus yields, and assign them to ranges of the debt ratio. For each leverage point up to 60 percent, the code chooses a rating, the related yield, and then recomputes WACC. The result is a rating driven WACC curve, where WACC falls at first as the tax shield grows, then flattens and starts to rise as the rating and yield worsen. Third, I build a 3D WACC surface. I vary the debt ratio from 0 to 50 percent and beta from 1.1 to 1.5. For every combination, I compute the cost of equity with CAPM and the WACC with a fixed after tax debt cost. The surface plot shows exactly how WACC responds when both leverage and risk shift together. Loop 2 makes the project feel more like an evolving capital structure lab, not just a single static calculation. V: Validate The Validate stage uses both loops. From Loop 1, I learn: WACC is very sensitive to the market risk premium. Even a small assumption change moves the hurdle rate a lot. When I add realistic stress on beta and debt yield, the post debt WACC jumps to 11.4045 percent, which is above the original 11.2186 percent. That means the simple \"more debt is cheaper\" story does not always hold. From Loop 2, I learn: The pure play WACCs of 8.55 percent and 9.98 percent are consistent with the 8 to 10 percent industry range. That helps validate that the method and parameters are reasonable. The rating based curve and the 3D surface both show the same message. Debt helps at low levels, but once leverage pushes ratings and beta up, WACC starts climbing again. So the original assumptions are tested and sometimes rejected, which is exactly the point of this stage. E: Evolve Now I convert the numbers into decisions. Which hurdle rate should Netflix use for the five billion dollar project? If this is standard US content with risk similar to the existing business, the base case choice is the post debt firm WACC of 11.1264 percent. If it is higher risk international expansion, a more conservative choice is the 13.6264 percent rate that adds the 2.5 percent premium. If the project is structured very similarly to Disney style content, a defensible range for the hurdle rate is around 8.55 percent. If it resembles Amazon Prime Video risk, the hurdle is around 9.98 percent. So the correct hurdle rate depends on how this content actually behaves relative to peers. Should Netflix issue more debt? The clean answer from Loop 1 is yes, because WACC falls slightly from 11.22 to 11.13 percent. But once I factor in the risk adjustments in Loop 1 and Loop 2, that answer becomes more careful: Netflix's starting WACC is already much higher than Disney's 8.2 percent and above Amazon's 9.5 percent. The main problem is Netflix's high beta, not a lack of debt. When I assume stakeholders notice the extra debt, WACC jumps above 11.4 percent. So my recommendation is that Netflix can use moderate additional debt for tax benefits, but should not try to match Disney's 30 percent debt ratio quickly. The firm should target a leverage range where the rating stays investment grade and where the stress tested WACC does not exceed the current level. R: Reflect To close the loop: Netflix's current WACC of about 11.2 percent is the minimum return it must earn on its content investments to keep both debt holders and equity holders satisfied. Modest debt additions help at first because of the tax shield, which matches the Modigliani Miller theory with taxes. However, the sensitivity and stress tests show how faster leverage growth can raise beta and debt yields, which pushes WACC back up. That is why firms talk about an optimal capital structure instead of infinite debt. Pure play analysis shows that not all projects deserve the same hurdle rate. Some content looks more like Disney or Amazon risk, and should be discounted at lower project specific WACCs.",
  "video_url": "https://www.youtube.com/watch?v=CjbotNgFxpk"
}