{
  "student_name": "Anamika Mitra",
  "org_defined_id": "037556874",
  "username": "mitra69",
  "video_url": "https://youtu.be/60dnE7FNakM",
  "transcript": "Anamika Sankha Mitra\n0 minutes 6 seconds0:06\nAnamika Sankha Mitra 0 minutes 6 seconds\nOK, so for the session 11 assignment, our goal is to analyse a $90 billion share repurchase proposal and we must determine if the screen's value or merely transfers it given specific constraints. So in terms of every day, we have $165 billion in cash and $100 billion in annual free.\nAnamika Sankha Mitra 0 minutes 25 seconds\nFor cash flows, in terms of the PE, we have APE ratio of 30 and a share price of $185. Our constraint is going to be that management is incentivized by your EPS and your Roe, but shareholders want tax efficiency.\nAnamika Sankha Mitra 0 minutes 43 seconds\nSo we need to essentially figure out, does Apple generate more value by keeping the cash which is earning Pinterest or by buying its own stock and the model that I'm doing is essentially testing if earning is yield of the stock beats the after tax yield on cash.\nAnamika Sankha Mitra 1 minute 2 seconds\nSo for the represent stage, essentially I have 3 timelines of or three options. If I want to say so for option A, if there's a share repurchase through the buyback today the board will authorise the buyback programme. The company will then buy shares through the market. Cash balance will drop Share Account.\nAnamika Sankha Mitra 1 minute 22 seconds\nShrinks permanently and then the stock price supported by buying pressure is supported by buying pressure and then the CEO and employee options remain at high levels in the future of the ROA would explode upwards with the same income less equity and the CEO.\nAnamika Sankha Mitra 1 minute 39 seconds\nIt hits both targets a lot easier and the shareholders own a higher percentage of the company tax rate. In another case, there's a special dividend where the board declares A1 time cash dividend and the cash leads the company. The stock price drops by exactly the dividend amount and the shareholders get cash but face immediate tax bills.\nAnamika Sankha Mitra 1 minute 56 seconds\nIn this case, there's a loss, but CEO options lose value due to bridge drops and in the future there's no change to the share count. No maccap the boost of the return equity can use the company as an extra or static growth company, and then in in option C There is.\nAnamika Sankha Mitra 2 minutes 13 seconds\nStrategic acquisition, where the company announces massive acquisitions, cash leaves, new assets, employees enter market often sells all the stock due to any type of uncertainty. There's a huge chaos in terms of integration, cultural clashes. The CEO then faces high stress and scrutiny. There's going to be.\nAnamika Sankha Mitra 2 minutes 32 seconds\nThen a binary outcome which is very hit or miss, and if there's a success, there's new growth engines that are being found, and if there's a failure, then there's billions being written off. CE OS being filed, a major management being judged essentially the buyback, which is the first option is the.\nAnamika Sankha Mitra 2 minutes 48 seconds\nPolitical favour in a way, because it avoids stock price draw of a dividend, it avoids career risk of acquisition and it guarantees that the RE metrics are met for nothing for bosses. OK, so after I got the code and I ran it.\nAnamika Sankha Mitra 3 minutes 5 seconds\nThe main things that we see is the impact on your earnings per share EPS. It dropped from 6.50 five $6.55 to $6.54, which is 0.02% drop the return on equity excluded from 156 point, 1% and 393%.\nAnamika Sankha Mitra 3 minutes 23 seconds\nWhich is explosive. And then your DFL or your leverage increased from 0.98 X to 1.101.01 X in terms of the EPS dilution of the 0.02% drop?\nAnamika Sankha Mitra 3 minutes 40 seconds\nWe essentially traded cash earnings for stock yielding. Since the yellow cash was higher than the earnings yield on stock, we lost more interest of income, which is about $3.2 billion a year than we saved in earnings demands.\nAnamika Sankha Mitra 3 minutes 57 seconds\nThe fact that EPS dropped even slightly proves that this decision is not about immediate earnings growth, but if the goal were purely to maximise your EPS this quarter, we would have kept the cash as opposed to in terms of the ROV that had like a massive.\nAnamika Sankha Mitra 4 minutes 15 seconds\nIncrease this kind of had something to do with negative equity in the sense that the initial Roe was 156%, which implies that the equity base of about $65 billion spending 90 billion subtracts directly from this equity, which is also your retained earnings. So then?\nAnamika Sankha Mitra 4 minutes 33 seconds\nYou have new equity of -25 billion. The company effectively operates with negative equity. The 393% figure comes from the model using absolute value of this 25 billion deficit. So in reality, the Roe is now infinite and this is the ultimate.\nAnamika Sankha Mitra 4 minutes 50 seconds\nI would say the metric hack for a type of management because they've shrunk the denominator so much that the efficiency metrics look like for astronomical in the sense cause signalling on ultra lean capital structure.\nAnamika Sankha Mitra 5 minutes 7 seconds\nIn terms of the increase in the DFL from .98 X to 1.01 X, the degree of the financial, so essentially a degree financial leverage measures the sensitivity to EBIT which is earnings before interest and tax. So ADFL of 1.01 X means there's a one, A 1% drop in.\nAnamika Sankha Mitra 5 minutes 26 seconds\nEBIT causes a 1.01% drop in EPS. The rise is trivial, which is about 0.0. Why? Because Apple's operating cash flow of $100 billion is so massive compared to its interest operations.\nAnamika Sankha Mitra 5 minutes 43 seconds\nSo even though we remove the cash safety net, the sheer volume of the incoming cash keeps the company safely and the bondholders are slightly worse off as there's less collateral. But the risk of default remains near.\nAnamika Sankha Mitra 6 minutes 1 second\nIn terms of validating the massive ROV jump confirms that the decision is a capital structure optimization point. So for a CEO compensated on ROV, this is this is probably like an optimal mood by turning 40 negative.\nAnamika Sankha Mitra 6 minutes 19 seconds\nThey maximise their performance metrics without actually increasing operating profit. Since the this is essentially like some sort of value transfer because since grow there's no operating value being created, so the value comes from tax approach.\nAnamika Sankha Mitra 6 minutes 36 seconds\nSaving shareholders, saving shareholders from intact dividend taxes and leverage of efficiency, which is replacing expensive equity with cheap debt and cash.\nAnamika Sankha Mitra 6 minutes 49 seconds\nIn terms of evolving this further, I feel like this moves Apple into the category of companies that McDonald's, which frequently operate with negative bug equity due to aggressive buybacks, it signals a transition of from high growth vitex to cash.\nAnamika Sankha Mitra 7 minutes 6 seconds\nLike a cash cow almost. And while the DFL is no currently operating with negative equity means that the company has no buffer of retained earnings. So if the free cash flow ever drives up, the company is fragile.\nAnamika Sankha Mitra 7 minutes 24 seconds\nI would say since I'm in in this position, I'm like an analyst. I would say that we would approve the $90 billion share repurchase programme. The rationale would be that in terms of optimization, despite accounting for the anomaly of negative equity, the move optimises walk.\nAnamika Sankha Mitra 7 minutes 43 seconds\nBy removing the excess cash in terms of incentives, it creates the strongest alignment between the management and their obsession with metrics and shareholders with their interests and taxes.\nAnamika Sankha Mitra 7 minutes 58 seconds\nPreventing empire preventing any type of based accumulation and in terms of safety, Apple's $100 billion annual free cash flow is a true safety net. Making the book equity metric largely irrelevant for schools.\nAnamika Sankha Mitra 8 minutes 13 seconds\nEssentially, the jump to the 393% Roe reveals the reveals something really important in terms of modern corporate finance is often about managing capital as much as earnings by hollowing out the equity base.\nAnamika Sankha Mitra 8 minutes 30 secondsManagement creates a hyper efficient financial engine that essentially satisfies all key stakeholders, even if it creates intemperate becoming anomalies. Thank you"
}