{
  "student_name": "Johanna Wen",
  "org_defined_id": "037039526",
  "username": "wen196",
  "email": "",
  "transcript": "Hi, I'm Johanna Win from your management 310 class from to and we're I'm going to go over the GameStop uh session 8 assignment. Uh again, I think I have a better understanding of it now. Um so, uh ver first, you know, verifying, you know, your first statements. Uh GameStop traded at 04 in August 2020. That is unbelievably incorrect. Um checking finance.yahoo uh you can see that uh its highest was uh 1.79 and its lowest was 1.0 and nowhere nowhere near close for trading at 0.04. Um and you can also find other trading prices for other dates. And you know if I were if you had any other issues or incorrect statements I you know again I would email you or talk to you in class or after class. Um yeah, so looking at uh to also verify some of the timeline uh again August 2020 uh GameStop was near bankruptcy levels and then in September uh Ryan uh Cohen uh acquired 13% which did um influence uh because this was a part of this was such a huge amount of uh GameStop shares um having like this event was a part of the public information that a lot of people had and and maybe in influenced people to also put in more money into GameStop. And in January 2021, uh uh Reddit uh uh Wall Street Bets also contributed a lot to um GameStop making the stock go uh up a lot. Um, in February 2021, uh, there were confession, uh, congressional hearings about market manipulation. Uh, so, uh, like I spoke in my first video, um, you know, I was a little confused of why there was a hearing. Um so because of unprecedented uh fallout uh volatility uh and market disruption, you know, you know, people people being able to manipulate something um immediately. A lot of people might have some concerns for market structure or fairness. Um some also some problems uh was one of uh the trading apps uh for stocks and shares. Uh Robin Hood um did not uh allow people to buy for a certain period of time from GameStop and only allowed people to sell which made things a little odd. um if there you know and so forth you know more questions you know the congressional hearing you know covered was you know uh well what do we do about it and how can we possibly restrict it and uh protect investors um and you know now uh with the conclusion uh they uh the most sign the the most significant action was the proposal to increase transparency around shortselling activities uh by requiring large institutional investors to publicly disclose more data on their short positions. The House Committee on Financial Services eventually released a report confirming that significant legislative and regulatory reforms are needed to modernize the system especially regarding uh quote unquote super brokers like Robin Hood and uh capital/ liquidity requirements. Um well play uh payment for orderflow uh payment for orderflow is uh the practice where brokers like Robin Hood sell customers trade orders to market makers like Citadel uh securities. Um well that uh that practice wasn't banned. Uh future regula uh future regul regulation became a key topic. um in Congress also discussed on whether or not you know trading apps like Robin Hood encourages excessive or risky trading among inexperienced retail investors. Um the uh like overall GameStop ultimately led to the closure of some hedge funds uh most notably Melvin Capital which uh suffered massive losses over 50%. Um, so you know, if we're going over these key data points, you know, uh, short interest did peak at 140%. Um, retail trading volume increased 10fold during, uh, the short squeeze. Um, I didn't really know what that was either. So, short squeeze occurs when stock price unexpectedly rises, which is bad for uh, short sellers. So, short sellers is uh, like are people who expect stock to go down. So they make um like basically agreements with people to uh like to buy their stock uh like later or sell their stock later and they make that agreement to do so. So when it goes up and they no longer have that stock to sell and earn money off of or they have useless stock, then you know it it doesn't work out. They don't get money. Uh trading restrictions uh implemented um at peak. Yes, that was um true. Um and uh yeah uh okay so I I did go over all uh the data above um and to test um market efficiency. So uh in class we kind of talked about this I think uh so efficient mark uh like the market efficiency to test the EMH um it's basically to see how uh like the relationship between public and private um like information and how that impacts uh how people like invest their money. Um so like a weak form of market efficiency states that you know prices will always reflect historical information. Um semi strong stocks uh believes that um like stocks current uh the current stock price reflects all current public information. Um information not available to the public can help investors boost the returns. But yeah, um uh strong is like the current stock price reflects all public and private information. So no matter what information an investor might have, they can't really have an advantage in the market. Um and I also uh so looking at uh collab earlier, um so I had one code that Gemini made for me. um that uh verified you know the first statement of 0.04 um which is incredibly not true because it tests the high low the volume not match and none of those match. Um I had uh Gemini also uh this was uh replicated from uh like a prediction like a post earnings announcement drift analysis uh uh based on um uh what we went over in class uh in the textbook. Um so let me see where I wrote about post drift. Um yeah so uh post drift uh post announcement drift refers to a situation where the stock's abnormal return the AR uh continues in the same direction for a long period of time after a major piece of public information has been released. So major piece of public information like um Ryan uh Ryan Cohen investing 13%. Um, also to to make a note about, you know, public information. It's it's really kind of hard to uh interpret, you know, like it feels a little weird to uh to think about the efficient market hypothesis because it relies on uh whether or not you have like it's the relationship between private and public information. that it can be hard to um put numeric value to information you don't know you don't have. So it it can be a little confusing. That was a little hard for me to wrap my head around, but uh I do think I got it. Um yeah, so to continue um this was just a test. So in the results uh pre- earnings uh average abnormal return was 0.1 um to total earnings stress was 3.0 um it was moderately efficient um post earnings momentum strategy may be profitable but consider transaction cost market impact and risk. Um so going down here uh we also have a graph made from another code that uh calculates AR. So you can it is all positive um which is weird but it's still going up in a posit so it's so it's going kind of up for a good period of time which is kind of that post drift. it goes down for a couple like a couple of periods which again a little odd. Um so some things are violated there. Um information [Music] so uh to compare uh EMH uh to observe behavior some people uh you know predict you know okay so how to also you know I I don't I don't think we've went over this in class but how do people like you know how people in general predict uh what the stock market is going to be. They use fundamental analysis, technical analysis, and quantitative analysis as well as uh sentiment analysis. I didn't really do those, but if I had a bit more time, I probably would have invested into it. Um I know I'm running out of time, but uh some of the predictions for uh 2020 was 3.31 uh which was a net loss. the people um the price earnings uh people it was it was negative. It was not doing well in 2019. You know, not not a lot of people, you know, had hopes that there would be a turnaround for uh GameStop considering a lot of digital uh like copies of games uh like uh Steam. So, it it wasn't you know, people didn't have high hopes, but you know why GameStop went up again. So with Ryan uh Cohen as well as uh the Redditors uh realized that collectively if they bought and held some GameStop shares, the stock price would rise as the price rose dramatically. The short sellers like again Melvin Capital would be forced to buy back the shares to quote unquote cover their short positions and cut their losses. Um uh I also uh had an Excel to you know uh to use a t test um well to use a normal like norm. this test uh to test you know like if it was you know a weak form. So I inputed all these adjun uh adjusted closing from 2019 to 2021. Um I had the expected return um and then I've found the p value. The p value was less than 0.05 uh the alpha and therefore is inefficient. So we can assume that the market you know the market is bad and also asking Gemini a bit more um uh the profit uh the systematic uh profit possible um weak form you know profiting required understanding structural flows um uh structural flaw not just chart pattern so not really getting profit getting profit off of uh semi strong if car drifts which drifted quite a bit So kind of yes from semi- strong form um and from strong form um uh yes but it would be illegal. So yeah that's that's what I could kind of shove into one video. I did go a little overtime, but I hope I",
  "video_url": "https://youtu.be/fWlrEfk11ko"
}