{
  "student_name": "Julia Munkholm",
  "org_defined_id": "037076876",
  "username": "jmunkhol",
  "video_url": "https://youtu.be/haE4ulsgpAQ",
  "transcript": "So here is my um assignment 11. So the assignment overview is to evaluate Apple's hypothetical 90 billion um share repurchase using driver. Act as an independent analyst who must determine whether the buyback creates value relative to alternate alternative uses of cash while balancing stockholder um incentives. Um so the capital allocation snapshot so the liquidity is 165 billion cash and investments 100 billion annual free cash flow market context $185 share price um um PE30 and then dividend yield is.5% 15.5 billion shares outstanding um on the balance sheet we have 110 billion debt birkshire owns 6% co CEO holds 3 million shares retail investor ers average 100 shares and employees have 170 strike options. So the proposal um $90 billion buyback executed over one year um which is um essentially equal to 10% of market cap. Um alternative options are um a $6 special dividend strategic AI/VR acquisition debt reduction and incremental R&D. So deliver a recommendation that explains um stockholder impacts, agency considerations, and value creation versus value transfer outcomes. So define and discover. The objective of this project is to determine whether Apple's proposal um of a $900 billion buyback um creates net value relative to alternative use of capital considering um total stockholder outcomes, incentives, and longterm capital discipline. So key facts. Um I already kind of mentioned all of these. Um they were all up above. Um but then so then it kind of gets into some of the math. So shares repurchased is 90 billion um divided by 185 billion. So it' be 486 million shares um that are going to be um repurchased. New shares outstanding um is equal to 5 15.014 014 billion um a 3.1% reduction. Strategic fit so AI versus VR um could create high ROIC if integrated well could destroy value if overpriced R&D expansion potentially highest long-term ROIC but could hard to um quantify and debt reduction low but stable return equal to um debt interest rate avoided. So stakeholder incentives um for this would be Birkshshire favors predictable buybacks when undervaluation exists. PE30 suggest not undervalued. So this support may be limited. CEO with 3 million shares um benefits directly from EPS um option plus share price support. Um retail investors care about liquidity from dividends versus long-term compounding from buybacks. Employees um with options prefer buybacks because fewer shares higher share which equals higher share price sensitivity. Um bond holders prefer cash prevention or debt reduction. So now to the represent stage there's a lot of formulas and kind of analysis you can do for this um and kind of base this decision off of a lot of things. So, first we're going to use the return on equity with leverage equation, the degree of financial leverage equation um to find like the leverages that take place in this problem and use that to our advantage to kind of figure out the best solution. Um we are also going to use the net income effect which is net income equals interest savings times 1 minus the tax rate. The EPS effect EPS so the change in EPS equals the change in net income over 15.5 billion. um shareholders um value transfer equals EPS boost minus intrinsic value change. Bond holders credit uh credit risk change equals the change in debt which also equals the change in credit rating. um employees um change in option wealth equals change in share price price times um options and management um the change in the wealth of the CEO um equals the change in share price times his 3 million shares. So um identify value creation versus value transfer creation equals positive MPV transfer stakeholder redistribution without raising intr intrinsic value. um agency analysis, CEO, equity incentives, investor preference, heterogenity and market signaling. So now we are on to the implement stage. to the prompt. Um, I'm basically going to be entering all the initial information that Gemini needs to calculate a bunch of stuff and then I also implemented the financial analysis requirements um that this assignment wants us to use and then I told Gemini to prevent or to present the results clearly and the alternative options as well. So this is our code. I already ran it but let me go through it really quick. So at this um at the top here it's just all the financial information that we um had put in um from what was given in the problem and then so the second one is core calculation functions. So here are all the functions that it's going to be using. Um the buyback proposal is on this side. This special dividend debt reduction simplified EPS impact from interest savings. um assuming a 4% average interest rate um and then it gets into like um the options that Apple has. So strategic R&D slashacquisition um institutional holder um the impact on burkashire the CEO bond holders um and then it kind of gets in the execution and reporting of the code quantitative output stakeholder impact quantification so the buyback um and then the final recommendation best option so now we come back here so um the snapshot net income equals 100 billion billion base EPS equals 6.45 um current shares equals 15.5 billion proposal 90 billion shares repurchase so quant quantitative comparison of capital allocation scenarios so base case do nothing so 0550 6.45 6.45 450. So no change in any of these. Um buyback proposal. Um cash use goes to 90. New share count goes to 15.01. Um base EPS stays the same. New P no new EPS goes up to um 6.66. EPS change is a 3.24%. Um leverage is 1.47. and strategic fit equals optimizing um $6 special dividend um cash use 93 new share um count 1550 base EPS um 645 new EPS still 645 0% EPS change leverage um debt/cash equals 1.53 so it's a payout um 90 billion debt reduction 90 15.5 5 6.45 6.63 so 2.7 um EPS change a27 leverage um d-risking and then the last option 90 billion strategic R&D/acquisition um 90 15.5 um 6.45 base EPS goes up to a 6.77 new EPS um 5% EPS change 1.47 247 leverage. So growth and innovation is its um title. So um total shares retired 486 million shares. Um ownership percentage before um the Birkshshire like for the Birkshshire impact 6% ownership percentage after 69% um management CEO impact sees existing ownership increases um um from 0194 to 0 um or yeah 13 um this benefit compensation tied to EPS stock price um bond holders leverage debit like cash increases from 67 to 1.47 47. Um this is a slightly negative higher financial risk as cash um reserves decrease. So the best option here ends up being the 90 billion strategic R&D/acquisition option is best use best use of capital despite the buyback's immediate EPS boost. The rationale so value creation it creates new assets and future revenue streams versus merely distributing cash. Um, strategic fit reinforces Apple's core brand value of innovation and positions the company for future growth in markets like AI and VR. Long-term shareholder benefit provides the highest long-term benefit with an estimated five um% EPS boost, which is likely to increase the P price/ equity ratio and overall stock price more sustainably than buyback. the buyback is financially acceptable um but strategically lazy um is kind of the initial analysis on that. So quickly going back to the validate um the calculations were all validated on other AI sites and financial calculators. Um code was correctly written with the right formulas as I checked beforehand and calculate um um and then it also had a complete analysis answering all the questions in the assignment. Um some ways that this could be better include incorporating share price elasticity to buybacks. Um this involves like um like right now the share price reaction is is treated qualitatively or pro proportionally to buyback size. Um a stronger analysis would also include historical Apple buyback elasticity to price. Um and then another option is adding a discounted cash flow base case um to provide intrinsic value per share and then add peer benching um so comparing Apple's decision metrics to Microsoft Alphabet um Meta to similar websites and or companies and then key variables um repurchase effectiveness PE levels at which they were repurchased and ROIC on acquisitions. So reflection using driver framework I was able to evaluate multiple different options for Apple to deal with their cash while satisfying many different sides factors they need to take account um when making financial statements. All in all we found the best option being strategic R&D acquisition using CLAB and Gemini to create a multi-step analysis using the financial terms um slations that we've been looking at this whole semester. So thank you."
}