{
  "student_name": "Andrew Kuper",
  "org_defined_id": "036275825",
  "username": "kuper",
  "video_url": "https://youtu.be/6JSSg6YjuGw",
  "transcript": "0:00 Hello, I'm Andrew Cooper, and I'm going to be talking about the Session 12 assignment of Panera, and pretty much I have this listed.\n0:12 So pretty much I need to deliver a full evaluation of Panera Bread for a prospective KKR takeover using the driver framework.\n0:21 I need to combine the DCF trading comps and President Transparency. I need to combine the DCF trading comps and President The $9 million dollars, uh, EBITDA, which stands for, um, Earnings Before Interest Tax Depreciation and Amortization.\n0:52 Uh, at 15% margin and $4 million dollars net income across 200 stores, or 2,100 stores, I apologize.\n1:06 Uh, the digital sales are at. 40, 50%. So the market references is that industry P is around 22X. The president EBITDA multiples from 12 to 15X, AAA trades at, uh, 35X PE, and McDonald's is at 25X.\n1:29 The capital assumptions are that the industry weighted average cost of capital is 9%, the management wants a 9, er, 10X and 10% rollover, strategic bidders such as Starbucks and McDonald's are circling, the growth levers are 500 new stores in 5 years, a digital mix of 70%, diner and catering expansion\n1:52 , early start-ups. So, what do I need to do is create an executive variety recommendation that states my valuation range, winning bid strategy, and a rational for choosing my financial versus strategic positioning.\n2:09 So, that was pretty much most of the defined stage, but pretty much my goal is to make a recommend, recommend a informed bid range for Panera for a KKR takeover.\n2:20 I'm going to commit to compare the difference in financial and strategic positioning. So, what I am going to represent is, or what I am, yeah, for the represent stage, what am I going to implement?\n2:32 I'm going to implement the discounted free cash flow projection for five years. The terminal value support. I need, I'm going to compare this to Panera's beers, Chipotle, McDonald's, and Starbucks to see their bid ranges and see their, uh, strategic market cap.\n2:51 And I'm going to. If you solve for the bid, the, the bid range based on, based on financial cap and strategic cap.\n3:01 And I'm going to output this in a football field chart based valuation. And I'm going to model the three scenarios, the base case with 8% growth, the upside case of 70% digital market mix, and a downside case to find terminal value.\n3:13 So, implementation, I implemented this in Google Colab, and I prompted it pretty much. Making the code, and this was my code.\n3:25 And this is what the output of my code is. Pretty much, it just solves for all the code. Scenarios, so it solves for this from year 1 to 5, it solves for the free cache from year 1 to 5, all of this, the blended of terminal value, EV, Yeah.\n3:41 And does that for all three of the scenarios, the base scenario, the upside scenario, and the downside scenario. And, uh, I made a sensitivity table, which is the weighted average cost cap.\n3:53 Versus the term growth, so pretty much the weighted cost of capital of 8% versus the growth of 2% versus the growth of 2.5% versus the growth of 1%.\n4:01 3% and then so on with the 9% and the 10% and then the triangulation and strategic premium. So pretty much the base case is valued at $11.94 billion.\n4:13 The peers valuation is like how much they're going to bid is from $10.8 billion to $13.5 billion. The financial buyer cap is $11.9 billion.\n4:27 The synergy value of 13.5% is $1.62 billion. And the strategic buyer cap is $13.5 billion.\n4:39 And I will show how this information helps me solve for what I need to do. So pretty much, I, again, set in here, the base calculates, the base calculates, the case calculates to $11.94 billion and uses 8% growth to keep the current 15% earnings before and after.\n5:04 The upside case of $14.74 billion shows the full potential that Panera has. Pretty much. This is like, if Panera is perfect, so having the 70% digital mix, making the Aveda 16% with the 10% growth, and, yeah, pretty much, like I said in the last sentence, this is what Panera could peak at if perfect.\n5:25 The downside case is pretty much, if it goes into a recession, what will Panera do? It's going to be at 7.3 billion, showing that the potential risk of a recession, if it happens.\n5:37 So, how I validated this, so the best way to validate this data is to check the interest rates and in the sensitivity, sensitivity analysis in Python, it confirms that the weighted average cost capital increases from 9% to 10%, which is makes the base drop around $700,000,000 of value.\n6:00 Pretty much like right here, the capital assumptions. One's 10% so when it actually works, It actually does, in Python, go from 9% to 10%.\n6:08 It does prove that it is validated, that this code is validated and all the numbers are correct. So how I'm going to evolve is the strategic buyer can pay $13.56 billion and be okay as a financial buyer, though we cannot pay that price.\n6:26 And the strategy should be around a $13.2 billion cap, but I honestly think it should be lower. I think it should be around $13 billion to be honest.\n6:39 So pretty much the same. Strategic buyer cap is pretty much all the peers that are going to bid or whatever.\n6:45 And that's their cap and the financial buyer where we have a little bit less money than them. But I think we're going to be able to, uh, bid and win because we have, we can prove that we can be super valuable and have very good speed.\n7:01 So. The winning bid strategy I had was to stay between 12 billion and 13 billion. Panera's value is at 11.5.\n7:10 13.94 billion and is facing bidders up to 13.56 billion dollar cap, which means Panera has to come close to the cap or they're just going to get outbid pretty much.\n7:21 So my recommendation is to start around 11.8 to 12 billion and max out at 13 billion because I think that this would be, puts us at the best value for the company and we'll propose the value and the speed that Panera has.7:40 And that is it. That's what I have for the assignment in my recommendation. Thank you."
}