{
  "student_name": "Ryan McNamara",
  "org_defined_id": "037202820",
  "username": "mcnama34",
  "email": "",
  "transcript": "Good evening. I'm Ryan McNamera and today we're going to be looking at the GameStop uh event in 2021. So, here I have my uh Python code which is going to help us go through that analysis of what exactly happened um and as well as the stock leading up to that time and um moving past it. and then we're going to go into what um a little bit deeper of an analysis. Um so just to start off, if you're not familiar with the event that I'm talking about, this is in in January of 2021. a bunch of people online uh specifically in a Reddit community decided that they were all going to buy GameStop stock, GameStop stock, and just inflate the price like crazy because the company was going bankrupt. They thought it would be funny to inflate the price. Um, and so they did that and um, it shot up like crazy, but of course they didn't actually um, keep the stock price high and it tanked again afterwards. But um, this specific case was very interesting because it was huge and sparked a lot of conversation everywhere. So let's get into it. So this is my Python code here. I start from the top. Um, we're importing data from Yahoo Finance, um, which is going to help us, which is going to feed our analysis so we know exactly that we're getting the right numbers for everything. So, um, we're just going to I'll scroll through it a little slowly just so we can kind of see everything here. Um, but really what this is going to do, it's going to output a timeline for a bunch of different statistics that's really going to help us um look at this this stock. So, we'll start here um add in on this table here. This is our closing uh price of the stock on the given day. um as well as the uh total shares that were traded and percent return based off the pro uh versus the previous day. So as we can see leading up to it 2019 2020 um stock is trading very very low dollar up to $4 in 2021 in January just before and then January 27th is when the event was and we can see that skyrocket. You can see $86 is where that is where that stock closed on that day. Um, and there were 373 million shares traded, which obviously was an insane return um, of that stock. And then, as we can see, the stock just plummeted after that. Only four days later, uh, we've got the stock down 30%. So, it was not a uh solid event here. Um, yeah. So, we're going to go a little bit more into what this actually means. So, I'm just pulling up something over here. Um, I want to talk about the just the uh the EMH, which um is what we can use to tell if a stock is weak, uh, strong or somewhere in the middle. And here the stock is weak. Um, we can see that if we come Oh, it's frozen. If we come down here a little bit, looking at our our other data here, we can see a lot of numbers that are very close to zero. And so what zero means is that the stock is weak. And we don't want a number um close to zero. That would be very very bad. Um so what this means is this uh this stock is not doing well and we should not invest in it. So the big a big question is is would a reasonable investor get into this? And the answer is no. Um this was a a singularity. It was a one-time event, right? So the biggest thing with that is you don't want you're go if you enter into this you would lose money. Um, a lot of people did lose a lot of money because they put a bunch of money into it and then the stock tanked before they could get out. So, it's not really um that's not really good. Not good at all. Um, if we're looking if we're looking at the um kind of the uh the behavior of the people who were investing, this is kind of where the uh the hurting behavior comes in. This is where it's a big group of people. It's a subreddit with hundreds or thousands of people um all just that came together to do this. They all decided that on one specific day that they were going to buy an insane amount of GameStop. GameStop. Oh boy. Um and that ultimately resulted in this event. Yeah. Um, and what that actually ended up doing is it sparked a lot of talk in like uh the government and political uh parties thinking is this stock manipulation? So, I think it could go either way. Yes, they did manipulate the stock and they did collude about it. Um, but it's kind of hard to go after that many people for that type of thing, especially on when it's all online. Um, but there was uh a lot of risk and very little return for everybody. So, ultimately, I think it was a uh it's definitely a one-time event and people lost a lot of money on it. So, um, yeah, and that's kind of what our our code backs up here. So, yeah. All right. Well, thank you very much. Have a great day. I was tired.",
  "video_url": "https://youtu.be/NebQ7Z-sWGM"
}