{
  "student_name": "Jaime Lee",
  "org_defined_id": "037547486",
  "username": "lee4972",
  "email": "",
  "transcript": "Hi everyone, it's Jamie. And for this project I analyze Starbucks' proposed flagship Roastery using the full DRIVER framework. And the whole idea here is not to just jump straight to coding, but to actually follow a structured workflow using the DRIVER framework, while showing that the Python model supports the finance analysis. And we're going to be starting with the D — define the problem — stage. The problem Starbucks is facing is whether they should invest $12 million into building this roastery that will operate for 10 years. Starbucks' corporate WACC is 8.5%, so that becomes the hurdle rate. My goal is to determine if the project creates value by calculating NPV, IRR, profitability index, payback periods, and then stress-testing the results with sensitivity analysis. The key decision rule is simple: if the NPV is positive, Starbucks should accept the project. If it's negative, they should reject it. Once I defined the problem, I moved on to the represent stage. And this is where I mapped out every assumption I need in the model before writing a single line of logic. I documented the initial investment of $12 million and the $500,000 in working capital that gets deployed at launch and returned in year 10, the 10-year straight-line depreciation schedule, and the revenue pattern over time. With that, I also had the $8 million in year one, $11 million for years two through five, and $9 million for years six through ten. Then I set up the costs: cost of goods at 40% of revenue, labor at $2.5 million, rent and utilities at $800,000, and marketing which starts at $300,000 and stabilizes at $100,000 after the first year. And then obviously you have to account for the 25% tax rate and the $3 million terminal value at the end of year 10. Laying all that out cleanly first lets us move into the implement stage. After structuring everything, we moved on to the implement stage. And here is where the full cash-flow model comes to life. In Python, I generated a year-by-year table from year zero to year ten. For each year, the code calculates revenue, cost of goods, labor, rent, marketing, depreciation, and then uses those to compute EBIT. One important detail is taxes. We apply the 25% tax rate, but only on positive EBIT because you don't pay taxes if you are losing money. After-tax EBIT gives you NOPAT, and adding back depreciation gives the operating cash flow. Working capital gets subtracted at year zero and then added back in year 10. The terminal value also gets added at the end. After combining all that, the model produces the total cash flow for the year. Finally, the code discounts each year's cash flow at the 8.5% WACC and sums all the discounted values to produce the NPV. Since newer versions of NumPy removed IRR, I built a custom bisection-method IRR function, and it solves the discount rate that makes the NPV equal zero. With those pieces, the model calculates the profitability index along with the simple payback period and the discounted payback. Once the implementation stage was complete, I got to the validation stage. This is where I double-check that everything made sense. The validation table prints out the NPV, IRR, PI, and the payback periods, which I'll show you later. If any number looked out of place — like negative depreciation or taxes being applied incorrectly — this is where you would catch it. Taxes only apply when appropriate, depreciation is constant, and the discounted values match the financing assumptions. Next we have the evolve stage, where sensitivity analysis comes in. I built two key scenarios. First, what happens if revenue drops by 20% across all years? Second, what happens if the WACC shifts by plus or minus 2 percent? These are classic stress tests that help identify whether the project is fragile or resilient. The revenue-down case rebuilds the cash flows and recomputes the NPV using the original discount factors. The WACC scenarios recompute NPV with new discount rates. As you can see, you have different scenarios. This part of the analysis is important because managers want to know not just the base-case answer, but how sensitive that answer is to assumptions that might be too optimistic. I also implemented the visualizations that we'll get to. Finally, we have the reflect stage, where I printed a full summary at the bottom, and this is where everything ties together. The base-case NPV is whatever number your model computed. If it's positive, the project creates value. The IRR comes out above the 8.5% hurdle rate, which supports acceptance. The payback periods show how quickly Starbucks recovers its investment, both on a nominal and discounted basis. And the sensitivity section shows what the biggest risks are. If NPV collapses under a 20% revenue drop, that tells management that the project is highly demand-sensitive. If NPV barely changes when the WACC moves, that means financing cost isn't the major driver. Putting all this together forms an actual recommendation instead of just a spreadsheet. Here are my results. This reflects the define, represent, and implement stages. You can see the graph of the cash flows by year, which shows that it's positive overall, and the NPV sensitivity analysis showing the base NPV and how it responds when WACC moves. These are my final results. My personal takeaway from this project is that building this model really forced me to understand how all the capital-budgeting pieces fit together. Seeing depreciation flow through taxes and then turn into a cash-flow benefit makes the mechanics way more intuitive. Working capital is another one — it's easy to overlook how tying up cash in upfront costs reduces year-zero cash flow, and then releasing it in year 10 boosts the final year. The sensitivity analysis also made it clear how small changes in these assumptions can flip a project from a value-creator to a value-destroyer. Overall, following the DRIVER framework made my analysis way more structured and actually made the coding feel simple because all the logic was planned ahead of time. And that wraps up my analysis for the Starbucks Roastery project. Thank you for watching.",
  "video_url": "https://youtu.be/fk65iJo7Tgk"
}