{
  "student_name": "Joe Dragoni",
  "org_defined_id": "036050644",
  "username": "jdragoni",
  "email": "",
  "transcript": "All right. Hello there. My name is Joe Dragoni. This is my section uh session nine assignment for the Cost of Capital Analysis. I'm using W-A-C-C or WACC. So, just to go into the assignment overview, just kind of note we're working with here for our assignment. So, we're going to calculate the weighted average cost of capital or whack for Netflix in connection with the hypothetical $5 or $5 billion rather content investment decision. Um, we must determine the current whack, the evaluation or evaluate the impact of additional debt financing. Assess project specific versus firmwide discount rates. Compare Netflix cost of capital to industry peers as well. So, just some of the parameters we were given for this assignment. We have 200 billion dollar market capitalization, 14 billion book value. So the debt 13 billion added debt or 13 billion market value debt rather. The equity beta being 1.3 um the triple B plus bond rating with a 5.8% yield 21% corporate tax rate and the stock price currently $450. Um some of the market conditions that were given is the risk-free rate being 4.5% market risk premium or the MRP being 5.5% and the media industry whack range is 8 to 10% for the whole industry. So that'll be our industry benchmark. Then some strategic context as well. So some of the peers information that we're given is that the Disney capital structure is 70% equity and 30% debt with a whack of 8.2%. And then Amazon Prime Video using Amazon corporate um financing strategy and get with a whack of 9.5%. And then Netflix is considering three $3 billion additional debt issuance for a content investment. So now to use a driver framework to go over this assignment. Um so we'll start in the define and discover stage. So um our primary tool for this is calculating the whack or the weighted average cost of capital. And for our goal, we want to calculate whack and find discount rate to evaluate a specific large scale $5 billion content investment for Netflix. Uh Netflix wants to look into a content investment strategy with the following inputs. Um those inputs being these parameters that we were given already at the beginning. Um then the whack will be compared to the hurdle rate in a capital buying an capital budgeting analysis. So we'll have to look into CAPM and use some strategies from the past sessions as well. Um so we have to calculate the whack for Netflix. The whack after $3 billion added debt. The project specific whack being US versus international um projects and how that might affect our financing strategy and our optimal capital structure. Um then comparing to other companies, those being Disney and Amazon. Um and also recommending capital structure to use in this project. Um so this investment adds value if it if it's exceed expected returns exceed the cost of capital. Um this calculation requires us to find the cost of equity using CAPM model with the provided beta risk rate and market premium and the after tax cost of debt based on the BBB plus yield as well as the market current market value weights of its debt and equity. So just some of the other information we have there's $3 billion in new debt as well that we that was introduced to us in the description and you must analyze how the specific financing decision changes the capital structure. So with that, we'll need to calculate a new whack assuming a $3 billion debt is added to the balance sheet. So is the average rate the right rate? We must assess the project specific risk versus the firmwide risk and is a $5 billion investment as risky as the average Netflix project? Also, is the firm ride firmwide whack the current hurdle rate or should we adjust it to reflect the specific risk of this content slate? And then how does Netflix's cost of capital compare to its direct competitors? we are given the beta for or the data rather for Disney, the 8.2% whack and the 9.5% whack for Amazon. Um those being Disney Plus and Amazon Prime Video. So just specifically looking at the streaming and media services. Um and this will provide crucial context for management about Netflix's relative financial efficiency. So now that we understand the direction which we want to take um with the Dstage, we'll move down to the represent stage um where we kind of go over the calculations that we are going to look into. So capital structure analysis um so the whack formula is the weight equity times the cost equity plus the weight debt times the cost of debt. Um so for that we look at the the whack calculation being the equity over the total value times the cost of equity plus the debt over the total value times the cost of debt times one minus the tax rate the corporate tax rate which is little t here. So like we said already, K_E is the cost of equity, K_D is the cost of debt. E is equity, D is debt, and then V is the total firm value. So looking at the cost of equity here, the risk-free rate um is 4.5%. The beta is 1.3 and market risk premium 5.5. So that gives us a 11.65% cost of equity. And then cost of debt as well as a tax-free rate. kind of combining that to make our calculation easier and quicker. Um the corporate tax rate is 21%. So 1 - 21 is 79. Um and then or 1 - 0.21 is 79. The pre-tax cost of debt is 5.8%. Um so 5.8% * 1 - 0.21 is 4.58% of our cost of debt. So then looking at these the capital values um the weight of the equity here is the 200 billion um which is a market value equity and then over 213 billion which is the total capital value that would be 93.9%. And the weight of the debt is 13 billion which is the market value for debt over the total capital value of the um investment being 6.1%. So then our baseline whack calculation will be 11.22%. As we combine the weight of equity times the cost of equity plus the weight of the debt times the cost of debt um as well as the tax rate to get the 11.22%. So now looking at how the how this changes with the $3 billion in additional debt um the cost of equity and the cost of debt for our calculation will not change um but it's just the weights that will change. So with the $3 billion of new debt added, that makes our total capital value $216 billion. So 200 over 216 billion will be 92.59% for the weight of the equity. And then 16 billion because we add the new debt to the existing market value debt is 16 billion over the $216 billion, which gives us a weight of 7.41%. So then plugging those new numbers into our WAC calculation gives us 11.13% which um shows that bringing in some new debt into this large investment even though it's just a little bit will bring our whack down just a little bit which is a good thing. So $3 billion in additional debt lowers the whack just slightly but we can see that this is the effect of the tax shield of which is the benefit of adding more cheaper debt um and having some more extra leverage in our company. So now looking at the US versus international project specific wax um the investments in international market typically have higher risks than the domestic market or the US market. So we already calculated the US- ccentric firmwide uh whack calculations. Now we got to calculate the international whack for a comparison. So the risk-free rate is still 4.5%. And then we have a 2% premium that we have to add onto that to kind of consider how there's some extra risk investing in international markets. And then the beta and market risk premium will stay the same as well as we see here. So their cost of equity international will be the um the 4.5 actually. Yeah, our cost of equity for international will be the 4.5% the risk-free rate plus the premium uh plus the beta times the market risk premium which gives us the 13.65%. 65% um cost of equity. So then we plug that um into the WAC formula to get our international whack of 12.98%. Um because of the 92.59% times the 13.65% for the equity plus the 7.41% times the 4.58% for the cost of the debt. So now we have the two distinct total rates for these two different types of projects and just kind of being able to use those to compare as we move to the implement stage. So moving on to the implement stage of driver um I had some assistance from Google Gemini to assist me in creating the Python code for the calculations of whack as well as sensitivity analysis. um we get the baseline WAT calculation as well as the um WAC calculation adding the $3 billion debt as well. Then sensitivity analysis for market risk premium or changing beta and changing market risk premium. So a couple of sensitivity analysises there and then um looking at the hurdle rate to get our recommendation for the capital investment strategy and then also looking at the implementation of how investing in an international market or comparing the whack for the international market will change our decision um about whether or not we will invest or not. So just to show that this code works I'll run it real quick. Give it a little run there. There we go. Um, just looking down through here, got the different functions to calculate the cost of equity, the cost of debt after the tax. Then the whack formula as well. As we can see here, that formula aligns with how we calculated it in the represent stage. Um, and then the big function for sensitivity analysis. Um, doing it for both the beta and the market risk premium. and then making the decision analysis for if we should uh invest in the project or whether or not our return will exceed our hurdle rate that is calculated in this analysis as well. Um then as well as the baseline parameters that we were given um to calculate the whack um calculating the cost of debt cost of equity and cost of debt as well. Um and then just looking down here at the implementing of the US investment decision as well as the international investment decision. So like we said got that to work already. So just looking at the results for the implement stage through the code we see that the WAC calculation reflects the same numbers that we calculated above. Same thing for the WAC calculation, giving us the same whack that we calculated um after adding the $3 billion debt as well to our project and how that will reflect in our WAC calculation. And then looking at the sensitivity analysis um for when we varied beta and varied m uh market risk premium and how that would change our whack. We see this we had the original beta of 1.3 and after tax you know that gave us the whack of 11.13%. Um which is very high compared to the industry benchmark that we were looking at and just as high in general because of the risk and volatility of involved with this company since um a beta of 1.3 is shows risky and growth which makes sense for a media technologically focused company like Netflix. So just kind of taking a look at the sensitivity analysis for beta, we can see that um as beta goes down to closer to that 1.0 market benchmark that will decrease our whack by a whole percentage point pretty much once we go to 1.1% closer to the market brings our whack closer to just 10%. um from 11 where we were, which is still relatively high, but at the same time is it's not it shows it's not as risky for our company. And then vice versa as we increase the beta closer to the 1.8 1.9 to beta um that increases our whack. So we can see a positive correlation with the weighted average cost of capital and the beta value. So as beta increases so whack and the other way around as well. And then looking down at the sensitivity analysis for the market risk premium we sort of get the same idea there as um we change the market risk premium by 0.04.045.5 that will increase our whack as well. So as we increase the market risk premium by 0.05006 05.06.065 that shifts the beta or shifts the whack rather quite a few quite quite a bit. So like we said our uh at the 5.5% um markers premium we have the bait or the whack of 11.13% but as we go up to 6% 6.5% that will start to really increase the increase the whack numbers by it looks around 6 each time 6% each time. So it just reflects that you know as we increase the market risk premium by um you know.5% that will increase the whack as well. So we also see a positive correlation between the micro risk premium and the whack through the sensitivity analysis. And then just looking at the implementation for our code we we saw that um after calculating this after calculating this W for this investment decision um the expected um rate of return we will have is 13.5%. So because the expected return um is 13.5% uh which exceeds our hurdle rate of of 13.13%. That was calculated here then we would invest in the project. But looking at the international implementation the implement the international project decision um we calculated that the whack of around the 12.98% as we did above um but the hurdle rate here is 14.98% with that same expected rate of return of 13.5. So because of this we would not invest in the international market um because the return is less than a hurdle rate so it would not be profitable. Um so just looking at this it demonstrates why a single firmwide whack is insufficient and that we need to sort of have a portfolio of different whacks. Um look at divisional wax rather than one standard whack because it's always changing. There's always things that could be affecting our analysis um and could lead to nonprofitability and risk for investors um and just not really reflecting the health of the company in general. So that was the implement stage. Now we can move down to the validate stage where we'll compare it compare our industry benchmarks and peer companies to Netflix. So, like we talked about already, we have Disney um Disney Plus specifically with a whack of 8.2% um where they had 70% equity, 30% debt. Then Amazon um Prime Video having the whack of 9.5%. Then the media industry benchmark um the whack was in between the 8 to 10% range just in general. So we talked about already our after tax whack for Netflix was 11.13%. So just to compare and validate our answers with these different companies, um Disney had a beta of 1.55. Um but you know it's a diversified company. Um overall Disney stock in general includes just Disney Plus as well as the Disney parks, the the cruise lines etc. um which offset the risk of the streaming service for the entire brand. So um because of this it's inherently sensitive to economic cycles and investor sentiment um leading to higher volatility. Um, but we also see it uses a higher amount of cheaper debt uh at the 30% mark. Whereas, you know, we're only using um, you know, a lot less than that because we invested or there it's a $200 million market capitalization, but we're only using about $13 billion of debt there. So, a lot less than 30%. So, because of this, it helps Disney to lower their WAC value. And then for Amazon, um, you know, Amazon's a huge company, also highly diversified. They have, you know, the selling platform, Amazon Web Services, Prime Video, which is what we were specifically looking at, and other services as well. So, um, it's got a beta of 1.29, which is 0.01% or 0.01 lower of a beta than Netflix is, or at least the Netflix number we were given. Um, and they're known for investing in technologies, new markets, which reflects the volatility here as well. Um, but the financial risk varies as leverage falls under Amazon's corporate capital structure. So uh the same capital structure that defines the web services, the selling um the e-commerce business as well. Um and then Netflix relies all on its streaming service platform and technology advancements. So the beta reflects that um because you know it's not a very diversified company. Their whole premise is providing um television movies for people to watch specifically on a streaming streaming service. There's not anything more to that company. So the firm is more equity financed um which is a more expensive source of capital which influences the whack value and then to look at the industry benchmark um being 8 to 10% uh for the related media technology industry um the numbers you know mostly fall around that region except Netflix is about a whole percentage point above that um but this is due to the high equity waiting and the high beta combination. So then just to look at some other validation strategies that we could use um you know market value accuracy um instead of what we're doing here it might be better to use a 30-day or 60-day analysis because stock prices are volatile over time and subject to change of events um which could establish a more stable and less biased market value of equity and debt which might give us a more accurate whack value. Um, and we used a more static constant value, um, being that $200 billion market capitalization. Um, and we assumed the new $3 billion in debt could be issued at the same 5.8% rate, um, of the debt. Um, but this could change and therefore have a different impact on the whack. Um, then another good strategy we could use to validate our answers might be the beta stability check. Um, using historical data of the beta of 1.3. um or we did use the beta of 1.3 um which was a historical value for Netflix but this is not the best idea because um you know historical data values for beta might not reflect the future um which we talked about you know in the last section using CAPM and just looking at risk in general um the historical data for beta might not be the best to really shape our perception of the future um and then we're also taking on more debt like $3 billion. Um, and that increases the financial risk, which should in turn increase the equity beta. Um, and like we said, we already looked at the sensitivity analysis up in the influence stage. Um, but the 1.3 beta is likely at the low end of the true forward-looking risk. And if the beta increases, the company becomes more more volatile, that could increase our whack as well. Um, and you know, just increase our overall volatility and risk in general that investors will be looking at. So some other methods we could consider going farther um which is part evolve stage but also part validation um looking at a scenario analysis um where we change multiple multiple variables at once compared to a sensitivity analysis where we're only changing one variable at a time like the MRP or the beta. And then another more like computer programming based simulation we could do is a Monte Carlo simulation where we run multiple thousands of simulations using a computer model to get more you know, streamlined average answers that are less biased um and less susceptible to error in our calculation. And then the hurdle rate matrix, which is a project where which is where the project is c categorized by its risk relative to the core business using the risk matrix. So those are some other methods we consider to validate our answers and look and see if we could more accurately define our whack and our other answers that we determined here. So then moving into the evaluate or the evolve stage rather not evaluate evolve stage here of driver. Um some applications of whack usage and other concepts and then some next steps as well. Um so DCF valuation whack um or the discounted cash flow valuation. Whack is a primary discount rate used to determine the price to pay for an acquisition. So this is a very important step in the process of you know valuation of a firm or uh just cost optimization and then whack is used to measure the annual performance of internal business units and executives and internal performance management. So this helps us to calculate economic value added and then optimal capital structure helps whack helps us to identify that and finding the structure that minimizes whack. um where we can get uh growth numbers and attract investors but also not be too risky as well. So finding that balance where the tax shield still applies but also minimizes the company risk perceived by shareholders. Um, and then lastly, capital capital budgeting decisions, which we talked about earlier, where WAC can help um deciding which long-term investments to make, like the $5 billion content slate, and whether or not that is a good investment to make. Um, yeah, whack is the discount rate that could be used to see if a project creates value, which is our net present value calculation, which is one of the overarching concepts we've been talking about this whole semester so far. And then if net net present value is positive then the project adds value to the company and vice versa. And then we accept the project if the rate of return is greater than the hurdle rate which we saw above in the implement stage. So the whack of 11.13% and the project hurdle rate of 13.13% are just are not just one-time use numbers but rather can be used to work through many parts of an company's corporate strategy. uh like Netflix or many other companies as well maybe like Tesla, Google, Microsoft etc. We can refresh this data with live market data to keep this analysis as accurate as possible. So not just performing this calculation one time and then looking at a portfolio of wax across multiple companies to look at divisional hurdle rates rather than just this one hurdle rate. Um or also looking at multiple countries at once like we did with the US versus international um project specific wax. And then lastly moving on to the reflection stage are the last RF driver. Um some of the key insights taken away from this whack calculation um that whack is not just a static figure um and changes as we considered new financial decisions like the $3 billion additional debt. Um and yeah, we saw the $3 billion barely moves the whack because the tax shield offsets the cost of equity increase. So another or super interesting insight to take away from that. Um then we must consider the context of the numbers when comparing to other numbers like Disney and Amazon in our project. Um spec specifically the context of the whack numbers. So Netflix is 11.13% whack shows riskier um low leverage company where they pure play spec where they hedge everything on their streaming service and its cost of capital must reflect that as compared to 8.2% 2% for Disney, 9.5% for Amazon, where there are much larger and diversified companies with other ventures like we said the e-commerce business for Disney and like the Disney parks and cruises for um Disney. So, e-commerce for Amazon and the cruises and parks for Disney. And then whack is sensitive to inputs like beta and market risk premium. So, it's important to understand the key drivers. Um like we saw in the sensitivity analysis, the increase in the beta in market risk premium across different companies might increase or will increase the whack. And then between the US international wax um in the case of Netflix, we saw how international projects can come with a premium that changes the whack in our investment decision um because the investors demand a premium for riskier uh cost decisions like that. And then location and associated currency, political and economic risks is a critical driver of the investment decision. Um and then there are also some hidden risks that are exposed um with the currency mismatch of different locationational whack values like the dollar versus the euro or the rupee. um if the rupee loses value in comparison to the US dollar that might change the whack and uh add some extra risk that investors might have to consider or that might they might not see initially without making these calculations. So the whack is the minimum return a company must earn to justify it strategic choices in the eyes of the investors and must clear the hurdle rates to create value within the company which is what Netflix has been able to do since the beginning. Um, so this is another important thing to look at and take away from this analysis which you know it makes sense talking about some of the other concepts we've learned about this in this class. Um, but still important thing to notice when doing these calculations. So then looking at our optimal strategy for the investment. So for looking at the two different projects specific wax um we saw that um for the US investment we we would invest in this project because the rate of return is over or is greater than the hurdle rate and then we would not invest for the international investment the $5 billion investment since the hurdle rate is greater than the internal rate of return. And then just some last key things to note is that our analysis showed how adding debt lowered our whack. So finding balance is key. Um like we saw with the apartment building example in class as well. Um then for investment decisions matching risk with rate. So instead of using a single firmwide whack for all decisions, the discount rate must match the risk of cash flows being evaluated. And then for investment and financing, um the goal is to fund the firm's portfolio of projects at the lowest possible long-term combined cost, which is optimal whack, which shows that you know the investment decisions and financing decisions that company's calculations are linked. Um and then a constant whack is an illusion because a portfolio of wax is reality as seen with the US versus the international whack calculations. And then just the last last thing the calculation of the base whack versus the content premium plus the country risk premium when calculating the internal or international rather wax shows that the hurdle rate is a stack of risks and layered but not blended. So almost just like a stack of risks where they're not mixed together but kind of added on top of each other. um which is it's pretty much like we saw adding extra risk on top of the US whack um not adding more there cuz we really only just added the premium that the investors were looking for um with their returns when investing in international markets. So yeah, that is the driver framework run through of the session 9 assignment. Thank you for watching.",
  "video_url": "https://youtu.be/XCBQBI_n7Ps"
}