{
  "student_name": "Jacob Youngworth",
  "org_defined_id": "035845246",
  "username": "jyoungwo",
  "email": "",
  "transcript": "Hi everybody, my name is Jacob and today we're going to be going through my session 9 weekly video assignment which covers the cost of capital analysis. I'm in this case referring to Netflix. Um obviously we're going to be using the driver framework in order to solve this problem. First working through the define and discover stage as well as represent and then getting into the implementation stage and the rest of them using our Google Collab analysis. So here's an overview of the assignment, but let's get straight into the define and discover stage to kind of solve our problem. The first step of define and discover is to really figure out the objective um as well as the guiding question. So what are we actually solving? Um and then overall how are we going to get through that? So our objectives is to analyze the cost of capital for Netflix by calculating its weighted average cost of capital under both current and perspective capital structures and to use this analysis to make a strategic recommendation on capital structure and investment hurdle rates. And our guiding question for this is eventually what is the optimal capital structure strategy for Netflix that minimizes weighted average cost of capital while ade adequately funding strategic content investments and how does this compare to industry fears peers like Disney to do this we're going to rely on the following hypothetical known parameters that were given in the statement of the problem for equity Netflix has a market capitalization of 200 billion and an equity beta of 1.3 which is shown right here, which signals a higher systematic risk than the general market. So a beta of 1.0 is the average. 1.3 is a little bit higher. For debt, we're going to actually use the market value of 13 billion because when you're calculating debt, you use that market value. And then that pre-tax yield rate of 5.8% for those tripleB plus related bonds. And then crucially, we're going to use this 21% corporate tax rate right here to help calculate the tax shield benefit of DEX. The tax shield explains that the interest expense on debt is actually taxdeductible, making debt cheaper than equity and requiring us to use it after c after tax cost of debt when looking at different calculations. And then finally, some market conditions we have right here. We have a risk-free rate of 4.5%, our market risk premium of 5 1.5% and then the media industry average rate is between 8 and 8 to 10%. So, our analysis is going to look at five key and core outputs right here, including the Netflix current weighted average cost of capital, the cost of capital after a $3 billion debt issuance. And then we're going to look at project specific weighted average cost of capital as in US content versus international content or can compare it to Disney and explain the differences from there. And then at the end, we're going to recommend optimal capital structure strategy and go through everything as a whole. So now that we're finished with the define and discover stage, let's jump straight into the representation side of things. This stage not only showcases the necessary formulas, but it also builds out a flowchart for this analysis. We already got through the define and the solver stage. We're going to go through represent in a second. We're just going to define the financial formulas and break down our analysis journey. Then we're going to get into the implementation side. We're going to calculate some key data values using Google Collab. Then we're going to go validate. We're going to sensitivity analysis evolve. We're going to look at a risk assessment and compare it the two companies together and then reflect it. We're going to talk about the optimal strategy and explain a little bit more on those specific things. These two specific necessary financial formulas are the weighted average cost of capital and the cost of equity. So the weighted average cap cost of capital is the main one. That's the first one. That simply is the minimum acceptable rate of return that a company must earn on an existing asset base to satisfy long-term investors both equity and debt. The weighted average cost of capital in this situation is also the primary hurdle rate for evaluating average risk projects. So, your weighted average cost of capital is equal to your weight of equity multiplied by your cost of equity plus your weight of debt times the pre-tax cost of debt and then multiplied by that corporate tax rate right over here. And it's important to look at these using the market values because market values reflect the opportunity cost to investors. And then this little corporate tax rate right over here is 21%. It's that tax shield because debt is actually better than equity because you can write off a little bit of taxes. Then the other stat is that cost of equity. It's the capital assets pricing model which we've covered a little bit earlier on in our analysis which calculates the expected return on equity by relating systematic risk to the expected return of the market. Looks at time value of money and everything like that. So your equity right here is equal to your risk-free rate plus your equity beta which in this case is 1.3 times your market risk premium which is 5 1.5%. It's always important to look at that tax tax shield effect which highlights the financial advantage of debt because interest payments are taxdeductible. They reduce non- tax they reduce taxable income which is important to look at which effectively actually lowers the cost of debt relative to equity. It's the primary reason that increasing leverage actually reduces your weighted average cost of capital. So now that we got the bulk of the basics out of the way, let's jump straight into the Google Collab where we're going to actually look at the actual values and everything like that. So we worked through the implementation side of things where we're going to do that basic weighted average cost calculations and using that capital assets pricing model that we described earlier. This provides the hard numbers for Netflix's cost of capital, which addresses the technical requirements that we need. So, we bring in all the financial parameters and then we simply just define the formulas that we're going to be using. And then in scenario one and two, scenario one is the current weighted average cost of capital. And then scenario two after a $3 billion debt issuance, which helps to cover a little bit more of our analysis. So, we can look right here. We calculated the fundamental data pieces that we need which remain constant across both your cost of equity right here which is using that capital assets formula right over there 11.65%. This is the high return Netflix must promise its shareholders. It's driven by the beta of 1.3 reflecting its higher systematic risk compared to the overall market. So we assume a beta of 1.0 in general. This is a little bit higher than your after tax cost of debt which is 4.58%. This is the effective cost of borrowing. It's actually lower than that 5.8% bond yield because of that tax shield benefit where interest payments of debt are actually taxdeductible. So, it's important to look at that. We're going to look at the benefits of those in just a little bit. Now, let's jump right into scenario one where we're going to calculate Netflix's current weighted average cost of capital. That's actually our baseline hurdle rates. We actually found that Netflix's capital structure was extremely equitive e equityheavy with 93.9% financed by equity and only actually 6.1% by debt. This highly conservative mix actually results in a weighted average cost of capital weighted heavily towards the expensive cost of equity. And then you can look right here results in a weighted average cost of capital of 11.21%. This is Netflix's firmwide rate. It's actually notably higher above the net or the media rate of between 8 and 10% and that's actually shown by the very high equity thing and we'll jump to that in a little bit. Then after that issuance of $3 billion of debt, the capital mix actually shifts marginally with debt increasing to 7.41% and actually that new weighted average cost of capital is going to drop to 11.2% between 11.2 11.12 and 11.13%. This reduction confirms that utilizing more cheaper tax advantaged debt does actually lower the cost of capital. In this case, you can see it's by between 0.09 and08 points, which is always something super important to look at. The key takeaway is simply the hurdle rate, which is 111.12%. This high cost of capital is simply driven by the reliance on expensive equity finance. Now, we're going to jump right into the validation stage. We're going to test this out. We're going to look at it, look at some changes that can be made and some sensitivity analysis. So again, we're going to pull all of our data in. We're actually going to build it out into a graph. Just makes it look a little bit easier where we can leverage it and explain and look at it all together. The goal here in this stage is to really test the robustness of this weighted average cost to capital of 11.12%. And to look at finance and technology to look at the leverage calculation. So this graph and this plot right here showcases what happens to weighted average cost to capital as the proportion of debt increases. So the x-axis down here shows the debt weight and as a percentage of total capital. The y-axis over here is going to show the um resulted weighted average cost of capital percentage. As you can see this blue line right over here is that initial range shows that downward slope across that initial range. It's the central finding of our validation confirms the financial principle that replacing equity with debt lowers the average cost of capital. So being moving in this direction down to the right is actually the benefit of debt versus equity. Then now let's look at Netflix versus its peers. Netflix is all the way up here at roughly 6.1% debt and 11%.21% weighted average cost of capital. It's very high on this cost curve. It's not a great position to be in. You can see that dotted orange line at the bottom is that industry midpoint. It said between 8 to 10%, so we assumed it's at 9%, Netflix is way above right over here. And actually, if you look down here at the green dot, that is Disney right over here. Disney operates at a 30% debt ratio with an 8.2% weighted average cost of capital. The distance between these two actually highlights the vast cost efficiency Netflix incurs by being underleveraged. The debt to equity mix or capital structure is super important when looking at weighted average cost of capital. It's a mix between the balance of cheaper debt and then also financial distress. Initially, when you increase your debt, you lower your weighted average cost of capital due to that tax shield. But push it too far and actually you can come to issues with debt. So that optimal capital structure is actually right in the middle which we're going to look at when we go into that evolve stage and then we reflect on everything else at the end. So now let's jump into the evolve stage where we're going to look at and answer two major questions. How are we going to use this calculation, this data point that we found and also why is Disney's value so much lower than Netflix's? So jumping into the first one, we're going to look at project specific weighted average cost of capital um which firmwide is 11.12%. But it's dangerous if we just use that as a whole overall for everything. So we must apply a risk adjusted discount rate in order to kind of understand that a little bit more. So this assignment had us break things down into US content and international content. Your domestic content is going to be lower risk. Your international content is going to be higher risk. For US content, we assume that there's established stable and lower risk. It's going to be evaluated at an adjusted hurdle rate which is lower than the firmwide rated average cost of capital which we say and we estimate to be about 10%. And if we use that higher rate right now that 11.12, we actually risk incorrectly rejecting valuable and lowrisk products. Then when you look on the international side of things, international projects a lot of times have higher risks, currency fluctuations, regulations that are different between countries. And also politics can always play a role in that. We have to adjust that hurdle rate upwards. If we use the too low of a rate, we can actually incorrectly accept different projects and different bids. high-risisk projects that actually would detriment the society and make the project worse overall. So the principle overall is clear that risk adjusted rates are mandatory to ensure we allocate our capital correctly depending on the specific situation. Now let's look a little bit at Netflix versus Disney. Our analysis showed that that debt that gap is really high. It's 8.2% versus 11.12%. And there's two main reasons for this. The first is the difference in capital structures or leverage. Netflix uses very minimal debt around only 7.5%. Disney is actually close to 30%. Disney uses their leverage stat strategically. They maximize their tax shield pulling their blended cost of capital a lot lower than Netflix. And then overall is diversification. This is another one to look at in beta. Netflix has a pretty high beta of about 1.3. It only has a streaming focused business model. That's the only really thing they do. So in cases that it might not go well, it would drop and everything like that. Whereas Disney actually has a very low beta because it's such high highly diver diversified. They have stable parks which bring in revenue. They have their own media networks. They have their contents. They post stuff on Disney Plus which is their streaming service, but they also have movies they produce. They have people who go to their amusement parks. So they're bringing in revenue from a variety of different situations. If one fails, they have a plenty of backups. This diversification helps to lower risk and significantly reduces their cost of equity which plays right into their capital assets pricing model and your cost of capital calculations. So really Netflix's high weighted average cost of capital is both because it's underleveraged and in a concentrated business model. We're going to use these when we're jumping into a recommendation side of things. We're going to look at that reflect stage to kind of figure out what is the best option for Netflix and how can they be beneficial jumping right into the future. We have two recommendations that I built out. The first one is an optimal capital structure strategy. Our analysis really showed a clear and present problem that Netflix's high weighted average cost of capital is primarily just a result of it being underleveraged which helps us to use that tax shield to maximize the total benefit. So right now our total debt ratio is about 7.14%. We want to move that get that up to be about 25 to 35% of your total um debt to equity is between that. This range helps to figure out where the tax shield benefits are the most perfect perfected. And when you are implemented this we have to do it in a phased approach. We can't just say, \"Hey, we're going to request we're going to send out $15 billion in debt cuz it's going to detriment the company.\" You have to do it in phases. It avoids messing up the market and everything like that. Um, and as well, the suspected outcome is a reduction in weighted average cost of capital, which makes the company overall a lot more financially sufficient and safe to invest. And then the last recommendation that we have is a capital allocation policy. Um, we formally advised Netflix to abandon the use of that single weighted average cost to capital rate and implement a dynamic risk adjusted discount rate which we mentioned a little bit earlier when looking at international versus domestic products to kind of look at different situations. So this policy implementation simply we can start it as two different tiers a low-risk tier and a high-risisk tier. That lowest tier is for US content, for content that's stable. Using a lower hurdle rate, let's say about 10%. Which makes makes sure that we reject anything that is too risky or low risk. And we make sure that we're at that rate where if something's in that range, we accept it. And then at that higher risk rate um for international products or things that we really don't know very well, we use a higher hurdle rate about 12 1.5% which helps to prevent the acceptance of any projects that might be too high of risk, that might be destroying value overall. Um, overall we want to align that hurdle rate with project risk. We want to really make sure that every investment decision that we're making helps to maximize our shareholder value and our return and calculates everything correctly. We're going to come back right up to the top after we've covered everything overall. In summary, this driver analysis really proves that Netflix has a path to be valued higher, has a path to less risk, and that's simply using that tax shield through higher leverage and by improving investment discipline, through that risk adjusted discount rate to kind of figure out and solve the problems throughout this situation. Was really interesting to work through the driver framework in this. Knowing Netflix very well and knowing Disney very well was interesting to look at everything overall like this. I hope I answered all the questions and covered everything that was important. So, thank you.",
  "video_url": "https://youtu.be/sfqFfYEIUZg"
}