{
  "student_name": "Ethan Mendonca",
  "org_defined_id": "037327547",
  "username": "emendon",
  "email": "",
  "transcript": "Hello, my name is Ethan Menona and this is the session 8 assignment for the uh management class where we're going to be doing a driver analysis on GME market efficiency. So the main objective of this um of the stage is to of the define and discover stage is to define the problem as well as figure out what are the main tools and ways that we can use in order to essentially make it easier to solve the solve the the question. So the main problem that we're trying to do is to investigate the 2020 to 2021 GameStop short squeeze um in market efficiency. And so we're going to be using a two two types of analysis which is an EM framework which is to test the event against the three forms of the efficient market hypothesis which is weak, semi- strong and strong as well as the behavioral framework which is to evaluate the event using financial concepts such as hurting and limits of arbitrage. Next is to figure out the main facts regarding our uh regarding our assignment which is through the use of Google and AI. So the main method I use was Yahoo Finance and so utilizing uh Yahoo Finance uh I found the the opening month for August 3rd 2020 which was $1.04 and so on. Also, I figured out what the uh the price surge was as well as the interest rate what the interest rate was at the time uh according to some articles online as well as Yahoo Finance as well as the main claim which was anal analyst fundamental value estimates $10 to $40 per share. Third, I focus on the scope and the key question that we need to ask ourselves in order to solve the the main problem, the problem statement. And so obviously we are going to be using the two styles of research which is EMH violation um as well as the behavioral explanation, what behavior biases there are and what forms of EMH were violated. Also, I wanted to figure out whether a rational investor could have systematically profited off of the short squeeze of GameStop. Additionally, these are the data sources that I used. So, um the main data required as well as the main sources which was mainly Yahoo as well as some of the tools that I'll be using which is Y finance which helps me download historical market data uh straight from the library. Next is the represent stage. And so the first part about the represent stage is creating a framework that we can continue with the implement stage on. And so firstly I wanted to do a mix of a qual quantitative and qualitative study because it's it's it's very easy to just input the numbers and create uh a chart and a set of values. However, the qualitative data is why these these numbers matter is the main uh problem that we're trying to solve. And so the main plan is to use import Y finance as well as the regular uh pandas and pipel 500 and GME from finance and then later on clean that data and essentially make it easier for the viewer to understand what happened during that short squeeze. And thus the next step will be to essentially study uh the window definition based on the the DND stage and we will define the two time frames which was the estimation window as well as the event window which is normal normal period versus the price search period. Additionally, we will calculate the expected returns in order to figure out whether people could a rational investor could have successfully um made profits on this short squeeze as well as the abnormal returns. And this shows a total compounding effect of the anomaly over the event window as well as the final visual visualization where we can uh create a chart of the split adjusted price and trading volumes as well as the uh cumulative abnormal returns uh based on the data. And so this is the code that I created. So obviously the first part of it is to import the libraries for downloading the stock data and creating the charts and thus first defining the tickers and the dates uh as well as downloading the data and selecting the the main columns that we need which is the the volume and the closing prices. of the opening prices. Next, uh I calculated the daily log returns in order to figure out the extent to which the short squeeze hit the market. Next, defining the time windows uh and splitting our data based on the different start estimations and the actual event start time and then running the OS regression model in order to create a alpha and beta values for the model results and this helps us to calculate our abnormal returns and C values. Um after calculating those we are able to visualize them by generating plots for uh the GME price and volume during the squeeze as well as um the C values and hence this is what we get get a calculated alpha of 0.122 calculate bit of 1.7346 and these are the abnormal calculation returns and as as we can see during that time there was a sudden spike in Jimmy price as well as the peak price around the same time. And as we can see in the CR values, there's also a sharp spike on abnormal returns which could showcase uh uh market manipulation which is the main point of this uh problem. And so when looking at back at the validation to validate the results from the implement stage is really important to relook by myself at the charts and the values in order to figure out whether uh then this is like a normal event or if it's a unique event. And since as we can clearly see from the graph that it goes from the that the close price was went from five from from a really low price and very low volume into extremely inflated numbers of volume and price as well as the as well as abnormal returns occurring during this peak. It is clear that this is not a market a normal market event. Right. However, some ways that we can improve this uh and evolve this uh this method of uh finding the finding market whether market is for is to use active investors because this event is a critical lesson in risk management. uh and is important to understand how people can change up their ma their their ways of uh their matter of investing as well as uh regulations and brokers as due to the lack of regulation in GameStop stock. It was extremely easy for people to market manipulate and essentially create a short squeeze out of nowhere and create fake demand and fake uh fake demand for products that do not really have any demand. And so reflecting uh from the analysis which form of EMH was violated. Uh the weak form was violated as our price/v volume chart shows that the past trading data did have predicted power which is exactly what the weak form EM says is impossible as well as the semi strong form was violated. And in regards to the EMA versus behavioral, the efficient market hypothesis is not wrong, but it is incomplete as it serves as a good benchmark for normal market conditions, the GM event is a perfect case study where behavioral findings explains the cause of anomaly and market mechanics explains its magnitude. And thus in conclusion, the GME event does not prove that one can systematically beat the market. It proves that markets can profoundly have irrational when behavioral biases are amplified by specific market structure leading to temporary but spectacularly failure of efficiency. Thank you.",
  "video_url": "https://www.youtube.com/watch?v=-7144o1hqaE"
}