{
  "student_name": "Andrew Jacobs",
  "org_defined_id": "036214646",
  "username": "jacob269",
  "video_url": "https://youtu.be/H3a3Ks35hwI",
  "transcript": "Hello, my name is Andrew Jacobs and this is Session 12 Assignment. In this assignment, I'm evaluating Panera Bread for a potential KKR takeover using the driver formula.\n0:12\nI'm going to show, define and discover first, then run DCF and comps and precedence, then combine them into a football field and end with a big target and a walk-away price.\n0:24\nSo, let's move on. Here's cell two. Cell two is my define and discover cell. This is the grading gate, so I'm doing it before I calculate anything.\n0:35\nAnd what we are given in this assignment is that Panera has about $6 billion in revenue, $900 million in EBITDA, and $400 million in net income.\n0:44\nAnd the market references I'll use is the industry PEL, and 22X, the McDonald's 25X, and the Chipotle 35X, and Precedent EV slash EBIDTA 12 to 15X.\n1:01\nSo for the DCF, I'm keeping the assumptions simple and transparent. The tax rate, DNA, CAPEX, and working capital are all set as percentages of revenue, so I can change them quickly.\n1:12\nI also set three scenarios, down, base, and up, each with a revenue grade rate, EBITDA margin, WACC, and terminal growth.\n1:26\nAlright, let's move on to cell number three. Here's cell number three. Thank Uhm, the model projects revenue about out five years, then builds free cash flow, uh, then it discounts cash flows at the WACC and adds a terminal value using a standard Gordon growth formula.\n1:49\nUhm, so, the enterprise value implied by each scenario and the, uhm, terminal value percent, just to make sure the DCF isn't completely driven by the terminal value is what I'm focusing on in the DCF output.\n2:12\nLet's see. Next, uh, Cell 4 is the market cross check in the synthesis. Uh, first training comps, I apply the PE multiple, uh, multiplies.\n2:24\nUh, to Panera's net income to get implied equity value, then convert that to enterprise value using the net debt. Uh, second, uh, the precedent transactions, I apply, uh, 12 times to 15 times EV, E-B-I-D-T-A, uh, to Panera's $900 million in EV, to get an implied EV range.\n2:48\nSo, Now, I, um, uh, combine the three approaches into a triangulated, uh, standalone EV range, and that's the range that KKR should most care about, because it reflects what Panera's is worth on its own.\n3:06\nI also add a simple strategy value proxy. This is not the KKR's base case, but it's here to explain, why strategic better might pay more.\n3:14\nUh, statistics can justify a higher bid if they can capture synergies at scale, and the KKR generally should not pay a strategic price unless those synergies are truly controllable.\n3:28\nAlright, so here is the feeling. So, Uh, my walkway price is at the top of the standalone range. That's the discipline sponsor ceiling.\n3:44\nMy bid target is around the midpoint of the standalone range, with only a small add-on for synergies if need to be stay competitive.\n3:52\nSo, uh, overall, let me see if you can see this. Um, the recommendation is, uh, bid any other standalone midpoint.\n3:59\nUh, do not exceed the top of the standalone And if strategies, uh, uh, strategic push past that, uh, KKR should be willing to walk.\n4:10\nThank you so much for listening. evening."
}