{
  "student_name": "Isaac Buche",
  "org_defined_id": "036112318",
  "username": "buchei",
  "email": "",
  "transcript": "Hello, this is Isaac Buche and this is my session nine assignment. So um in this assignment we're going to start by calculating the um the goal is to calculated uh average cost of capital or the WACC. So to define some of our parameters here, our market capitalization is 200 billion. Our total debt, we're looking at 14 billion for Netflix. Our debt market value is 13 billion. Equity beta at 1.3. Our bond rating here at BB is a yield of 5.8%. Our corporate tax rate is at 21% and then the current stock price is at $450. So we're going to determine the correct hurdle rate for hypothetical for hypothetical uh $5 billion content um strategy. We will conduct this analysis using driver framework. So as we move on um our objective is clear. We're going to calculate the WACC. Um we're going to use those um parameters that are defined there. So before we start calculating the WACC, we want to refine our remaining input on the cost of debt. Our pre-tax yield of it being 5.8% because interest is t is tax deductible. We benefit from the tax shield. So our interest after tax debt is 5.8% um is we put it into a um formula which is going to be it's 1 minus21 times by 5.28 which gives us 4.58%. within our established our capital weights which ne Netflix is extremely quite um equity heavy which is there being about 93.9% equity and only about 6.1% debt. So now we're going to start to implement um this is where we draw in our the code that I created for this because this is where I did all of my calculations. So jumping into this, start up top here. So I had Gemini write my code here. so first I had it like defining my parameters. figuring out my risk rate, my marketer risk premium and all that putting plugging all these numbers in and then getting our cost of equity calculation. Um, so and then we and then it goes down into our into going into the WACC calculation. So what it ends up spitting out here is our cost of equity calculation. So it shows us that our total capital, our weight of equity being 93.9% there, our weight of debt is 6.1, our after tax cost of debt being that 4 point that 4.6% that I talked about earlier. and then we keep scrolling here. It we get to our um our WACC here, which it spits out that our WACC is about 11.22% currently. So um this will be the company's baseline hurdle rate here that they can that that that is spit out. So that is something that we can evaluate to our other peers here from these previous um um from this area right here the strategic context here. So what this is saying is so Disney's capital structure of 70% equity and 30% debt and then a WACC of 8.2% 2% and then Amazon Prime Video uses uses Amazon corporate of the WACCC 9.5%. And this shows it right here. So um this tells us that the minimum required returnway for the $5 billion uh content investment for um Netflix is 11.13%. assuming like average risk. So our project specific WC for high-risisk international content hurdle rate of 13 must be used to compensate for high abate assess sovereign risk preventing adverse selection rejecting low risk accepting high-risisk projects. So and then comparing it to Disney here Netflix current debt ratio of 6.1% is far below Disney's 30%. Um, so what my what the AI spit out here and what my coach spit out here is that Netflix should the recommendation at the bottom here is that Netflix should strategically increase its debt ratio to the towards the 20 to 25% range to lower its WACCC which is currently um approximately like um like three percentage points higher than um Disney's. So um if they can lower it and realize the full benefits of the tax shield there that way they can um they'll maximize their firm value a lot higher comparatively to what they're currently doing. So um that the minimum um so that they're just basically what I all I want to confirm is that they that 11 um one two is a fairly high WAC rate WACCC rate and um if they can if they can lower that it would create um a much more maximized uh value for them. However, based on the calculations here, um at the 11.12% um WAC rate and by opting the capital structure, um Netflix can ensure its $5 billion investment maximizes their shareholder value at that. So, um going back to the problem, yes, with a hypothetical $5 billion content investment, your analysis must determine the current WACCC. So, at that $5 billion, the WAC is 11.12%. Uh, thank you. This is my session 9 assignment. And, uh, goodbye.",
  "video_url": "https://youtu.be/c2HsXTvE0bk"
}