{
  "student_name": "Colin Crean",
  "org_defined_id": "037433259",
  "username": "creanc",
  "video_url": "https://youtu.be/I3x31fp5hm0",
  "transcript": "0:00 How's it going? My name is Colin Crean and this is my session 12 assignment about comprehensive, comprehensive business valuation. So to start off here, uh, with my Define and Discover section, the D section.\n0:16 For the assignment overview, we're going to deliver a full valuation of Panera Bread for a prospective KKR takeover using the driver framework.\n0:24 We're going to combine DCF trading comps and precedent transactions to produce an informed bid range while contrasting financial buyer discipline with strategic value.\n0:36 So, for the key variables and assumptions, so the target Panera Bread is 6 billion revenue, 900 million EBITDA, and 400 million net income.\n0:43 The growth profile, an 8% historical growth, planned for 500 new stores in January. Digital expansion, for the cost of capital, the WACC, uh, 9%, it's industry average.\n0:54 For the comparisons, uh, Chipotle, 35 times PDE ratio, McDonald's, 25 times PDE ratio, and for the industry PDE ratio, roughly 22 times.\n1:04 And then for the precedence, EBITDA, the earnings before interest, taxes, depreciation, amortization, uh, it's multiples of 12 X to 15 X.\n1:13 So for our goal, we're going to create executive, an executive ready recommendation that states my value. A cryptocurrency based on which is I'd like to comparison of the it's to loss.\n1:33 So going to do a comparison of my Let's on the And into the right side, I'm which is represent for the represent section.\n1:38 I'm going to lay out the formulas in a visual map as long as along with a pseudo code showing our strategy.\n1:45 So for the visual strategy map. Or the valuation strategy map, the objective is to triangulate Panera Breads value using. Thank you.\n1:52 Redistink Lenses to Minimize the Bias. So we have these sections of the methodology type Roland Analysis and Key Strategy. So for the DCF, uh, it's intrinsic in its Roland Analysis as it captures long-term valuation of growth in margins and the Key Strategy is free cash flow or.\n2:08 For trading comparables, it's relative in its role as, you know, a benchmark's against current market sentiment or the peers and the Key Strategy is the PDE ratio.\n2:19 And then for precedent transactions, it's relative if benchmarks against what buyers actually pay for. The M&A and its Key Strategy is EV divided by E-P-I-E-B-I-T-D-A.\n2:32 Now to move on to the mathematical logic. So the Umm-levered free cash flow, the UFCF, we're going to use this to calculate the cash available.\n2:40 The all-capital providers before debt payments. And so the formula for that is E-P-I-D-D-A times one minus the tax rate plus D-N-A minus cap X minus the change in networking capital.\n2:52 And for this model, we're just going to use a simplified version which is E-B-I-T-D-A-T-A-T x is minus cap X. For the terminal value or the Gordon Growth model, I'm assuming Panera grows at a steady rate G forever after year five.\n3:04 So the T-V-N equals the F-C-F-N times one plus G over the W-A-C-C minus G. And then for the enterprise value, I will discount both the five-year flows in the terminal value back to today and the equation I have it on here since it's complicated is this.\n3:23 Okay. So now, uh, for my Python, and code layout, this full chart is going to serve as a pseudo-code list to help way out, uh, and structure the code for the implement stage.\n3:35 So for the input layer or the parameters, we have the financials, we have the revenue, the e-b-e-b-i-t-d-a, the net income, and then for the drivers, we have the growth, a-b-b percent, the margins, fifteen percent, the tax, twenty-five percent, the WACC, nine percent, and then for the scenarios, we're\n3:50 going to do a base scenario, a bold scenario, strategic synergies, and a bare scenario, execution fail. For the processing layer, the function, we're going to iterate through five years, growth- throw The revenue to apply margin to deduct tax slash cap X and to store FCF.\n4:05 And then we're going to calculate terminal value at year five, discount all cash flows to present value, and some present values to get enterprise value.\n4:12 And then for the output layer, the visualization. . . Uh, for the data frame, it's a side-by-side comparison of EV across scenarios.\n4:20 The triangulation is an overweight trading comparisons of AAA slash McDonald's and precedent transactions 12 to 15 times EBITDA to define the football field range.\n4:32 So called football field. Uh, by parameterizing variables like growth rates and margins, I can instantly toggle between a base case, a bear case, and a strategic synergy case.\n4:40 This automation allows us to see how sensitive our valuation is to small changes in performance, which is critical for KKR's risk assessment.\n4:48 Now to move. To move on to the i stage or the implement stage, I've prompted AI to output a code that follows our pseudo code structure.\n4:54 We just went over here and, um, yeah, the pseudo code structure that I made in the represent stage right here.\n5:00 So here's the code right here. So we have the defining discover. Our case, base case, bulk case, market assumptions, all the stuff we were given.\n5:09 And what it ends up outputting is a graph here with some data. So we have the precedent trans, the trading comps, the DCF intrinsic.\n5:17 You see here the valuation is on this x-axis here. And the title, Pronero, red valuation, the football field, uhh, the red data line, the right here, $11.5 billion.\n5:29 And then so the detailed valuation output, we get a DCF base case evaluation of $8,866. 0.54 million, the precedent range of $108.00.0 million to $135.00 million, and the trading range of $88.00.00 million to $100.00 million.\n5:52 Not to explain the code a bit. For the engine function, the code encapsulated the value logic in the calculate underscore DCF function.\n6:03 This ensures that every time I change an assumption, like whack or growth, the model recalculates consistency. This satisfies the automation requirement for the, uh, assignment.\n6:13 The code also allows for scenario toggles in the scenario dictionary. The code defines a bare base and bold case. This allows us to instantly stress test evaluation.\n6:24 For example, if the margin drops to 13%, in the bare case, we can see if the deal still makes sense.\n6:29 Finally, for the logic check, inside the loop, the code explicitly calculates free clash flow by stripping out tax and capital expenditures from eBITDA, which gives us the true cash available to pay.\n6:40 Pay down the debt KKR would used to buy the company. Now, for the validate section of the V section, for the validate section, we need to do a check and make sure everything makes sense.\n6:49 So, for the floor, our trading comparables, based on the industry PDE ratio of 22x, suggest the value around 8.8 billion.\n6:56 It serves as our absolute four. Panera should not trade below its peers. The ceiling are present transactions 12x to 15x EVITDA.\n7:08 Sorry. Uh, imply a range of $10, er, 10.8. $8 billion to $13.5 billion. The confirmation are DCF based case of lands squarely in the middle of this precedent range at approximately $11.5 billion.\n7:21 This valuation, this validation is important and makes sense. Since our intrinsic DCF valuation aligns with with a buyer- so historically paid for similar assets, we can be confident that a bid in the $11 billion to $12 billion range is defensible and not relying on unrealistic growth-expect- assumptions\n7:39 . Now, for the evolve stage, I'm going to stress test the assumptions using Scenario Toggles built into the code. So, for the bear case risk, if the store expansion execution fails in growth drops from 4% or 24% from 8%, the model shows the valuation collapsing roughly $9.5 billion.\n7:55 This highlights that KKR's returns are highly sensitive to the successful rollout of the new $500 source. The strategic threat, McDonald's S Starbucks, this is where the bull case toggle becomes a proxy for strategic, a strategic buyer.\n8:08 Company like McDonald's can realize supply chain synergies that KKR cannot. If we toggle margins up to 17% simulating these synergies, the valuation- jumps to over 14 billion.\n8:18 The insight that this tells us is that if a bidding war begins, a strategic buyer will always be able to outbid KKR mathematically.\n8:26 We must be disciplined. Now for the reflect stage, the of DCF and precedent transactions, I recommend KKR submit an opening bit of 11.5 billion, approximately 12.8x EVITDA.\n8:41 I chose this price because it secures the asset at a fair market premium above of the industry average. Average, it also leaves room for KKR to generate an IRR above 20% by executing the digital expansion and store growth plan.\n8:54 The strategy for strategic buyers. We must anticipate that McDonald's or Starbucks may circle this deal because they can value Panera at 14 billion plus due to synergies.\n9:03 KKR should not answer bidding more. My final decision is to draw a hardline at 12.5 billion. If the price exceeds this cap, the returns for a financial sponsor effectively vanish and it would be smart to walk away.\n9:15 So that is my session 12 assignment of a comprehensive business. Valuation, um, for Panera Bread, uh, for a, a Panera Bread for a prospective KKR takeover and we use the driver method.9:29 So thank you for listening."
}