{
  "student_name": "Gavin Henning",
  "org_defined_id": "035722847",
  "username": "gjhennin",
  "email": "",
  "transcript": "Hello, my name is Gavin Henning, and today we're doing the Session 6 Assignment Market Efficiency Investigation. So we're given the overview to investigate market efficiency using the GameStop GME short squeeze event of 2020 to 2021 as a case study. We have to verify accuracy of state of facts, analyze price behavior for market hypothesis predictions, and evaluate whether market anomalies constitute evidence against market efficiency or can be explained with existing frameworks. Critical first step is to verify that the GameStop traded at four cents in August of 2020 against actual historical data. I think correct document the accurate figures and determine appropriate communication approach for correcting the professor so it gives us event timelines key data points and the required analysis so I did run this in collab already and it kind of pulls historical data from Yahoo Finance so maximum trading price in August 2020 was a dollar and I did run all this in collab here's kind of a visual but also created a PowerPoint to kind of in short kind of recap these findings so the GameStop GME short squeeze and analysis of market efficiency and behavioral finance um so the four cents um was is the question the trading price is that fact or fiction um so that's really what we're trying to discover investigating claim that set the stage for a market anomaly um so key questions answered uh four cents in august in 2020 Was that a true trading price? And the answer is no. The statement was incorrect. The GME was traded between $1 and $1.79 in August of 2020. Market efficiency violated? Yes. The weak form and the semi-strong form efficiencies were potentially violated. And was there systematic profit? Unlikely because the event was predictable, high risk, and driven by non-traditional factors. data analysis is what what the numbers say so key findings again that a dollar was actual minimum price in August of 2020 not four cents so the the fact check is that analysis directly contradicts the viral claim of a four cent trading price the lowest trading price for GME in August 2020 was a dollar with a max trading price of $1.79. This factual baseline is critical for understanding the scale of subsequent squeeze. So some key findings, anatomy of the squeeze, there's a $37.05 price increase from January 25th to February 1st of 2021, a significant and rapid price surge 2.3 billion plus shares were traded so it's like exceptionally high trading volume during that peak period and then 25 .91 standard deviation so extreme volatility in closing prices and then highlighting market instability some key findings a weak form efficiency violation historical data historical data failed to predict the surge on the extreme and rapid price surge was not predictable based on historical price and volume data alone. Past performance is not an indicator of immediate future results and this suggests that a clear potential violation of weak form efficiency where all past trading data is supposedly reflected in the current price. And then there's just a GME price anomaly pre -squeeze versus the peak. So you can see at the pre-squeeze how low that price was And then at the squeeze peak, it skyrocketed to that unpredictable surge. For semi-strong efficiency violation, which was the second one violated, was irrational response to public information. So public information, such as social media posts or short interest data, did influence the price. However, the extreme market reaction and volatility suggest prices were not a purely rational or instantaneous reflection of this information. This indicates potential violation of a semi-strong efficiency. And this is just kind of a visual for that, that the public information such as social media did directly affect that market price. behavioral noise not instantaneous or rational key findings the human element hurting and sentiment collective action driven by online communities creating a powerful unified force availability bias highly visible memorable posts and success stories or games driving decisions over base rate data confirmation bias is seeking out information that confirm the squeeze narrative by ignoring contradictory data and then regret avoidance or FOMO fear of missing out on what was perceived as a once -in-a-lifetime event some insights and next steps the gme squeeze highlights the limitations of traditional emh and explaining phenomenal phenomena driven by social media market structure and collective behavioral data some next steps future for future analysis deeper quantification so future analysis could quantify the impact of specific behavioral biases and social media sediment using advanced data analysis techniques such as NLP on social media data simulation of modeling so in corporate agent-based modeling to simulate the complex market dynamics and collective behaviors observed during the squeeze. So that's kind of all I have for today. Thanks. Bye.",
  "video_url": "https://www.youtube.com/watch?v=GCdsd-mygAA"
}