{
  "student_name": "Sharanya Srivastava",
  "org_defined_id": "035908028",
  "username": "sriva154",
  "email": "",
  "transcript": "Hi everyone, my name is Sharanya and today we're going to take a look at session 9's section six assignment which is where we're finding we're calculating the weighted average cost of capital for Netflix in connection with a hypothetical $5 billion contract content investment decision. Sorry. Our analysis must determine the current WACC, evaluate the impact of additional debt financing, um assess project specific versus like firmwide discount rates and compare Netflix cost of capital to industry peers. So um now the key financial question that we have to answer in this assignment is what hurdle rate should Netflix use to evaluate major content investments. So now to answer this I will have to calculate Netflix currents w current WACC WACC after issuing an additional $3 billion in debt um project specific WACCC's for US versus international content uh comparison of Netflix WACC to Disney and Amazon. And lastly I'll leverage sensitivity analysis to explore how capital structure affects risk and the cost of capital. So this will help us create a full picture of how Netflix should finance its growth while managing investor expectations and risk. That was our define um from the driver's framework. Moving on to discover um so for this analysis I used a hypothetical Netflix financial parameters provided in the assignment as it's written over here. Um the market capitalization is 200 billion. Our market value debt is about 13 billion. Our equity beta is 1.3. Our bond yield is around 5.8% which is a BBB bus rating. Our tax rate is around 21%. Our market data um shows that we have a risk-free rate of 4.5%. Our market risk premium is 5 5.5%. And our strategic benchmarks like Disney's WACCC is 8.2 um%. Amazon's corporate WACCC is 9.5%. The media industry range is around 8 to 10%. Um I also incorporated assumptions for project level betas. So the US content beta is 1.2. International content beta is 1.4. And finally I modeled an additional $3 billion debt insurance. So all of these inputs that I just talked about I would feed directly into the Python calculations that I would put in collab. Now moving on to represent where I will show you guys my code. Um I coded this analysis in Python to ensure transparent repeatable calculations. So um first what we did was we broke this up into sections. Our first section is input as inputs and assumptions. So this stores Netflix financials, market data, tax rate and PRWACC benchmarks. Second we have our helper functions. So I created small functions. So the process is a little more simpler. So we have uh the cap capm cost of equity after tax cost of debt compute wacc and hamada unlevered beta and hamada reveler beta um as is written right over here. The third thing that we have is the base cost computation. So this model computes the cost of equity via CAPM which gives us around um 11.65% we'll see in the output below. Um our after cost of debt is around uh 4.58% our unlevered beta is 1.237. So yeah and then moving on to our fourth section which is the current WACC. So we would be using market value weights equity around 200 billion. Our debt is 13 billion. So our current WACC would be around 11.22%. And then um our fifth one is WACC with 3 billion extra debt. Um basically new debt is 16 billion our WACC will then be 11.1313%. And then we have um project specific WACCC's our US content is 10.7% and international content is 11.74%. Um, and then we're moving on to the peer comparison where we're looking at Disney and Amazon. And then we have our uh sensitivity analysis, our sensitivity to leverage um main execution. And then moving on to our um output. As I said the numbers before our sorry our cost of equity 11.65 after tax 4.58 unlevered 1.237 so Netflix current WACCC is 11.22 22 um additional after the 3 billion additional debt there really was no change so it's 11.13 um US content beta is 10.7% international is 11.74 all that and so forth now um moving down this is a sensitivity to leverage model um so using Hamad's model I made um I simulated WACC at debt to ratios from zero grow to 60%. Uh so this basically helped produce a vis visualization showing that uh WACC declines as the Netflix adds more moderate leverage due to the tax shield. Um yeah so basically in implement here's what the code basically tells us our code and our output. So Netflix current WACC is 1.22%. So this is fairly high relative to what Disney has which is 8.2%, Amazon's 9.5 and the industry range which is which is around 8 to 10%. Right? So basically a higher WACC indicates it's a higher perceived equality equity risk business model concentration risk and more volatility in subscriber and content performance. um WACC after the $3 billion additional debt um was 11.13%. So this slight reduction um reflects how the tax shield benefits from the interest deductibility. The low relative cost of debt compared to equity, our stable tripleB plus credit rating assumptions and this basically tells us that Netflix can safely add modest leverage. Next, our project specific WACCC, our US content WACCC is 10.7%. So the lower the beta, the lower the risk we have. Basically, our international content WACCC is 11.74%. Since we have a higher beta for this, it means there's a political regulatory currency and a new market risk. So this means that Netflix should apply different hurdle rates depending on the project geography that we have. Uh next we have a pure comparison. So Netflix WACCC being higher than both Disney and Amazon basically signals that there's a higher equity beta, more reliance on equity funding, uh lack of diversified business units, greater exposure to subscriber churn and content performance. Um and then lastly what we have is leverage sensitivity. So the WACC sens sensitivity chart sorry reveals that the increasing debt ratio. So from 0% to 60% are WACC lowers from 11.3 to 10.49 almost. So this happens because debt is usually cheaper than equity after tax. But however real world limits do exist. So at a high leverage distress risk would increase beta and borrowing cost. But this model focuses on the textbook benefit side. We have next to validate um so to validate the model the CAPM produces a realistic 11 to 12% equity cost given a beta of 1.3 in a volatile content industry. This is expected to be seen. Um our after tax cost of debt matches the tripleB borrowing levels. So a 5.8% 8% pre-tax to a 4.58 after tax aligns with our market yields. Okay. Um, next we have the WACC aligning with the industry positioning. So, Netflix should have a higher WACC than Disney because Disney has a diversified revenue. Netflix is a pure play subscription. Um, a higher beta raises our equity cost. And then, um, lastly, sensitivity behavior is intuitive. uh WACC decreases moderately as leverage rises which is consistent with standard corporate finance theory. So uh overall the calculations pass both our theoretical and our practical validation tests. Lastly for Evolve now based on all of these results one Netflix should increase their debt moderately uh the WACC falls slightly with additional leverage uh given stable cash flows and high market capitalization. Netflix can support more debt actually. Two they should use um more project specific hurdle rates. Um international content should have a higher required return than domestic content. Three, care, we should carefully evaluate the high beta investments. Projects with global expansion risk need a higher profitability than u prior profitability threshold. Sorry. Um four, monitor the credit rating risk. So beyond a certain point, additional leverage could raise borrowing costs and beta which would increase the WACC instead of decreasing it. Lastly, um, five, our strategic conclusion is Netflix's optimal capital structure likely involves a slightly higher debt ratio than it currently uses. So, especially when financing large content investments, but still preserving flexibility and credit stability. So um overall this analysis demonstrates how WACC sits at the intersection of risk, capital structure and strategic decision-making. Using the driver framework um allowed me to structure the problem, build a transparent financial model, validate it against the market logic, and draw strategic recommendations for Netflix's future financial decisions. Thank you.",
  "video_url": "https://youtu.be/_fTBqtu8GPw"
}