{
  "student_name": "Demi Freeman",
  "org_defined_id": "035770733",
  "username": "freem174",
  "email": "",
  "transcript": "Hello, my name is Demi Freeman and today I will be analyzing Netflix weighted average cost of capital or WACCC to evaluate whether a hypothetical 5 billion content investment would create long-term value for investors. WACC represents the minimum return that Netflix needs in order to satisfy both debit and equity investors making it a hurdle rate for major investment decisions. Before starting, I organize all the financial information provided. Netflix has a market capitalization of $200 billion, market value of debt of 13 billion, a corporate tax rate of 21%. An equity beta of 1.3 and a bond yield of 5.8%. The risk-free rate in the market is currently 4.5%. And the market risk premium is 5.5%. Netflix is also considering issuing an additional $3 billion in debt. So, I will compare their current WACC to their new WACC after this financing change. But the key questions that are guiding my analysis are is what is the current WACC? What would be the impact of $3 billion in new debt? Um, should Netflix use different discount rates for the US versus international content investments? And how does Netflix capital structure compare to Disney and Amazon? And what is the optimal capital structure strategy for Netflix? So before I start stating any calculations or using Python, I laid out the formulas. So, as you can see here, these are all of the formulas that I have used. And for project specific discount rates, I plan to adjust beta. A US content project, we use a beta of 1.2 because it is less risky. An international content project will use a beta of 1.5 due to higher uncertainty, currency risk, and cultural factors. This setup helped me get my logic organized and ready for implementation. Now that my approach is clear, I moved into implementation using Google Collab. Enter my financial assumptions into Python and built calculations for cost of equity, cost of debt, capital structure, weights in WACC. And then I will show you my collab real quick. But as you can see here, um, I ran that. And then we go down here and we get our outcome here at the bottom, which I'm going to go ahead and talk more about right now. So after running the code, my results showed um cost of equity at 11.65%. After tax, cost of debt 4.58%, current WACC 10.9%, WACC after debt at 10.8%, 8% US product WACC 10.4 and international product WACC at 11.8%. These results make financial sense since debt is tax deductible. Adding moderate debt slightly lowers the WACC. Also, international content projects are riskier, so they should be evaluated using a higher discount rate. The next step is validate. At this stage, I reviewed my notes to make sure nothing was off, my formulas ran correctly, and my Python code executed without any errors and the numbers logically aligned with the financial theory. Importantly, I confirmed that I used market values, not book values, which is required in WACC analysis. The relationship also made sense. Higher level higher leverage lower WACC a bit due to the tax shield benefit. Next up is Evolve. And this is where we think more strategically. Netflix currently uses very little debt, only about 6% of its capital structure. Meanwhile, Disney uses about 30% debt and has a WACC of 8.2, which is significantly lower. This tells us that Netflix may be too conservative with its financial strategy. My analysis shows that Netflix could take on more debt around 20 to 30% while still maintaining financial flexibility. This could reduce the WACCC further and improve investor returns through tax shield and effect. Reflect. So my key learnings reflecting on this project, I've learned that the WACC isn't just a calculation. It's a strategic tool that connects connects risk, investor expectations, capital structure decisions, and long-term corporate strategy. By using the driver framework, I was able to clearly explain my thought process, work with AI as a co-pilot, validate my results, and make logical recommendations. Overall Netflix current WACCC is 10.9% and after adding 3 billion of debt it drops slightly to 10.8%. US content projects should use a discount rate of 10.4% while international content should use 11.8% due to higher risk. Netflix would benefit from moderately increasing its use of debt similar to Disney as it long as it balances financial risk with flexibility. Thank you.",
  "video_url": "https://youtu.be/bzDdEbakpOo"
}