{
  "student_name": "Aren Dominic Damayo",
  "org_defined_id": "037061012",
  "username": "adamayo",
  "email": "",
  "transcript": "Hello, my name is Aaron Domcile and this is my session 10 assignment submission for professor Zang's class management intro to uh financial management. And today we are presented with this issue where we are basically trying to figure out nope we're basically trying to figure out whether or not it is worthwhile for Starbucks to go ahead with this proposed flagship roster based on this information presented in front of us. And we use the driver framework in order to solve this issue today. So then um in order to define the objective I just find it simply as determine if the Starbucks proposed flagship roaster is worth it or not. Pretty simple. Um and then that moves us on to discover stage. So this is just the general known information, right? Things like the whack, the corporate rate, how much it took investment and then some discovered information that I uh went ahead and researched about. I already knew about working capital. So that that being the equation, but I verified that and also how it would affect cash flows. Basically in year zero we take it away because uh that those current assets get tied up and then uh when they're recovered in year 10 we basically get that capital back. So um we add them in back in year zero and then we take it away in year 10 or sorry we take it away in year zero and we add it back in year 10. I also looked at the difference between simple and discounted payback period and it's pretty simple. I already knew what payback period was due to my background in accounting which is basically uh how long it takes in order to make the initial investment back. Um and simple uh doesn't take into account time value money whilst discounted does. Uh so discounted you discount those cash flows and typically will be longer than simple payback period because as we know a dollar tomorrow is not as worth as much as a dollar today. Um and lastly I also found that terminal value should be included at the end assuming that we manage to sell it exactly for what it depreciated for and there wouldn't be any tax effects if we are selling it exactly for what it depreciated for because the book value would be equal to the sale value. So that moves us on to represent and so I made this uh simple timeline here and you can go ahead and read it. It's basically most of the information here um went into and that's what got fed to the AI and then also this list of things I wanted it to do in order right I wanted to reference the cash flows then discount them using the whack as the discount rate calculate the NPV of that and then also give us a summary then calculate the irr discounted payback period the simple payback period as well as the profitability index and compare IR and then compare the IR to whack because that's where we're going to see that's the main metric we're going to use to figure out whether or not it's worthwhile uh and then also to recal calculate them based on these three scenarios here. Perfect. Oopsies. Sorry. And so now we can move on to the AI. So after feeding it a prompt, we were provided with this. So I can go ahead and run us through the code a little bit here. So uh here install some missing libraries. Uh and then here it just sets up um the general uh how do I say the general um uh what you call this information that we had already provided. So you can see the tax rate there is 25%. Uh the COGS percent is 40% because it's going to be 40% of whatever the revenue is. And so these are just things it's going to reference throughout. Um you can see here the marketing cost in year 1 is going to be uh.3 cuz that's 0.3 million. Uh but then ongoing it's only 0.1 million because after year 1 it reduced 0.1. So it looks like all of this is calculated correctly. Um and here it's calculating the depreciation assuming the salvage value of 3 million. That takes those 10 years divides it by 10. So it should come out to about 900,000. And then calculation logic. So here the calculation logic isn't as very clear and that's because what it's doing is um with these appends it's kind of referencing that um information we provided before. Uh but it is able to calculate these things here. So it's you know it's putting in the cogs it's foring for the years and then also finding the specific things. So you and you can see some of the equations here right the cogs it's taking whatever the revenue of the year is and times it by the cogs percent. Um but then here it is um you know it is uh putting in basically whatever it should be for that year. So if it's year zero then it's going to put in whatever the marketing cog percent etc should be and then if it's year whatever else then it does something else. Um if year is equal to one right we find the marketing append of specifically year one but if it's not then we put in whatever the market cost is and then it's basically going to sum all of that in order to figure out the cash flows for that year. Uh here it's just building a data frame as well now. So then we're able to look at that later. Um, so that's going to be our our big sheet that we're going to reference. Um, and then finally displays the results as well as all the metrics of like the NPV, the IRRa, and the uh profitability index. And you can see some of those equations here, right? Calculating the IRRa um, and also the profitability index by taking whatever the net present value is, adding the initial investment working capital, and then dividing it by the initial investment and the working capital in order to figure out the profitability index or generally how profitable it is. um and such. And here you can see that it's discounting as well. Uh this is where it's calculating a lot of the cash flows for the year and also the EBITS. Um right and then finally a sensitivity analysis where it is basically putting in the scenarios that we talked about it for right uh revenue is decreased by 20% whack up 2% whack lower by 2% um and then making those changes as necessary and then giving us um what the new IRS uh the NPVS etc would be based on that assumption and then finally that comes us out with our outputs and so we can go ahead and do some validating here right for the code that we I'm going to go ahead and pull up Excel here. So, let's do some calculating. Um, based on what we're looking at right now, it looks good, right? The revenues are inputed. Um, which is good. Um, right? 8 million first year. Uh, from 2 to 5, it's 11. And then 6 to 10, that's 9 million. That's good. Um, we can also do some general checking, right? So, does it make sense? Right? Um, I was looking at a validate, right? Does it make sense? Let's take a look. Um, -12.5 the first year. That makes sense. And the cash flow should be exactly the same because no time has passed. However, the cash flows should become lower than whatever the free cash flow that year should be because we're discounting it after we discount it down to find the present value. And if we look here, uh all of these the free cash flow is the same because there's no effective difference between years 6 to9. And so we can see that the present value of cash flow goes lower and lower and lower. And that makes sense too because we know that as it goes more in time, it's going to be discounted each year and it's going to become less and less in value um in today's money. So that does make sense as well. And we can go ahead and check some of these calculations as well and how it's doing some of these things. So uh we have EBIT. Uh let's go ahead and look at the uh EBIT for year 2. So we know it starts with $1 million, right? But uh we also have to take away 40% of that cuz that's going to be going to COGS. And then we have to take away I'm just going to pull this up so I can calculate it myself. Um we know that okay yep -2.5 million to labor. Um0.8 to rent and utilities. Um, this is year two, not year one. So, we're going to be taking away 0.1 million. Good. Oh, this one should be negative as well. That's good. All righty. Perfect. Okay. And then we also for so we have to take out depreciation in order to calculate the taxes, right? So, if we take negative whatever depreciation would be would be 900,000. So, we're going to go 0.9, right? Then we can sum this up. So this provides us with our EBIT of 2.3, which makes sense, right? That should match what our code came out with. Perfect. We can calculate the taxes based on that EBIT 0.25. Good. And then if we sum these back, we also have to add back depreciation because remember that's not a cash expense. You're given 12 in. There you go. 2.875. Good. Free cash flow 2.625. Good. And if we add 0.9 back in taxes were correct. EBIT free cash flow. Am I missing something? What am I missing? I'm definitely missing something. It was calculating correctly before. Um, appreciation should get added back in. That's true. Appreciation should get added back in cuz that was never supposed to be taken on in the first place. Oh, wait a minute. So, we shouldn't be summing these. What we should be doing is doing that subtracted by that plus 0.9. There we go. Yeah, my apologies. I was accidentally adding the two together. So, I was wrong there. Um, but yep, you can see the free cash flow calculates perfectly. So, that's good. So, it looks like it's calculating that correctly and then it finds the present value of those cash flows. Discounted that all together in order to find NPV. We can quickly check um if it's discounted correctly too, right? So, this is year two. So if we take net cash flow divide it by uh our whack which was 1.085 and put it to power two we should get yep that rounds to 2.23. So I apologize about that mistake I was doing. So uh a I was able to code it correctly but I was not at first because I was accidentally not subtracting the taxes from it. But now that we've subtracted taxes from it and added back depreciation free cash flow is exactly how it should be. Um there's that tax field effect happening as well because we took away that depreciation which ma naturally made the taxes lower. Um and then as a result we got already that um that lower tax value. So we don't actually have to include it because it's it's already represented. Um but yeah it looks like the calculations are all correct here. Um and now we can go ahead and take a look at the data that's provided in front of us. So if we look at go ahead and look at what's provided, we can see that the net present value is positive 2.53 million. So what does that mean? That means generally over the course of the lifetime of the entire project, we actually expected to indeed make money and we expect it to make around $2.53 million or at least it would be worth $2.53 million in today's money. And generally because it's positive, that means it is a good investment. Moreover, uh this coincides with our IRRa, right? Our IRRa is 12.5%. uh since it's greater than the whack as we can see here that's a good thing because that means the rate of return necessary in order to make um the MPV equal to zero or the discount equal to zero need to be 12.5%. But because the whack is lower than the um IRRa in this case that means it is a um potentially um that mean it is a potentially more beneficial uh investment. Lastly, if we look at simple payback and discounted payback, we have 5.51 years. Oopsies. 5.51 years versus 8.73 years. Now, that makes sense that it would take longer in order to uh make back our money. Um, it's a good thing that it's within our year range. Uh, if it wasn't within uh 10 years, then that means we wouldn't be able to make our money back in time. Uh, but even with discounting, which is that discounted payback, uh, we still are able to make it roughly uh make it back roughly around here. And then years nine and 10 are purely going to be us making money even after discounting our cash flows which is good. And then lastly um so that we validated now and the last part about validation that we always should do is the sensitivity analysis. So we can take a look and we did do the sensitivity analysis here with three of them. How does that affect our scenarios? So uh the biggest change that we can see here is if we reduce revenue by 20%. Well uh a lot big changes happen. IRRa decreases to 3.02% 2% uh 0.74 in our profitability index and our net present value becomes negative 3.245 million. So all of a sudden this uh this good investment suddenly becomes really really bad. Um and that kind of shows that our model is really susceptible to changes in revenue. Um and kind of shows that our model might not be the most robust um based on the current calculations. And so that revenue and u that revenue is a really key part because as you can see I kind of talked about in the vault stage um all calc all calculations are assuming consistent revenue and such but what about variability right it revenue might not be consistent or we might overshoot or potentially even undersshoot what the revenue might be and so if we do undershoot by let's say overshoot by 20% uh we're really going to be hurting from it and the um project can really become uh a bad investment if that were to be the case and end if our assumptions and analysis were to be wrong. Uh lastly, if we look at whack here, we can see that the net present value still stays uh above whether or not we add percent or decrease the whack. And that makes sense, right? If we are increasing the whack, that means we are discounting it by more. So it makes sense that the present value would decrease and vice versa for if we were to decrease the whack. uh the IRRa should be exactly the same because whack doesn't actually have any calculations in Irra since that's uh since irr is calculating what the discount rate should be in order to make net present value equal to zero and so it makes sense as well that these would still be worthwhile investments because our whack right now is 8.5% and even if we were to add 2% to whack it's still under that IR so that means it should still be good and profitable and um likewise for if we were to decrease the whack because as we know lower whack better than higher whack especially when comparing comparing to internal rate of return. And then we see the profitability index, right? Higher whack, lower whack. Higher whack means lower profitability index. Lower whack means a higher profitability index. That makes sense because the investment should become more profitable as um the whack lowers and vice versa if the whack would be higher. Likewise, as the revenue decreases, the profitability of the entire project becomes lower. and that's why it's also less than one because it's not really making us any money. Um, so that's all the results that we got. Um, that kind of moves us on to evolve. So I already talked about how the calculations assume consistent revenue which could be a problem. And so adding that variability in the future might be really important. Also external benefits aren't really included here, right? Having a flagship grocery roy might come with publicity advertising which might increase the revenue of a company as a whole and that really isn't represented here nor is that really quantified in any way. Um, and also likewise, this the current code doesn't really show the altered cash flows based on the changes. Um, it does seem like it's calculating correctly, but it would be nice if we got another summary as well based on these new cash flows or based on these scenarios, but it still gave us what we need in the end. So, uh, finally on to reflect, right? We ultimately managed to come to a conclusion that it is indeed worthwhile to for Starbucks to invest into this proposed five grocery. Um, and that's predominantly because the IRRa, the internal rate of return is higher than the whack, which means that it is a good investment opportunity, right? Because it's going there's a good chance that it's going to make back the money that it um took to invest into it. Um, and the whack being that hurdle rate or kind of that rate we need to beat and the internal rate of revenue being higher than that meaning that we did beat that whack and that is a good thing. And likewise since the net present value is positive at least in the base case and even if the whack were to change um then that means that is a good thing uh because that means we are going to be able to actually make money back on the scenario. Moreover, the payback period is lower than whatever period that we have presented here which is 10 years and since the payback periods are lower that also means we we're able to make back that money. So this is all ways to say that effectively the entire scenario should be profitable which can also be seen in the profitability index being higher than one. the um going into this investment should be profitable and does have a high enough rate of return um where it will beat out um the required amount that we need. That being said though uh as we did the process right we did come into some hurdles with the AI also got reminded of taxes to calculate the taxes which I kind of forgot to include in the initial timeline which was important and good at least uh I thought about the tax shield but I didn't think about actually taking away the taxes from the EBIT so that was good but there was also some hiccups right uh the AI had trouble reading this a few times so it took a few runs in order for it to read it correctly and some corrections but we ultimately got there um and lastly the sensitivity the sensitivity analysis really showed how susceptible our model currently is to changes in things like revenue. And so those are huge things to consider in the future because if our revenue uh projections are wrong, then that will completely change the trajectory of the project uh and decide whether or not it is profitable or not for us and worthwhile. Um but yeah, that um concludes my assessment. Thank you.",
  "video_url": "https://youtu.be/mGtaw2BBApw"
}