{
  "student_name": "Damian Lopez",
  "org_defined_id": "035724848",
  "username": "lopez613",
  "email": "",
  "transcript": "Hi, I'm Damian Lopez, and this is my session 10 assignment. The assignment overview is to evaluate Starbucks' proposed flagship roastery that requires a $12 million upfront outlay and is expected to operate for 10 years. We are to use the firm's 8. 5% weighted average cost of capital as the hurdle rate to determine whether the project creates value and to recommend and accept or reject decisions supported by driver documentation. Here we have some project parameters such as the $12 million initial investment, which is to depreciate a straight line over 10 years The working capital, which is $500,000, deployed at launch and recovered in year 10. The revenues, $8 million in year one, $11 million in years two to five, and $9 million in years six to 10. The operating cost, the cost of goods sold, 40% of revenue. Labor, $2. 5 million. Rent and utilities, $0. 8 million. E-marketing, $0. 3 million in year one, then $0. 1 million thereafter. Taxes, 25% corporate tax rate. Terminal value, $3 million at end of year 10. Hmm, the financial analysis requirements. We are to build a year zero to 10 incremental cash flow schedule that includes revenue, operating cost, depreciation, tax fields, taxes, working capital changes, and terminal value. Calculate the net present value and terminal rate of return, discounted payback period, simple payback period, and profitability index using Starbucks' weighted average cost of capital. Run sensitivity analysis for revenue reduced by 20% and weighted average cost of capital, give or take 2%, and summarize the impact on the net present value and the internal rate of return. Four, we are to provide a recommendation that outweighs financial results, strategic fear, brand implications, and key project risks. Hmm. Okay. So starting with define. So we are going to evaluate whether Starbucks should invest the $12 million up front to build a flagship grocery that will operate for 10 years. Starbucks corporate. Starbucks corporate weighted average cost of capital is our, of 8. 5% is our hurdle rate. This project is going to be judged financially on whether the net present value is positive at this weighted average cost of capital, whether the internal rate of return exceeds the 8. 5%, and whether the payback profile and profitability index look reasonable. Strategically, we care about the, the grocery strengthening Starbucks brand as a premium experiential destination and whether the risk is acceptable given that this is a flagship concept. Onto the discovery stage, organize the problem data and assumptions. Hmm. And the code. The national investment is $12 million in the building, equipment, and training. This amount is depreciated straight-line over 10 years, so depreciation is about $1. 2 million per year. The project also requires $500,000 of working capital at launch, which is fully recovered at the year 10. Revenues are projected at $8 million in year one, $ 11 million years two through five, and then $9 million in years six to ten. The operating cost includes the cost of goods sold, equal to 40% of revenue. The labor is 2. 5 million per year, rent, and utilities of 800,000 per year, then the marketing of 300,000 in year one and 100,000 in later years. Starbucks pays a 25% corporate tax rate. Finally, there is a terminal value of $3,000,000 at the end of year 10, and then I'll treat that $3,000,000 as an after-tax terminal cash flow. Next stage R, which is represent. I'll show how the model is going to work before writing the code. From each year from 0 to 10, I'll calculate the revenue, cost of goods sold, other operating expenses, depreciation, earnings before interest and tax, taxes, now operating profit after tax, and then free cash flow. In year 0, the free cash flow is just a negative $12,000,000 Kipex, plus the negative $500,000 of working capital for a total initial outflow of $12,500,000. In years 1 through 9, free cash flow equals the net operating profit after taxes plus the depreciation, with no working capital changes and no terminal value. In year 10, the free cash flow equals the net operating profit after taxes plus the depreciation plus the $3,000,000 terminal value plus the $500,000 working capital recovery. Once I have this cash flow stream, I'll discount it at 8. 5% to compute the net present value, solve the internal rate of return, and compute the symbol and discounted payback and then the profitability index. I'll also build a parameterized function so I can easily change revenue assumptions and discount rate for the sensitivity analysis. Onto the next stage in the driver framework, which is I implement. Here I have my code. Top of the script, I have imported Numpy, Pandas, and Matplotlib. Then I set up the key parameters. I have the initial investment of $12,000,000, the $500,000 working capital requirement, the 10-year project life, the 25% tax rate, the 8. 5% weighted average cost of capital and the $3,000,000 terminal value. I define the revenue schedule for each year, the cost structure, and compute the straight-line depreciation of $1,200,000 per year. Next, I define this function called the build cash flows. It loops from year 0 to year 10. It calculates expenses, depreciation, earnings before interest and tax, taxes, net operating profit after taxes, working capital changes, the terminal value in year 10, and then cash flow, net present value, internal rate of return. Here it is. Where do we have this? Mm-hmm. Next, I compute the core metrics. The core metrics such as the net present value, internal rate of return, the simple payback, the discounted payback, and the profit profitability index at the Starbucks way to average cost of capital of 8. 5 percent. The model produces a net present value of roughly 3. 0 million dollars. The internal rate of return is roughly is about 13. 3 percent, which is comfortably above the 8. 5 percent hurdle rate. The simple payback period is about 5. 3 years, and the discounted payback period is about 8. 2 years. The profit profitability index is around 1. 24, which indicates that the present value of future cash flows is about 24% higher than the initial outlay. To validate the model, I started by checking the pattern of the free cash flows. This bar chart, which is free cash flows versus the discount rate, shows the initial outflow in year zero, followed by positive free cash flows each year and a larger spike in year 10 when the terminal value and the working capital recovery come in. The pattern is consistent with the project description, and it reflects the expected ramp-up and steady-state operations of a flagship grocery. Next, we have a net present value, or versus a discount rate applied to the net present value as a function of the discount rate, which the curve crosses the horizontal axis at about 13. 3%, which matches the internal rate of return at 8. 5%, which is Starbucks' weighted average capital. The net present value is clearly positive, around 3. 3 million. This gives me confidence that the discounting logic is working correctly. Next, we have a sensitivity, and on to the next stage in the driver framework, which is Evolve. In this stage, I did some sensitivity testing, which first I reduced all revenues by 20%. Um, and then the model rebuilds the cash flows and recomputes all metrics. The net present value drops about three point negative 3. 2 million dollars. The internal rate of return falls to roughly 3. 2 percent, which is well below the hurdle rate. The simple payback stretches to almost nine and a half years, and the discounted payback period is never fully recovered in present value terms. The internal or profitability index falls below one, which means that the project destroys value in this scenario. Here, next, I vary the discount rate plus or minus two percentage points. At a weighted average cost of 6. 5 percent, the net present value rises to about 4. 6 million dollars. At the base case of 8. 5 percent, the net present value is 3. 0 million. At a weighted average cost of 10. 5 percent, the net present value is roughly 1. 6 million dollars. Um, as you can see, the internal rate of return, uh, remains at about 13. 20. 13 remains at 13. 25 percent because it's independent of the discount rate. This shows that the project is robust to reasonable changes in Starbucks' cost of capital, but it is more sensitive to revenue performance. On to the next stage in the driver framework, which is reflect. Finally, in reflection, I combine the quantitative and qualitative insights into a recommendation. In the base case, the flagship roastery generates a positive net present value of about 3 million dollars and an internal rate of return of roughly 3 13. 3 percent, which is comfortably above the Starbucks 8. 5 percent weighted average cost of capital. The profit profitability index is above one, and the payback profile looks acceptable for a long-lived brand asset. However, the sensitivity analysis highlights a key risk: a 20 percent revenue shortfall flips the net present value to negative 3. 2 million dollars, and it makes the project value destroying. This means the project's success hinges critically on achieving the projected visitor traffic and average spending levels. Strategically, through a flagship roastery, it has benefits that extend beyond the four walls of this single location. It serves as a global brand beacon. It deepens Starbucks' experiential positioning and may also create halo effects on other channels that are not fully captured in these cash flows. Bringing this together, my recommendation is to accept the project with guardrails. Starbucks should move forward with the flagship roastery but pair the investment with rigorous demand validation, disciplined cost control, and clear tracking of brand and halo metrics to ensure the project delivers both financial and strategic value. This concludes my driver-based evaluation of Starbucks' proposed flagship roastery. And the model, thank you",
  "video_url": "https://youtu.be/FVIIeASyZoo"
}