{
  "student_name": "Cruz Tirado Rojas",
  "org_defined_id": "037412563",
  "username": "ctirador",
  "email": "",
  "transcript": "For this session assignment, we are to evaluate Starbucks' proposed flagship roastery. This project requires a $12 million upfront outlay and is expected to operate for 10 years. We will use the firm's 8.5% WACC as the hurdle rate to determine whether the project creates value. We will also recommend an accept or reject decision, supported by DRIVER documentation. Our objective is to determine whether the Starbucks project should be accepted or rejected based on the WACC of 8.5%. To determine this, we should find the NPV at 8.5%. We should also find the project's internal rate of return. We also want to find how sensitive the project is. We will test this by reducing revenue by 20% and adding 2% to the WACC. Here is the information we are given: The initial investment is $12 million for building, equipment, and training, depreciated straight-line over 10 years. The working capital is $500,000 deployed at launch and recovered in Year 10. Revenue is $8 million in Year 1, $11 million in Years 2-5, and $9 million in Years 6-10. Operating costs are as follows: Cost of Goods Sold is 40% of revenue. Labor is $2.5 million. Rent and utilities are $0.8 million. Marketing is $0.3 million in Year 1 and then $0.1 million thereafter. Taxes are at a 25% corporate rate. The terminal value is $3 million at the end of Year 10. Something to note is that the depreciation is $1.2 million per year. This is because it depreciates in a straight line with an initial investment of $12 million. I made a simple cash flow timeline. For Year 0, we invested $12 million. Then the working capital is $500,000. That gives us a net incremental cash flow of negative $12.5 million. For Year 1, we have $8 million in revenue. We have negative $3.2 million in Cost of Goods Sold. Negative $2.5 million in labor. Negative $0.8 million in rent and utility. And negative $0.3 million in marketing. So before tax, we are up $1.2 million. In order to find the taxable income, we subtract the depreciation of $1.2 million. This gives us a taxable income of zero. So, we are not paying tax in the first year due to the tax shield of the depreciation. This results in a net incremental cash flow of $1.2 million. From Years 2 to 5, the revenue is $11 million. The Cost of Goods Sold is $4.4 million. Labor and rent are the same as the first year. However, marketing changes from $0.3 million to $0.1 million. So before tax, we have $3.2 million. To find the taxable income, we subtract the depreciation of $1.2 million from the before-tax amount. This gives us a taxable income of $2 million. We multiply this by the tax percentage of 25%, which gives us $0.5 million. We do the before-tax amount minus the tax of $0.5 million. This gives us an operating cash flow of $2.7 million. From Years 6 to 9, we have revenue of $9 million. Cost of Goods Sold is $3.6 million. The labor, rent, utility, and marketing are the same as from Years 2 to 5. So before tax, we have $2 million. Again, we subtract the depreciation from the $2 million. We have a taxable income of $0.8 million. The tax at 25% is $0.2 million. Subtracting that from the before-tax amount gives us an operating cash flow of $1.8 million. For Year 10, we have the same cash flows up to the operating cash flow. However, afterwards, the working capital we invested comes back to us. This is $500,000 recovered in Year 10. The terminal value is $3 million. We add those two to the operating cash flow. This gives us a net incremental cash flow of $5.3 million. Next, I asked Gemini to provide me with a code to calculate the metrics. This includes the Net Present Value, Internal Rate of Return, Profitability Index, Simple Payback Period, and Discounted Payback Period. Looking at the code, we have the initial inputs: Initial investment, working capital, WACC, years, tax rate, and terminal value. We also determined revenue and marketing based on the year. In Year 1, revenue is $8 million and marketing is 0.3. From Years 2 to 5, revenue is $11 million and marketing is 0.1. In Years 6 to 10, revenue is $9 million and marketing is 0.1. For the costs, Cost of Goods Sold is revenue times 0.4. Labor is $2.5 million and rent is $0.8 million. To calculate depreciation, we divide the initial investment by 10 years, which gives us 1.2. We then calculate the operating cash flow. Finally, we add the terminal value and working capital recovery in Year 10. The code then calculates the metrics: NPV, IRR, PI, and the payback periods. We are given the following values: The Net Present Value is $3.02 million. This is greater than zero, so we accept the project. The Internal Rate of Return is 13.25%, which makes sense as it is higher than 8.5%. The Profitability Index is 1.24. This means for every $1 we invest, the project generates $1.24 in present value. The simple payback of 5.28 years means the initial cash outlay is recovered after that time. The discounted payback, taking into account the time value of money, is 8.21 years. We also wanted to test the sensitivity of the project. We reduced the revenue by 20% and added 2% to the WACC. The code performs the same calculations with these scenario adjustments. The revenue adjustment is 0.8, and the WACC becomes 10.5%. This scenario gives us a Net Present Value of negative $4.05 million. Therefore, we would not invest if this were to happen. The IRR drops to 3.19%, which is lower than 8.5%. This makes sense since the NPV was negative. To validate, how does this data compare to actual Starbucks locations in the real world? Flagship roasteries in Chicago and Seattle roughly generate $30 million a year. Our data uses $8 to $11 million a year. This makes the decision safer, as we are modeling a worst-case scenario. Even with these conservative numbers, the NPV is positive. We can also look at Starbucks' gross margin of 67% to 68%. We can determine that the Cost of Goods Sold is typically 32% to 33%. Our data sets Cost of Goods Sold at 40%. So our data isn't overly optimistic; it is actually pessimistic. This also makes the decision safer. To evolve, looking at the data, one expense is significantly high: labor. We see Cost of Goods Sold is 40% of revenue. Labor is at $2.5 million, while rent and utilities are only $0.8 million. Labor is over three times the cost of rent and utilities. If we could lower this expense, the NPV would be higher. One way to reduce this is by automating the roasting process. This would lower the cost of labor. To reflect, the project gives us an NPV greater than zero. Therefore, we should accept it. The IRR is higher than the WACC. We get $1.24 in present value for every $1 invested. The sensitivity analysis shows that reducing revenue by 20% and adding 2% to the WACC results in a negative NPV of $4.05 million. However, this isn't too worrying. Based on real-world data, we were quite pessimistic with our inputs. Real-world flagship roasteries generate roughly $30 million a year, while we used $8 to $11 million. This is only a third of what they actually make. Next, I determined the best way to increase NPV was to reduce labor costs. Automating the roasting process is a viable solution. Overall, Starbucks should accept the project. That is all. Thank you.",
  "video_url": "https://youtu.be/VdUZbg6sRxw"
}