{
  "student_name": "Alejandro Jervis",
  "org_defined_id": "036132121",
  "username": "ajervis",
  "email": "",
  "transcript": "Hello Professor, my name is Alejandro Jervis and today I'll presenting my Session 8 Assignment talking about Market Efficiency and Behavioral Finance, and then I'll walk through my Python event study simulation using the DRIVER method — Define, Reason, Inputs, Visualize, Example, and Review. Before I begin, I want to give a quick overview of what I'll be covering today. This session is about how markets react to information — specifically, how they behave around major news like earnings announcements. We'll compare two big ideas: Market Efficiency, which assumes prices instantly reflect all available information, and Behavioral Finance, which shows that human psychology can cause delayed or exaggerated reactions. To bring this to life, I'll show a short Python simulation that visualizes how a fictional stock reacts to an earnings announcement and what that tells us about efficiency The goal of this simulation is to see how quickly prices adjust after an event. I'll do this by running a simple Event Study using the CAPM model to estimate expected returns. Then, I'll compare those expected returns to what actually happens when new information hits like a positive earnings surprise. We'll measure three things: 1. Abnormal Return, which shows how much the price moved beyond normal expectations, 2. Cumulative Abnormal Return, which adds up those effects over time, and 3. The Efficiency Ratio, which tells us how much of the total reaction happened right on Day 0 To stay organized, I'll be explaining everything using the DRIVER method. First, I'll Define the goal of the study. Then, I'll Reason through why we compare expected versus actual returns. Next, I'll show the Inputs — the numbers and parameters used in the code. After that, I'll Visualize the results using a graph and a table. Then I'll go through an Example of how to interpret those results. Finally, I'll Review what this tells us about market efficiency and behavioral patterns. After this intro, I'll move straight into explaining both the theory and the code Let's start with the theory behind it. The Efficient Market Hypothesis, or EMH, says that markets reflect all available information almost instantly. This means that stock prices always represent fair value based on what's known at that moment. In an efficient market, it's impossible to consistently \"beat the market,\" because as soon as new information appears, it's immediately priced in. There are three main forms of efficiency. Weak form means that past prices and trends are already reflected in today's price, so technical analysis can't help you. Semi-strong form means all publicly available information — like earnings announcements or news — is already priced in. Strong form says even insider information is instantly reflected, though in reality, markets rarely reach that level. Now, on the other side, we have Behavioral Finance — which challenges the idea that investors are always rational. Instead, it looks at how psychology and human emotions affect market behavior. People make systematic mistakes — like overconfidence, herd behavior, loss aversion, or anchoring. These biases cause prices to sometimes drift away from their \"rational\" values. A famous example is post-earnings announcement drift — where after good earnings, prices keep rising for a few days instead of jumping all at once. That's a clear sign that investors may under-react to news. Our simulation today captures that same idea. Now I'll move to my Python code. The goal of my project is to simulate how a fictional stock called BrainWave AI reacts to an earnings announcement and measure how efficient that reaction is. Define The purpose of the script is to test how much of the total price reaction happens on the announcement day compared to the days after. We simulate daily returns from Day −5 to Day +5. Then, we calculate three key things: Abnormal Return (AR): the difference between actual and expected return, based on CAPM. Cumulative Abnormal Return (CAR): the sum of abnormal returns over time. Efficiency Ratio: how much of the total reaction happens right away on Day 0. If most of the move happens on Day 0, that shows efficiency. If the stock keeps moving after Day 0, it suggests behavioral under-reaction. Reason The logic behind the setup is simple. We use the CAPM model to estimate what the stock's return should have been, given the market's performance. Then we compare it to the stock's actual return, which includes any surprise effects from the earnings announcement. The difference — the abnormal return — tells us how much the event moved the price beyond normal expectations. If the abnormal returns cluster around the announcement, the market is efficient. If they spread over several days, investors may be reacting slowly. I — Inputs Now let's talk about the parameters used in the simulation. I started by setting a random seed for reproducibility — np.random.seed(1337) — so we get the same results every time we run it. The simulation covers 11 days, from Day −5 to Day +5. The market has a small positive average daily return of 0.06% and a volatility of about 0.9%. Our stock, BrainWave AI, has a beta of 1.1, meaning it moves slightly more than the market. The risk-free rate is 0.015% per day, representing short-term Treasury yields. For the event itself, I simulate a positive earnings surprise of +3.5% on Day 0, and a small drift of +0.8% per day for Days +1, +2, and +3. This drift represents investors slowly adjusting to the news — a realistic behavioral effect known from empirical studies. Finally, I added a small amount of random noise to capture day-to-day company-specific movement that's unrelated to the market. V — Visualize After computing everything, I create a DataFrame with the simulated data and calculate: Expected stock returns using CAPM. Actual returns including the event effects Abnormal returns (AR) = actual minus expected Cumulative Abnormal Returns (CAR) = the running sum of abnormal returns Then, the program prints a clear table and plots the CAR graph. The x-axis shows days relative to the event (−5 to +5), and the y-axis shows cumulative abnormal return in percentage terms. A red dashed line marks Day 0, the announcement day. When the code runs, you see a sharp upward jump in CAR on Day 0 and then a continued upward slope on Days +1 to +3 — exactly what we'd expect if investors are under-reacting. E — Example To interpret the results: Before Day 0, CAR fluctuates around zero, showing no unusual movement. On Day 0, CAR jumps upward by about 3.5%, reflecting the earnings surprise. After Day 0, it continues to rise slightly due to the +0.8% drift, showing post-announcement momentum. The Efficiency Ratio, calculated as (AR on Day 0 / Total CAR), might come out around 70–80%, meaning that roughly 70–80% of the total reaction happened immediately, and the rest took place in the following days. If we set the drift to zero, the CAR line would jump and then flatten — showing a perfectly efficient market. If we make the drift negative after the surprise, CAR would rise and then fall — an example of over-reaction and correction. R — Review So what does this teach us? The event study helps visualize how real markets process information. An efficient market prices news instantly, while behavioral effects cause delayed or exaggerated reactions. In our simulation, BrainWave AI showed both — a strong instant jump followed by gradual adjustment, which mirrors real-world investor behavior. In practical research, event studies like this use actual market data over many events to test how quickly information is incorporated into prices. The code I wrote provides a simplified but powerful way to demonstrate that concept using simulated data. In summary, market efficiency and behavioral finance represent two sides of the same coin. Efficiency assumes rational pricing, while behavioral finance reminds us that humans aren't perfect — we react emotionally, sometimes slowly or excessively. My Python simulation of BrainWave AI's earnings announcement makes this visible: it shows how information, psychology, and timing all combine to shape real-world market behavior. Thank you.",
  "video_url": "https://youtu.be/C3nA6_PF0lU"
}