{
  "student_name": "Colin Crean",
  "org_defined_id": "037433259",
  "username": "creanc",
  "email": "",
  "transcript": "How's it going? My name is Collin Crean and this is my session 8 assignment on market efficiency investigation. So we're doing the case- study for the GameStop squeeze- short squeeze event of 2020 and 2021. So I'll go over to my collab notebook. Here. So yeah, session eight assignment. So for the define and discover section, my primary objective, I want to investigate market efficiency. Using the GME GameStop short squeeze as the case study, I'm going to analyze the price behavior against the efficient market hypothesis while considering. I'm going to test the which forms of the market efficiency, weak, semi-strong, and strong were violated. Analyze the behavioral finance explanations for the anomaly to evaluate whether rational investors could have profited systematically. I'm going to compare the EMH predictions to observe behavior to assess profitability. I'm going to assess and compare behavioral finance explanations to the EMH to discuss implications and observe anomalies. So, my first step, I will use a public financial data source, Yahoo Finance, to pull the GME historical data for August of this 2020. I will look at the low and adjusted close prices. So, when I did this, what I found was that, in the statement, GameStop traded at $5 for $0.04 in August 2020 was incorrect. Looking on Yahoo Finance from August 1st, 2020 to August 31st, 2020, the lowest price point I found came out to August 3rd, 2020 and was $1. The lowest closing price I found came on both August 3rd and August 7th, which were both closing prices at $1. $1.04. The claim that GameStop traded at $0.04 in August 2020 is incorrect. The actual split adjusted at $1 below for the month was approximately $1. Now for my communication approach. Since the professor was incorrect, my plan is to address the issues in my report. Report and video, and I'm going to cite and explain my data source, and I will clearly state the actual data I will be using for my analysis. So for the representation, first I'm going to put the data needed into a list of key events in order. So here's the list of key events. So on August 3rd, 2020, uh, near bankruptcy low of $1, which is my verified low on August 28th, 2020, Ryan. Cohen files a 13 D for an initial roughly 9% stake on December 17th, 2020. Ryan Cohen amends the 13 D increasing it to roughly 12.9% or the 13% stake from our prompt on January 28th, 2021 price surge. There was a price surge to $483 and this was the peak pre-split on January 28th, 2021. Robin hood and other brokers implemented trading restrictions on February 18th, 2021. There was a house financial services committee hearing. Now for my analytical plan, I'm going to test weak form efficiency semi-structured. Strong form efficiency and strong form efficiency. Weak form efficiency is the idea that past price data cannot predict future prices because the current. Asset prices reflect all trading information. The semi-strong form efficiency is the idea that prices adjust instantly and unbiasedly to all public available information. And the strong form efficiency is the idea that all information possible. First, we are going to look at the weak form efficiency by prompting AI to output a python code that gives us some graphs comparing the price to volume, volatility, and autocorrelation for GME. So here's the python code. We'll go up here. So, the first graph and plot that it gave us is the price right here, split adjusted, and we're going to pair this and look at it with the trading volume. So we can see here that right here there was a huge spike and it also correlates with the trading volume. I'm right here, a spike in the trading volume, which represents hurting. Now we'll go down to here. This is the volatility. You can see right here, there's a huge spike in the same section that happened. There's the price spike. And then here's the auto correlation right here. And here's the explanation. That gives us, so for the price and volume plot, the massive volume spike that coincides with the price spike in January, 2021, this video pattern. Is what a hurting looks like. The volatility plot, observe the volatility. It was low in 2020 that explodes to unprecedented levels. Quantifying the risk of the event, and then for the autocorrelation plot, this right here, The horizontal dashed lines are the 99% coverage. Quantifying the risk of the event, and then for the autocorrelation plot, this here, The horizontal right over here. It suggests returns from one day are correlated with the next, violating the weak form EMH. So as you can see from these graphs, the weak form efficiency was clearly higher. And now we are going to take a look at the semi strong form efficiency by prompting AI to output a python code that contains the price of the stock in correlation to the connection with when our key event happened. So here's the code again, and here's what it outputs. So as we can see here, the y I access is the adjusted close price and the x-axis is the date. And we have, right here, this section, where is where the rhinos live. And Cohen put his initial stake in 9%. And then here's when he ups it to 12.9%. Here's the surge price all the way up here. The, uh, RH restrictions and the house hearing right there. So, here's the analysis. So. So, So, for our E.M.H. hypothesis, the price should react instantly to news. For example, on August 8th, 2020, or August 20th- 2020, in December 17th, 2020, jumping to a new rational price and then stabilizing, key point stabilizing. Now, if we look at our observed reality, you look at the Cohen news, August in December 2020, did the price jump and stabilize? No, it slowly drifted up and- exploded. So you can see, just slowly drifted up and then exploded right after the 12.9% stake, all the way to the surge up here. Thank And never stabilized. The price did not reflect the public information about the company's value. It reflected- the public information about other traders' actions, which, again, is an example of hurting. In conclusion, this is a profound violation of the semi- Thank very much. The fact that Melvin Capital taking advantage of all public info and probably the best insider info lost so much, they lost 53% of the- uuuh, they suggest that they didn't have strong form advantage. There was a group of traders that formed on Reddit to create the event, which is a unique case, and my ne- my analysis likely concludes that strong form is not- Yeah. Not relevant. So for my behavioral finance analysis- I'll do this. So for my behavioral finance analysis- Hurting. As we see in some of the graphs, the massive volume spike paired with the Reddit sub-Reddit of Wall Street Bats- Let's go. There was also confirmation bias. We saw how users on the forum were reinforcing each other's diamond hands narrative, which resulted in them holding instead of something. And then there's limits to arbitrage. We look at why the rational investors didn't just short the GME stock at $300. hundred bucks in this is because the short interest was a hundred forty percent, which means there's no shares to borrow, and the risk of short squeeze was too high. The rational option. It was made almost impossible to execute. Now, for a rational investor's in profitability, people who bought at one dollar and sold at four hundred and- eighty-three dollars made a massive payday. But this was not a systematic strategy by any means. Instead, it was a gamble on a low probability event, which upp- with a potential high payoff. This wasn't a rational or calculated investment, but a gamble, which happened to pay off for some people. Not for my implement- implement. We're going to have AI output of Python code with all the information we've talked about thus far, and put it all together for us to analyze. So here's the code- Alright. Right here. And. You get it right here. So here's the data collection. Well, thank you very Thanks so And for GME's data. So it has the dates of January 2nd, 2020, January 3rd, 6th, 7th, and 8th, 20th. It has the closed numbers. You can see right here the high numbers, the low numbers, the open numbers in the volume. And you can see from January 2nd, o all the way to January 8th, there was a huge spike in the volume from 17 million all the way to 22 million. Now, for the data verification, uuuh, verifying GME traded at $0.04 in August 2020 claim. The actual split adjusted low found was $1 on August Amen. Uh, this claim is incorrect and the analysis will proceed with correct verified data. So now for the weekform- UmmH, it generated the plot which we already seen here before, the price plot and the volume plot, which we, uhh, concluded. with It violated the weak form efficiency. Now for plot number, oh yeah, and this is- same thing with the- it also gave the same plots here, the volatility plot, and the auto correlation plot. But. Now for the semi-strong form EMH, uh, generated plot form- plot 4, which we already saw here, too. And we concluded- uhh, violated semi-strong form efficiency. And then for the analysis here for strong form efficiency, uhh. Uh, strong form E.M.H. states that all info public and private is in the price, and the evidence, the failure of smart money, Melvin Capital. capital. suggest that they had no profitable strong form advantage. The evidence, the alpha, the 140% short interest was public data and the coordinate. Umm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm , ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, e hm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, ehm, e right? And right here is the squeeze period. And this dotted line down here is zero which means no more turns. So we can see at the start it's relatively flat. And then as we get into October 2020 and then January 2021, it starts a solid gift up. And then January 2021 it's- but makes right here during the squeeze period. So as we can see here, as we can see here, the line is relatively flat at the start and near zero. as you can zero, and then shoots up in January 2021 and goes almost vertical. This shows how the returns become completely abnormal compared to its historical, rational relationship. of the market. This resulted in completely abnormal returns and is a complete violation of the semi-strong EMH. And then, for the reflector. In summary, the 4 cent claim was incorrect and I found a lot of $1. We found that GME likely violated the weak form EMH in completely- violated the semi-strong form EMH. Well, while we also concluded that strong form EMH was likely not violated. For the behavioral ex- Thanks for watching. We concluded that the GME event was caused by hurting limits to arbitrage and confirmation bias. We also concluded that a rational investor cannot have systematically profited from this and instead it was a gamble. I. E. D. Overall, walking through this unique case with the driver framework helped me understand this case and taught me a lot. Completing the DNR stages first, I realized that there was- . . We were able to see the unusual jump that GME stock took from $1 to $400 to $400. 100 and $83 and we were able to conclude that a rational investor would not have been able to predict this systematically. This case, this case study. I'll see you in the provided me with a lot of valuable information about a unique situation in the stock market and the unusual things that caused that, that caused that to happen. So, thank you for listening and this is my session aid assignment. it.",
  "video_url": "https://youtu.be/LrfB659IUO8"
}