{
  "student_name": "Anamika Mitra",
  "org_defined_id": "037556874",
  "username": "mitra69",
  "email": "",
  "transcript": "So for this session 10 assignment, Starbucks is considering a capital uh intensive flagship grocery. Um this is not going to be like a standard store. Um it's a brand building asset requiring significant upfront cash and a high fixed operating cost. So essentially the the objective of this assignment would be to determine if the project creates shareholder value using the net present value rule um with a walk of 8.5% um for Starbucks and the decision rule would be that if NPV is going to be greater than zero we would accept the sort of investment and reject it if it's less than zero. Some of the inputs and information that we've been given um within the scenario is that the investment is about $2.5 million total, which is inclusive of $12 million in capex and about.5 million or $500,000 in working capital. Um in terms of the revenue, it's volatile as it starts at 8 million. As it's ramping up, it peaks at 11 million and then stabilizes at about uh 9 million. In terms of a terminal value, there's a significant recovery in year 10 with a $3 million salvage and a point again recovering the $.5 million in working capital. And it's also given to us that we have a 25% tax rate, corporate tax rate. Um in terms of the represent stage I have uh structured my approach to this particular uh project into three distinct phases looking at investment operations and exit. So in terms of year zero which is our investment phase. We have a um in we have immediate outflows in terms of not just the 12 million capex uh from building and equipment but it's also inclusive of $500,000 which is injected into working capital which which represents cash that's being tied up in inventory and registers that we can't um use elsewhere at the moment. So essentially the total year zero net cash flow is a negative $12.5 million. In terms of operations in years 1 through9 um I needed to convert the accounting profit into a cash flow. So I mapped out the incremental operating cash flow using the formula given within the session of revenue minus cost uh bracketed multiplied by 1 minus the tax rate plus your depreciation. Um, a key part of this representation is uh the depreciation tax shield. Since $1.2 million um annual depreciation is a non-cash expense, I added it back after calculating um uh the taxes because this properly captures the cash benefit of lowering our taxable without actually spending any of the cash. And then in terms of the terminal phase or the exit phase, um I would say year 10 is particularly unique in the model because it incl uh because it includes three distinct inflows in terms of the standard operating cash flow from selling the Starbucks coffee, the salvage value of $3 million from selling the assets, and the recovery of the initial working capital um which was insured as I ensured that $500,000 that we injected in year zero is then flowed is flowing back into the firm in year 10 as we liquidate all our inventory. Um, and based on this, I was able to structure my prompt for Gemini to uh generate the Python code. Um, so for uh the implement stage, these are the formulas I'm going to be using. I'm going to focus on net present value formula uh which looks at uh which is this right here. Um and the decision rule's going to be following. If it's greater than zero, we accept the project as it creates shareholder value. If it's less than zero, we reject the project as it destroys shareholder value. And if it's equal to zero, um we're indifferent in the uh in terms of our decision regarding the project because it's it earns exactly the cost of capital. And um the operating cash flow uh calculation I've used it within my representation but essentially it's just revenue minus cost minus your depreciation multiplied by 1 minus the tax rate plus your depreciation or it can also be written as EBIT which is uh earnings before interest and tax um uh multiply by one minus your tax rate plus your depreciation. So in terms of the output that I got from my code. So this is what I got uh as I ran my code bas given the formulas that I used um and what Gemini gave me. So if we look at um the analysis right here in terms of the cash flows um I feel like the launch which is year one is particularly unique because we have a revenue of about $8 million to uh and our total costs are also $8 million which is inclusive of 3.2 million into cost of goods sold 2.5 million in labor.8 8 million in or 800,000 in rent and um.3 million in marketing 1.2 million in depreciation which is uh in total $8 million. So our revenue is equal to our cost meaning that our earnings before interest in tax or EBIT is about is $0 and our tax is also zero in this year. So accounting wise the pro uh the project makes zero profit in year one. However, because $1.2 2 million of those costs was depreciation which is a non-cash expense. The project actually generates $1.2 million in positive cash flow. That's why our net cash flow here is positive immediately as it this highlights the importance of cash flow over any type of accounting profit. Now in the years two through five um our revenue um jumps to about $11 million and stays stable there while fixed costs remain stable and marketing drops to maintenance levels. Our um EDIT drops to $2 million and in terms of taxes we now pay $500,000 in taxes per year and the operation operating cash flow then becomes $2.7 million annually. Essentially, this helps us recover the initial 122.5 million outlay much more rapidly. And then um in year 10 uh this is where the net cash flow um spikes to about 5.3 million creating a tail heavy valuation. roughly 18 to 20% of the P project's total value comes from correctly estimated the estimating the exit which is when we sell the equipment and recover all types of inventory cash. Um yeah this is where our terminal value essentially boosts in terms of the core metrics that we have. The net present value that's been calculated is about just over $3 million. And this is positive. it's greater than zero meaning that it is creating shareholder value. So just based on the net present value you would expect this um project and this investment. Um the internal rate of return is 13.25% which is significantly higher than our 8.5% walk that which also um further lets us uh understand that we should accept the project given that our IRRa is greater than our walk and our payback period is 5.28 to eight years. Um, this kind of just indicates that our liquidity is moderate and the capital is tied up for about half of the decade. In terms of validating my calculations and the robustness of my decision, um, I kind of went through a sensitivity analysis. So in terms of revenue sensitivity um if the revenue uh for example the model is tested with a revenue drop of 20%. If the revenue drops 20% the NPV collapses um to about -2.7 million and our internal rate of return drops to 3.8% well below our 8.5% walk. Um, this tells us that the project has a high operating leverage because fixed costs like labor and rent are high and a small miss in revenue leads to a massive miss in profit. And if the revenue is $6.4 million instead of $8 million in year one, we don't just make less money, we're burning a lot more cash. Um, I also looked at walk sensitivity. So, um, I tested like different in terms of how uh if what happens if the walk fluctuates. So if the walk rises to 10.5%. NPD is still 1.6 million. Essentially this tells us that the project is interest rate robust. So even if the FA even if the Federal Reserve increases um your interest rates or Starbucks credit rating drops the project still remains viable. Um essentially this tells us the validate stage tells us that the financial risk is not interest rates per se but it's purely based on um it's purely operational and based on customer demand in terms of uh I would say I would re recommend approving the flagship um grocery investment. The rationale behind this would be that it creates value. The project uh clears the walk with a 3.2 2 million 3 million little over $3 million buffer. Um and the flagship nature likely creates like a halo effect and brand equity for standard stores which is an unquantifiable um upside that's not uh necessarily included in the NPB model and a profitability index of 1.24x uh indicates an efficient use of capital. Um but because the validate stage did tell us that a 20% drop in revenue drop uh destroys uh the project, we I would recommend evolving the strategy to mitigate the specific risk through an attempt to structure say one of our fixed costs which is rent of $800,000 as a percentage of sales rather than being fixed to lower the break even point. And in terms of the year, I would say allocate additional an additional amount of the budget towards year one marketing to ensure that the 8 million revenue target is hit no matter what as year one is the most vulnerable point because your uh EBIT is zero. In terms of reflecting on the overall process, I would say that the what was the most critical insight for me throughout um this particular session would be that the the distinction between accounting profit through a event and the cash flow or operating cash flow is um really important to consider. In in year one, the project appeared to be breaking even with a Z a bit. But a p a purely accounting based uh manager who would look at that would probably panic because um uh despite having a $0 a bid, the capital budgeting analysis through NPD revealed that a positive cash flow of 1.2 million due to depreciation tax field is present. So it it kind of tells us that um solvent businesses can look unprofitable on paper but an NPV analysis would reveal um the true economic reality that accounting statements often hide. So we kind of have to look at we have to kind of analyze um different projects and investments through different angles to understand whether um it's truly profitable or not which in this case it is. So thank you.",
  "video_url": "https://youtu.be/huWfvFkuKW4"
}