{
  "student_name": "Shane Shuman",
  "org_defined_id": "036088017",
  "username": "sshuman",
  "email": "",
  "transcript": "Hello, I am Shane and today we're going to be going through the session eight part for the assignment of the week. Um so we're going to go through the overview here which is investigating market efficiency with GameStop at the short squeeze 2021 the case study verify the facts um relative to efficient market hypothes predictions and then we're going to go through all these steps how we talked about how it's traded four four cents in 2020 against actual historical data if accurate we're going to compare we have a timeline so go through some of the times we have here we have um August 2020 about GameStop nearing bankruptcy. And then month later, um the Chewy Founder acquires a 13% stake, Wall Street Bets has driven the price to $483, which was pretty insane. I was I remember when this happened. I was a personal person going through this time. Obviously, during COVID, so there wasn't much going on. So uh then congressional hearings and market manipulation and then obviously postevent price uh stabilization. We have all this data that we've acquired here. We have our acquired analysis. We have our driver and then we have some more analysis that we have here. So obviously um for driver I use I use multiple multiple iterations actually took me multiple to get it correct getting all the correct stuff a lot of evolving a lot of figuring it out all the analyzation onto the Python and um answer it. So obviously a lot of print here and more print here. A lot of it a lot of it we'll see as we go through but there's so much analysis that there's a lot to go through. So going through let me just run this again. Going through this is just reaffirming the steps of driver which are really cool. Going through all the ideas and then there's execution here which is all about the data verifications. It's going through all the data they gave us four cents. It's between four Dollar 67. Um, and it's going through all the steps here, which I think is really, really cool. Um, obviously, this is Ryan Cohen's investment, the short interest peak, and then now we're on to um, market efficiency testing right here. So, as you can see, we went through the we form um, trading data reflected in the stock. The GameStop event driven by social media momentum, specifically Reddit, appears to be a case of momentum trading where past price actions led to more buying. Obviously, it seems like I think in this case there's people shorting the stock. Semi- strong form violated the semi- strong form states that all publicly available information is reflected in this price. system was clear clearly violated of course because um the short interest was known to be over 100%. As I brought up earlier it was a lot of shorts they're short like more than they should have which led to the problems that we saw we saw Cohen's active mistake was public knowledge all this information now we have strong form which was also violated um it was by default because of the public information isn't reflected in the If it wasn't honestly I don't want to go through all this because there's so much analization so much words to go through to reflect all the ideas. We'll go through some of the broadstrokes because I mean this was very um analysis heavy so there's a lot of analysis to go through. So back to this obviously we have identification behavioral biases. There's Harding. They're hurting. This was the primary driver. Overconfidence. There's retail traders who um obviously like hedge funds that are very very overconfident in their shorts which again which is what led to I think some of them went bankrupt because there was so much shorting on Gamestock and the price was so high they couldn't afford it which is insane for a hedge fund of all places. I mean those are places don't have a lot of money. prospect theory loss aversion. Hedge funds may have held their losing short position for too long hoping it would come back rather than realizing a massive loss. This is another problem. I mean if you're the hedge funds it's like okay the it's going up past what you want it to be. You would not expect it expect it to peak at what $483 I think is what they said. So fair enough. There's a confirmation bias which was investors on all sides saw information that confirmed their existing beliefs which makes sense obviously there was games to the moon or is a worthless company I mean obviously that's going to reinforce their ideas what they think limit valuation limits arbitrage noise trader risk we have here where we have um retail traders are so overwhelming that it forced them to um arbitrage out of the market which is cool. Reclamation cost and then just go through more of this evaluation of systematic profit opportunities profit was not available led to a chaotic event as they say a black swan which is good way to put it I'd say rational investor by definition would have seen gametock at 100 or 5100 and 300 included it was overvalued and stayed away or shorted and lost. That's Yeah, that's probably true. The thing is this was this scenario is so irrational. Yeah, the irrational narrative. Yeah, exactly. Antie versus X post. Um, easy to say you should have bought in five and sold and that's obviously looking in hindsight, you know, and for the anti side obviously it was impossible to know that something like that was going to happen. going through implications. EMH versus behavioral fails to explain. I think it's very hard to explain this just because of how odd of a scenario, how big of a one-off it is for something that peaks so highly, but the behavioral for uh the behavioral finance framework explained it pretty well, saying it's a case study in hurting overconfidence limits arbitrage, which I do agree. And then going through more of this we have active versus passive went through all these analysises doesn't change much obviously say that index fund tiny amount the yeah the rounding error so I guess that makes sense but for active it was a major warning probably more for the idea of shorting how how volatile how risky it can be for some of these companies and then going through some market structure should brokers like Robin Hood beowed to restrict trading. That's big key because I do remember also in this case Robin Hood stopped people from trading GameStop GameStop when it was basically peaking and they're like okay something's wrong with the market let's stop the trading at GameStop which I mean honestly makes pretty interesting sense and then does this hurt the system for retail investors that is a good thing to look at because obviously retail investors made a huge mistake here and then should hedge funds have to disclose their their short positions more transparently. That's a big thing I think would be interesting. I mean, it would stop them from having this problem ever again, most likely. And then obviously through this, we have more analysises that we went through. Um, but for the most part, that's a lot of the analysis. There's a lot of analysis of all the stuff that we just ran through and all the ramifications that took a while for me to do, getting it all onto the actual Python, which was pretty dang cool. But, um, for the most part, going through all this information, I just say the case itself is really, really cool. I for a lot of these cases it's like they're either something I I'm not like that related to or something happened before I was born. But I remember this GameStop case when it happened and I thought it was incredibly interesting that basically these people on the internet who didn't know each other were able to cause such a stir in the world to to these companies. I mean it was all over the place. I thought it was I mean it was like I said it was co so there wasn't a lot going on other than co but it was incredibly interesting and I think um that's important I think that's an important thing I mean I'm not the only one who's probably going to remember this in this class or anything else I think that's an important part for all this analysis is that it's fresh in people's mind and people it's it was a very famous thing that happened but thank you um that'll be the end of",
  "video_url": "https://www.youtube.com/watch?v=Xs0emI6xBj8"
}