{
  "student_name": "Daniel Verachtert",
  "org_defined_id": "037038927",
  "username": "dveracht",
  "email": "",
  "transcript": "Hi, my name is Daniel Verachtert and this is my market efficiency investigation. All right. Uh so this is the first slide. This is the critical first step. Uh the statement that uh GameStop was trading at 4 cents in August of 2020 is incorrect. image to the left shows the market open. Uh it shows the market open, high, low, and close retrospectively for uh GameStop in the first four columns here. Uh looking at this image, we can see that the low for August never even dipped below a dollar. So the 4 cents obviously is not true. Uh GameStop closed at the end of August of 2020 at a price of $167. Uh moving on to my timeline. So the first uh big event was in August 2020 when GameStop was reaching near bankruptcy levels. So if we look at August right here, uh it has a low share value of less than $5 per share. And then in September of 2020, Ryan Cohen acquired 13% stake. the low share. It still had a low share value, but there was growth from August that we can see. And then it also grew into uh October. And uh then when we look at January of 2021 when the Reddit like Reddit broke the prices up to $483 per share, you can see a giant spike. uh this created a hurting bias because many people like saw this growth and heard about it behaviorally. Uh it caused serious growth in share value of about 11,000%. Uh and then when we look at February 2021, there were congressional hearings on market manipulation and you can see this large decrease in uh share value. Uh and then in the present values or in the present postevent stabilization uh the shares stabilized around $20 per share. So for my market efficiency testing this is my cap m uh I solved that it is -20.72% and then the actual return should have been or the actual return was 7,130%. Uh let me go back to this. So the negative 20% is because it moved in the opposite direction because the beta like the stock would tend uh to go to the opposite direction of the market. So for the abnormal returns uh the actual it's the actual return minus the expected return. So the 71.3 minus the negative 0.2072 2072 uh and that gives you 71.51. This shows that GameStop actually or GameStop's actual performance far exceeded what CAPM respected or predicted. Uh clear this shows clear signs of market inefficiencies and behavioral frenzies. So more market efficiency testing uh the so the testing it's weak form which is prices already reflect past proc or processes semi- strong which is prices reflect all public information and strong form which is prices reflect all public and private information. So for weak form I check for patterns like momentum. So the prices keep rising or reversals where prices crash. Uh outcome for that is that it was violated. Uh GameStop had huge momentum up reversals down uh implying shortterm predictability. Uh for the semi- strong form. I looked at how quickly GameStop responded to public events such as Cohen stake, board seat, and Reddit hype. And based on that, the outcome was it was violated or strained. Uh prices overshot fundamental values for weeks, not just one day. And then strong form, uh it's not really testable without insider data. So the outcome is unknown and it's not testable. uh for investor profitability. Could a rational investor have profited systematically? Realistically, no. Even though some individuals made huge gains, those profits were not predictable, scalable, or repeatable. The results most likely came from luck, timing, and behavioral momentum, not rational analysis. In summary, in summary, there's a lack of X anti-anti expectations because it was strongly influenced by behavioral factors. From the Xanti point of view, it was very ris a very risky investment. From an expost view, people may wonder why everyone didn't buy it, but it didn't show clear future growth. So, it wasn't a safe investment. And even some of the people who did buy early and like before the massive surge lost major portions of their profit due to loss aversion bias because they didn't sell uh they didn't sell early enough because they were trying to maximize their profits and they missed peak. Uh the theoretical implications so EMH versus behavioral financing framework. Uh, EMH says that GameStop shouldn't have received a $7,000% return without new fundamental information. Additionally, behavioral finance explains that social influence and emotional trading drove the short sorry short-term mispricing. Uh, EMH still works in theory, but behavioral uh behavioral explains why reality can temporarily deviate. Uh, as for active versus passive management implications, though active managers couldn't systematically profit due to timing and liquidity, passive investors who stayed diversified weren't harmed. Uh, and then this proves that chasing short-term inefficiencies isn't sustainable and active trading can't reliably outperform in the long run. Uh as for market in or sorry market efficiency and policy implications uh from a policy view the game or the GameStop sorry from a policy view GameStop even exposed how clearly clearing and collateral systems can stress liquidity. Uh regulators should ensure transparency and risk management without limiting fair access to the market. Uh, and the goal isn't to stop volatility, but is to prevent structural breakdowns. Uh, that's all I have for my slides. And here's my Python code that I have. It's just the actual or the expected actual and abnormal returns. And when you run it, it will give you the values that I have in my slides. So the expected return is -20.72%. The actual return is 7,130%. Abnormal return is 7,151%. So that's all I have. Thank you.",
  "video_url": "https://youtu.be/48Tl6Ls46Yc"
}