{
  "student_name": "Abha Gupta",
  "org_defined_id": "037604525",
  "username": "gupt1107",
  "email": "",
  "transcript": "Hello, this is my section 10 assignment for the management 310 class. Um, in this assignment, I'll be walking through a Starbucks proposed um, flagship roaster project. Um, we'll be going through the full analytical workflow that I followed, starting with defining the business question, building a structured set of assumptions, coding a capital budgeting model in Google Collab, validating the results, and then evolving the model through sensitivity analysis, and finally reflecting on the project's financial feasibility and strategic implication. Um, in this presentation, I'll reference the Python code that I developed, explaining how each component contributes to the overall financial model. I'll also look at the outputs, the NPV, the IRRa, payback periods, profitability index, and sensitivity results to give Starbucks a complete decision ready evaluation for whether this roaster should move forward. Um, and just as a preface, I did use an AI chatbot to help make sure that my code was as efficient as possible and was um answering the question that the assignment was looking for. And then um yeah, with that we'll start with um the define and discover section of the driver framework. So um to start the analysis, I first needed to clearly define the business question and discover all the relevant input details according to the driver guidelines. Um uh this should be done before writing any of like the code so you kind of have an understanding of what you're going to talk about um and the problem that you're answering. So the project um under evaluation is Starbucks idea to launch a flagship roaster experience. And the key question we kind of needed to answer does investing $12 million today in a 10-year flagship roaster create value for Starbucks. the company requires an 8.5% return. So to answer this, I collected all the financial information provided in the project description. This included the initial investment, the depreciation method, working capital requirements, yearly revenues, operating cost structure, the tax rate, and the terminal value. Um so the initial investment was $12 million. This includes the cost of constructing the roaster, acquiring equipment, and training employees. The project will run for 10 years. The invest investment will be depreciated using straight line depreciation. So that is 12 million divided by 10, which equals to $1.2 million per year. Starbucks also needed $500,000 of working capital at launch, which is fully recovered at the end of year 10. Revenues follow a specific pattern. $8 million in year 1, then $11 million from year 2 to 5, and then $9 million from year 6 to 10. Operating costs include the COGS at 40% of revenue, labor costs of $2.5 million per year, rent and utilities of $800,000 annually, and then marketing which is 300K in year 1, and then 100K per year afterwards. The corporate tax rate is 25% and the terminal value at year 10 is $3 million which we treat as after tax cash inflow and then Starbucks hurdle rate or discount rate is their walk of 8.5%. So um after creating this this is the financial model we rely on um and then we go into the represent section of the driver framework. So I convert the project's financial logic and information into a planned model structure. This is really the design phase of phase of the project. So first I started off by importing all the necessary Python libraries that we'll use in the model um to do all the numeric calculations and then maybe some graphs and then we represent every single parameter that we talked about in the define and discover section as the base pars um dictionary which has every single input that we talked about. Um, and then we just printed it out here to make sure all the values look correct. But this dictionary is extremely important because it lets me change any of the assumptions in just one place. That way the entire model updates automatically um in case any of the values need to be changed later. Then we move to the implement section. So we translate the all the representation into working Python code. We started off by creating helper um functions to help with some of the calculations. The main core of the model is based on the cash flow construction function. Here it creates arrays for every financial line item, revenue, COGS, labor, marketing, depreciation, EBIT, taxes, and free cash flow. And then you fill in operational logics for years 1 through 10. um throughout this function and then we have separate functions to compute the NPV um the IRRa the simple payback the discounted payback and then the profitability index. Um, some important things to note in just this build cash flow table function is there's some important sections like this over here which calculates the depreciation per year and it tells you there's $1.2 million of depreciation every year. Um and then this section right here which tells you that the EBIT incorporates revenue minus all operating costs and depreciation. This section right here which tells you that which is the year 10 working capital recovery and terminal value. So this pulls in both the 500k and the $3 million value. This section right here um which is the free cash flow. So this produces the actual investment cash flow that we use for NPV, IRRa and payback analysis. And then finally you generate the table of all the base values um for years 0 through 10 in um including column titles that are easily understandable. Now you go to compute the capital budgeting metrics using any of the functions I'm using the functions that we created. um in the previous code block and then after that you can see that it um prints the values for the NPV, the IRRa, the simple payback in years, the discounted payback in years and the profitability index. To visualize the free cash flows, I created a bar chart. Um here you can see that year zero is highly negative from the investment. Um but operating cash flows in years 1 through 10 are consistently positive. Year 10 spikes because of the work working capital recovery and terminal value. This visual just shows confirmation that um the model is behaving correctly. Now we move into the validate section um before you can entirely trust the model. So what we did was we printed year 0, year 1, and year 10 um of the base values to confirm the accuracy. This check includes that the depreciation is $1.2 million every year. Year 10 includes the 500K WC recovery and the $3 million terminal value. And then the operating costs match the provided assumptions. So with looking at the table you can see that all the C costs lined up correctly um so you can trust the outputs from the function. Finally in the involve section we did some sensitivity analysis. We test tested how sensitive the project is to changes in assumption. So in scenario one we the revenue drops 20%. right here and then you run the CF table um function again and it simulates a demand downturn. The results show that the drop is the drop shows that the project is sensitive to revenue performance and um traffic volume. You can see the outputs right over here. Next, what we did was we adjusted the walk by plus or minus 2% right here. When walk decreases, the NPV improves meaningfully and this simulates a cheaper cost of capital. And then when the walk increases, you can see that the NPV drops and this simulates rising interest rates or higher risk. Finally, we graph the sensitivity. Um, here's a plus or minus 2% right here. The base case of revenue of minus 20% in the table format. And then this section we graph the sensitivity to walk and then you can see as the NPV falls as the walk rises um this way a classic relationships. This helps quantify financial risk under different capital market conditions. Now we move to the reflect and recommendation section. In this phase, um we can really interpret what happens. Um the roaster based on the standard capital budgeting rules, this project should be accepted. Beyond numbers, the roaster fits Starbucks brand because it strengthens the premium experimental brand identity and it acts as a destination store. It also differentiates the company from its comp competitors purely on experience. Now this project is sensitive to revenue declines. It is moderately sensitive to changes in walk and the upfront capex is large. Um and the flagship success depends on foot traffic, tourism and store level execution. But um given the given the positive um given the positive NPV IRRa above the discount rate and strategic upside, I recommend that Starbucks proceed with the roster investment provided that the mitigate revenue risk through site selection, experiential design and marketing. So this concludes my driver-based financial modeling walkthrough. I demonstrated how I defined the problem, represented the solution, implemented a full cash flow model in Python, validated the results, evolved the model through sensitivity, and reflected on the strategic meaning of the outputs. However, it is also important to note that um the sensitivity analysis that we did has some caveats. So if revenue is meetingly lower than expected, the NPF shrinks rapidly. And additionally, if the walk increases due to interest rate changes, the project becomes less appealing. But as an overall strategic standpoint, I do believe that the roaster that Starbucks is looking to put into their um company is something that lines with the brand identity and also um enhances the customer experience. But you always have to make sure to manage demand uncertainty and cost overruns to preserve the value. Thank you.",
  "video_url": "https://youtu.be/CTRc_F_imX0"
}