{
  "student_name": "John Gascho",
  "org_defined_id": "035820898",
  "username": "gascho",
  "email": "",
  "transcript": "Hi everyone. My name is John Gasho, and this is my Section 6 Capital Budgeting analysis on Starbucks' proposed flagship roastery project. In this presentation I'm going to walk through the full DRIVER analytical process, demonstrate my Python model, and interpret the financial results — including NPV, IRR, payback periods, profitability index, and the key sensitivity analysis. This project applies Starbucks' 8.5% WACC as the hurdle rate to determine whether the investment creates value. So now let me go to my code. These are just some endpoints I have. I begin with Define & Discover. I begin with Define & Discover, which is the most important stage and also the stage required for full credit. The goal here is not to build anything yet — it's to understand the decision, the financial structure of the project, and the information I need to model it. The decision problem is: should Starbucks invest $12 million to build and operate a new flagship roastery that will run for 10 years? To answer that, I gathered all required inputs. The initial investment is $12 million, depreciated straight-line over 10 years. Working capital of $500,000 is invested at launch and fully recovered at the end of Year 10. Revenues are $8 million in Year 1, $11 million in Years 2–5, and $9 million in Years 6–10. Operating costs include cost of goods sold at 40% of revenue, labor at $2.5 million each year, rent and utilities at $0.8 million, and marketing at $0.3 million in Year 1 and $0.1 million in subsequent years. The tax rate is 25%. Terminal value is $3 million received in Year 10, and the discount rate is Starbucks' WACC of 8.5%. I also clarified the output requirements, which are to build a Year 0 through Year 10 incremental free cash-flow schedule. I also need to compute NPV and IRR, simple payback and discounted payback, and the profitability index, then run sensitivities for revenue down 20% and WACC ±2%, and provide an executive-ready recommendation that combines financial and strategic thinking. Once all assumptions were defined, I was ready to move into the planning phase, which is the Represent stage. In the Represent stage I pre-designed the structure of the model before writing a single line of code. Represent is about designing the architecture. I broke my model into four components: the cash-flow engine, which computes revenues, operating costs, EBIT, taxes, depreciation (and the tax shield), working capital movements, terminal value, and free cash flow from Years 0 to 10; the value-metrics engine, which calculates NPV at 8.5%, IRR, simple payback, discounted payback, and profitability index; the scenario and sensitivity module, which runs the model for revenue at −20%, WACC at 6.5%, and WACC at 10.5%; and visual outputs, including bar charts showing free cash flows across all 11 years and additional visuals for scenario comparison. I also planned the DRIVER printouts that document each stage as I worked. Once the structure was represented, I moved into the Implementation stage. In Implementation I wrote the Python code exactly according to the plan while keeping everything parameterized so any assumptions can be easily adjusted. My assumption section defines all project parameters — revenues, costs, depreciation, and WACC — at the top. This ensures a transparent model that anyone can update without touching the logic. I implemented the build_cashflows() function. This function calculates COGS at 40% of revenue, adds labor, rent, and marketing, subtracts operating costs, computes annual depreciation, calculates EBIT and taxes, adds back depreciation, adjusts for working capital, and adds terminal value in Year 10. This satisfies the assignment requirement to model incremental free cash flows from Year 0 through Year 10. The financial_metrics() function computes NPV using Starbucks' 8.5% WACC, IRR, profitability index, simple payback, and discounted payback, which satisfies the requirement to produce all core capital-budgeting metrics. I built a small scenario engine that returns the model under revenue −20%, WACC = 6.5%, and WACC = 10.5%, and I plotted yearly free cash flow so the investment profile is clear. Finally, I included clean, sequential DRIVER messages so my work is fully documented, meeting the assignment's critical requirement to show the analytical progression rather than reverse-engineer a completed model. Then I ran the model and here are the results. In the Validate stage I checked the mechanics to ensure the model was operating correctly. I verified that depreciation equals $12 million divided by 10 years, which is $1.2 million per year. Working capital is subtracted in Year 0 and fully recovered in Year 10. Terminal value is added only in Year 10. Revenue and operating-cost logic match all problem parameters. Free cash flows show the correct pattern — a large outflow in Year 0, stable operating inflows during Years 1–9, and a large inflow in Year 10 from terminal value plus the working-capital recovery. After checking EBIT, taxes, NOPAT, and cash flows, everything validated properly. Then I proceeded to sensitivity analysis. In the Evolve stage I focused on scalability. Because my model is fully parameterized, I can change any assumptions — revenue growth, WACC, rents, marketing — and the model updates instantly. For future expansion, I identified enhancements such as adding a cannibalization adjustment, running Monte Carlo simulations, modeling monthly construction cash flows, and considering multi-stage capex. These improvements would enhance decision confidence in a corporate setting. In the Reflect stage — the final stage — I combine interpretation with strategic judgment. Base-case results at 8.5% WACC are: NPV = $3,022,515, IRR = 13.25%, discounted payback ≈ 8.2 years, simple payback ≈ 5.3 years, and profitability index ≈ 1.24. The project passes the financial tests. A positive NPV means the roastery creates value. The IRR exceeds the WACC by almost five percentage points. PI above 1 confirms benefits outweigh costs. Payback is long, but that is normal for strategic flagship locations. The cash-flow visualization clearly shows a typical retail investment profile: a large upfront cost in Year 0, stable operating inflows throughout the asset's life, and a final spike in Year 10 reflecting depreciation tax shield, working-capital recovery, and terminal value. I was satisfied with these results. I used ChatGPT to help refine wording, but I primarily supplied the inputs and model logic. Sensitivity analysis shows that revenue −20% yields NPV ≈ −$2.75 million, which is the most important insight: the roastery is extremely sensitive to revenue performance. A 20% drop wipes out all value, meaning consumer traffic, pricing power, and marketing execution must be closely managed. Sensitivity to WACC ±2% shows that at WACC = 6.5%, NPV ≈ $4.64 million, and at WACC = 10.5%, NPV ≈ $1.63 million. Even at a higher cost of capital the project remains financially viable, demonstrating resilience to capital-market conditions. The main risk is not financing — it is revenue. Based on my analysis, I recommend accepting the Starbucks roastery investment. The financial case is compelling: a positive base-case NPV, an IRR that exceeds the WACC, a strong profitability index, and robust results under higher discount rates. Beyond the numbers, the project supports Starbucks' strategic brand goals. It strengthens premium and experiential brand positioning, creates a tourist attraction and a high-visibility flagship site, and supports long-term brand equity and global differentiation. However, Starbucks must proactively manage demand uncertainty, as the revenue-downside scenario shows that underperformance in traffic or pricing materially damages value. Marketing, consumer engagement, and site selection are key risk areas. Overall, the roastery creates financial value, supports strategic objectives, and is worth pursuing — with attention to demand risk. That completes my DRIVER-based capital-budgeting analysis. Thank you for listening.",
  "video_url": "https://youtu.be/Yk98Af95SyQ"
}