{
  "student_name": "Harry White",
  "org_defined_id": "037593398",
  "username": "white977",
  "email": "",
  "transcript": "Hello, I'm Harry White and today I'll be going over my session 10 assignment. Um, our assignment for session 10. It's gone out over here, but basically we have to evaluate Starbucks's proposed flagship roaster, a new store that requires a $12 million upfront outlay and is expected to operate for 10 years. Uh we're using the 8.5% weighted average cast of capital whack as the hurdle rate to determine whether the project creates value and to recommend an accept/reject decision supported by driver documentation. These are the basic benchmark facts we're given. The initial investment is $12 million for building equipment and training and the depreciation method uses straight line over 10 years. So it equally depreciates every year. Uh there's $500,000 of working capital deployed at launch and recovered in year 10. Revenues all given um it's 8 million for the first year, 11 million which spikes uh from years 2 to 5 and then 9 million from the rest of the time the store is open. Operating cost um cost of goods sold is 40% of revenue. Labor is 2.5 million. Rent and utilities is8 million. marketing is 0.3 in year one and then 0.1 million thereafter and then taxes wise um it's a 25% corporate the terminal value $3 million at the end of year 10 for I represent and what I planned out to do in this project um I wanted to build a uh uh incremental cash flow schedule that shows the different facts and the that shows revenue venue, operating cost, depreciation, tax shields, taxes, all of that for each year from zero from year zero of opening to year 10 of when they close. And then we have to calculate the NPV, the net present value that IR, the discounted payback period, simple payback period, and profitability index using the whack we were provided of 8.5%. Oh, excuse me. then um run a quick test to see how revenue reduction would affect the NPV and the profitability of the store and if whack went up or minus 2% and summarize how that affects the company and how it affects MPV and IRR and then based off the information we calculated above provide a recommendation that weighs financial results fit brand applications and key project risks. Um, all this information here is all we needed to go. So, uh, for my implement stage, I asked Google Collab to make me a code that calculates all of these. And I'll start from the incremental cash flow schedule. As you can see here, plugged in all the information, calculated our corporate taxes and all the taxes and the all this stuff over here. terminal um gives us a lot of good information that we need as you can see here. So this is the incremental cash flow schedule gives us all this for the 10 years that the store is expected to be open for um our core financial metrics for our regular case. This is our NPV calculated 3,22,515. It's NAM% uh 8.5% hurdle rate which we were given the discounted payback period which is how long it's going to take for the uh the store to make the money back make return their initial investment which is 9.71 years then this is their profitability index ratio which is good fees were the three different scenarios we had if the revenues reduced by 20% what would happen to the store and the NPV and the IRR goes down NPV V is negative 3 million. Now um it decreases by 6 million from this is the base value and this shows that you would reject it because MPV is negative. You're going to lose money on this project. Um it's not going to go good. So and then this is for whack going up and down 2% both scenarios. So in this scenario our whack is 10 12%. As you can see, MPV is lower than what it was, but it's still positive. So, you accept, but you don't plan on making as much money and it's not as safe an investment. Sorry, this for whack going up 2%. For whack going down 2%, our MPV increases by I think about a million at 1.6 million. IRRA, same thing as always. And then our whack is at 6.5%. We accept this and it's a strong value creation. And it shows us that this is a strong example of we would invest in this because the MPV is so much higher than it was before. And then for our recommendation and summary, um the code itself, final recommendation was to reject. It says that um it has a high positive MPV of 3 million. It's going to return in 9.71 years. It's a strong candidate for acceptance, but it doesn't show enough tendencies and it's I mean it only it makes the initial return 0.29 years before it's done. So, it just doesn't the risk is not worth it. As you can see, it goes over specific things right here. Uh um you know like brand equity reinforces Starbucks commitment to high quality specific coffee and strategic fit. They service coffee cathedrals. Brand equity premium coffee sales. Basically pushing their brand is a stronger one and a more premium which you can also upcharge on. But the risks and mitigation revenue risk uh the sensitivity analysis show that MPV remains positive even after a 20% reduction in revenue. Um provides a strong buffer against market downturns. You know uh you don't want to put this store in an area with another one already because then it just harms the company itself. Um and then for my validate stage, I just wanted to make sure the stuff calculated by the code was right. So I went over MPV. I did calculate MVP using this formula and it was correct. I got the same thing that the code got and I went through all of this data using the data that we were given and calculating the taxes. This was all correct that from what I calculated. So all the data I checked was correct from the code for my evolve stage. The code recommends the rejection excuse me um the code recommends a rejection of this plan even though it was expected to make profit. I agree with the statement because as I said before the project is projected to return the initial investment in 9.71 years giving it only 0.29 years to make additional profit. Um while it's expected a profit it's not worth taking on the risks for such low return. I don't know how much the return specifically would be but it's not worth the risk you're putting in and the time and money spent. Um and a net loss is still possible. So, it's not worth uh taking on the extra risk. For my reflection, um yeah, this assignment did take me a while. I kind of had to tweak the code for a while. Um I learned a lot about how I can use MPV to measure a profitability of a company and how whack affects a company's profitability and MPV in the long run. um investment like a store like this. I would never expect um to use 10 years like a of a store opening and then closing in 10 years doesn't sound right. But I guess if it's a project where you work on it for 10 years and if it doesn't work by then you cut it off or you keep it going if it makes profit. But this uh situation's taught me a lot. learned a lot about MPV, whack, and how to calculate all that stuff and how um even net profits can still cause somebody to reject it due to the small profitability or the scale that isn't worth taking on the risk for. But",
  "video_url": "https://youtu.be/ViqHJlhO8So"
}