{
  "student_name": "Abby Goldstein",
  "org_defined_id": "035857284",
  "username": "goldst13",
  "email": "",
  "transcript": "Hello everyone. My name is Abby Goldstein and this is session nine assignment for management 310. Um in this assignment we focused on calculating the weighted um average cost of capital or the WACC for Netflix. Um specifically um evaluating its hypothetical 5 billion content investment and a related $3 billion debt issuance. Um the WACC is simply the minimum return a company needs to earn on any new investments just to keep its investors happy happy. Um it's basically the company's hurdle rate for approving projects. So I'm going to run my code and we can kind of start with the core financial calculation. Um this table right here summarizes our findings for Netflix's um WACC under the current and proposed capital structures. Um our code successfully calculated the cost of equity um using the CAPM which is 11.65 initially reflecting the company's high beta risk. Um the key takeaway is that the new dash the debt issuance um slightly reduced the WACC dropping it from 11.22% to 11.20% after borrowing 3 billion more. And this shows that Netflix is underleveraged. Um they aren't using enough debt to maximize this benefit. Um the small drop is a good sign. It confirms that Netflix can borrow money cheaply. Um the debt is cheaper for two reasons. Um the interest rate or the cost of debt is lower than the required return or the cost of equity for investors and the interest rate is tax deductible making the debt even cheaper for the company. Basically borrowing money um is financially smart right now. Um as the firm's W um ACC is 11.20%. Using it for all projects would be a mistake. Not all projects are risky. Um you would just need a risk adjusted hurdle rate. Um so they must use a divisional cost of capital approach. Um content projects like any business units um have different risks. Um therefore lowrisk projects using the 11.20% WACC would cause us to reject profitable safe projects. Um and then the high-risisk projects like international content due to currency political instability and market maturity using the low 11.20% um WACC would cause us to accept value destroying risky projects. Um Netflix must calculate a separate tailored WACCC um for its different markets the US, Europe, Asia and other countries by looking at how risky similar local competitors are. Um and this ensures they approve of profitable safe projects and reject value destroying risky ones. Um comparing Netflix to its peers highlights a significant competitive advantage. Um, as you can see, Netflix cost of capital is 3 percentage points higher than Disney's. Disney's ha Disney has a major competitive advantage. Um, Disney can profitably invest in a content project that only returns 9%. But Netflix would be forced to reject that same exact project because it doesn't meet Netflix's higher 11.20% hurdle. Um which leads us to the question of why the difference. There is the business risk. Disney's diverse assets including parks and media networks stabilizes stabilizes its income um giving it a lower systematic risk than pure play Netflix. And then there's capital structure. Um Disney uses a significantly sign significantly um more cheap debt um 30% versus Netflix's 7.4% 4% um capitalizing on the debt tax shield far more effectively. Um so based on this analysis we have some clear strategic recommendations. Um we have the optimal financial strategy of um the initial 3 billion debt issuance. Um it is optimal and they should proceed as it reduces uh the WACC and provides funding. And then we have the optimal capital structure. Um Netflix should strategically aim to increase its debt ratio toward a more balanced um structure, maybe 15 to 20% debt. Um this would lower the WACC closer to the industry average and close the competitive gap with Disney. Basically, Netflix um should push its borrowing up to find that sweet spot um where the WA or the WCC is at its lowest. Um we do have a trade-off. Um Netflix would have to balance um this benefit against um the risk of going bankrupt if they borrow too much. Um essentially by lowering the W um ACC, Netflix increases its investment capacity. Um, it raises the uh net present value for all future content projects. Um, basically allowing the firm to create more value for its shareholders. Um, and that was my coding assignment. Thank you for watching.",
  "video_url": "https://youtu.be/G3GIcPRHdoc"
}