{
  "student_name": "Abbey Carroll",
  "org_defined_id": "035875419",
  "username": "carro146",
  "email": "",
  "transcript": "So, in this video, I'm going to be walking through my capital budgeting analysis for Starbucks's proposed flagship roaster project. So, I structured the entire workflow using the driver framework. Define, discover, represent, implement, validate, evolve, and reflect. And you'll see each stage as I go through the notebook. So, first in the define stage, I laid out the core question we're trying to answer, which is should Starbucks invest 12 million million in this 10-year roastery project using their 8.5% WACC as hurdle rate. The decision rule is straightforward. If NPV is positive at 8.5%, the project creates shareholder value. Supporting metrics include irr payback periods and profitability index. Then in the discover step, I documented all relevant case assumptions including revenue patterns over the 10 years, operating costs like cost of goods sold, labor, rent, and marketing, working capital investment, straight line depreciation, a $3 million terminal value, and the 25% corporate tax rate. So, this step ensures that the entire analysis is transparent. And then here's that work um and grounded in the provided inputs. So next for section two in the represent stage I translated the business logic into a parameterized model. This cell loads all of the packages and stores every assumption in one place. Then here's that work. Um making the model easy to update later. So here's the printed summary. WACCC 8.5% tax rate 25% initial investment negative -12 million working capital negative0.5 million at year zero annual depreciation 1.2 2 million per year and a terminal value of 3 million at the end of year 10. Having this table clearly visible makes the upcoming calculations very easy to validate. So here I or here I implemented a reusable function that builds the entire year 0 through year 10 cash flow schedule. So you can see the table here. Year 0 shows the initial outflows. Free cash flow is -12.5 million which includes the capital investment plus working capital. From years 1 to 5, free cash flows are strong because revenue is highest in that window. Years 6 through 10 dip slightly due to lower revenue. And then finally in year 10, you can see a jump in free cash flow to 5.3 million because working capital is recovered and the terminal value of 3 million is added. So the table automatically calculates EBIT tax, EBIT taxes, depreciation, tax shields, operating cash flow, working capital changes, and terminal value. All right. Now, using the cash flow stream, I calculated all of the required capital budgeting metrics. So here are the results. NPV at 8.5% a WACC is a positive 3.023 million. So this is the primary decision metric. It's positive. So the project creates value. The IRR which is 13.3%. So the IRR is comfortably above the 8.5 hurdle rate. The simple payback which is around 5.28 years. The project recovers its initial outlay well before the 10-year life. Discounted payback at around 8.21 years. So slightly longer but still within the project's light lifespan. and then profitability index which is 1.242 meaning every $1 invested generates around $1.24 in value. All metrics point toward a strong base case financial performance. So now to evaluate robustness I ran two sensitivity tests. One was revenue with at - 20% scenario. So NVP NPV drops to -3.157 million turning negative and the IRRa collapses to 3.2% far below WACC. This shows the project is very sensitive to underperforming revenue. If foot traffic or con customer spends ends up weaker than expected the value can evaporate quickly. So number two, WACC is plus or minus 2%. So at 6.5% WACC, NPV increases to 4.636 million. And at 10.5% WACC, NPV remains positive but falls to 1.627 million. So this means financing conditions at Starbucks risk profile matter but not nearly as much as revenue performance. Across all scenarios the IRRa sets the IRRa itself doesn't change because irrra depends only on the cash flows and not discount rate. So now for section six this first chart visualizes the free cash flows across all years. So you can clearly see the large negative year zero outflow, strong operating cash flows during years 2 through 5, slightly smaller but stable cash flows afterward in a big year 10 spike from terminal value and working capital recovery. This confirms that the model behaves exactly as expected. So now for the next one, the second chart visualizes the NPV sensitivity. So the base case sits around positive $3 million. um revenue is negative 20% sends NPV deeply negative. WACC movements shift NPV up or down but keep posit but keep it positive. So this visualization supports the insight that revenue uncertainty is the primary risk driver for this project and then in the reflect phase I brought everything together. So financially the project should be accepted. NPV is positive. IRRa significantly exceeds WACC. Profitability index is above one. Paycheck period falls within the project life. Strategically, the project also fits Starbucks brand. So, it showcases the roasting craft. um strengthens the premium exper experential strategy, acts as a halo store that lifts the brand globally and some of the key risks includes revenue underperformance, high labor and occupancy costs, execution and construction delays and brand risk if the experience doesn't meet expectations. So our final decision is to accept here we are with it with its strong financial profile and strategic alignment but with attention to revenue risk the flagship roaster should be approved. So this concludes my driver guided analysis and implementation. Thank you so much for watching.",
  "video_url": "https://youtu.be/kGJA9EjQUOM"
}