{
  "student_name": "Katherine Schmelz",
  "org_defined_id": "035859682",
  "username": "kschmel",
  "email": "",
  "transcript": "The session 10 project is working with capital budgeting and investment decisions for define and discover in the first step in the driver sequence. Um, I said, \"I want to determine if Starbucks should accept the 10-year investment project for the flagship roaster by using financial analysis tools, including net present value, NPV, and comparing internal rate of return IRR, with Starbucks's weighted average cost of capital, WAC, 8.5%. Um, so after understanding what I want to do, uh, I wanted to identify the components that I have as part of the discover process. Um, so the whack or the hurdle rate is 8.5%, the corporate tax rate was 25%. The initial investment is $12 million. The terminal value is $3 million and that's the ending sale price. Um, and then the working capital is $500,000 which is invested at the launch and then recovered with the with the terminal rate. Um, and then the other components are the operating costs which include cost of goods, labor, rental, utilities, and marketing. And then the revenue streams fluctuate throughout the 10 years. Uh, and that's laid out later. Um, I also when I was looking into this, I made sure I understood uh what the reasonable corporate tax rate is. So I made sure that it it is around 21%. So 25% is fairly reasonable. Um and then I also made sure I understood what all the formulas were uh because net present value is the sum of all the cash flows at the present value. Um, and so that takes the uh earnings before tax and it takes the tax value, brings it back to the present value and then subtracts uh depreciation. Moving on to the represent section, uh, I decided to create a timeline with the net cash flows, sort of laying out what I want it to be. So you can see at time Z there's the negative $12 million for the initial investment. Uh in year 1, it's $8 million of revenue minus the 40% of revenue plus um and then minus $2.5 million of labor uh 8.8 million of rent, $300,000 for marketing. Um, and then for year two, the only thing that changed from that is the $11 million of revenue and the expense of $100,000 for marketing. And that is the same for the next uh for years 3, four, and five. Um, once it breaks even, then you have to add in the 25% tax rate. Um, and then in year six, the revenue changes to $9 million. So this covers the lif line of the um of the investment of small amounts of revenue and then the peak amount of revenue which is 11 million. And then now we're seeing towards the end of life the taper of $9 million of revenue and that lasts until year 10 when we sell this investment, sell the roaster for $3 million which is the terminal value. So based off this timeline, it's hard to see exactly when the net present value um it's hard to see exactly what it'll be and it's hard to see when the cumulative amount will become positive. Uh like when the return will make sense. Um but we know what calculations need to be done. So moving on to the implement section. Um I put this into code in Python code. Uh here we can see the core financial inputs. Um let's run that. So we have the walk and the tax rate. um the hurdle rate here and then the parameters are given as the initial investment working capital uh initial working capital recovery terminal value. We factor in depreciation with the life value and depreciation is defined as initial investment divided by project life. Um and then the revenue is put into a vector. Uh so you have the different the 10 years there and then operating costs are laid out here. Um moving on into year labels here and then running the model with the cash flows. It defines the whole schedule and then it calculates all of it and the Python coding labels everything with a variable so that it's easier to print later. um depreciation and earnings before tax is then calculated uh for years 1 through 10. Um calculates the taxes and net income, operating cash flows, nonoperating cash flows, and then the terminal value after tax and the terminal value with the sale. Um and then down here it um runs some other tests that I will talk about later. And then for the output, what's being printed? It also created a graph. Um so moving down to the output of this code, it created a step-by-step schedule. So you can see each aspect of what we're looking at from year to year and also the incremental final. Um so you can see all components are laid out with the revenue EBT taxes um operating costs operating cash flow uh the initial investment working capital and terminal value after tax and then the final incremental. So we can see the changes. If you're looking from the in or the investor's perspective, from Starbucks's perspective, this is how much money you lose. You lose this initial investment and then you gain back these incremental amounts of money each year. Um so that walks us through years 1 through 10. And then looking at the metrics using net present value, the net present value of this investment of the roaster is 3,982,818.86. Um, so about $4 million, which is in fact greater than zero. So that's a good sign. We like that number. The internal rate of return is 12.84% 84% which is higher than the 8 12% of the company's weighted average cost of capital. So that's also a good sign. Um and then the profitability index 1.32 years. Um so that's just how long it takes to get our money back. Um and then simple payback period. Wait, the profitability index is 1.32 years, which means you're getting $1.32 per dollar of investment. Um, and then the simple payback period is uh 5.28, which means it'll take 5.28 years to return your initial investment. Um, and that is less than the life of the project year, which is which is 10. And then looking at a discounted payback period which takes into account the discount factor um it is also less than 10 at 8.21. So it is less than the project life. So based on all of our measurements this is a good investment to make. Um and then here we can see the in incremental free cash flow timeline for the roaster project. U each bar represents a cash flow. So you can see the first one is in the negatives because that's the initial investment. And then every year afterwards it has a positive net income. Uh and then this blue line represents the cumulative cash flow. Um and we can see that in year five we're almost there. And then in year six we are cumulatively in the positive amount. Um and so we can use this graph as an easy way to reference. In order to validate this uh whole project and all the Python and everything, uh I first double checked that the corporate tax rate was reasonable and I made sure a couple other definitions made sense to me. Um I had some struggles with the code. It I was getting some errors. So, I was able to problem solve that by adding additional modules um imported that would allow me to run with uh a few more tools. Um and then I was also able to add that cumulative graph line to make it easier to understand what we're looking at. And then I also double checked that all of the outputs made sense to me. Um, this table here with all of the broken down cash flows took a minute to understand, but after understanding what calculations were being done, I was able to to double check those and those all looked right. Um, so for the evolve section, how to take this the next step? Uh, first I did some sensitivity testing. Um, so if the you have the base case where the internal rate of return is 12.84%. If the revenue were to have been 20% lower, so 80% of the revenue that we originally looked at, that would have dropped by 2.41%. Um, so that means the internal rate of return would then be closer to 10%. which is still higher than the um 8 and a half%. So, it's still good. Um it's just a little bit lower. Uh and it was a pretty significant difference between that that 20% of revenue. And then looking at the weighted average cost of capital, uh measuring plus or minus 2%. Um, so that would look at if the company had a hurdle rate of six and a half percent or 10 and a half percent. Um, that internal rate of return is still pretty close to that 12.8%. Um, and so that's relatively unchanged. So in summary, a 20% reduction in all revenue would cause the net present value to drop by over 80% and the internal rate of return to fall. Uh while the project remains positive, this demonstrates a high sensitivity to sales volume. And then as for the whack changes, uh the project is less sensitive to small changes in the discount rate. Um as I noted earlier even with the uh whack increasing to 10 and a half percent the net present value remains strongly positive. So the internal rate of return is unaffected by the whack changes. Um another thing to consider for evolving this this scenario is looking at other types of investment that go along with Starbucks branding. they push for the premium and luxury type of audience. Um, so this is a roaster, but maybe they would consider uh certain types of cups or other types of machines that may seem special or seasonal. Uh, another thing to consider is scale. So, if this is one machine at one shop, uh what would it look like at a lot of shops in one region or maybe nationally or even possibly globally? Uh considering how to scale this and how that would affect the rate of return and the net present value and if it would still be worth it. Like at what point would you invest enough to like still be worth it or would it all sudden become negative and therefore you wouldn't want to invest anymore? Uh as a reflection um overall the project is robustly profitable under the base case and offers an acceptable return even under a significant stress test with a 20% revenue drop. The substantial financial returns combined with strong strategic alignment warrant an accept decision. Um so we als I also want to recognize the possible risks. um over reliance on foot traffic and novelty effect. Uh so basically a lot of people will be coming in to see this. So you would have to ensure that the experience remains fresh and high quality over the 10-year life and then um you also don't want the market to become too saturated or competitive uh with competitive pressure. So you want to m maintain the quality and uniqueness of the instore experience um to protect the revenue stream. Um overall this investment is about brand different differentiation as much as cash flow because uh this investment would strategize the premium premiumization and experimental retail aspect of Starbucks. Uh and is crucial for maintaining pricing power against competitors and groceries are a very innovative aspect of this. Um, so final thoughts because of the nature of Starbucks as a corporation, it is also interesting to look at the branding side of the business, we have learned a lot about how to use financial analysis tools to quantify smart business decisions and investments. But adding in this extra component of branding and growth adds the factor of quality when it comes to the business as a whole. So all in all, this is definitely an accept decision. Take this investment. Uh, it checks out financially, mathematically, and with the brand.",
  "video_url": "https://youtu.be/lp8qhIU4-wM"
}