{
  "student_name": "Lal Thang",
  "org_defined_id": "038073978",
  "username": "lbthang",
  "email": "",
  "transcript": "Hello guys, my name is Law. Um for today's video, we are on session nine, assignment nine. Um the cost of capital. So in this um assignment, it's cost of capital analysis. So the assignment overview is calculate the weighted average cost of capital for Netflix in connection with a hypothetical 5 billion content investment decision. Your analysis must um determine current WACCC. Evaluate the impact of additional debt financing assets project specific vers versus firmwide discount rates and compare Netflix cost of capital to um industry industry peers. Okay. So in this video or we are this is going to be basically my um analysis for Netflix. My goal is to determine Netflix um WACCC and use it to evaluate a hypothetical $5 billion content investment. Um okay. So let's open our notes. So this is going to be my plan. So discover for my discover the task is to define Netflix true cost of capital. Um my plan is to first calculate the current debut ACC then model the impact of the new depth analyze project um risk and finally compare to peers to implement. I'll execute this um plan. Okay. So, first I'll calculate the current weighted um average cost of capital of Netflix. Um the formula here is on the screen as you guys saw this. So to solve this we need um three three um three components. components um cost the market value weights and the final WCC. So step one component cost is cost of equity. So here using the CA PM my um my formula is kind of hard to understand so I'll go through it. So we have a risk-free rate of 4.5 plus the market premium which is the 5.5% and the Netflix beta of the 1.3 and so we get a total cost equity of 11.65% 65% here. And for the and so after next that would be after the tax cost debt which is here we take the five the we take the 5.8 the pre-tax yield and multiply by 1 minus 0.21 21% tax rate here. So this gives us a much lower um after tax cost of a 4 58%. And for step two we will what we will do is have the the market value weights. So here I have the information from here the from our assignment. So our market weight is the market equity is 200 billion and the market value of debt is 13 billion and the total firm value is 20 the 200 plus the 13 billion which is 213 billion and then divide that we get a 93.9 and the 13 divided by the 213 bill which is a 6.8. So there we calculate the market values weight. So we we use the markets values with a market cap of 200 billion and the market value of depth at 13 billion. So the total volume was 20 um 13 billion. So this means um Netflix is financed by 93.9 equity and only um 6.1 debt and for for our step three. So basically after doing that we finally we would come and combine to find the WACCC. So we take the weight of equity the weight of um equity times the cost of um equity plus the weight of debt times the um after tax cost of debt. So so this gives us the final WACC of 11.22. This is Netflix current hurdle rate. And for part two of the assignment, we have I analyzed the the impact of using so basically the impact of issuing 3 billion in new debt. We just can't change the weights. Um adding adding debt increases financial risk which increases the beta in cost of uh equity. So, first we must unlever the beta to find Netflix um piers uh pure asset beta which is um the 1 2 36 and okay 23 1.236 here and for the second step of that part is So after that now we basically add the new debt bringing the total depth to 16 billion. We relever the the asset beta using the new capital structure which give us a new um higher equity beta of 1 35. And so here we calculate the new WAC. So when we calculate the new um AC with the new weights and the new cost of equity, our WAC barely moves falling to 11 20 here 11.20 the benefit from the cheap debt was almost entirely canceled out by the increased risk and cost of uh equity. Okay. And for part three, the project um specific risk validate is here's the notes. The firm is 11.22 average risk of all projects. Um should use a lower discount. Um, yeah. So, basically, as you guys can see from the notes, this brings us to the the validate stage, is the 11.22 the right rate for this 5 billion content investment. Um, it depends. The 11.22 WACC is an average of all Netflix operation. A safe US-based content um project is less risky and could use a lower uh hurdle rate. A new um international project is far riskier and must use a higher risk rate. And using using the wrong rate is is a major error. You could accidentally reject a good project or worse accept a bad one that destroys value. And here for our here I made a comparison for a pure like um just for the comparison of Netflix and Disney we have so Netflix is the business risk for Netflix is um is purely pure play streamer um Disney is diversify giant like parks merchandise and cruises and the capital structure is that Disney uses the depth tax shield. Netflix doesn't. So to basically evolve our analysis, we compare Netflix and Disney. Netflix here has 11.22 is much higher than Disney at a 8.2. So there are two clear reasons. business risk. Um, like I mentioned, Netflix is volatile, pure play streamer, so it like has a high beta and with Disney being diverse with stable cash flows from theme parks and all these cruise basically more cash flows, which gives it a lower beta. And secondly, capital structure. Disney is for capital structure. Disney Disney is 30% debt, meaning it takes full advantage of cheap uh cheap tax deductible debt. Netflix at only 6% does not. And here for for step five recommendation for the reflection is so Netflix is underleveraged. It relies too heavily on expenses um expensive equity 11.65 and not enough um cheap on debt the 4.58%. and the current WAC is too high. This hurdle rates put Netflix at a competitive advantage. Recommendation is Netflix should um increases its use of depth to optimize its capital uh structure. So this will lower its WA CC. Um also lower allows Netflix to probably outbid competitors for content and for more projects. um ultimately increasing value. So I think so I mean with my reflection here this brings me to where Netflix as this brings my analysis to show that Netflix is underlever it's leaving value of table by relying almost entirely on you know expensive expensive of equity and ignoring cheap and then tax advantage debt. So the high of the 1165 is a disadvantage and yeah I lower a powerful weapon. Um, it would lower the hurdle for investments allowing Netflix to bid outbid competitors and create shareholder values. And I also have a Google collab which I use Gemini to generate this small code which helps validate more accurate um information here. Thank you.",
  "video_url": "https://www.youtube.com/watch?v=g8hXqG1TCck"
}