{
  "student_name": "Matthew Sant'Anna",
  "org_defined_id": "037006517",
  "username": "mwsantan",
  "email": "",
  "transcript": "All right. So for the session 10 assignment, I am evalu evaluating the financial viability of the Starbucks flagship uh roster project by performing the following steps. Uh the the following driver steps. Um yeah, so a 12 million uh royary 10-year investment. We use the driver framework and a python provided by Gemini to um to model to determine if this project creates value for the company. Our hurdle rate or minimum accept acceptable return is 8.5% WACC. So, um, for my defined section, um, I'm going to look at the total initial cost, which is 12 million right here for the building and equipment plus 500,000 in starting working capital. Uh, our WACC, our discount rate, or in other terms is uh, 8.5% as you can see right there. And the goal is to confirm if the project's MPV is positive and its IRRa is above 8.5%. So that's what we're trying to figure out. So for our represent uh stage uh the the represent stage was the model design. We built a parameterized Python uh with the help of Gemini of course where every assumption was easy to change. So the key inputs for this section were the um we programmed in the 25% tax rate and a $40 uh% cost of goods and the $1.2 million annual uh depreciation. Um and you can see that to uh to calculate the incremental cash flow schedule as per the subtest instructions, we have the provided data from the Python uh code right here. And um as we scroll down more, we can see the CL the cash flow schedule right here. And we designed the model to calculate the net cash flow each year, making sure to include the description tax savings in the final year's terminal value and working capital recovery. And you can see the different uh the the years, the numbers. I really like having the the data tables to helps me connect the the numbers and the revenue for each year. for the implement stage. Um the result of our base uh case analysis, the net present value is 3,652 or sorry 3,65285 uh 352,856. Since this is positive, the project is expected to make 3.65 million in wealth for Starbucks. the IRRa in uh is 12.58%. This is significantly higher than our 8.5%. So the conclusion is finally the project is a clear accept because it was higher than our we anticipated which means they gain more money. And as we continue to scroll down, um we can see for the validate and evolve part uh the revenue risk. What if our revenue projections are 20% uh too high? Then the MPD plunges uh down to 2.39 million which will show extremely sensitive to revenue. A small drop turns a profitable project into a costly mistake. and the cost of capital risk. If our WACCC rises to 10.5%, the NPV is still is still a strong 2.2 1 million, which tells us that the project is robust against rising interest rates. And yeah, and again, it has the visual um representation just to help us help me better understand the the numbers that we plugged in and whatnot. just to give me a better idea of what we're looking at. And in summary, the the task um is asked to evaluate the financial financial viability of Starbucks flagship roster project and provide an accept or reject recommendation. So the financial viability based on the core capital budgeting metrics, the project appears financially viable under the initial assumptions. It has a positive net value NPV of 3.65 65 million an internal rate return of 14.25% which is above the WATC of 8.5 and a profit profitability index of 1.2 1.29 which is greater than one. The simple payback period is 4.99 years and the discounted payback period is 7.62 years both within the project's 10year lifespan. So what's what's the recommendation based off these uh this this data based off the initial analysis the project is recommendate recommended for acceptance the data analysis and key findings all necessary financial parameters including an initial capex of 12 million initial working capital of 500,000 8.5% and a corporate tax rate of 25% were successfully defined and initialized the incremental cash flow schedule a detailed incremental cash flow schedule from 0 to 10 years was successfully calculated incorporating this initial outlay. You can see the the numbers that we provided throughout the code right here. The sensitivity analysis a 20% reduction in project projected revenue would result in a negative NPV of 2.39 million indicating that the project becomes financially unviable under this scenario. And we had the analysis if the WACCC changes and you can see all those right here which I already explained and I added the visual vis visualization to help me better understand what's going on and yeah so the the project is strategically essential for brand premiumization and the customer experience providing the value that the MPV alone cannot fully capture. However, the high revenue sensitivity means we must immediately validate the market demand and develop contingency plans before breaking ground. We accept the project, but we won't but they'll need to manage the risk that comes with it. And yeah, so my insights and next steps, while the project shows financial strong promise with a positive NPV and an IR significantly higher than the WACC, it is, like I said, still highly sensitive. So, they're just going to have to manage the risk. The next steps that they could take is conduct a detailed market analysis to validate the revenue assumptions especially for the initial years and furthermore explore strategies to mitigate revenue related risks such as market diversification or contingency planning for sales of shortfalls. So yeah, that was my assignment and thank you.",
  "video_url": "https://youtu.be/6M-vwBcq-FQ"
}