{
  "student_name": "Ramon Randolph",
  "org_defined_id": "036002798",
  "username": "randol15",
  "video_url": "https://youtu.be/khWeRDU5vUE",
  "transcript": "All right. So, for today's assignment,\nwe're supposed to deliver evaluation of\nPanera for a KKR respective takeover\nusing driver. Um, combine the DCF,\ntrading comps, and precedent\ntransactions to produce an informed bid\nrange while contrasting financial buyer\ndiscipline with strategic buyer\nsynergies. Um here you can see our deal\nsnapshot\nand we want to create an executive level\nrecommendation that states your\nvaluation range winning bid strategy and\nrationale for choosing the financial\nversus strategic positioning.\nSo for our design and discover phase, we\nwant to know what enterprise value KKR\nshould bid for Cor for Panera such that\nthe deal clears financial buyer\ndiscipline and still is competitive\nversus strategic biders like Starbucks\nand McDonald's that may underwrite\nsynergies. Um snapshots once again up\nhere.\nUm the key underwriting tension is that\nthe financial buyer can improve\noperations but generally must assume\nlimited transformational oper uh\nsynergies no existing procurement no\nstore overlap and the strategic buyer\ncan rec recognize uh the GNA procurement\nand uh supply chain and digital platform\nand potentially real estate footprint\nand can just five pay above the sponsor\nvalue.\nSo for the represent stage uh this is\nour model. We need a multi DCF scenario\nbase the downside and the upside. We\nneed a 5-year operating forecast driven\nby revenue growth. EBID margin ramp and\nreinvestment working capital. And then\nwe need the terminal value via Gordon\ngrowth. For the trading comps we use EV\nand IBIDA as anchor. for restaurants,\nthe capital structure and lease\ndifferences and the P over E framework\nor P over E formula to cross check our\ngiven industry uh\nwe're given that 22 times um and then\nthe CMG and MCD are res are uh available\num for the president transactions we\nneed to anchor our case to the 12 to 15\ntimes D range and reference restaurant\nM&A Okay. Uh, Jersey Mike's,\nuh, Tropical Smoothie, Carols,\nand and in the video, we want to call\nout the exact multiples that vary by\ngrowth, franchising mix, and unit\neconomics. Um, and then for the football\nfield, since there's strategy bakes, we\nneed to produce a standalone sponsor\nvalue and an output bid range. Um, so\nfor our\nimplement stage,\nFor our implement stage, we have this\ncode. Um, and I had AI help me to add\nthis and we iterated it a few times. Um,\nbut\nbasically we'll we'll run it\nand go down to our result section.\nOkay.\nSo for our define and discover once\nagain we have the deal snapshot and then\nthis is our key the growth levers. Um so\nwe got the new stores in the next 5\nyears the digital nation going from 50\nto 70 the dinner and catering expansion\nand the early stage international\nrollout. And so how they flow into the\nmodel is the store growth scales revenue\nvia stores uh revenue based on the\nnumber of stores. Um and the digital mix\nincreases eB margin via the BPS uplift\nper 10% digital mix and the dinner\ncatering increases revenue via the main\nadditive uplifts factor each year and in\ninternational add incremental value to\nrevenue updraft beginning in year three\nrepresent. So our analysis plan\noperation projections and we convert\nunlevered free cash flows. Um and then\nfor the DCF scenarios down base and\nparameter toggles with multiple ranges.\nSo trading and precedent EBIDA and EV\nbands.\nUm and then for buy comparison\nstandalone versus strategic\nand the visual output scenario bars\nfootball field synergy sensitivity.\nSo here we have\nthe base downside and upside for each\nbuyer. So for and this is in the\nbillions. So for uh for KRR\nthe base is 13.8 billion. The downside\nis 9.72 billion and the upside is 16.9\nbillion. For McDonald's and uh Starbucks\nthe base is 15. So this 2 million uh or\ntwo billion right here is their\nstrategic\nsynergies and you see that in each of uh\neach the down in both the downside and\nupside as well. So the trading comps\nrange from 9 billion to 12 billion and\nthe precedent ranges from 10 billion to\n13.5 billion.\nUm so after we\nreflect on this, we have our base case\nfor the unlevered.\nUm\nno, okay. No, here here's our here's our\nbuyer and virtual use. Um so for\nMcDonald's, the strategic is 13.8.\nThe standalone EVs,\nand the synergy in the millions is 150\nmillion. Synergy Ibida\n300 million for McDonald's 250 for\nStarbucks and for KR it's only 75 and\nthe synergy value for KR is zero.\nUh it's high for\nfor um McDonald's and all and Starbucks,\nvery low for KRR. And as you can see\nhere,\nthis is our base cases\nand the base case with the leverage\nincluded. So the revenue from stores\npre-plift and this is the revenue from\nstores in the uplift. And you can see\nafter year three like we said before it\ndoes grow much faster than the previous\nrevenues.\nUh and we see the marginal uplift from\ndigital is much greater than the\nmarginal uplift catering. And now we see\nour base our comparisons values across\nthe ebid range. So the blue is the\ndownside, the orange is the base case\nand the green is the upside. And you see\nthat\nfor KRR they would have to bid on the\nupside for the value the valuation range\njust to make sure that they have a\ncompetitive bid or they have to bid much\nmore near the upside to make sure they\nhave a competitive bid for uh McDonald's\nand Starbucks to compensate for\nMcDonald's and Starbucks's strategic\nvaluations.\nUm here we have our base case which is\nright around\n15 million\nwith the precedents ranging from uh 13\nfrom high in the 13 million range to low\nin the 10 or high in the 10 million\nrange. The trading comps 9 million to\nhigh to near 13 million and the DCF\nranging from that high in the 9 million\nrange to almost 17 million.\nAnd so our synergy sensitivity\nis\nuh is greater here and it goes less\nhere. So we're seeing that the EV value\nis\nhas a high synergy run rate with the\nwith the EBITD for Starbucks\nand a lower synergy run rate with the\nrest of them. And so what we need to\nunderstand from this\nis where our KRR financials should place\ntheir where KRR financials should place\ntheir recommendations in the valuation\nrange and for that winning bid strategy\nand the rationale for choosing this\nuh for choosing this decision. So now\nthat we've taken a look at that,\nI'll give my recommendation.\nand then we'll go back and take a look\nat what the AI recommended as well.\nSo,\num I believe\njust based off looking at these charts\nthat to compensate for our lack of\nsynergistic effects in this uh that\nMcDonald's and Starbucks have, we need\nto go up near the 17 million range\nbecause as we can see for them\ntheir\ntheir upside range is in the 18 millions\nand their downside range is in the 15\nmillion and the base range is in the 15\nmillions. So, they're going to be doing\ntheir calculations\nmostly based on a little bit more than\nwhat they could make in the base case\nsince they do have those strategic uh\nstrategic advantage advantages and\noverlaps and can make\nsort of much more headway than we can in\nthat range.\nSo if we want to win this, we need to\nbid up in the 16 million range. But\nthat's only if we can rationalize that\nbased on the growth that we see that we\nwould see it experience. And I believe\nwe can simply based on how simply based\non how uh Panera is doing as a whole.\nUm and so now we'll go to the validate\nstage for the triangulation. It's the\nwho can play what discipline versus\nsynergies. Um and it's a clean way to\nrepresent this. The DCF is 5.9 billion\nto 14 billion. Um and trading comps 9\nbillion to 12.6 precedence 10.8 to 13.5.\nStandalone investment is 11 billion to\n12.8. uh lower end products downside\nwith multiple compression risks and\nupper end is still inside rushing just\nuh rushing just that 15% assuming we can\nactually deliver the walkway for the\nfinancial buyer should be 13.5 billion.\nSo like I said\nuh like I said before if we want to\ncompete with their strategic synergies\nthis is where we're going to have to\nbuild. we're going to have to buy if\nthey do their calculations based on a\nhigh return for based on a return\nbetween the base cases and the upsides.\nBut if they don't if they do it based on\nthe base case and the downsides, we\nmight have a chance with our 13 billion\n13 billion uh build bid. Otherwise, it's\nnot uh it's not a good decision.\nUm and so the for the strategic buyer\nvalue strategies they can justify paying\nmore if they can recapture eBay the\nsynergies McDonald's and Starbucks can\nachieve 100 to 250 150 million to 250\nmillion eBay the run rate synergies and\nthe value of synergies is roughly 112\nmillion to 188 million after tax\nleading to a 1.8 billion to 3 billion\nvalue uplift. So they could rationally\npay uh around 14.6 6 billion to 18\nbillion if the if the acritive\nintegration risk is manageable and\nthat's why uh they must been on\nstructure certainty of speed not on the\nhighest headline price like I said we\ndon't want to be paying that 16 billion\nhigh price\nuh to compete with these people we want\nto build bid based on uh a structure and\nmaking sure that we run the company well\nuh for certain making sure it's a\ncertain asset making for sure for\ncertain that it is an asset and not a\nliability.\nSo for KRR,\nour bid range 11.5 billion, 12 billion.\nThe hard walkway 3.5 billion. Unless we\nhave a credible synergy angle like a\nplatform asset we already control.\nWe need to win without overpaying. So we\nwant certainty, speed, and a clean\nclose, the diligence list, limited\nfinancing outs, strong lender package,\nand we want to roll over alignment. We\nwant that 10% rollover to lower cash\npaid and improve returns and the value\ncreation.\nWe want to push that digital mix to 70%.\nWith the dinner, catering and unit\ngrowth and labor productivity and skew\nsimplification. So basically downsizing\nwhat we make and making that better. Um\nand so the negotiating talking points,\nwe're underwriting fundamental cash\nflows. Strategics are underwriting\nsynergies we won't pay for synergies we\ncan't capture.\nThat's a good one simply because if\nyou're paying for stuff that you can't\ncapitalize on, you're just wasting\nmoney. Um, and our offer is high\ncertainty and respect to 12.5 or 12 to\n15% control market ban and we'll partner\nwith management via rollover and\nincentive ties to digital mix uh inner\nattach inner attach rate and new unit\nreinvest or ROIC.\nUm, so what this teacher does and what\nyou're looking for from our answers in\nthis and the sponsors will win by price\ndiscipline and structure, not by winning\nthe auction. Just bidding high amounts\nis a great way to lose money for your\ncompany. And if that's what you do as a\nmanager, you're going to get fired. Um,\nthe DCF is a truth engine, but constant\nprecedents define the market clearing\nzone. So that so DCF is what you want to\nlook for to make sure that okay this is\nthis is what they say and this is\nactually what happening what's happening\nbut these right here the comps and the\nprecedents define how we're how we want\nto look for stuff and how we can the\nsort of space that we can step into to\nmake our money.\nUm and the moment the process becomes\nstrategic versus sponsor, our job is to\nseparate value you can create by paying\nfor it by value someone else can create\nand and we don't want to pay for it. So\nlike we said before their synergies\ncreate uh 150 million to 250 million\num and we can't capture that value.\nAnd so if they're bidding based in this\nthis 14.6 6 billion to 15.8 billion\nrange. We if we want to win this bidding\nwar, we have to pay for something that\nwe can't capture. Uh value that we don't\nvalue that we can't um\nwe can't capitalize on. And so if they\ndo uh we we don't want that. And so\nwe're not going to worry about what\ntheir uh what their synergies cost. We\nneed to worry about what we can do.\nwhich is why our walkout price is 13\nbillion. Is that 13.5 billion? Unless\nuh unless we have something that can\ncreate this synergies, we don't need\nthat. And so we walk out with this 13.5\nbillion even though we have to bid up\nhere to win this.Um yeah, thank you"
}