{
  "student_name": "None None",
  "org_defined_id": "037407177",
  "username": "fsegurav",
  "video_url": "",
  "transcript": "So for the third mini project, I decided to create an earnings/reent news analyzer that would take stocks and create conclusions of some of their weakest points. For example, once again, I use a dart methodology. My goals for his for this was to create an app that can take advantage that can take the Alpha Vantage API and analyze recent stock news and earnings numbers to determine business's weakness and explain them in colloquial student English. I used tools like NADN, Alpha Vantage, tutorials, articles, and OpenAI API. And the sources were news and earnings reports. This is a flowchart of how the NAD should look like. It should receive a chat message from the user, send it to the AI agent, which will use tools like the Open AI API, simple memory, and the HTTP request or the Alpha Vantage Alpha Vantage API. So in the implementation, first we need to get the API keys. This is similar to the past mini project but here I'm using different keys. The first we only use the openi to create a simple agent. Now since we're implementing actual function we need to get a different API to get data from which is what the alpha vantage key. Then we link the API and their credentials as well as build the brain for the AI agent telling which URL to use for the alpha vantage API to replace the ticker based on the students input as well as other things. Then we set up the nodes and the flowchart functions.\n\nAnd then this is the output we got. For this first step, I wanted to make the pro the process just work to see if I could get an output to see if I could learn to use the alpha vanish API. So I just type directly in the chat some I asked the weaknesses for the sprouts farmers market stock, which is a stock I invest in. It gave me some EPS numbers and then for Microsoft and then I did for another one to see if it could change and provide for not something else and it did as well. These are all numbers from pulled from the alpha vantage API. So this concludes the first loop. The first loop what we can evolve from this is to link external output. So make it an even more developed tool. not only using external API to bring data but then output it into some sort of function to for the user so the user can use it in the real practice. I want I also want to make use of memory since this part of this tool in the original AI agent wasn't used this much for this particular one but it unlocks a lot of potential for it and so my reflections was since it's the second time using Edn I was a bit more efficient this was also due to practice and then I particularly had a hard time figuring out how to use the URLs for the API key the alpha vanish one it was made up a lot of different parts it looked like code I had never seen before And this sort of challenged me at first, but I was able to overcome it. Which leads us to our second driver loop. Once again, using D methodology, you can stack loops up loops upon yourself to go to go further on improving your product. So our goals for here is the same, but also we want to link an external product like sheets and have the output stored there neatly so the user can use it in real life, which is why you added Google Sheets to one of the tools. And then source also being the internal memory. It's a similar flowchart, but now we're adding a fourth tool. As you can see here, the Google Sheets connection\n\nwe're implementing. We add the new node so it matches the previous workflow we we determined. We set up the brain for the Google Sheets tool. We set up the credentials with the actual sheet and have it matched to the column set up already. And then this is our output. This is our first output. uh we asked for Microsoft again and then it has the weaknesses stored here in more of a colloquial English also using part of the AI brain to give a more serviceable output not just numbers but also practice practicable\neffects and how this would affect stock price for example it can say Microsoft has slowing growth in legacy segments like window and office licensing margin pressure from increased cost and investments in cloud and AI high and competitive pressures in Azure and gaming which are some of their divisions product divisions and then using the memory and the AI agent can format it in a way where when we prompted it to also use apples to determine some of Apple's weaknesses then it can it can copy the formatting of the first one and list a second one on top of it. So we can create a spreadsheet with information of a bunch of different stocks. And if we were to further develop the tool, then it could also go a third time and draw further conclusions and evaluate these weaknesses. For Apple, it's the supply chain challenges and production delays are some of its weaknesses as well as slow growth in iPhone sales, increased competition, rising cost in product innovation and services, and macroeconomic uncertainties impacting consumer demand. So some of the way we could involve this in a third loop for example would be to expand on the analysis using the AI itself to make other conclusions. Then we could also have learning model use other data and also have b f use further data from paid API subscriptions which was another hurdle I encountered. It was difficult to use the free version of the alpha manage API and if we were to further develop this tool for professional use a paid subscription could help. They have to use recent more recent and daily closing prices for example for stocks. So my reflections was this was a useful and rewarding tool and the driver methodology helped me develop and grow upon it. Once I had the first like skeleton version the second version was even better and it could go further on like that. Thank you."
}