{
  "student_name": "Chihiro Ueki",
  "org_defined_id": "034175099",
  "username": "ueki",
  "email": "",
  "transcript": "All right, let's talk Netflix. So for this pres uh video, it's a cost of capital analysis for Netflix. We're focused on calculating the appropriate investment hurdle rate for the $5 billion content project. So first I want to find and discover. So from the question I see that the market cap here is 200 billion. Market value of debt is 13 billion. Um the equity beta is 1.3. The risk-free rate is 4.5% and the corporate tax rate is 20%. As well as the yield on the triple B plus bonds 5.8% and the market risk premium of 5.5%. Next, we want to show how to calculate the cost of equity which implicates the CAPM by taking the risk-free rate and adding the risk premium. So, it' be the 4.5%. plus the 1.3 times the 5.5% market risk premium. And then next here after that to calculate the cost of debt after tax, we would do one minus the tax rate. So it would be the debt yield times one minus the tax rate. So you can get these numbers here as well. Next, the two variables here of unlever data and rollover data uses an equation to accurately model how changing the capital structure impacts equity risk. So, we take, you know, D and E up here, plug it in, we find what needs to be done that we'll get into a little bit later. So first we wanted to do the current WACC calculation. So the cost of um equity which is K is calculated here because you take the RF rate current and the MRP. So it' be 4.5% plus 1.3 * 5.5%. Which if we run the code gives you 11.65%. Next, for the after tax cost of debt, it would be 4.58%. As you can see here, because you would take the 5.8% times the 1 minus 0.21 from the numbers given within the problem and then waiting these cost yields a current whack of 11.23%. Which is our initial hurdle rate. And then we also calculated the weight of debt here as you can see. And then next for the whack after the $3 billion debt um issuance. Here's that one. So you just take the um asset beta which is 1.23. Oh, wait. Uh the the pure B business risk is 1.23 and then the within with the change in the beta, it changing to 1.35. And so this higher beta increases the new cost of equity to 11.91% as you can see in this code. But because of the benefit of a cheaper tax shielded debt, the new whack actually drops slightly to 11.19%. And this confirms that the debt issuance is a financially sound decision as it lowers the firm's overall capital by 0.4%. You can see the change in whack here with the new rack and the change in whack, which is basically what I was touching earlier. Next, in terms of qualitative analysis, the output confirms a single rate is inadequate at 11.22%. For a course prospects like core US content, but for the international content, we could see that um it has a higher currency and political risk. So, we have to use an adjusted higher discount rate. So, for instance, adding a 2% risk premium or bring the hurdle rate to 13.23% for these high-risk markets. Then next we can see here we compare the Netflix whack which is 11.23 to the Disney whack of 8.20 that was given. So because Disney's lower whack, we would say that it's due to lower business risks or diversified revenue and a more optimized capital structure, higher debt and maximizing tax shield, which is basically the reason why that is. And then finally um from the output here, I made a chart for sensitivity analysis as a visualization. So first the optimal f financing strategy is that uh the $3 billion debt insurance has to be a case. So we take the difference in the scenario from above and just plug all these numbers in find the new beta K whack all those numbers and then we come here and as we uh move the whack down we could see that the debt to value ratio uh goes down as we go down. And so to just reflect on all that, we would say that the debt issuance lowered the whack, indicating Netflix is underleveraged. And then a recommendation would be to utilize strategic debt financing.",
  "video_url": "https://youtu.be/m-ZquiYqEew"
}