{
  "student_name": "Lal Thang",
  "org_defined_id": "038073978",
  "username": "lbthang",
  "email": "",
  "transcript": "Hello guys, my name is Law. For today's video, we're on session 10 or assignment 10. Um cost of for their assignment is cost of capital analysis. Um so we were for Simon overview evaluate Starbucks proposed flagship rose three that requires a 12 million upfront outlay and expected to operate for 10 years use the firm use the firm's 8.5 WACC as the hurdle rate to determine whether the project creates value and recommended and recommend and accept slash reject decisions supported by driver um documentmentations. And here for the parameters for the project is initial investment um 12 million for building equipment and training. Depreciation is straight over 10 years. Our working capital is 500,000 deployed at launch and recovered in 10 years. Revenue is 8 million in one year, 11 million in two to five years, 9 million in six to 10 years. Operating cost is COGS 40% of revenue. Labor 2.5 million, rent and utilities.8 million, marketing is 0.3 million in a year, then 0 million thereafter, and then taxes 25% corporate rate and terminal value 3 million at the end of 10 year. Okay. So with our pro for this assignment, we're going to use the driver framework as it tells us to do supported by drive um driver documentation. So to begin the define and discover phase, uh I have isolated the critical variables from the project brief to ensure our model inputs are accurate. So basically summarizing this, we have a 10ear time horizont. Initial outlay is 12 million for the asset and 500,000 for working capital we are using Starbucks WACC of 8.5 as our as our discount rate and then on the tax side we have a the 25% corporate tax rate right here the asset depreciates to zero over 10 years meaning the 3 million here ter terminal value in 10 year will be fully taxable as capital gain. All right. So to begin all this, we're going to go through our So this is what I went through from our notes and our project operation cost the revenue schedule here. We will see. So this is the numbers for the operating project operations like what I went over and then for the and moving to the represent phase I have mapped out the logic for the cash flow model. I will structure this by calculating the operation um the operating cost cash flow first. So I will calculate EBIT by subtracting the um the COGS, labor, rent, marketing and depre depreciation from revenue. Then I will calculate NOPAD which is net operating profit after tax and add back the non-cash uh depreations charge. And then finally here I will uh adjust the final capex and the initial capex and the working capital recovery in 10 years to arrive well in 10 years to arrive at a free cash flow FCFC which is here for the step three for the firm and for the implement I have a python on which well now for basically I used Google collab which I will show you guys here in a minute. Um what basically I'm doing is I'm using the collab to primitize these um variables. This allows for dynamic sensitivity analysis later. And I am building a schedule for I guess zero years through the 10 years. So if we go here and here's the first code that I went through which gives us all our number and so this is for the represent oh no this is for the implement I'm sorry I believe we were on the implement Yes. So that is for the implementation. Okay. All right. After the implement driver, it is to validate. Okay. Let me open up my notes. Okay. So for the validate base which I also um so in the validate phase I am calculating the core metrics to check the project's health. Um I am looking for a positive MPV and an IRR higher than our 8.5 hurdle rate that was given to us. And I also have uh code as well for it too which is here. Our second code here. So this model validates successfully. We see a positive um MPV of 12.6 million and an irr of 12.84% 84% and our simple payback of six years which is well above the cost of capital and for okay and for five to evolve this far I have the chart here as you guys can see the stress test model stress testing model that we were supposed to do in in the assignment. So to evolve the analysis I am I ran a sensitivity test. The assignment um asks us to stress test at 20% reduction in revenue and variance in the WACCC. This allow us to see if uh if the project remains viable under important conditions. And interestingly enough with with our results here the sensitiv um analysis reveals a critical risk. If revenue drops by 20% the MPV turns negative approximately negative 645K this indicates the project has a high operating leverage and I believe I also have a code on here. So that is for our evolve section. All right. And for our reflect and so finally I will reflect on the findings to provide a recommendation of what we should do about the project. I recommend accepting the project um financial justification because the base case MVP is we see here in our validate as we see here it is 2.6 million our MVP is 2.6 six and with a with an irr of 1284 significant significantly claiming the 8.5% hurdle rate but however for the risk in the strategy is um the decision is not without risk our sensitivity analysis shows that a 20% Drop in revenue destroys value. Therefore, while we should accept the project for its brand value and high upside, management must uh slowly control labor and rent costs in the first two years to pro protect against lower than expected demand. And I think for that is pretty much it and that will be it for this um assignment. Thank you for watching.",
  "video_url": "https://www.youtube.com/watch?v=can8gLbh0VE"
}