{
  "student_name": "Ryan Swann",
  "org_defined_id": "037338799",
  "username": "swannr",
  "video_url": "https://youtu.be/15W-3h4Ea5g",
  "transcript": "0:00 Hello, my name is Ryan Swan, and today I'm going to be going over my cornerstone project. Getting right into it, uh, for my define.\n0:12 Retail investors and early career analysis consistently seem to be stocks that move sharply without understanding why. Financial news is fragmented, overly technical, and often contradictory.\n0:26 The problem I wanted to solve was simple. How can someone quickly understand what most people want to without needing Bloomberg, Terminal, or DeepMarket expertise.\n0:41 This tool is built for people who want clarity and not just random noise. Moving into my represent, my approach was to combine two things humans struggle to do quickly.\n0:54 First, scan multiple sources of market context, headlines, price movement, and timing, and then second, synthesize that information into a clear, disciplined explanation.\n1:07 I used an AI language model, not to predict prices, but to explain market behavior, which is a much more realistic and useful task.\n1:16 I deliberately built this in stages, and proving the prompt as I learned what worked and what didn't work. With that being said, I'm going to get right into showing what my project is.\n1:32 So, for my first loop, here is a screenshot of the my app. I started with the simplest possible version. The app takes a stock ticker, a date, a price change, and recent news headlines and asks the AI to explain why the stock moved.\n1:51 This version works. It worked technically, but the output had problems. The AI was overly confident, sometimes speculative, and not always clear about uncertainty.\n2:01 That was expected, but this version existed only to prove the pipeline worked end-to-end. So, as you can see, we pick our stock, it gives like our usual breakdowns, the volume, the p-ratio, the market cap, the price, and then on the side it gives us all of our recent headlines.\n2:23 Many of them. Uh, websites like Yahoo Finance do this, but I want to combine it all into a much easier app.\n2:30 Uh, and then for the main part of what my app is doing is getting this, uh, analyst's insight, which for the first prompt was a bulky parachute.\n2:51 Uh, and then for the second part of what my app is doing is getting uh, analyst's to my second loop.\n2:58 Uh, I focused on usefulness and control. I defined the audience as a retail investor and forced plain English, limited length, and explicitly allowed the AI to say when the call was unclear.\n3:14 I also structured the output into bullet points with a short summary. This dramatically improved readability and trust. Users could quickly scan the explanation and understand what mattered and what didn't.\n3:28 Uh, very similar to our first loop, here's the stock with the information, but then for our analytical insight, it's bullet points, much clearer to read, and just a lot easier to comprehend.\n3:44 However, this was not perfect, or not exactly what I wanted quite yet, so I continued on to my third loop.\n4:00 Here's my third and final loop. Uh, in the final version, I treated this like a real financial product. The AI is required to separate confirmed drivers from uncertain factors, avoid, and inventing facts, and clearly state its confidence level.\n4:22 The output is fully structured, what likely drove the move, what's less certain, a confidence rating, a one-sentence takeaway. This version doesn't just explain a stock move, it communicates it analytically, judgment, which is what actually matters in finance.\n4:39 So, as we can see, what likely drove the move is an insight we were given. What's less certain, so something that we're not completely sure about, or the AI is not completely sure on, but still is important to mention.\n4:52 And then it gives us our confidence level, and a key takeaway. Both of these make it a lot easier to understand the stock you want to search up, and is what makes this tool so important.\n5:04 Also, under this, another screenshot from my app, is a generated analysis viewful report. What this does is when you open it, it gives you a much larger breakdown of all its reasoning, all the insights.\n5:19 Less important. The more important ones said with more financial terminology, that might be harder for some to understand. This moves me into my ValidBank account.\n5:36 I tested this with a few of my classmates, and the feedback was consistent. It helped them understand market moves faster and with less confusion than reading multiple articles.\n5:51 That confirmed that it tool solves a real problem and is a helpful tool that can help many people understand the financial movement of the stock market.\n6:04 This moves me into my evolve stage. This project could easily be extended to earning specific explanations, macro events, or sector-wide moves, but for this assignment, I focused on shipping a simple, reliable core product.\n6:22 Moving into my final and last stage. The biggest lesson was that building with AI is less about model choice and more about constraint, structure, and iteration.\n6:35 Early versions technically worked, but weren't trustworthy, and the final version worked because it could. It respected uncertainty and enforced discipline.\n6:44 This project taught me how to build AI systems that assist judgment instead of replacing it. Overall, this project helped me, once again, see the importance of AI, especially in the financial world of just truly understanding why certain factors affect markets and why some don't.\n7:06 Overall, this project helped me see AI's importance as well as how I can use AI to improve my financial literacy and understanding.7:19 Thank you."
}