{
  "student_name": "None None",
  "org_defined_id": "035859682",
  "username": "kschmel",
  "video_url": "",
  "transcript": "for my session three or session to end of project mini project. Um I decided to do a balance sheet. Uh this can be beefed up as much as you want, but I decided to do just a simple entry since I've never done anything like this before in AI. Um so first I built my balance sheet net layout. So, I wanted the date, a general category, the income and expense, and then I set it to also calculate the net income. So, that way you sort of know how much you have coming in, how much you have going out at the end of the day. Um, so this is definitely a learning curve for me. Um, and there was a lot that I didn't know about after watching the video. I sort of fumbled my way through a learning different tools. Initially, I was actually going to do a different uh concept, but that proved to be way too complicated out of my league, and I needed to start with a much more simple idea to get used to this kind of AI agent building things. Um, so for this I hooked it up to Gemini, had a simple memory and then in the entry tool\n\num I laid out um that is linked to the balance sheet and then it automatically defines all these different variables in the Excel. in the spreadsheet I have it calculating um net income manually so that it'll just be magic in there. Um\n\nso that was that one and then I used Gemini to help me come up with a good prompt for the AI agent. Um so here's the prompt. Identifying that the responsibilities are extracting the factors of um the date, what category things go into, income, expenses, and noting that if it's not specified is automatically zero. Um, and then this was one of the tricks that we learned in the video. So, I want to include that in here cuz that definitely helps. And then, um, using the entry tool since that's what we attach to it. Uh, I had tried to use another tool like in addition to that and that just sort of complicated things a little bit more than necessary. So, I'm sticking with just the one tool for this. Um, and then it steps through some other things and uh, it does ask for has responses set up. So, I'll show in a minute. If you don't give any indication whether it's an income or expense, uh, then it'll ask it. So, I'll just run through a quick few examples here. Um, so if I say if I just say um like today's date and I don't say what kind of income or expense it is, I just say uh like money moved\n\nuh 100\n\ndollar sign. Then it's going to think and the prompt the amount is 100. What was an income or expense and what is the category? So I can say it was an expense\n\nto Venmo.\n\nSo then it thinks and it goes and it says everything's successful. And over here I get a date pops up for today and Venmo an expense of 100 and our net income is here. So let's say I wanted to log maybe a lot of things at one time. I can say today's expenditures or today's um cash flows.\n\nWe can say paycheck\n\nof 1,500\n\nand then let's say groceries\n\nwas 150 and then we can say um went shopping and spent 75. five.\n\nSo, I threw a bunch of stuff at it, but it's going to go back and it's going to think through a lot of different things and then at the end it'll show up as a three separate um it automatically went to side hustles here and then Venmo and shopping. Well, let's see what it said. income, expense, and expense. So, um, yeah, there's definitely a lot more that you can do with this. You can create more outputs. You can, uh, have AI create new categories or try and add calculations within AI. if you want to like take pictures of receipts and have that go into the chatbot. Um, that could add for an interesting way to record everything. Um, yeah. And then one other thing I wanted it to do is if you have a previous expense. So let's say I forgot to log something from two days ago. I can say uh went out to dinner on 1027 2025 or $30.\n\nSo again, it'll go through here. Workflow successful. It says is recorded this expense, which is what it is. And it pops up right here. So yeah, that's my quick little personal project here.\nI was definitely able to use some experience from previous projects, and, I'm happy to see how my understanding has grown for AI tools like this."
}