{
  "student_name": "Tirth Patel",
  "org_defined_id": "037647601",
  "username": "pate2347",
  "video_url": "https://youtu.be/nliS1-JLtvQ",
  "transcript": "Hi, my name is T Patel and in this video I'm going to be going over session six or sorry session 11 section six for corporate finance uh decision and analysis. So the assignment overview we have is that we're going to evaluate Apple Apple's hypothetical 90 billion dollar share repurchase using the driver framework act as an independent analyst who may determine or must determine whether the buyback creates value relative to the alternative use of cash while balancing stakeholders and incentives. So the capital allocations snapshot we have here is that liquidity is 165 billion cash investments 100 billion annual free cash flow market context of 185 price share P& of 30 dividend yield of 0.5% 15.5 share billion shares outstanding a balance sheet of 110 billion in debt burkshare owns 6% CEO holds three million shares retail investors for average 100 shares. Employees have $170 worth of strike options. The proposal is that a $90 billion buyback executed over one year about 10% of the market cap. Alternatives is a $6 special dividend strategic AI/VR acquisition debt reduction incremental um research and development. So for this assignment, we're going to be de delivering a recommendation that explains stakeholders impacts and agency uh consideration value creation verse value transformation or sorry transfer outcomes and this we're going to use the driver framework and I'll be presenting that in the video. So that's slide.\n\nAll right. Right here. So we're going to be using the driver framework. So in the define stage of the driver framework, I'm going to structure the analysis um of this assignment. I'm going to be framing the decision and identifying the stakeholders before doing any calculations. So Apple's capital allocation snapshot in this is that the liquidity is 165 billion in cash investments about aundred billion annual cash flow. I already said that the market context was already covered with 80085 and a P& of 30 dividend yields 15.5 billion shares outstanding and also a balance sheet of $110 billion of debt which is going to be important. The ownership details were already covered. Bergkshire Hathaway owns 6% Apple CEO owns 3 million shares and retail investors hold I think an average of 100 shares. Employees also have a $170 price uh strike price price strike price and the proposal we're evaluating is $90 $90 billion share buyback executed over one year. alternatives use of 90 billion. We must compare $6 special dividend to the $90 billion buyback a/vr\n\nacquisition 12% um ro I or we can reduce debt instead of using the money and then we're going to do an R&D of 15% long run. This is all going to be modeled and calculated using um Python code a Python model generated by AI a mix of CHBT and Gemini. So this assignment basically asks me as an independent analyst to quantify the stakeholders outcomes for the buyback retail shareholders institution holders like Birkshare management employees and options and bond holders. It's also asked me to compare the buyback to the dividend between all these options. And it's going to also ask me to evaluate the value creation versus value transfer if we do a buyback rather than other um options. And we're also going to discuss agency issues, government implication, signaling effects, market perception, and long-term allocation disciplin. So this was going to be the define stage. I'm going to move to discover stage. So conceptually we're going to be doing I'll use a capital structure and leverage that changes risk return trade-off and that we'll see how that affects WACC also ROIC and value creation acquisition and research developments only create value if ROIC is greater than the cost of capital. We're also going to look at EPS mechanics buybacks increase EPS if net income stays consistent by reducing the share account. So agency theory that um we have is that management incentives usually the stock base pay can bias towards buybacks that boost EPS and stock price. shareholders versus respond holders. Equity holders may prefer aggressive payouts or riskier um sorry or riskier uh investments while bond holders are more safely invest and don't like using as much leverage. So the signaling theory is going to be that buybacks, dividends, and debt reduction each and send different signals about Apple's confidence and opportunity set and risk tolerance. On the stakeholder side, I'll explicitly tackle retail shoulders retail shareholders holding 100 uh holding 100 shares, institutional holders representing represented by Birkshshire Hathaway stake management via CEOs $3 million shares or 3 million shares and then Apple employees via a pool of $170 price, bond holders through the debt and leverage matrix. Now that I've covered all the concept and the key components of this task, I will use um AI to model and design all of this. And then also I'm going to be using this to implement um and run the model. So let's see if I can find the okay, I don't see the represent slide here, but I'll go over the representation stage of the driver framework really briefly. And the represent stage I map the case into a transparent Python model. Um,\n\nfirst I set the baseline to let's see I could go to\n\nso I set the baseline to 185 shares outstanding to 15.5 billion PE ratio to 30 and then so baseline's going to be it's not calculated here but it's going to be 6.17 net income all that is going to be done with this code so I'm going to move to the implementation stage um the represent stage is going to be later in uh shown with all the results of this implementation stage okay let me run this and this implement the code generated by a mix of AI and Gemini has all the information we stated in discover and define stage and it's going to help us get to a decision.\n\nSee here, let's see. All right\n\nscenario. Okay, here we can go over the baseline setup.\n\nSo the price, the outstanding, the market cap, the approximate net income, baseline EPS, debt at 4%. And then this is the EPS under different capital allocation scenarios which we covered in the textbook and we were asked to cover. So the baseline the buyback EPS is higher for um AIVR acquisition and also longterm long long run uh research and development while the other ones were less and then leverage under different capital allocation scenarios. So the leverage is significantly lower for debt reduction because we're lowering the debt obviously instead of spending it on other sources. So I'm going to go over basic scenarios and the results of those scenarios that AI um or this Python model gives us. So the baseline the EP EPS is 6.17 leverage is 3.69% 69% debt retail share value Berkshire owns 6% co value is roughly.56 billion employee option value is 75 billion that's the baseline now if we perform the buyback this is what the EPS goes to 6.7 or 6.37 the leverage increases slightly the debt stays the same because we don't touch anything with the debt the share value roughly stays the same. Berkshare ownership goes up a little bit and then CEO equity value stays the same because the CEO isn't directly doing anything. And then employee option value or stays roughly the same. But I feel like that would we could ask\n\nGemini this because I feel like if\n\nUm, if a company does a buyback for stocks, will the employee strike price increase? Because I feel like if the company buys back stocks Oh, okay.\n\nAll right. So, the strike price is All right. Yeah. Yeah, that makes sense. So, the strike price stays the same. It is not affected by that. If it was regular stocks, that would be a different story. All right, that makes a lot more sense. So, let's go to special dividend situation or the scenario. Total $6 per share, I believe it was. So, the total dividend is about $93 billion. EPA remains at 6.17. Leverage is leverage increases because Apple's cash cushion is small, leaving debts the same.\n\ncompared to the base. Wait, leverage stays the same actually. And then retail value 18. Retail is the same. The port share ownership is the same.\n\nSo retail and institutional shareholders receive immediate cash, but ownership percent stay the same because there's nothing being added or removed. They're just getting money. All right, if we go to the AI VR acquisition scenario, it's 6 86 EPS is increased\n\nI believe um with a 90 bill $90 billion investment with a 12% RYC generates 10.8% in incremental net income. EPA rises to roughly 6.86 or 6.87% 87% or dollars and then leverage remains similar as debt doesn't change in this scenario. Um leverage also remains similar to the previous stages as debt doesn't change in this scenario and then debt reduction.\n\nIf we move to the debt reduction uh scenario EPS is 6.34 leverage decreases significantly because we paid off the debt. the debt is inc decreased by 90 billion the amount um we would use in different scenarios for different things everything else stays the same because the only thing reduced was the debt and the scenario the R&D long run EPS increases to 7.04 04. The leverage stays the same because the debt is the same. The shares, everything else is constant because nothing else is affected by that besides the EPS. In year one, long run, I would assume no immediate effect on the EPS impact. Net income and EPS would reim around the same. In the long run, a 15% ROIC according to AI on the $90 billion ad adds around a 13.5 billion net income pushing EPS around to 7.4 four or $74, the highest EPS among all scenarios.\n\nAnd then this chart reflects all of the things uh we got from the scenarios, especially the leverage and the EPS, which they're considerably the most important things.\n\nSo in the validate stage I went over the representation stage with these charts and graphs and then I also went over the implementation stage with running this code and getting the results from different scenarios. I feel like we can move on to the validity stage. I will check the numbers and whether uh they make sense from a financial standpoint. I'll use the modus parameters to run a quick sensitivity test. If I lower the RO\n\num so if I lower the ROIC here, let's\n\nroed.\n\nOkay.\n\nWhat happens when ROIC is lowered?\n\nOkay, that makes sense. So, if I lower the ROIC on the AI/VR acquisition from 12% to around 8%, the EPS advantage strengths because we're getting less return on investment and acquisition becomes less attractive to buybacks. If I raise ROIC and uh return uh research and development, the long run EPS becomes more dominant and forcing a higher value for that scenario. If I raise also interpret the results through agency and government perspective, a large buyback would boost EPS and the stock price can be attractive to management whose compensation is tied to stock-based incentives. This is a classy uh agency issue. Bond holders may prefer debt reduction because it strengthens coverage and lowers default risk. However, for a company like Apple, that chances are also just relatively low in general. Retail investors might prefer a special dividend if they want cash immediately, but long-term holders may prefer high ROIC investment in acquisitions or R&D. the layer in signaling and market perception. Then I layer um all this results in signaling and market perception. A $90 billion buyback signals a strong confidence and a limited alternative high risk or high return projects market might let's go back to the slideshow real quick.\n\nOkay. Yeah. So, a $90 billion buyback signals strong confidence and limited alternatives to high return projects. Markets might take the EPS boost but question long-term reinvestment discipline. A large um research and development or a large acquisition results signal a commitment to strategic growth and innovation, but markets might worry about um execution of risk, a high risk or high debt ratio. And then a debt reduction seems like a safe um\n\nseems like a safe option. However, this signals\n\nthis signals low innovation. This signals conservativism a balance sheet strength which rating agencies and long-term institutions typically prefer but retail traders do not because they want a faster higher growing um return. From a capital allocation discipline uh discipline standpoint, a policy of doing mass buybacks in all environments can look like a short termism and raise governance questions. My model output lines up with these frameworks. The trade-offs between the value creation, value transfer between risk taking stability are clear. So in the VOLve I think about how this approach scales behind beyond this case on a technical side I could extend the Python model to pull Apple's real data from financial APIs and add multi-year projections for free cash flow and simulate buybacks programs over time. I could also build a interface with scenario toggles for CFOs to explore capital allocation strategies live on the finance side. The same structure can be used to analyze and share repurchase decisions for other large caps. M&A versus buybacks versus dividends and real firms. Impact of agency issues and governance on value creation. This satisfies the rubrics finance\n\nand technology integration. All right. So after covering all of that and also\n\num the evolve stage, I'm going to move to the reflect and final recommendation for me after doing all these calculations using AI to go through the driver framework as well as using AI to help me simulate a model to get a decision. So finally in the reflect stage I synthesize synthe synthesize the results and make a recommendation. So first does the $90 billion buyback create value or does it transfer? The model shows the modest EP uplift from a let's see\n\nlet's see so a model shows that a EPS from 6.17 to a 6.3 7 if Apple's stock is fairly valued this is a large value transfer from shelling from selling shareholders to non-elling shareholders and toward shareholders who pay is linked to EPS's stock price, the management and some institutional investors. Second, how do the alternatives stack up? The special dividend gives immediate cash to all the shareholders but no EPS improvement and higher leverage or constant leverage. Um the AI/VR acquisition with a 12% return on investment, capital investment generates materially higher EPS and supports strategic positioning. And this is a genuine value creation if the ROI assumption holds. Debt reduction to 20 billion sharply lowers the leverage modestly lifts the EPS and clear benefit bond holding and rating supports long-term financial resistance. But it may not be apparent that the company is doing anything um worth innovation wise. Incremental re research and development has the highest long run EPS $74 represents the biggest value creation opportunity but the delay payoff and ex execution risk.\nUm the third stockholder and agency perspectives retailer shareholders benefit from dividends and long run investments. Buybacks mainly help if remained invested. Institution holders like Burkshare benefit from buybacks that increase their ownership concentration and long run. EPS management and employees with stocks and options benefit heavily from buybacks and EPS boosts raising agency concerns about over reliance on repurchases. Bond holders and credit rating agencies favor debt reduction and dislike aggressive buybacks that raise leverage obviously because that's going to be a negative for them if Apple ever defaults. My recommendation based on this model and financial theory is that Apple should not allocate the full $90 billion exclusively to buybacks. The choice skews too heavily to short-term EPS and agency driven um incentives. A more disciplined and balanced capital allocation policy would be 40% to buybacks, 30% to RIC and then 30% to incremental uh research and development. Apple can complete this over time and ongoing gradual debt reduction to maintain a strong balance sheet. This concludes my driver-based uh corporate financial decision of what Apple should do with this 90 billion buyback proposal and what I think of it. Thank you for watching."
}