{
  "student_name": "Ryan McNamara",
  "org_defined_id": "037202820",
  "username": "mcnama34",
  "email": "",
  "transcript": "Hello everyone, and welcome to this analysis of Netflixs financial strategy. How does a giant like Netflix decide whether a massive 5 billion content investment is financially smart? They dont just guess. They use a critical metric called the Weighted Average Cost of Capital, or WACC. Shutterstock . WACC is the fundamental tool for capital budgeting. It represents the minimum rate of return a company must earn on its existing asset base to satisfy all of its creditors and shareholders. Think of it as the hurdle rateif a projects expected return is lower than the WACC, it destroys value; if its higher, it creates value. The WACC is a blended cost, calculated using this formula: WACC equals E divided by V times Re plus D divided by V times Rd times one minus T. Lets quickly break down the key inputs we need for Netflix: one, Cost of Equity Re: This is the return required by shareholders, calculated using the Capital Asset Pricing Model CAPM. Two, Cost of Debt Rd: This is the interest rate paid to bondholders, adjusted for the corporate tax shield one minus T. Three, Capital Structure Weights E divided by V and D divided by V: These are the proportional market values of Equity and Debt. A company can change its WACC by adjusting either the Costs e.g., improving their credit rating or, more commonly, by adjusting the Weights—that is, changing the mix of debt versus equity in their capital structure. Lets move to the calculations, which you can see running here in the Google Colab file. First, the Cost of Equity Re. We use the assignment inputs: a risk-free rate of 4.5%, a Market Risk Premium of 5.5%, and Netflixs high beta of 1.3. Re equals 4.5% plus 1.3 times 5.5% equals 11.65%. That 11.65% is the return Netflix must promise its shareholders. This high cost is driven primarily by the high beta, which signals high systematic risk compared to the overall market. Next, the Capital Structure. Netflixs current market value of equity is 200 billion and debt is 13 billion, making its total value 213 billion. This results in an extremely equity-heavy structure: Equity Weight is 93.90% and Debt Weight is 6.10%. Plugging all of this into the WACC formula gives us Netflixs current hurdle rate: Current WACC approximately 11.22%. The hypothetical 5 billion content investment is partially financed by 3 billion in new debt. By taking on this debt, Netflixs debt-to-value ratio slightly increases from 6.10% to 7.41%. Because debt is cheaper and offers a tax shield, this shift slightly reduces the overall cost of capital. The WACC falls to 11.13%. While a small change, it demonstrates how shifting the capital mix can instantly create value. Now, the strategic question: Should Netflix use this 11.13% WACC to discount all projects? The answer is a definitive No. A single, firm-wide WACC is generally inappropriate because it fails to account for the risk of the specific investment. . For example: US Content is lower risk mature market, stable cash flows and should be discounted at a rate below 11.13%. International Content is higher risk currency, political, and regulatory risks and should be discounted at a rate above 11.13%. Using a blended rate would lead Netflix to over-accept risky international projects and over-reject safer domestic ones. Netflix must use a risk-adjusted WACC for each project. Next, we compare Netflix to its peers. Netflixs WACC of 11.22% is much higher than competitors like Disney 8.2% and the general industry range 8.0% to 10.0%. The differences are explained by two main factors: one, Systematic Risk: Netflixs high Beta 1.3 reflects its exposure as a high-growth, high-expenditure company, resulting in a high Cost of Equity. Two, Capital Structure: Disney uses significantly more debt 30% than Netflix 6.10%. Since debt is cheaper and offers a tax shield, Disneys higher leverage efficiently lowers its overall WACC. Netflix is currently employing a highly conservative, equity-heavy financing strategy. While this reduces bankruptcy risk, it results in a very high WACC, which makes every content deal more expensive. Our Sensitivity Analysis in the Colab file demonstrates the financial benefit of increasing leverage. As the debt-to-value ratio increases from 6.10% up to 40% assuming the cost of debt remains stable for a low-leveraged firm, the WACC consistently falls. . This is because Netflix is not fully utilizing the debt tax shield. The Recommendation: Netflix should strategically increase its debt usage toward the lower end of its industry peers, targeting a debt-to-value ratio of 15% to 20%. Moving to a more optimized capital structure will lower the WACC, making the 5 billion content investment, and all future projects, cheaper and more value-accretive for shareholders. This strategic use of debt is the key to minimizing the hurdle rate and sustaining Netflixs global growth. Thank you for watching.",
  "video_url": ""
}