{
  "student_name": "Meher Vig",
  "org_defined_id": "037300863",
  "username": "vigm",
  "email": "",
  "transcript": "Hi, my name is Meher and today I will be presenting a weighted average cost of capital analysis for Netflix focusing on the financial implications of their proposed $5 billion content investment. So our primary goal is to determine an appropriate discount rate for this investment or hurdle rate. Um and we will be calculating both the current WACC which is weighted average cost of capital and and the walk WACC after a 3 billion debt issuance. This analysis strictly adheres to the driver framework starting with defining our parameters and moving through implication validation and a strategic reflection on optimal capital structure. So as we completed the first step of the driver framework define and discover we will move on to the next step which is represent. So here all calculations are based on provided hypothetical data and the key inputs are a marketable cap of 200 billion um 200 billion and a current market debt of 13 billion. For our cost of equity, we are using a high equity beta high equity beta of 1.3 reflecting Netflix's non cyclical but high growth high-risk risk profile. We use the cost asset pricing model in uh capital asset pricing model inputs a risk-free risk rate of 4.5% and a market risk premium of 5.5%. For the cost of debt we will be using the BBB plus uh yield rate of 5.8 the bond yield rate of 5.8 8% and and a 21% corporate tax rate is essential for calculating the after tax cost and the value of the debt tax shield. So the represent stage confirms our financial approach. So the core formula is the weighted average of the after cost of debt and the and the cost of equity. So by their market values, our cost of equity is determined using the capital asset pricing model linking Netflix's specific risk, which is beta, to the market's required return. And the cost of debt um must be taken after tax reflecting the interest tax shield depth's primary advantage over equity. So we're committed to using market values for our capital structure weights as these reflect the true value of funds supplied by investors. So now here we are in the implement um stage uh for the model for the current uh WACC scenario. So we will be using collab for all these calculations. So first the cost of equity is calculated by 4.5% plus 1.3 * 5.5% yielding 11.65% which is a high cost reflecting the beta of 1.3. So here we can see the 11.65% 65%. For the cost of equity and then the after cost debt of debt cost of debt is much lower at 4.58%. And the calculation is done by 5.8% * 1 - 0.21 0.21. So we put in all these formulas into um collab uh with the help of Gemini and we are receiving the calculations and given the current market values capital um Netflix capital structure is 93.9% equity and only 6.1% debt. So this is highly conservative. Combining these components, Netflix's current weighted average um with WACC is calculated as 11.19%. This is our initial hurdle rate. So now we modeled the impact of the proposed 3 billion debt issuance. The new depth increases the total depth component to 16 billion which is uh slightly increasing the depth weight to 7.4%. As we see in the Python Python output the higher percentage of cheaper depth results and a slightly lower overall WACC of 11.9%. This small reduction about nine basis points confirms the value of the debt tax shield. But the structure uh remains heavily equity weighted. So this increased leverage slightly lowers it to 11.10%. So now we will move on to the validate stage of the driver framework and we validate our result by comparing Netflix to its peers. So our WACC of 11.19% is at the high end of the media industry range which is around 8 to 10% and s significantly higher than Disney which is a competitor in pure comparison um of 8.2%. So the difference with Disney is primarily due to capital structure. Disney uses 30% debt, taking full advantage of the cheaper DEB financing while Netflix is barely leveraged. So more importantly for the $5 billion content decision we must use project specific walks WCC's um the firmwide 11.19% is too low for the high-risk international content and potentially too high for predictable US content. So the investment should be split and discounted through using appropriate hurdle rates that reflect the project beta. Now we will move on to evolve which is the next step of the driver framework. The evolve stage focuses on optimization. Netflix has substantial unused depth capacity. Our analysis shows that moving from 6% to 7.4% depth lowered the WACC. We project that increasing the depth ratio closer to the industry average of 20% to 30% would significantly reduce the overall WACC. We re recommend targeting a more leveraged structure to achieve WCC closer to 9 to 10%. This lower hurdle rate would make more content projects like the $5 billion investment which passed the net present value MPV test increasing growth potential. So in our last stage of the driver framework reflect um we will make a conclusion with the summary of our findings. So, in conclusion, our driver analysis successfively determined Netflix's current WACC at 11.19% confirming its position as a conservatively financed company with a high hurdle rate. The key finding is the need for strategic leverage. The proposed $3 billion debt is a step in the right direction, but Netflix should continue to optimize its capital structure. This process reinforced that WCC is more than just a calculation. It is the minimum required return to satisfy all investors and managing um and managing it is crucial for corporate strategy and investment decision making. I recommend proceeding with a $3 billion debt and adopting the project specific WACCC's for the $5 billion content portfolio. Thank you.",
  "video_url": "https://www.youtube.com/watch?v=zX6ue8tAmQU"
}