{
  "student_name": "None None",
  "org_defined_id": "036132121",
  "username": "ajervis",
  "video_url": "",
  "transcript": "Hello everyone my name is Alejandro Jervis and today I'm presenting my AI Finance Advisor, a tool I created for the Advanced AI Integration project that aims to push beyond what traditional financial calculators do. Instead of simply outputting numbers, this system uses AI to understand personal context, explain financial concepts in clear language, and guide users with insights that feel personalized to their situation.\n\n I built the tool using the DRIVER framework, beginning with the Discover phase, where I recognized that many people aren't just looking for formulas—they need a financial companion that can adapt to their goals, preferences, and risk tolerance. During the Reason phase, I focused on how AI can interpret natural language questions, analyze user data, and translate complex ideas into meaningful explanations. In Implement, I used the Base44 platform to bring these capabilities to life and structured the tool around features that users can interact with intuitively. The experience starts with setting up a personalized profile where users enter essential details like age, income, expenses, savings, investments, debt, experience level, and financial goals—such as saving $80,000 for a house in five years. This persistent profile becomes the foundation for every recommendation the AI provides.\n The Dashboard then offers a clear financial snapshot showing net worth, savings, debt, and investment totals, paired with a Financial Health Score that evaluates emergency fund status, savings rate, debt-to-income ratio, and investment allocation. This acts as a built-in guardrail that gives users a sense of where they stand before they even ask a question. The AI Chat Advisor is the core of the platform—users can type questions like \"What's my financial health?\" or \"Should I pay off debt or invest?\" and the system responds by referencing their exact numbers, breaking down the reasoning behind each answer, and including educational disclaimers for transparency and safety. \nThe Scenario Comparison tool showcases multi-step reasoning by evaluating two choices side by side—like investing $10,000 in an S&P 500 index fund versus individual tech stocks—and turning that analysis into structured outputs that include pros and cons, risks, projected outcomes, confidence levels, and clearly stated assumptions. To support financial education, the Concept Explainer translates complicated ideas into simple explanations matched to the user's experience level, and now includes stronger S&P 500 integration—for example, if you ask \"What is diversification?\" or \"What is dollar-cost averaging?\", the AI provides explanations using the S&P 500 as a familiar benchmark, showing how regular contributions to a broad, diversified index like the S&P 500 can smooth out volatility over time, why the index is widely used as a market indicator, and how many investors rely on it for long-term compounding. It also gives real-world S&P 500 scenarios, common mistakes people make when investing in index funds, actionable next steps, and related concepts for a guided learning path. \n\nThe Market Insights tool integrates external data to produce real-time outlooks on topics like the S&P 500, emphasizing current sentiment, major drivers affecting the index such as inflation reports or tech-sector momentum, potential opportunities and risks, long-term historical trends, and how S&P 500 performance aligns with the user's risk profile. The tool also explains how investors often use the S&P 500 as a reference point for gauging market health or comparing portfolio performance, and it provides confidence scores on every outlook to help the user understand uncertainty. Across the entire tool, advanced capabilities such as multi-step reasoning, structured JSON outputs, external data integration, persistent memory, and strong guardrails work together to ensure clarity, accuracy, and user safety.\n\n For validation, I tested the system with real-life scenarios involving retirement planning, debt payoff strategies, and investment decisions, confirming that the AI stays grounded without hallucinating numbers or giving inappropriate guarantees. Looking ahead, I see opportunities to evolve the tool further by connecting to brokerage accounts, enabling document uploads for tax or budget analysis, and helping users track progress toward their financial goals over time. Reflecting on the process, I learned that building with AI shifts the challenge from writing formulas to designing prompts, schemas, and reasoning frameworks that guide the AI toward safe, helpful, and personalized responses.\n Overall, this AI Finance Advisor demonstrates how AI can become more than a chatbot—it can serve as a thoughtful financial companion that understands each user, explains concepts clearly, and presents structured trade-offs with transparency and responsibility."
}