{
  "student_name": "Leon Francis",
  "org_defined_id": "037379655",
  "username": "franc103",
  "email": "",
  "transcript": "This is my response for homework 9. So let us start off with the define and discover stage. So our goal for this assignment is to perform a deep analysis of Netflix using the weighted average cost of capital method for a $5 billion content investment decision. Now let us look at the key information. So if we go back to the textbook, we see that we obviously the overview of what we have to do. So calculate the weighted average cost of capital and hypothetical 5 billion content investment decision. We also have some financial parameters of Netflix itself. So the values, the debt it has, the beta value, corporate tax and stock prices and many more. And I'll get back or get into a few of them in the represent stage. So here is our required analysis and each of these um analysis you know components will be done within the various stages of the driver framework. So let us start off with the represent stage here. I just wanted to take a moment to synthesize the information that we're giving so that we have a solid foundation to work upon so that we can have a better and concrete analysis to reach our goal more efficiently. So we have all the code but it's a pretty simple code because it's just taking in all the information and presenting it to us in a printed format. So here we go Netflix um WACC analysis input data summary. So we have the market value of equity and this just refers to the investments or financial investments from the ownership or the stockholders and how much that accounts for for Netflix. So we have $200 billion. We have the market value of debt itself which accounts for so loans or accounts payable and those type of things that accounts for $13 billion. So therefore the total firm value is the sum of the market value of equity and the market value of debt which gives us $213 billion. Here we have the capital structure rates which is the weight of equity and the weight of debt. So it's just a percentage to see how much equity and debt forms of the total firm value. So we see that the equity which was 200 billion forms 93.9% of the 213 billion whereas debt only forms 3.1%. And this can also be called the debt to value ratio ratio. Additionally we have the cost and risk inputs. So we have the beta value which shows how much the stocks or the Netflix Netflix stock values move relative to the market and the higher it is or the more it moves relative to the market and the lower it is the less likely it is to move similar to the market. So we have the pre-tax cost of debt we have the corporate tax rate how much it's applied to be 25%. You have the risk-free rate and you have the market risk premium which is the how much um investors will ask for on average to invest in a risky uh stock and additionally we have the bond rating and the media industry uh V range. Let us now move on to the implement stage. Here we want actually want to focus on calculating the weighted average cost of capital for Netflix. We want to secondly look at um I just want to look at the tasks. So we have to calculate the current um you know whack. We also have to calculate the whack after the $3 billion investment in insurance and we want to compare the whack with a competitor which is Disney. So if we go back to the code we see all the different formulas and information used. So first off all this information was given to us. the 200 million billion dollar uh equity value, the debt 13 billion and the current value 213 billion. We have all the rates given. So let us start off by looking at the whack equation itself. So if we just go back to the top, we should be able to see the equation for the weighted average cost of capital. There we go. So this is the clear formula that we'll be using throughout the assignment. So it takes in the market value of equity, the market value of debt, which we know what it is, the total firm value, cost of equity, pre-tax, cost of debit, corporate tax, and we'll also be using the capital asset pricing model, which we'll get into when calculating the cost of equity. So if you go back here, first off, you want to calculate the cost of equity using the CAPM uh equation. So we have the equ representing this and then the risk-free rate plus the beta value times the market risk premium. Another equation I want to focus on is the after tax cost of debt. So that refers to this component. the current real um on company bonds and comparable debt or RD in other words and the equation for that is the pre-tax cost of debt times 1 minus the corporate tax rate and lastly we have the actual whack calculation itself so E divided by V times the uh cost or cost of equity plus uh the debt to value ratio times the after tax cost of debt and further a few more calculations and this is for the second scenario of the $3 billion debt and insurance investment. So if you go back to the print statement or the output we clearly see the cost of equity value based on our current which means no investments made yet. So 11.65% 65% in the after tax cost of debt was 4.58 and then the current W value was 11.22%. And here's the equation shown. And then after the $3 billion debt insurance, our VC actually decreases by 0.09 percentage points. So giving us the result of 11.13%. So here's a table that just summarizes everything and actually compares it to Disney. So we have, you know, all the different components we calculated for, but we also have the current whack and the post insurance whack. So 11.2% which rounded out is 11.22 and 11.13. However, the DisneyWAC which accounts for 70% from the ST stockholders and you know you know investors and a high 30% of debt and their whack is actually much lower of 8.2%. So here's a quick summary. So Netflix's whack is significantly higher than Disney's primarily because the capital structure. Netflix debt weight is only 6.1% which is you know as I said very low compared to Disney's 30%. And then we have a new component called the tax shield. So the minimal use of that means Netflix captures only a small tax shield benefit. And a tax shield benefit essentially looks at the taxable income of a company and how much tax can actually be applied because there are different brackets of tax and when you discount or remove the tax uh the tax amounts you get a lower taxable income which is what Disney's leveraging to have the lower black. We also have the risk profile. Netflix's high equity beta 1.3 suggests a higher systematic risk than Disney's broader, more diversified portfolio, which includes media, movies, parks, and other cases, which leads to a higher cost of equity, which was 11.65%. To validate, I want to just focus on the calculations as we know the calculations can determine a lot. So that's why I took extra care to look into the calculations and focused on finding certain ways to u you know verify the whack but that was not possible. So therefore I just focus on ensuring all the data values are correct and all the components used in formulas actually make sense. Now I want to move on to the evolve stage. So here the main tasks I want to focus on involve um comp doing a comparative optimal structure analysis to identify the um actually I can show you what this focuses on. Yeah. So I want to focus on evaluating the project specific which is US content versus international content and then recommend optimal capital structure strategy. So this code is a bit more complex because there's a lot going on, but essentially it's just working with the same data that we calculated and we were given and it's going to evaluate the project specific which is based on the current rates um you know the weight of the equity and rate of debt and we have all the calculations and print statements here but essentially I I actually want to look at the output because it be much easier to explain it from that. So our first task was to find the project specific evaluation content investment. Right? So we have the US content which actually has a lower risk than beta. Um this is just an assumed value um from Gemini for analysis purposes and the international content is actually set to be higher uh or a higher project hurdle rate which is a whack of 12.25% and the whack of 10.44%. 44%. For each of these two different segments that we're looking into for Netflix. So here is the comparative optimal structure analysis. So we're actually going to look at the whack values compared to the debt to value ratios ratios. Sorry. So here is a quick um back sensitivity to capital structure leverage graph and it's similar to what it look should look like because it should be U curved but we can see how the initial without the investment insurance our rack was 11.22%. But according to that our debt to value ratio that was used in the equation as I said debt to value ratio is a component used in the calculation of whack it was actually uh around 6.1%. We can see yep current state 6.1%. for post insurance that a post insurance we have a lower V which is actually better and I'll explain why it is better in a few a moments but our debt to value ratio is actually higher which makes sense because our debt has increased by three billion and even though they might be here the optimal structure is actually around 10% and I'll explain why that is so strategic recommendations the optimal capital structure which is a minimum back is achieved at the ADV ratio of approximately you know 9.98 or around 10%. And under current stage Netflix is 6.1 in debt as I said and post debt insurance state Netflix moves to 7.4 debt and this is how I talked about you know the debt increasing with the insurance purchase. So since moving from 6.1% to 7.4% 4% the debt to value ratio. This actually decreases the whack and taking additional debt is immediately beneficial as it moves the firm closer to its optimal structure which is around this curve that we see right here. Long-term continuing to strate strategically increase the debt to capture the full tax shield will help reach the optimal debt to uh value ratio. So by taking the um insurance essentially what happens is uh the whack values essentially lower and why that makes why that's better is that whack acts as a symbolize or a symbol for you know perceived risk and the higher the VA the higher the perceived risk. So that's just a quick insight into what the VA values mean and how the values actually make up how the companies are per perceived by the investors. So by having a lower back value, you're actually attracting more investors to implement their uh income or inflow of money into Netflix. And by doing this $3 billion investment in debt or investment in insurance there the Netflix is actually getting closer to the optimal vac curve simulated back curve. As we see the simulated V curve is a table of values and it's just what the V value would be um if the debt to value ratios keep increasing you know the more debt you're taking compared to the value you have invested. So overall we see that you know investing $3 billion in insurance would actually be beneficial for Netflix in terms of the reducing the weighted average cost of capital which should make them more um attractive to investors because the perceived risk as I showed you here is actually lower. So um yeah so another thing is that a lower back allows a company to invest in new projects and opportunities at a lower cost. So this is essentially a good step step to take and it provides us with a comp and this assignment provides us with a comprehensive understanding and insight into how we can use whack debt to value ratios and capital structure leverages to identify if taking a step financially could be good for the company or not. and equations such as the capital asset pricing model and the weighted average cost of capital just help make more informed decisions when it comes to making financial decisions for a company and overall I think it was a good exercise to understand how people in companies actually make decisions based on uh financial calculations. Thank you.",
  "video_url": "https://youtu.be/0kTXSnxBjGY"
}