{
  "student_name": "Ella Brummet",
  "org_defined_id": "037237297",
  "username": "ebrumme",
  "email": "",
  "transcript": "Hello, my name is Ella Brummet and today I'm going to be walking you through my session 8 assignment. So, let's go ahead and let's get started. So, um throughout this assignment, I'm going to be using the driver framework to um talk about this case study and what I found. Um and yeah, so let's go ahead and let's dive into this. So um essentially for my Dstage or the define and discover stage um I just kind of um analyze the information that was given to me. So um for example um the information given was that the GameStop stocks traded at 4 cents in August of 2020 and after some research I determined this to be incorrect data. So the GME stock price in August of 2020 ranged between a low of approximately 1.04 or $14 and a high of approximately $167. So basically this confirms that the um 4 cent claim is inaccurate by a factor of over 25 times wrong. So, this is really important when going in to some of the other information that was provided. Um, like for example, in August 2020, they were like pretty low, like near bankruptcy. Yes. Because it was like again between just a dollar, like stock price when Moch was like a stable market price be four and $5. Um, and then it also said like in September 2020, Ryan Cohen buys a 13% stake. So then the price is going to increase a little bit. Um, the January of 2021. This is also a really important factor because this is like the whole Reddit um driven surge where like the price is spiking, the stock price is like insanely high because there was like rumors that it was going to be really high. So people are willing to invest which kind of caused it all just to go crazy and inflate a little bit. And then um and then 2022 to 2024 uh we are back in the postevent stabilization. So the stock price is kind of normal out and it's evened out to its normal um to a normal stock price range for a pretty well-known company. So for the represent stage or the R stage um we're going to talk about the EHM form. So this is basically three categories. So it's like weak, semi- strong or strong. So basically our weak past prices can't predict future returns. So essentially we can't base any of our analysis off of it because it's just it's a weak um form. So semi- strong is that the prices reflect public information. So like if there is a rumor that um GameStop price is going to increase and so people want to get in on it so then they can make a little bit more money on the return. And then the strong would be prices reflect all information. So this would be public and private. Um which is essentially just the opposite of weak. basically the prices are going to like um be able to determine like if everyone knows about what's going to happen and all of that. So next is the behavioral biases to examine. So um there's like hurting behavior which is really important um to make sure we're examining throughout this uh driver stage um overconfidence and confirmation bias. um some FOMO, the fear of missing out um and maybe missing out on a great price or a great return from the stock. So there's that and then there's limits to arbit arbitrage. So we're moving in now to the implement stage. So the implement Oh wait, I'm sorry. No, we're not. We're still in the um represent. So now I'm going to talk about the formulas that I used um for the financial model in analyzing um this case study. So first with the financial models and formulas, the first one I used was the capin model which shows the expected return on estimation. So this is really important because it kind of talks about like the expected return and then like it goes into like our risk-free rate, our market return and then the systematic risk that the company has. So basically, it's a baseline of what returns should have been back in 2020 when the stock price was ranging in August at like $167 um per share. So the second one was abnormal return and cumulative abnormal return. So the abnormal return or AR uh measures deviations between the actual and expected. So essentially when we calculate this we needed to make sure um like just because um a return is expected to be high doesn't mean that it actually is. So it was really important to analyze what people were actually getting um in return. Then we have the cumulative abnormal return which is C and basically this is just across the event window. So they basically indicate that new information was not immediately incorporated to prices. So like in this case it was like the Reddit information which is suggests that this company has a semi strong uh EMH validation which is important to note. Um, and then there's also the market model, which this was interesting to me because I hadn't really heard of it um before like this chapter. And this was just an alternative to the CAPM um like formula. So basically, it's just um a different way to um do the risk-free rate like if it can't be determined or estimated. So um I thought that was really important to know. And then there's also the weak form I efficiency. Um and this was about the Durban and Watson information that was given. So basically um the test like if the past returns predict our future return. So basically we're winning this. This is from the weak form efficiency because weak is based on our past. Um and then it kind of goes into the Durban Watson statistic which again I not really heard of this before this chapter. Um and um basically it's a simplified test for autocorrelation. So basically it's saying if it's two there's no auto correlation and it's going to support efficiency which is really good. And then if it's less than two it's a positive um autocorrelation. So basically there's going to be momentum or predictability for the company. So my implement stage um is in collab which should be able to pull up really quick. is basically what it was doing was just talking about like the Python um code and um using like different financial sites is what I did to kind of um walk through these calculations um which was really helpful and I know I just walked through them um like explaining what they were but basically what my code did here was it analyzed um the actual code and um plugged in some numbers to see our return rate and all that which is super great and super helpful. Okay, next is our validate stage. So basically what I did was I checked the analysis um like valid validity. So um basically I did the data sources which were Yahoo Finance verified and then my stat statistical results are um reproducible in Python. So basically I was just talking about my code is already in there. So basically I can just run it again and that would be how that would work. I'm also cross-checked the event timing versus news reports which was done also in the Python code just to make sure that like our information is correct and then abnormal returns are um statistically significant because this would support our in um inefficiency claim. So this was really important because I think it was like making sure that we knew that the stock price was not actually 4 cents um played a really big role into making sure we had these correct information and the correct calculations. So then our next step in the evolve um basically this was just kind of some other things that we could do that might help us better understand. So this is like market efficiency doing a binary binary test um information pro processing rapid or rational um a profitability which I thought this was interesting and then behavioral finance and then an analysis approach. So more financial models, integrated financial behavioral primary driver, like all of these things I think could maybe make um our um case a little bit stronger if I like if you like were to dive a little bit deeper into it. And then la um the next stage, the last stage um we're going to be reflecting. So I didn't really I didn't really know a lot about the EMH limitations. So the real markets that um deviate during high attention events and social media implications. So I didn't really understand that there was like a really strong or like a really weak um I just kind of thought like it just kind of just fluctuated with the market. Um and I didn't really know there was like a specific category for those things. Um also um I learned that the behavioral finance actually explains like our GameStop stock better. um and which is really interesting. Also, there's investor implications. So, these short-term inefficiencies exist, but they're not systematically exploitable, which I think that was also super something that was important to note for me. And then lastly, the policy um implications. So, highlights the need for the market circuit breakers and transparency and trading restrictions. So, um I learned a lot from this assignment. I learned so many new formulas that I definitely think I'm going to be able to implement. And so my other financial classes that I have to take um and getting a better understanding of this like case study um instead of just doing like an assignment, I think it was a really great way to dive deeper into the finance world. So thank you so much",
  "video_url": "https://youtu.be/KsfAaKZJxOA"
}