{
  "student_name": "None None",
  "org_defined_id": "036002798",
  "username": "randol15",
  "video_url": "",
  "transcript": "Right. So for today's project, we are to\nbuild a AI assistant that helps us track\nfinancial tools. Um, so some of the\nbasic stuff that we could do for it is\nearnings call translators, financial\nhealth advisors, finance concept tutors,\nand then a risk concept interviewer. Um,\nwe wanted it to have\nwe wanted to have uh a platform of our\nchoice and it uses AI to explain, advise\nand analyze our\nfinancial queries.\nUm, we want structured outputs,\nmemory state that influences Rex,\nrecommendations,\nscenario comparisons with trade-offs and\na recommendation.\nUm, we want safety and accuracy, clear\ndisclaimers like this isn't a this isn't\num this isn't a professional, this is\nAI, and at least one accuracy and\nrobustness mechanism.\nSo those are our requirements and here I\nhave my AI. So I use chat GBT to create\nmy own GPT uh chatbot.\nAnd here you can see my main prompt.\nIt's like your core responsibilities.\nStart everything by asking these three\nquestions. What's your risk level?\nWhat's your investment horizon? What's\nthe goal? How much money are you\ninvesting? And are there any\nrestrictions? Um and it classifies the\nuser profile and provides example for\nallocations.\nUm and then after that\nuh there are other broad categories but\nit states that this is an allocation\nhelp you learn. It's not it's not\nadvice. Um, and then had to teach an\nassembly or simple student friendly\nlanguage because I wanted it to be sort\nof an educational tool along with like a\ntool to help you visualize your time\nhorizons and all of that. And so it\nteaches all those concepts.\nUm, and there's a bit more there's not\nreally strict formulas in this. So\nthere's like a bit of balance between\nthe risk tolerance and I gave an\nexample. So it's a balance between risk\ntolerance and time horizons or amount of\nmoney and all of that. And yeah, that's\nthe main uh that's the main sort of\nmode. And then after that I I you used\nit a little bit and then I went back to\nthe suggestions that Chad BT had for me\nsort of keeping it\nmoving it better towards where I wanted\nit to be. Um stuff like this taking a\nmore advisory role include something\nabout small stocks focus on investing\ncompanies and how each sector could\nbenefit. And so here is one of my\nprompts and it was show me a balanced\nportfolio with real market visuals for\nsomeone who wants to invest for 5 years\nversus somebody who wants to invest for\n10 years. So it has what's your modeling\nthe S&P 500 represented with with\ndividends reinvested bonds by US Trevory\nand a balanced portfolio is 60% stocks\n40% bonds like the classic diversified\nmix. Um, it has a couple of images you\ncan open\nbased on the\nuh based on the stocks and graphs you\ncould. So here you see the S&P 500\nreturns. Uh this is based on Bloomberg.\nSo this is the growth in dollars growth\nof $1 invested in January 1926.\nSo just see how much that uh like that\nsort of time value of money is worth.\nAnd this is the chart one portfolios\nfrom January to 1995 to June\n30th of 2021. And so over this 5ear span\nand then it'll have what it shows you.\nSo it says over this 5ear span the stock\nportion of the S&P tends to dominate\nreturn potential. Historically holding\nstocks for 5 years significantly in uh\nincrease the chance of earning. And then\nit shows you where you see this and you\ncan go to this link and it'll tell you\nuh and you can read this article. So\nit's like\nvery educational in that if you want to\nknow more about this, it lets you see\nits sources so you can read it for\nyourself. Um then going down this is the\n5-year portfolio and then the 10ear\nportfolio. Once again, more more um more\ncharts, more graphs\nand then what it shows you power of\ncompounding interest becomes more\nevident. This portfolio tends to show a\nsmoother growth curve, less roller\ncoaster, more gradual climb. We learned\nthe time horizon matters. With the\n5-year, you get a mix of growth and\nvolatility. The 10-year there's less\nimpact of short-term dips and potential\nfor better returns. Uh here are\ndisclaimers. These are using historical\ndata shows what has happened not what\nwill happen. Past performance is not a\nguarantee. So those uh sort of strong\nlike this is just in the past. These are\nnot recommendations for you. Um and then\nI have it sort of generate some\nhelpful things to visualize what you\nwant to do for later. Um and yeah,\nthat's my AI assistant.Thank you."
}