{
  "student_name": "Siri Surapaneni",
  "org_defined_id": "037411103",
  "username": "surapan2",
  "email": "",
  "transcript": "Today we are going to do our session 9 assignment and we're first going to go over the assignment overview and then we're going to go over final findings then talk about the financial concepts and actually dive in deep to those all while while using driver framework to guide our analysis and our process and then we'll answer a few questions in the very end. So first going over the assignment, we are want to calculate the weighted average cost of capital WACCC for Netflix in connection with the hypo hypothetical $5 billion billion content investment decision and my analysis will determine current WACC evaluate the impact of additional debt financing assess project specific versus firmwide discount rates and compare Netflix's cost of capital to industry peers. So, we're given the Netflix's hypothetical financial parameters, market conditions, and the strategic context all in the problem. And then we're supposed to find the current WACC, the WACC after three billion debt debt insurance, and evaluate the project specific WACC, compare Netflix's to Disney's, and recommend optimal capital capital structure strategy. Now that I've went over the problem, we're going to actually go into our analysis. First going to go over the final answers, like I said. So, here's my small executive summary. The current WACC for Netflix is 11.22%. The WACC after $3 billion debt is 11.2%. So, it went down to 002%. The project specific WACC is using the 11.22% from WACC for US content. use a higher risk risk adjusted WACCC like 12 to 14% for international content due to the greater political and currency risks in other countries. And then the peer comparison Netflix's is 11.22 like I mentioned it's significantly higher than its competitors Disney's as Disney's is at 8.2%. And the reason for this that I'll get into deeper later is it's driven by Netflix's higher risk profile. It has a beta 1.3 which is high and it's lower use a cheaper debt financing. And my strategic recommendation is to finance this investment using the proposed three billion in debt because Netflix is currently undervalued and strategically increasing its debt will lower its overall WACC which is a positive sign. So now the define and discover this is basically just everything that was stated in our textbook for this assignment. So we have again the problem, the context, the data and parameters that I was using and the an analytical questions so I can make sure I'm getting all my needed answers from the code. Now representing we need to understand what type of model we want to use and our core financial model today is the weighted average cost of capital WACC like I've been mentioning and the formula is the central framework and this is the formula right here. I copied and pasted it from the textbook. So here we have E is the market value of equity. D is the market value of debt. V is E. V equals E plus D and that's what the EV here symbolizes. The RE is the cost of equity. The R P is a pre-tax cost of debt. And the T is the corporate tax rate. So for the RE right here, this is a smaller formula for it. And then using the CAPM model which we talked about in the section 8 assignment. And the RD is the current yield on company bonds or comparable debt. So as there's different comp components inside of the CAPM model, there's other calculations that we need to do alongside that we need to solve the cost of equity which is a K of E and that we will use that using the CAPM model that again we talked about more in session 8 assignment. So I won't go as deep into it this assignment but here is the formula for cost equity right here. And the cost of debt K of D is the pre-tax cost of debt is given as the yield on existing bonds 5.8% in the problem and the relevant cost is at the after tax cost. So the after tax K of D equals K of D * 1 minus T. The capital structure weights E of V and D of V that I mentioned you need to use the market values for that. So the V= E plus D total firm value and then the E divided by V is the weight of equity and the D / V is the weight of debt. So now my analytical plan is to calculate this the K which is the cost of equity in the CAPM calculate the after tax K of D calculate the total value of V in the market value weights of E / V and D / V combine all those components into the WACC formula which is our final calculation. So all that will be done in the code and the new debt scenario is where we have 3 billion more in debt. So the the debt the new debt is 13 billion plus 3 billion which is 16 billion and the new E is 200 billion and the new V is 216 billion. And also the new risk beta relevering the new debt will slightly increase financial risk. So we must unlever the current beta to find the asset theta BU V of U and then relever based on the new D / E ratio. And those formulas can be seen right here. the new cost of equity, the K of E new recalculate CAPM with a new relever beta of course and then same thing with the new WACC and then the qualitative analysis is discussing the project risk divisional WACC and pure differences based on capital structure and business models and forming that strategic recommendation which we will do later in my analysis and video today. So implementing this of course this stage is where I'm going to show you the Python code using Google Collab and also the financial analysis. I have just also the written out financial analysis to prove these financial concepts are really well in my brain and just easy for anyone else to understand as well. All these formulas are in the code which I'll show. But I also want to just quickly go over the calculations. I already mentioned the formulas for all these. So I'll just say the value specific to the problem input into the formulas. So the cost of equity which is the return investors require on their equity given its risk. The math for that is 4.5% plus 1.3 * 5.5 and that gives 11.65%. And that means Netflix shareholders demand on 11.65% 65% annual return accounting for the 4.5 they could get risk-f free plus a 7.15% premium for burying their specific beta market risk holding Netflix stocks and that's where all those numbers come from. So I'm going to do that for the rest of them. Now the math for the after tax cost of debt which is the true cost of debt as interest payments are tax deduct deductible. The math is 5.8 time 1 minus 0.21 which gets 4.58%. And that that means while fix 5.8% in interest the two 21% tax deduction the T makes the effective cost only 4.58%. Now market value weights these are important because they reflect the current value of cost of capital. The total value is E plus D. So 200 billion plus 13 which gets 213 billion. The equity weight E / B 200 divided by 213 equ= 93.9%. Debt weight is D / E. So 13 divided by the 213 = 6.1%. So now the big calculation, the whole reason we're doing this problem is the WACC. The math for that is a 93.9% which is the value from right here times 11.65% 65% which is the cost of equity plus 6.1% which is the debt weight times 4.58% which is that after tax KD equals the 10.94 or plus 0.28% which is 11.2% 22% sorry which is what we mentioned in the very beginning and what that means 11.22% is Netflix corporate hurdle rate and a new project of average risk must be forecast to return at least 11.22 22% to create value for shareholders. So it's a nice value that tells what we need to go above to have a successful return. Now for the capital structure analysis, the impact of 3 billion additional debt, the Python script, which I'll get into now, shows some of this information, then we'll go and further analyze all this stuff. So here's the code. What we've been waiting for. Here we have the input parameters all the values that were given in the problem right here and then we can change those values if needed. The calculation for the current WAC here we go this is the formula that I just explained how to this is the cost equity formula that we went over. This is the after tax cost of debt formula. Here are the market value weights that we calculated by hand already. And then here we have the WACC formula. the premise of today's assignment and then we have the calculation of the after three billion debt. So we just have the new values new debt the new weight equity new weight debt all that stuff and then here we have to relever the beta as required. So we had to unlever the current beta, relever the beta with the new d / e r ratio. Calculate the cost to equity with this formula. Calculate the new wacc which is shown right here with this formula. After we after we relever the date, we also did a sensitivity analysis always helps enhance and elevate and evolve our analysis which is part of the driver framework. E and driver. So we have a sensitivity framework to see how it changes. And then here is our output. So we have the all the calculations for the current WACC calculation that we went over. All these values match up what we found by hand. So we know our data and our code is correct. And then we have the final value here. And then we have a similar format for the after 3 billion debt in issuance. And then we have the new values including the unlevered beta of 1.2365% the new levered equity of beta 1.314 7% and then also the new WACC of course which is 11.2% 2% which is better because it's lower which is a key part and you can also see here the change which is a small change but still matters because it's less and then for the sensitivity analysis on the current WACCC we have the sensitivity to market risk premium which is an MRP of 4.5% gets a WACC of 10%. Currently it's at 5.5% MRP so that's where you see the 1.22 2 and for an RP a greater MRP of 6.5% you see a WACC of 12.44% 44%. So you know lower MRP is a lower WACCC. And you see the same thing for the equity beta beta which I don't really need to get into. Now going back into our deeper analysis we have here the new debt of course is 16 billion with the added 3 billion. The new total value is 200 billion plus 16 billion. Equity plus debt 216. And then we calculate the EV E divided by V D / V the same way. I won't get into that but the change in cost of equity beta relevering that's a new concept that we get into in this part so I'm going to explain that further the adding debt increases the financial risk for equity holders debt gets paid first this increased risk weight raises the equity beta and so we first find the asset beta the unlevered beta which is a risk of Netflix's business with no debt so the B of U is calculated as 1.3 divided by 1 + 1 - 0.21 21 times the 13 divided by the 200 which gets you 1.236%. We then relever this asset beta using the new D / E ratio and that B of new beta is 1.236% the acid beta* 1 + 1 - 0.2 * the 16 not the 13 over 200 which is 1.315%. So the beta increased increased a bit. This raises the new cost of equity K of E 4.2 11.73% using the same formula. So the optimal capital structure assessment the WACC barely moved because Netflix is dominated by equity 200 billion. Adding 3 billion in debt is a small change because it only started off with 13 billion in debt. However, the analysis shows a key trade-off. Adding debt lowers the WACC by replacing expensive EV equity 11.73% with cheap debt cheap debt of 4.58%. That raises it by and making the remaining equity riskier beta increases. So my recommendation for Netflix my recommendation for Netflix is that Netflix's WACC is high. It's suboptimal. The company's underlevered. It should add significantly more debt. So 3 billion is the right direction which could continue to lower the WACC until the risk of bankruptcy and a lower credit rating causes the cost to debt KFD and equity beta to rise dramatically. Now for some project specific WACC analysis all this has kind of been explained before but the risk differences using a single 1.22% 22% of WACC for all projects is dangerous. US content this is Netflix's core business its risk profile on the company's average risk. Therefore, the firm Wal sorry WACC of 11.22% is the correct discount rate. One second. Okay. Is Sorry, where was I? So the 11.2% is the correct discount rate for international content. This tends to be riskier. New underdeveloped markets have currency risk, the exchange rate changing, a political risk, unstable governments, market risk, uncertain subscriber adoption. So adjustment for project specific risk is a higher discount rate to compete compensate investors for that extra risk. So we just suggested about 13 to 14%. The company for the international contract use a higher WACCC perhaps by adding a risk premium 2 to 3% making the hurdle weight 13.22% to 14.22%. Now Netflix now the pure comparison the Netflix 11.22% 2% versus Disney of 8.2%. That 3.02 gap is massive. So the explanation of the differences is the capital structure. Disney has 30% debt uses large stable cash flows from diverse sources of parks and movies and merchandise merchandise to support a large amount of lowcost debt. Netflix only has 6.1% of debt and it's financed like a high growth tech company using this valuable equity and that Disney's high use debt tax shields dramatically lower WACC which is the correct move in decision. The business model and risk same thing similar idea. Disney's a 100-year-old diversified conglomerate and its beta is likely lower than 1.3%. Netflix is a relatively newer streamer in a highly competitive market which is shown in the higher beta 1.3%. The competitive implications is Disney's 8.2% WACC gives it a significant competitive advantage. It can greenlight projects that Netflix could have to reject because of just the their company status. Now for my strategic recommendations before I drive dive back into the driver framework because all of this is still part of the evolve sorry but implement um so my first recommendation optimal financing strategy Netflix should receive a $3 billion debt issuance and I've explained why several times in this video at this point debt is cheaper than equity so you should do that and then tradeoffs pro debt debt lowers WACCC, increases firm value, lowers WACCC, which is a key part. Con debt, cons of debt is increases bankruptcy risk, which is why Netflix isn't doing that right now. And it reduces financial flexibility and could, if taken too far, damage its credit rating, but it's all about doing the right amount of debt. And they definitely could still increase their debt. And then the impact of financial flexibility. The $3 billion $3 billion insurance is a small for $260 billion company and will not impact flexibility like it could of a smaller company. So they're still good. They should still increase their debt. And that's my final recommendation for Netflix. They could increase their debt. So their target capital structure between 20 and 30% debt that minimizes its long-term WACCC. So now validating back to the driver framework. The 11.22% for Netflix is above the provided media industry range of 8 to 10%. This makes sense though it's not an error because Netflix is not a traditional media company. It's a high growth high risk almost techike company. So the high beta 1.3 explains why the WACC is higher. And also the peer validation the comparison with Amazon WACC of 9.5% Disney of 8.2% confirms that Netflix is on the high side because of their investment strategies which aligns again with their high beta low leverage capital structure. Now further evolving how I evolved my analysis the applications the do different WACC serve as the MPV net present value discount rate for the $5 billion content investment. If the projected cash flows from this content when discounted at about 11.2% 2% result in a positive net positive value. The project should be accepted limitations. This is a static point in time analysis. In reality, market values and interest rates and betas are constantly changing. Future work that could be done is the next step is to move from a single WACC to a divisional WACC system. Netflix should calculate separate WACCC's for its different risk based divisions like US streaming, gaming versus advertising. There's so many parts. And my final reflection is the primary takeaway is that for WACC and success in general, capital structure matters. Netflix's high WACCC is not due to a high cost in debt, but it's a high use of excessive equity. So debt should be increased while equity should actually be lowered. My strategic insight is a pure comparison with Disney is the most powerful part of my analysis. It shows where Netflix is lacking and that as Netflix matures its large largest opportunities to create shareholder value which can come from optimizing its value balance sheet which means adding debt. Final recommendation mentioned it a million times the $300 billion debt in Shuins is a small step in the right direction and it'll minimize its WACCC and maximize the ability to completely invest on new content. That is my takeaway. Thank you so much for listening.",
  "video_url": "https://youtu.be/vm_YZ_BV5Fo"
}