{
  "student_name": "None None",
  "org_defined_id": "035870380",
  "username": "rdinn",
  "video_url": "",
  "transcript": "Uh hi guys. Uh my name is Robert Den and this is my submission for mini project 3. Um yeah so for this project I built an an advanced uh AI finance tool using N. Um so my goal was to create something that doesn't just calculate numbers but actually understands financial questions uh provides context and explains the why behind decisions. Um so what does this tool do? Um this tool is called Finn AI uh short for financial AI. Um it takes a natural language financial question from the user and it pulls it in an optional external data um and then uses the multi-step reasoning to give in-depth explanation. Um it can analyze tradeoffs, compare scenarios and break down complex concepts in simple English. It returns everything in a structured JSo format which keeps it reliable and easy to interpret. Um but who's it for? Um, so Finn AI is designed for students, new investors, or anyone trying to understand financial decisions without getting overwhelmed by jargon. Instead of asking a textbook or a calculator, users can describe their situation naturally, and the tool interprets that context automatically. Um, so let's use uh the driver loop. Um, in the discover step of the driver loop, I focused on one big problem. Financial tools can do math, but they usually can't explain why a financial decision makes sense. So, I wanted to use a tool that uh interprets intent, understand risk tolerance, uh and reads natural language problems, and propose options, not just one answer. Um for for reason, uh I designed a prompt that forces AI to think step by step. It analyzes goal goals uh breakdown risks checks for missing data simplifies complex topics and explains how different scenarios would play out. This gives the user clear reasoning not just a final number. And then for implement um this is what the the actual workflow I started with a chat trigger node which takes whatever that uh user types and converts it into a JS. So when uh structure exacting intent and tires entities uh time horizons and missing info um next I pass that into uh the Finn AI agent node which uses my main system prompt. Um this is where the intelligence lives. The model gets the user questions uh plus any external data and it returns an analysis in a structural format, summary, reasoning, scenarios, recommendations, warnings, and follow-up questions. I also added a validator node. Um, this second AI step checks for uh hallucinations, unsupported claims, unsafe recommendations, or bad formatting. If needed, it corrects the output automatically. Uh finally, I built a memory node that that saves long-term user preferences uh like risk tolerance or or goals so the the tool can become more personalized over time. Altogether, this creates a multi-step analysis pipeline, not just a single prompt. Um so let's do a a live demo. Um let me show a quick example. Um I'll ask the system, uh I have $10,000 and a moderate risk tolerance. How should I allocate it across stock, bonds, and cash over the next year? Um, so the chat trigger extracts the intent and entities. The the the f the Finn AI agent then produces a detailed breakdown, not telling the user exactly what to do, but explaining reasonable uh allocations, the pros and cons, and why different scenarios could make sense. It also gives warnings, risks, explanations, and clarifying questions the user might want to think about. Um, yeah, this is this is the uh the output. Um, so in the verify part of driver, I tested the system uh with dozens of questions. I checked for hallucinations, math errors, and unsupported claims. Um the validator step um helped catch mistakes especially when data was missing or the question was ambiguous. Um for evolve between version one and and version two. I made several important improvements. Added scenario comparison to force the AI to to weigh to weigh trade-offs. Added a guard rails so the model never gives direct by this advice. I added JSON structured outputs to avoid rambling text and I uh added a validator node to correct hallucinations. Oh, I also added um uh a memory layer for personalization and reduce token usage to keep API uh cost reasonables. Um so version two is more accurate, more interpretable and safer. And then for for reflect uh there were real ethical challenges. AI can sound confident even when it's wrong, especially in finance. So, I added warnings, disclaimers, accuracy, checks, and and logic to avoid telling someone exactly what to do with their money. Also, external data can be outdated or inconsistent. So, the AI always explains uncertainty in its conclusions. The biggest thing I learned um is that building with AI isn't about letting the model do everything. It's about designing a process around it. uh structure, guard rails, memory, multi-step reasoning. So the model becomes a component, not the entire solution. This project showed me that I can actually build intelligent uh finance tools, not just calculators. Um but it definitely makes me excited because this really does feel like the the future of finance. Um yeah, thank you guys for for watching my demo. This concludes my mini project three submission."
}