{
  "student_name": "None None",
  "org_defined_id": "037338799",
  "username": "swannr",
  "video_url": "",
  "transcript": "0:08 Hello, my name is Ryan Swan, and this is my mini project three, building an adobe. The goal of the assignment was to create a finance assistant that doesn't just calculate numbers, but actually understands them.\n0:24 Explains concepts clearly and provides intelligent, personalized insights. My first version of the tool was a simple AI Q&A system focused on four major personal finances.\n0:40 Topics, Investing, Retirement Savings, Debt Management, and General Budgeting Questions. Users could ask questions like, how should I start investing, or how do I manage debt?\n0:54 And the AI would give helpful answers. To ensure accuracy, I manually fact-checked the AI's responses using reliable financial finance, uh, sources.\n1:07 This helped me see where the model was strong and where I needed to add structure or guidelines. To evolve the tool and make it more intelligent, I added multiple layers.\n1:21 features. I built three simulation models, savings, debt, and retirement. Each, Each simulator takes key, inputs such as starting amount, monthly contributions, time horizon, and interest rate.\n1:43 The tool then creates final bounds, interest earned or expected retirement savings, for example, with $29,000 in contributions at a 5%.\n1:53 interest rate over 10 years. The simulator calculates $10,292 in interest earned. This gives users a clearer picture. projection of their financial outcomes.\n2:04 This can be seen here as this is my project screenshot. After showing the numbers, the AI explains what those results mean.\n2:14 It provides context, recommendations, and the next steps. In my workflow, the AI processor goals, the function, uh, handle simulations, and the output structures everything into a clear readable format for the user.\n2:36 The AI is instructed to stay strictly within financial- In disclaimer, uhh, for educational purposes only, a sanity checks on calculation.\n2:57 Thank you, ladies. I also and consistent structure to reduce un-predicted outputs. I also validated the simulator results by doing manual hand calculations to ensure the math aligned exactly as, As shown.\n3:15 I did this for each of the simulation calculations. calculation. So I can make sure that not only the AI project not create an error, but I didn't.\n3:30 And I have an error. And a future version, I would add more advanced. and it's An actual planning future, such as a home buying readiness calculator, a car affordability model, and a few full personal balance.\n3:46 balance. And she, builder, this would allow the tool to give more comprehensive goal-based guidance. This project was extremely- Extremely. It be valuable for me, especially if someone's studying to become a financial advisor, showed me how AI can amplify financial- analysis by providing clarity, structure\n4:05 , and fast calculations, while still requiring human judgment and oversight. We'll be right back it. The driver method helped me organize my ideas clearly and build a tool that is not just functional, but genuinely and tell, intelligent and user-friendly.\n4:21 And once again, here is the screenshots from my project. It has, the savings debt investing retirement, uh, sections that you can click on and ask questions to which we will receive a, financial analysis feedback that answers our question, and hopefully puts us on the right track to evolve and, be successful\n4:44 in whatever financial endeavors we have. Thank you for watching my demo. I hope you and- enjoy exploring my AI financial tool as much as I enjoyed building it.4:57 Thank you. Thank you."
}