{
  "student_name": "Luke Hardymon",
  "org_defined_id": "035866355",
  "username": "lhardymo",
  "video_url": "https://www.youtube.com/watch?v=9K8wmzkHfWs",
  "transcript": "0:03\nSo for my capstone project, um I wanted\n0:06\nto create\n0:08\num something where you could take\n0:10\narticles from the Wall Street Journal um\n0:12\nand it this tool would give you um just\n0:16\nan automated response about a summary of\n0:18\nthe article and how it could potentially\n0:21\nuh impact the markets. And so my first\n0:24\nprompt um was saying I want to create a\n0:26\ntool that takes a Wall Street Journal\n0:27\narticle and analyzes how this will\n0:28\nimpact the stock market. I also want\n0:30\nthis analyzation of the impact um\n0:32\nbasically to give me trading advice. Um\n0:35\nso you can see here\n0:38\nuh if you take this link um then paste\n0:43\ninto here\n0:45\nclick this\n0:48\num you basically get in a summary um\n0:51\nsome kind of short like for an outlook\n0:53\naction and risk um and then also\n0:55\nprojected market impact um and then just\n0:58\nlike a few stocks that like it thinks um\n1:01\nmight do well um and then also gives it\n1:03\nlike a sentiment score Um, I think\n1:05\nanything over 50 is like bullish.\n1:07\nAnything under um is bearish. Um, and\n1:10\nthen it kind of just talks about like\n1:11\nsome key like subjects.\n1:13\nUm,\n1:15\nso you can see here I put it in there.\n1:17\nIt gives me all this. Um, and then sort\n1:19\nof evolving it. Um, I had to kind of\n1:21\nlike work through it a little bit. It\n1:23\nwas kind of giving me just like only\n1:25\nthree different summaries. Um, but I\n1:27\nmade it like more tailored to each\n1:29\narticle that I was putting in there. Um,\n1:31\nand then to sort of evolve it, I\n1:34\nactually had it give me a section that\n1:36\nlinks to Robin Hood's site, which is\n1:38\nlike a free stock trading platform. Um,\n1:40\nthat immediately lets me buy the stock\n1:42\nthat suggested. Um, so you can see here\n1:43\nif I for like the S&P um, you can click\n1:46\nthis and it automatically takes me um to\n1:52\nwhere I could sign up um, and buy it\n1:54\nreal quick. Um, so I thought that was\n1:55\nkind of cool. Um,\n1:58\nI think sort of reflecting I think this\n2:01\nis really cool how you can uh use these\n2:03\nsort of tools to kind of like\n2:05\nautomatically automate things instead of\n2:07\ndoing kind of like the research um on\n2:09\nyour own. And if it's kind of like a\n2:11\nthing that like you maybe can't read the\n2:12\nwhole like 8 minute Wall Street Journal\n2:14\narticle, but you can uh kind of get this\n2:17\na quick summary um and kind of like what\n2:19\nit means maybe for your personal\n2:21\nfinances. Um so yeah, that was what I\n2:23did for my project."
}