{
  "student_name": "None None",
  "org_defined_id": "035817975",
  "username": "sing1099",
  "video_url": "",
  "transcript": "0:01\nHello, my name is Kulpreet Singh and\n0:03\ntoday for our mini project number three,\n0:05\nI used the driver method to build finite\n0:08\nAI.\n0:09\nSo in our discover phase, I started by\n0:12\nidentifying the problem. Most finance\n0:14\ntools are just calculators. And if I ask\n0:16\na calculator, should I buy Bitcoin? It\n0:19\njust gives me a number. It doesn't know\n0:21\nif I'm a 20-year-old day trader or a\n0:24\n65year-old retiree. So I wanted to\n0:27\ndiscover a way to make the finance tools\n0:30\nactually understand the user.\n0:33\nSo for our reason and implement stage um\n0:38\nso my reasoning\n0:40\num uh that uh was that the AI needs\n0:44\ncontext. It shouldn't just look at the\n0:46\nmarket. It needs to look at the person\n0:49\nalso.\n0:50\nSo in my implement stage uh I I built\n0:54\nthis app using a react and fire database\n0:57\nwhich we could see here or firebase uh\n1:00\nconfiguration inization. So I connected\n1:04\nthe Coindesk API to get realtime prices\n1:07\nand then I connected to Gemini and then\n1:10\nin the code here you can see where I\n1:12\ndidn't just send a prompt and inject I\n1:15\ninject the U users risk tolerance and\n1:18\nage directly into the AP AI's\n1:21\ninstructions.\n1:22\nSo on our verify stage um so here's the\n1:26\napp that it created. Um, so let's say I\n1:31\nset my profile to 21. Uh, my risk\n1:35\ntolerance is aggressive. And then I want\n1:38\nto, you know, just wealth acclimation in\n1:41\ngeneral.\n1:43\nUm, so here I need to add my key. So go\n1:48\nover here, copy my key, paste my API key\n1:52\nright here. And then it's going to run\n1:54\nthe sanity check.\n1:57\nAnd then after running it, it's going to\n1:58\ngive me a score. So for me being an\n2:01\naggressive trader and my goal is to\n2:04\naccumulate wealth. It's saying it's a\n2:07\ngood score and it shows you why. And\n2:09\nthen showing you the bull case, which\n2:11\nmeans the aggressive case, and then the\n2:12\nbayer, which is like a less aggressive,\n2:15\nand then it gives you a whole\n2:17\nexplanation before you move, what to do\n2:19\nreally. So,\n2:22\nand then like let's say I do the same\n2:24\nthing. So I changed the profile to\n2:27\nuh just the age of 60, but he wants to\n2:29\nbe aggressive and wealth actization.\n2:32\nYou run the Sandy check again with the\n2:34\ndifferent age\n2:36\nand then you will probably uh just give\n2:39\nit a second. So yeah, the score goes\n2:42\ndown a little bit, you know. So just\n2:45\nit's a it's a little bit of different\n2:47\nfor a 60-year-old to do it than it is\n2:49\nfor a 20 year old 21 year old.\n2:51\nUm so with this\n2:54\num I finally reflecting on the process.\n2:58\nThe hardest part was the prompt\n2:59\nengineering which I had to teach the AI\n3:02\nto um really be cautious\n3:06\nuh and then uh rather than just agreeing\n3:10\nwith me trying to fix uh the problems\n3:12\nand then this tool just proves the\n3:14\ncontext that key intellig that is the\n3:17\nkey to intelligent finance. Thanks. So\n3:22\nthis AI is really useful. I I I would\n3:25\nrecommend people to just look at it to\n3:28\nbe honest like\n3:30\nfor my age, someone who wants to be\n3:32\nconservative and then they want to be\n3:34\nable to buy a home\n3:36\njust anything you want to do. And then\n3:38\ninvestment, let's do real\n3:44\nactually let's do let's say you want to\n3:46\nput all your money in Tesla, right?\n3:49\nAnd then it just gives you a risk\n3:51\nanalysis to that. Like you could do\n3:53\nstocks, you can do anything. And then\n3:55\nsee right here it's saying it's a 15 out\n3:57\nof 100. You know, it's not the best idea\n3:59\nto go go about doing this. Like we can\n4:02\nput in\n4:04\nreal estate\n4:07\nand then yeah, conservative goal buying\n4:10\na home. See, with real estate, it\n4:13\ndoesn't give me anything. But, you know,\n4:14\nlike with a lot of the let's say rental,\n4:19\nyou know, you want you want to get your\n4:20\nown rental, we can do that instead.\n4:24\nAnd\n4:27\nso, again, you know, like you can put in\n4:28\nanything you want and it it works\n4:30\nperfectly. It's really really useful for\n4:34\npeople who just want to get an idea\n4:36\nbefore they get started on investing in\n4:38\nanything really. So yeah, thanks for\n4:41watching."
}