{
  "student_name": "Gavin Hannon",
  "org_defined_id": "035642219",
  "username": "ghannon",
  "video_url": "https://youtu.be/oMf68_NdNS8",
  "transcript": "Hello, I'm Gavin Hannon here for the section session 11 assignment and today we're looking at corporate decisions and incentives. So our assignment overview is that we need to evaluate Apple's hypothetical $90 billion share repurchase using driver. We need to act as an independent analysis who must determine whether the buyback creates value relative to alternative uses of cash while balancing the stakeholder incentives. So we have the capital allocation snapshot which is liquidity of 165 billion cash and investments 100 billion dollar annual fee cash flow. Market context is $185 a share price. Uh dividend yield of 0.5% 15.5 billion share outstanding. Our balance sheet shows $10 billion debt. Birkshshire owns 6% coe holds three million shares. Retail investors average around 100 shares and employees have $170 strength options. Our proposal is that we have the $90 $90 billion buyback which can be executed over one year. But we also have alternatives like the $6 special dividend, the strategic AI/VR acquisition, debt reduction and incremental R&D and we need to sell start with go to our code which takes us through the driver steps. First we have to define the discover which is going to state the objective which the primary objective is to inform Apple's board of directors and instit in instit in institutional investors on the optimal capital allocation strategy specifically whether the $90 billion share repurchase is the most value uh creative use of cash compared to alternatives like the ones I've stated earlier. And so the goal is to determine if the buy pack buyback represents value creation or primarily value transfer and we need to identify key considerations. So our scope and horizon like I said that the execution horizon for short-term was one year and this analysis is for the board of directors.\n\nSo now we need to go to the represent stage which is going to map out a plan to analyze the data in our code. It gives us a plan to go by and then also states the status quo that we originally the company originally had. So if we run the code and scroll down.\n\nSo in the represent stage we need to first quantify the buyback impact. We need to calculate the new EPS ownership concentration and leverage. Uh next we do stakeholder impact. We need to do the model outcomes for uh the stakeholders. Do alternative comparison and then do value creation versus value transfer. And so here we have the status quo data which the most important numbers from these is that the current EPS is 6.17 and the current OIC is 3.4% net income 95.8 8 billion. And so this now brings us will bring us to the implement stage which can if we go all the way up back to the code.\n\nOkay. Here it's going to calculate the EPS impact using this formula. the new EPS buyback, net income divided by new shares outstanding and it's also going to do the EPS impact percent. So what the EPS does, it tells us how much money a company makes for every share it has outstanding. And so then next we have the ownership concentration uh which has the the uh calculation right here which will show more like the how much uh percent the of ownership that Birkshshire has with the different uh alternatives and then we have the employee impact and we have leverage calculations. s\n\nand then now we have and then it's the code is going to create a comparison uh table. So when we scroll back down we can see that the buy the buyback versus the status quo and how this affects each stakeholder. So for the retail and institational holders there is an increase to 3.24% 24% EPS as it increases to uh 6.37. Um so for for them this higher intrinsic value uh is good for them and reduces their future optionality. Vex's management has the same 3.24% increase. uh employees have a greater intrinsic value and bond holders net cash decrease by $90 billion\n\nand this has a negative but marginal impact for Apple but the leverage slightly increases the net cash. So now we're going to compare. Now that we know that the share buyback has a increase in EPS, we need to look at other alternatives to see if there's any better options for the company to do. And with the special dividend with an increase of $6 per share, this makes the EPS stay the same and creates a new debt of 38, but for the most part, the strategic fit is very low. an immediate cash return to shareholders, but there's no retained earnings for future growth. Next is the strategic acquisition of R&D. This EPS actually increases all the way up to 6.75 with a EPS change of 9.42. This is a very high strategic fit as it addresses our future growth in technology gap and it creates a long-term value creation potential and for the shareholders it has potential for long-term growth. Employees have new opportunities and management has more strategic advantage. Next is the debt reduction which also uh will increase the EPS to 6.35 but just not as much as the strategic acquisition and R&D. So it has a more of a medium strategic fit. So now that we have those, next is to move on to the validate stage. And to help validate that we're using the right data, it ran all sanity checks. And it is showed that we used the correct data of $185 share price, 30 p, 15.5 billion shares, and $90 billion buyback. And the key validation check is the buyback calculation is correct because 90 divided by 185 is 486.5 million shares and an a post buyback should be always be an increase in EPS. So the data is uh we can rely on the data. Next we move on to the evolve stage which is which is to tell if it the buyback has more value creation or value transfer. So the buyback has a high P/e authority and is primarily a value transfer from the company's balance sheet to selling to the shareholders. This is concentrated by a permanent reduction in share count. So this visual I also have a visualization that helps show how each uh option affects the EPS. And we can see here that the strategic acquisition R&D has the highest um increase compared to the others.\nSo next I would like to get into the signaling effects and market perception of each um option. So for the buyback there's a this signals financial strength and management confidence but also lacks a potential high return in internal projects. For the dividends uh option the positive for income investors. This signals commitment to cash return but offers less flexibility than a buyback. The acquisition is signals an aggressive growth strategy and belief in future market expansion and this most likely to be perceived positively by growth investors. And then lastly, the debt reduction signals prudence and de-risking and is favorable to bond holders and conservative investors. So lastly to reflect um I would say my recommendation for the company is to go with the buyback uh strategy as this is a defensive uh value transfer move. It is a rational choice for a company that is generating massive SCF and addresses suboptimal use of excess uh cash and uh appeals to large investors like Birkshshire. So, but however, I would talk to more of the board and try to get them more on board with a the strategic acquisition option as that showed the highest EPS. So now the key takeaway is while the buyback offers an immediate EPS lift, the long-term strategic value and superior return on capital from a $90 billion investment uh makes it much more value uh creative for the use of cash and address it and addresses future competitive threats and maintain strategic optionality."
}