{
  "student_name": "None None",
  "org_defined_id": "035866355",
  "username": "lhardymo",
  "video_url": "",
  "transcript": "0:02\nSo for my mini project um I was\n0:09\num I used a personal investment advisor\n0:12\nbut also it gathered sort of tech news\n0:14\nand world news and then kind of transfer\n0:16\nthat into investment advice. And so my\n0:18\nmain prompt here um was said you're an\n0:21\ninvestment agent using the world and\n0:22\ntech news. Give sound personal financial\n0:25\nadvice. Gave it a couple of\n0:27\ninstructions. Um, I applied some strict\n0:30\nguard rails, no personalized advice of\n0:32\nany kind. Um, no promises or certain\n0:35\npredictions. Um, always include a clear\n0:38\ndisclaimer at the end. So, this was\n0:39\nmainly a summary of the news. Um, but\n0:43\nyou can sort of gather investment advice\n0:45\nfrom that. And you could obviously\n0:46\nchange this prompt to actually give\n0:48\ninvestment advice, but I would figure\n0:49\nthat the guardrails were important and\n0:51\nthat um, yeah. So, and then I kind of\n0:55\nhad to do it in this sort of JSON\n0:58\nformat. Um, so there's that.\n1:01\nAnd then you can see in the output node\n1:03\nhere, um, sort of just the output. So\n1:07\nyou can see the summary and everything.\n1:08\nAnd then I thought it was cool that\n1:10\nactually I was able to send it to my\n1:12\nemail. Um, so that every day I could\n1:14\ntechnically just put something in here.\n1:16\nIt would automatically do this and send\n1:18\nit to my email. Um, you gosh, do that\n1:21\nagain. Um, you can see the email\n1:27\nhere. Um, obviously the format could be\n1:30\na little better. I tried to mess with\n1:31\nthe format. I spent a lot of hours\n1:32\ntrying to mess with the format, but it\n1:34\nwasn't able to do it. So, that's\n1:35\ndefinitely like something reflecting and\n1:36\nto evolve is to actually like make this\n1:38\nlook a lot better. But the words are\n1:40\nhere. Um, it shows key news and then you\n1:43\ncan kind of take investment advice from\n1:44\nthat. So, um yeah, and I think um\n1:49\nanother way to evolve this would\n1:52\nactually to put um like the investment\n1:56\nadvice into tables and maybe have it\n1:59\nlike uh conservative, moderate, and like\n2:03\naggressive risk levels and kind of give\n2:06\nadvice based on those three categories.\n2:08\nUm also giving advice maybe be based on\n2:11\nspecific goals that the user might have.\n2:13\nthat's definitely something like we\n2:14could put in there."
}