{
  "student_name": "Anamika Mitra",
  "org_defined_id": "037556874",
  "username": "mitra69",
  "email": "",
  "transcript": "So for the second assignment, uh the goal that I'm focusing on is to systematically analyze um GameStop short squeeze between 2022 2020 and 2021 to determine the expected market inefficiency and to identify um of behavioral finance and market microe um in terms of revisiting some of the values. The fundamental value for the capital value is about 12 to $4 per share and the observed market price during that time period is about$14 483 per share as reported on June 28th uh 2021 as per finance. So that's the question that I'm going to be looking at is does the 483 car for share price represent rational response to more information um uh or investor mania findings. So I wrote that out and terms of the EMF form weak form. The test implication would be that past prices cannot predict future returns in terms of gain stock. the price surge was driven by momentum and social media coordinated buying patterns. So for this we can conclude that probably this this has been violated the short-term price if it was highly predictable X. Um in terms of the semi strong form you could say that the the implication would be that public fundamental information was priced um in this case the price is greater than analyst fundamental targets of $40 um and public financial. So you can assume that it's been strongly violated as um uh there's a massive sustain price from public information. In terms of represent uh we will use event study methodology in the sense of calculating abnormal return and the cumulative abnormal return during uh the squeeze period of 2020 21 2020 to 2021 using uh cap to establish uh the expected normal return. So these are the two formulas that I'm going to be using in the stage um where um r is the actual daily return in this case. of stocks. Um, E of RT is your expected daily return based on your market data. Uh, a R of T is your abnormal return which is your alpha and car is your total abnormal return over a certain time period. Um and just uh in terms of interpretation a high positive card indicates persistent u mispricing and failure of EMH and it in terms of alpha uh in terms of the abnormal return it should be near zero inefficient market and a massive positive abnormal return confirms inefficiency. The expected return in terms of Jamie should be relatively small given the normal movement and uh the return is massive during just short speed considering that it's a peak. Um, and the behavioral framework that I'm going to be using is going to focus on nonrational factors in the sense of hurting, which is coordinated buying on street ads, anchoring, which is price targets like $1,000, which become psychological anchors, and limits to arbitrage where short sellers or rational arbitrers are faced like extremely high cost to borrow shares, risk margin call as price move against them. So like fundamental risk towards liquidating risk liquidation risk. Um so in terms of the influence stage I code and I got this output that's so I'm going to be using cappo specifically within the methodology that I'm using test efficiency during short. So in terms of the expected return calculation here um the column is calculated based on CAM and the expected return formula that was uh demonstrated here. Um so this is the return a riskadjusted investor would expect GME to generate given the market's movement and high systematic risk. um assuming a beta 1.5 for example in Jan 2027 the uh if you calculate the market return is about 0.10% but the expected return is uh 0.5% gives you the calculation of 0.01% 1.5 which is your beta multiplied by 010%us your 0.01% uh which is approximately 0.5%. The abnormal return column here um was is the difference between your actual return and the expected return. It represents market movement and cannot be explained by systematic risk or rational pricing. Uh again taking Jan 27 uh Jan 27 as our example um the actual return of 134.8% 84% right here. Subtract that by your expected return of 5%. You get an abnormal return of 134.70%. Um the large the AR of a single day is over about 1,340 times the expected rational return. This large unexplained return is empirical severe pricing disconnect. Um the cumulative abnormal return car sounds daily abnormal returns over a simulated event period. Say we're taking a 5day period from June 25 to 29th to measure the total particip. The car for the simulated 5day period is 169.43%. As shown in this output. Um, so you can tell that there's a strong violation of a semi- strong EMH. In a semi- strong efficient market, the abnormal return should be statistically indistinguishable indistinguishably close to zero because all public information like GM fundamentals is already priced in the mass of sustained and mass and sustained profit of 1.43% without a doubt as violation of accountations occurred. the market is not pressed into systematic risk. Um so in you can also assume that the extreme abnormal return is driven by nonal factors like mic market microructure where the extremely high short interest risk created a structural vulnerability and behavioral biases where retailing and social media moment of concepts like cause prices to soar far beyond on the rational expected return and this massive uh cumulative animal returns created and sustained by these behavioral dynamics and structural constraints also as limit limits to the arbitrage in terms of the validated stage um the massive uh the massive return is not compensation for additional capital it's a genuine failure the pricing mechanism but it persisted because of limits to arbitrage. So in terms of some of the limits to we have short selling constraints um and its role to GME would be it's difficult and expensive for national to borrow shares due to high borrowing costs to short the overpriced stock. And then we have another limit called noise. Um the possibility of irrational factors for example like the Reddit crowd um driving the price even higher forcing irrational into liquidation and even liquidity risk where the sudden trading restrictions by brokers like Robin Hood um that is too essentially the mispricing was economically significant due to the high return and statistically significant as it's far from zero. But the limits to arbitrage of um short selling or trade risk and liquidity risk prevented its immediate correction allowing inefficiency to persist period in terms of um evolving uh the markets are adaptively efficient efficient enough to beat most of the time but subject to periods of extreme inefficiency when behavioral forces or structural con constraints are underlined. Um, in terms of looking at strategy, you look at like say active versus passive. Um, if you look at active versus passive, you see that this uh short squeeze event mandates a hybrid start strategy. Uh, where you acknowledge general image use low cost index funds and holdings. Um and then you selective active management that targets um market value of a size or behavioral um for example small cap high interest. Um in terms of just like a I would say a corporate financial I got would be that in terms of cost of capital a CEO of GME during this period would realize that the market price is irrational. Using this artificially inflated stock versus capital raising, for example, issuing new equity um would be highly advantageous, demonstrating how market inefficiencies uh impacts corporate finance decisions. In terms of reflecting, I would say that the GM short squeeze is a clear case for behavioral finance framework. Um my belief in the market efficiency, my belief is that market efficiency is challenged by uh the GME event because it demonstrates social media coding and market structure uh which market structure fail market microructure failures um like extreme short interest that can sustain a systematic mispricing. um for weeks proving that rational analysis alone is not uh sufficient when faced with extreme behavioral momentum um and severe limits to arbitrage um as there was in the event. So if we just look at the efficient market hypothesis uh in terms of the influence of GME the price must be fair. So I would say that my analysis to this or diverse model must have been wrong in the case of J. But if you look in terms of behavioral finance, the price is bubble by curving and um other social behavioral aspects like they're missing out and other essentially behavioral aspects that are sustained by structural limits on arbitrage. And I would say this was probably the the ideal explanation for the short that GM experienced. So I would say overall successful investing involves respecting the constantly seeking behavioral and structural weaknesses that create exploitable um outite risky opportunities.",
  "video_url": "https://youtu.be/V0LRa7K5P6g?si=UJsX4caGD47AdsG5"
}