{
  "student_name": "Arianna Dilling",
  "org_defined_id": "036049965",
  "username": "dillinga",
  "email": "",
  "transcript": "Hi, today we're going to be doing C uh cost of capital analysis. So, we'd like to calculate the weighted average cost of capital WACCC or WAC for Netflix in connection with a hypothetical 5 billion content investment decision. Your analysis must determine the current whack, evaluate the impact of additional debt financing, assess project specific versus firmwide discount rates, and compare Netflix's cost of capital to industry peers. So, we have some financial parameters here for Netflix. We have the market capitalization, the total debt book value, the debt market value, the equity beta, the bond rating, the corporate tax rate, and the current stock price. We also have some market conditions. We have the risk-free rate, the market risk premium, and we have the medium industry rack range is going to be from 8 to 10% on average. The strategic context is that Disney's capital structure is 70% equity and 30% debt with a whack of 8.2%. Amazon Prime Video uses Amazon's corporate ra whack of 9.5%. Netflix is uh considering a $3 billion additional debt issuance for content investment. And then our required analysis is to calculate Netflix's current whack. Determine whack after $3 billion debt issuance. Evaluate project specific whack content versus international uh US content versus international content. Compare Netflix's WAC to Disney and explain the differences. And recommend optimal capital structure strategy. So in order to solve for this, we're going to work through the driver framework in order to effectively um solve this scenario. We're going to start off with the define stage. Our problem is going is that Netflix is considering a $5 billion content investment and a $3 billion debt issuance. Our goal is to determine whether this investment makes sense financially given Netflix's current and potential future cost of capital. We must determine the current whack, the new debt impact of that 3 billion project specific whack, international content versus US content. We want to do some pure comparison. Netflix's whack compared to Disney's and the industry range and capital structure strategy. What mix of debt and equity minimizes whack while maintaining flexibility? The next thing we want to do is define some of our v variables because we have a lot of information to work with. So market capitalization is our market value um of equity and that's represented with an e. We also have a beta which is our risk. We have a stock price, the total debt book value versus the debt market value. We have the bond yield. We have the corporate tax rate which is the t. We have the risk-free rate and we have the market risk premium which can be calculated but luckily it's given to us here as 5.5%. We have the new debt issuance. Um we also have the industry rack range. We have Disney's whack and then we have Amazon Prime videos. So you may be wondering what is cost of capital? A company must earn enough return on its investments in order to satisfy all of its capital providers both shareholders and lenders. This blended return required return is called the weighted average cost of capital whack. It is the company's hurdle rate. The minimum acceptable rate of return for new projects. So if a project earns more than its whack percentage, it creates value for its shareholders and lenders. If it earns less than its whack percentage, it destroys value and therefore would not be a profitable project for its capital providers. So for Netflix, we want to create value. The formula is this EV ultiplied RE plus DV * RD ultiplied 1 minus T. So one of these um variables may look familiar if you remember cap M that is our cost of equity. We have E equals the market value of equity. We have D which equals the market value of debt. V is that E plus D to create total firm value. And when you multiply uh the E by the V or the D by the V, you get the market value weights. And that's what we need for the whack formula. Um these market value weights uh reflect the proportion of equity and debt at market values, not book values. Um RE is again that cost of equity. RD is the cost of debt or the market yield on company's bonds before tax. T is going to be the corporate tax rate. And when you multiply RD by 1 minus T, that is the company's effective cost of borrowing after accounting for the tax shield because interest expense reduces taxable income. So that's important to keep in mind and we're going to kind of see how that plays out in our calculation during the implement stage and how there is a tax shield. Moving on to the discover phase. Um key idea here is market value versus book value weights. So if you use the book value or the historical data, we can just find the future financing capital structure. But with market-based calculations, we can use the current stock price, the equity market value, the current bond prices, the debt market value to get the market value weights. And that's how we find true investor demands. So, as I said, whack is we need to calculate this to make sure we're creating value for our stockholders. So we need to use market base in into in order to ensure that we're doing that. So some of the big business context that we can think about is that Netflix invests heavily in content. So cost of capital affects how much it can invest while maintaining profitability. Unlike Disney, uh Netflix has less diversification. There's no theme parks, fewer assets to borrow against, increasing its risk premium. The CFO's concern is that balancing the benefit of cheaper debt versus the risk of higher le leverage and rating downgrades. Our strategic goal is to identify the optimal capital structure that keeps whack competitive and supports long-term growth. Now we can finally move on to the represent stage. Now I've broken it down into a couple scenarios here based on our required analysis necessary. So we want to calculate Netflix's current baseline existing whack. So in that case the debt is um 13 billion and the beta is going to be 1.3 and then um cast uh cost of equity is going to be 11.65%. And then after cost of debt is going to be 4.58%. We uh V total capital value is going to be 213 billion. We have our equity equity value of 93.9% and debt weight of 6.1%. And then this is kind of what the formula is going to be look like in that scenario. But we're going to use Python in order to calculate this in the next stage. The next scenario is going to be adding on that additional 3 billion in debt. So that's going to be that original 13 plus the three now creating $16 billion of debt and beta would uh adjust in this scenario to 3.5 and then our our uh RD is going to change to 6.1% because it's going to be more risky. And then the next scenario we're going to calculate for is project specific. So for US content the beta is going to be 1.3 and then international content it's going to be 1.5%. I mean 1.5. So each scenario will produce a different distinct whack for decision making. The next thing we're going to do is move on to the implementation stage and we can um solve for each of these different scenarios. So, first we have our inputs um that we talked about earlier above. We have our equity, our debt, our treasury, our market risk premium, and we're going to need all of this information The next thing I'm going to do is create all of our functions. So we have CAP, our CAPM function. We have the after cost after tax cost of debt function. We have the capital weights. We have whack. We have unlevered beta. Now, this may seem confusing, but that's just what our original risk is versus our new risk with the additional debt. So, we have the formula here for the original base case business risk only and then we have the new risk due to a new level of debt. So then we can um implement all of the information that we created above into the formulas that we created. And this is the first scenario for the base case. You see we're calculating that here. Then we can move on to the post debt scenario adding that $3 billion. And we're going to implement all of that information here. We have the rele beta uh beta when capital structure changes. We can recmp compute component costs with the new beta and then do new debt yield. And then we're going to recomputee the whack. Then we want to do the scenario three for project specific whack. So we have that US content versus the international content. And then we want to do our peer and benchmark con uh comparison for Disney. And then we also have some sensitivity analysis which will be really helpful to see how whack moves as we change um beta and the leverage. So let's take a look at some of these results. So for the base level, the whack currently is 11.2%. So after the $3 billion uh new debt, it's also 11.2%. Um and I'll explain why once we get through this. So for the project specific whack we got for US content is 11.2% and then for international it is 12.25%. Pure context Disney's wax was given 8.2%. The media industry range is 8 to 10 and Netflix sits above the industry range. This implies a higher perceived risk/cost of capital. This is where things start to clear up. So for the sensitivity we can see that at 10 billion of debt the whack is 11.24%. At $13 billion and with a new beta it is 11.2%. At $16 billion of debt it is 11.4%. And at 20 billion in a new beta it is 11.68% and so on. So, as you can see, as more debt accumulates and the beta or the risk changes, we get a different percentage of whack and it continues to increase. So, let me go ahead and explain some of these results. Netflix must earn at least 11.2% on its content and other investments to satisfy both its debt uh holders and shareholders. So how however much money we make on this project, it's got to be greater than 11.2% whack that we calculated in order to create value. This rate reflects a high cost of equity driven by its risk profile and a relatively low leverage, limited tax shield from debt. So if you remember, I talked about the tax shield before. Um we're not getting a a great amount there. So the new debt raises the wax slightly, meaning the benefit of the tax shield is offset by higher financing risk. This is consistent with the fi finance theory. Moderate leverage can reduce the whack, but beyond a point risk increases faster than tax savings. So we can see that that even though here it looks like it's the same. We can see that as the debt accumulates the whack is going to increase in percentage. Um it's just because that 3 billion is so small. Um increasing the debt from 13 billion to 16 billion shifts the debt weight only from 6.1% to 7.4%. 4% which is too small to significantly affect the blended cost of capital. Although the relevered beta and cost of debt increased marginally, these effects are diluted by Netflix's 200 billion equity base. The sensitivity analysis confirms that whack increases more noticeably only when the debt rises to tw 20 billion or more where financial risks accelerates and both cost of debt and cost of equity respond strongly. In this specific scenario simply, Netflix is so big of a company and equity heavy that adding that $3 billion of debt is like adding a cup of water to a swimming pool. the proportions barely change. So with the sensitivity analysis, the pattern to understand here is that as debt ratio increases, the whack first in decreases slightly from the tax benefit, but beyond a threshold, it rises again. Higher default and equity risk. This just demonstrates the classic U-shaped whack curve with a moderate debt, cheaper capital, excessive debt, higher risk, and higher whack. So Netflix's opital capital structure is likely around 8 to 12% debt to capital, close to where it is now. So now we can move on to the peer peer context and then the project specifics. Netflix should discount its international projects at 12.3% not 11.2 to reflect that added risk if they are potentially going to be doing international content. This ensures that higher risk investment is still um able to produce adequate returns for its shareholders. So Netflix's higher whack indicates investors demand more return for riskier content driven cash flows and the the lack of diversification there. When it comes to Disney, they have multiple businesses, parks, medias, IP licensing. So the spread there's a spread of risk lowering its cost of capital and then Amazon's wick reflects parent company stability and scale benefits. Um Amazon has reached out in all different kinds of um businesses. So they have um strength there. And now we can move on to the validate stage. So we validation prevents blind reliance on these formulas. So we want to confirm our output output makes um economic sense. So if you were to calculate the cap by hand, it's 11.65% which is realistic for high streaming high-risk streaming firm. Our cost of debt calculated in the base case aligns with current media bond yields. Our tax rate um uses the federal corporate rate given to us. Our um we have a capital weights of 64% equity and 6% debt which matches Netflix's low leverage profile. And then the after risk tax risk adjustment is a correct tax shield treatment. In conclusion, inputs are market based, current and realistic. The internal consistency or lo logical behavior check is that the cost hierarchy holds here that 11.65% is greater than the whack of 11.2%. And then adding the 3 billion debt slightly raises the whack 11.2 to 11.4. A higher risk offsets the tax benefit. and then the international project whack as 12.3% which is greater than the US project um whack. So that just makes it clear that a higher beta is going to be a higher hurdle rate. So the output uh behaves as expected under the financial theory and we can see from that sensitivity um analysis that we created that as the beta increases the whack is going to increase. So higher beta increases the whack linear linearly as expected. And then we also have the leverage sens uh sensitivity which is that um debt divided by the total market value and as that is increases the whack increases. And then here's a little chart for specific industry comparison. We've talked about it so far but again Netflix is way above the 8.2 to Disney, Amazon Prime, and it's above the industry range, which is typical for a mature media firm, but it's not it's specifically for Netflix. They're equity heavy, riskier cash flows, and high growth focus. So, it's not crazy out there. Netflix's higher whack is justified. Oh, I just said that, but yeah, you understand. Um for doing some research, corporate wax typically typically are in the range from 7 to 12%. So um it's okay that Netflix is sitting at 11.2%. It's ex with within expected bounds for a growth of an entertainment company. And um the incremental change from 11.2 to 11.4 post debt is small and realistic. Um and so we can conclude here that the results are numerically and economically sound. Now we can move on to the evolve stage. Um WAX serves as a foundation for all corporate financial decision-m and valuation work. So some of the strategic Netflix uh recommendations for Netflix on how they could evolve um and um increase as a company is m is to maintain a balanced capital structure and avoid overleveraging keep the debt low below 15% of total capital. They could strengthen their credit rating. They could pursue cash flow diversification. that can enhance transparency with investors and consider hybrid financing. This would be using convertible or long-term debt to reduce the whack without increasing risk too quickly. In regards to this project, we could do some um more global expansion and use project specific whack adjustments to evaluate how international market uh new international markets by accur accurately pricing risk for each region. Netflix could expand globally with disciplined investment decisions. They could content diversify and and apply whack as a filter for selecting new content categories such as sports, gaming, or live streaming. and projects that exceed the 11.2 hurdle rate strengthen profitability and investor confidence. They could um evolve their financing strategy. Use ongoing WAC analysis to test different debt um debt to equity mixes as Netflix grows. As the company matures gradually increase and low cost debt could optimize WAC and support larger scale investments. There could be some technology and innovation investments and extend whack modeling to innovation projects such as AIdriven content recommendation advert advertising platforms or interactive media media. These investments could be evaluated using project specific discount rates to balance innovation risk and uh expected return. And then finally, they could do some valuation and shareholder value growth. As Netflix lowers its whack over time through stable cash flows, improved credit ratings, and diversified revenue streams, its um enterprise value will rise and continuous moni monitoring of whack ensures that long-term strategic decisions are aligned with shareholder value creation. And finally, we can move on to the reflect stage. So, some key insights that I want to drive home here is that WAC is a strategic benchmark. This project demonstrated how the weighted average cost of capital serves as Netflix's financial hurdle rate for investment and expansion decisions. Every new content or market project must generate returns above the 11.2% whack to create shareholder value. Increasing leverage uh for the capital structure balance increasing leverage slightly, adding the $3 billion in debt raises raises Netflix's whack to 11.2 to from 11.2 to 11.4% showing that its current structure about 94% equity and 6% debt is near optimal. Beyond this point, additional debt would increase um financial risk faster than it reduces taxes. There are some project specific risk awareness. This analysis reinforced the importance of adjusting whack for project level risk differences. International projects could use higher discount rates um due to currency, political or regulatory uncertainty as well as some competitive positioning. Netflix um comparing Netflix's WAX to peers like Disney and Amazon highlighted how diversification and stable cash flows reduce cost of capital and enhance stable uh financial flexibility. And then it's important for continuous improve improvement. Recalculating the whack regularly allows Netflix to ad adapt financing decisions as market conditions, risk-f free rates, and investor expectations change. So some um challenges that I encounter in this that I encountered in this project specifically was just the data estimation. Determining accurate market-based values for debt and equity required assumptions and simplification since not all data is publicly synchronized or current. So there's some assumptions there. And then um it took some time to kind of understand what beta relevering was and that complexity. So I had to do some research on applying Hamadada's formula which introduced estimation uncertainty especially when debt levels changed. Small shifts in beta significantly affect whack outcomes. There's also market volatility. The risk-f free rates and market risk premiums fluctuate frequently. So we had to make some assumptions there um with what was given in the information making it difficult to lock in stable inputs for long-term project evaluation. So this kind of project in a bubble there's project specific adjustments assigning risk premiums to different content categories or regions require judgment rather than fixed data highlighting the need for managerial insight along with calculation again. And then there's interpretation versus comp computation. Um, the most challenging part wasn't the mask. It was interpreting what the numbers meant strategically for financing, valuation, and shareholder value creation. So, I hope you learned from this and I hope I hit all of the points of the requirements.",
  "video_url": "https://youtu.be/NNWY-r6Cs5Q"
}