{
  "student_name": "Jackson Montgomery",
  "org_defined_id": "035961927",
  "username": "montg126",
  "email": "",
  "transcript": "What's up, guys? This is uh Jackson Montgomery and this is my session 8 section six assignment um market efficiency investigation. So, just a quick rundown of what the assignment is. Um our overview is basically to investigate market efficiency using the GameStop GME stock. Um it's a short squeeze event from 2020 to 2021 as a case study. Um, so we're going to verify the accuracy of stated facts, analyze price behavior related to efficiency or efficient market hypothesis predictions, and evaluate whether a market anomalies constitute evidence against market efficiency or can be explained within existing frameworks. Um, so our timeline's right here. Our event timeline is 2020. Um, GameStop is near bankrupt bankruptcy. Uh, September Ryan Cohen, the Chewy founder, acquires 30% stake. Uh, January 2021, Reddit, Wall Street Bets, drives the price up and surges to $483. Uh, February 2021, congressional hearings on market manipulation. Present U postvent price stabilization. Um, and then we have key data points which are short interest peaked at 100 40% a float. Uh, retail trading volume increased to 10fold. Um during squeeze trading restrictions implemented at peak on Robin Hood a hedge fund Melvin Capital substained 53% loss requiring bailout and analyst fundamental value estimates $10 to $40 per share. So our required analysis for this assignment is basically is to one verify all stated historical price data and documentation corrections. Two, test which form of market efficiency, weak, semi- strong, strong, strong, was violated. Evaluate whether rational investors could have profited systematically. Four, compare efficient market hypothesis predictions to observed behavior. And five, assess behavioral finance explanations for observed anomalies. So, I'm using the driver framework for this. And this is basically just the text for my driver framework. Um so starting off to find and discover um problem setup and verification a a critical value verification statement. GameStop traded at 4 cents in August of 2020. The stats incorrect. The verified data states that GME's split adjusted price in August 2020 was approximately $14 to $167. Um the analysis proceeds using the verified historical data dollar4 and documents the correction as a critical first step. So basically it's just stating that the GameStop price is actually wrong. Um B event and estimation window definition the S&P 500 risk-f free rate approximated daily rate for example is 0.05 or 232. The estimation period for beta is September 1st 2019 to September 1st 2020. So one year prior and our no hypothesis is basically the market is a weak form efficient um with the mean and normal return of zero. So that's the find and discover it's our problem setup and verification and then moving on represent we have um our analytical framework and equations. So we have a our normal return model which is capm equations. Um one capm regression used to estimate alpha and beta during estimation period. And then we have our second equation which is expected return. Um and this is used to predict normal daily return during the event period. Um and then for B we have market efficiency testing metrics which is basically one are at no return. the difference between actual and expected return and then two we have cumulative uh normal return C which is the total total abnormal profit over the event. So these are kind of the four equations we have our capm regression expected return abn normal return and then cumulative abnormal return we have implement this is basically where we use our data execution calculations um this is all shown in my text and code later um our estimated beta is 1.050 our max daily is 0.85 85 which is 80% abnormal return in one day. Um and then our final cumulative abnormal rate end of event period is 456% total abnormal return. So to validate we have a statistical test which is a one sample t test on the mean ar against a null mean of zero. Um our conclusion is just that the p value of 0.0 is the p value is less than 0.05 5 which just means um our significant value is less. So we reject the null hypothesis and it shows that there is um a statistical significance here. Um there's a this val this is validates a strong violation of the weak form. To evolve this we could have strategic and policy implications. Um rational investor profitability or policy implications. The extreme air magnitude and volatility point to severe market micro structure issues specifically related to the 140% short interest and the subsequent liquid liquidity risks uh necessating that policy review of short short selling regulations. So if you wanted to take this problem even further, we could just evolve and include those two. And then to reflect I will to reflect um this is basically just inclusion. So EMH versus behavioral finance the statistical rejection of we form EMH is best explained by behavioral finance and limitations to arbitrage. Um, our behavioral bias extreme here hurting in social media coordination drove the price disconnecting it from $10 to $40. Fundamental volume estimates uh limits arbitrage. Rational investors, hedge funds um could not exploit the mispricing due to high liquidity risks and the massive forced margin buying calls allowing the in inefficiency to persist. Our final conclusion is the GME event shows that EMH fails under conditions of extreme systematic shortselling and coordinated behavioral action. Um so basically the market was highly ineffective across weak and semi-strong forms. So this is my implement section. So one define and discover we have this is where we define everything everything up. We have our critical val critical factual correction variable 04. Um we define tickers and time windows right here and then we have implement. So we retrieve data output is multiindex. This basically just all of our text that does all the work represented right here. implement um here are equations being used. So we calculate log returns for the event period, calculate expected return um for the estimated beta, calculate abnormal return and [ __ ] cumulative abnormal return and then we display uh let me display them and showcase them at the end. So they're right here. So to kind of cover this basically we have an OS regression results. Um our dependent variable is GME excess return. Our model is OS. Here's the date and time numbers. So our R square is 0.139. Our adjusted R square is 0.135. These are both very low. are. So our constant is 0.020 and our market return is 1.04. So this is basically our slope and this is our starting value. Um if we take our market excess from our coefficient and go to our p value, we can clearly see that our p value is less than our alpha, which that just again goes to show that we reject the null hypothesis. Um and that there is statistical evidence that GME was affected by social media. And this is what this this is just our abnormal return. and C calculation. So our final cumulative abnormal return C end of the day CR GME was 25069. So this is my data um in my results. So basically I also made three visuals to help see this. Um right here we have GME versus S&P 500 daily log returns um during event period. This visual demonstrates the daily volatility of GME returns compared to the market, especially during the squeeze. So, this red line is the squeeze. Our black is the S&P and GME log return. As you can see, it's just super static. And then up here, our log return shoots to over 0.75, which is insane. Um, here's our dates. And then I also have one here. Um this visual clearly shows the accumulation of abnormal returns crucial for asset market efficiency. So once again this is our peak squeeze and this is our zero abnormal return and this is our GE cumulative abnormal return. Um as you can see it's constantly positive and it continues to grow all the way till our squeeze. And then here's a bell curve that we have. And this histogram shows the frequency of different normal return values. Um a distri a distribution heavily skewed away from the zero suggests inefficiency. So our mean return is 0.0205 and this is zero AR. And yeah, um that's my project. And basically to sum it up, um we verified our document corrections in the historical price. So historical price is off. It was not 0104, but 1.04. Um we test our forms of market efficiency. We evaluated whether rational investors could have profited systematically. um rational investors um could not have given that it was squeezed and shorted. Um and we compare efficient market hypothesis predictions to observed behavior and we assess behavioral finance explanations for observed anomalies. Thank you.",
  "video_url": "https://youtu.be/IhdNBe8Z-ww"
}