{
  "student_name": "Fabian Segura Vargas",
  "org_defined_id": "037407177",
  "username": "fsegurav",
  "video_url": "https://youtu.be/cCJILK0tiHI",
  "transcript": "So session 11 assignment is a corporate financial decision analysis for Apple. We're going to be using the driver methodology to analyze this decision. And starting off with the first D is define. We want to define what are our goals and what are some of the parameters of the decision. Our goal should be to decide how should Apple deploy their $90 billion towards buyback or other alternative uses. We're going to evaluate value creation versus value transfer and how this affects stakeholders and all the parties involved. The situation is the current share price being $185. The PE being 30, the shares outstanding $15.5 billion, the buyback size or the valuation in this the monetary value in this case we're analyzing is $90 billion which would be a 3% of shares retired. We we have $165 billion in cash, $110 billion in debt, and hundred billion dollars in free cash flow. And some of the alternatives uh besides a buyback we'll be looking at will be a special dividend, a debt reduction, a strategic AI/VR acquisition, and incremental R&D investment. So first in the represent stage, you want to set up basically what we're going to be analyzing. The questions are how much EPS increases under the buyback? How do ownership stakes shift? Which stakeholders benefit or lose? Does the buyback create value or is it cosmetic? And how do other uses of capital compare? Uh the skeleton for the code will be to set up the parameters first, then set up helper functions, then scenario calculations for all the different scenarios and then visualize it in tables and graphs. The model components uh would be a share count adjustment adjustment, an EPS and price recalculation, stakeholder value mapping, comparing buyback versus alternatives, and the scenario toggles and visualizations. So, we're starting off with the code. Uh this first part of the code is inputs and helper functions. We set up the parameters for all the different actions, the balance sheet and cash flow with the previous established parameters of free cash flow and debt. Then proposed capital action which would be the way to allocate the $90 billion. uh assumed return on investment and re research and development acquisition costs and stakeholder details for like the current percentage and of shares held held by either the CEO or the retail shares or Bshire Hathway which owns 6%. And then we set up the helper functions functions like compute baseline and then some other ones like computing the stakeholders and computing the leverage metrics to see how much leverage would be lost in this scenario. Then the second part is actually calculating the scenarios the buyback scenario which retires the share. It would increase EPS since there would be less shares outstanding and the ownership concentration would go up since the stock since the company is buying back shares. In the dividend scenario, there would be a 5.8 dividend per share and no EPS improvement. In the debt reduction scenario, the interest savings would be equivalent to $3.6 billion. And this would also increase the earnings per share from a more real and longstanding output in operational benefits of having more equity to deal with. And then return development or acquisitions would both boost long run net income and through the return on investment of acquiring a new company or developing new technology. Then in the next part we run all the scenarios and the the visualizations. We set up functions we set up a dictionary for all the scenarios. The functions can also create data frames and the plots the earnings per share and the debt to capital or leverage. And then in the execution block which is this final block we call the functions and plot the visuals. Then in the validating stage here we can see our output. We get a a main table with the key metrics, the net net income, earnings per share, share price, shares outstanding, market cap, debt, and debt to capital and then the stakeholder outcomes. From here, we can draw a few conclusions. We can see that the earnings per share increases under both buyback and debt reduction, but only debt reduction reflects true fundamental improvement. This is because when you're buying back, you're technically boosting the the EPS, but it's more of a cosmetic. As we stated previously, it's not truly and fundamentally boosting the earnings per share or the actual valuation of the company. Research and development and acquisition scenarios generate the largest long-run increases in net income. Since this boosters the company's actual growth, it supports sustainable value creation. The debt to capital improves meaningfully only in the debt reduction scenario. As we can see here this number in most of them it stays at four or 3%. In the debt reduction scenario it would be the only one which is actually reducing the debt since logically it's investing that capital into debt reduction specifically. Uh this strengthens the balance sheet but also weakens the return on equity at certain point since it would have less leverage. The stakeholder value shifts reveal that buybacks disproportionately benefit Berkshshire the CEO and option holding employees confirming value transfer rather than value creation. buying back stock wouldn't really it's more like moving money from one place to another not actually creating sustainable growth or net income increases in the company which is why as you can see here the baseline and the buyback have the same net income as well as paying out the dividend and the debt reduction actually increases it while R&D and acquisitions would increase the net income while also increasing increasing their earnings per share then And we can plot a couple graphs. The EPS comparison is similar in most although as you can as we know it goes up more for R&D and acquisitions. And then the leverage is similar just greatly decreased by the debt reduction. Once again, since logically when you're buying back some of the debt, then the leverage equation the the numerator would increase driving the number down the nu the denominator in the equation. The EPS bar chart also also shows that R&D and acquisition delivered the highest upside surpassing the buyback and their reduction in long run EPS potential even by a slight margin. The buyback bar clearly lifts the EPS the least among all value scenarios illustrating its limited economic contribution which would be here. The debt to capital graph highlights that only debt reduction improves financial resilience while buybacks slightly increase leverage risk which is demonstrated here. And then the stakeholder ownership chart shows how buybacks concentrate ownership by 3% confirming their asymmetric benefit toward large instit institutional holders like Bershire or the CEO. So the last two steps in driver would be evolve and reflect. To evolve this we could test alternative buyback sizes $50 billion or 120. We could allow multiple PE to fall if signaling is negative. We could include higher cost of capital under increased leverage. Test different ranges for the actual return on investment if we had more details about where the R&D or the acquisition could go. And then we could test strategic constraints involving more of a behavioral economics and analyzing the macroeconomic factors of what an acquisition of an AI infrastructure company would look like. Then finally, we reflect on the whole analysis. I've said some of these things already in the graphs, but buyback raises EPS, but the risk is cosmetic. But there's a risk that it is cosmetic since it's more of a reallocation of funds than actual creation of of infrastructure or value. The value creation comes more from the R&D or the acquisitions. The debt reduction improves balance sheet resilience. It makes a company stronger in that sense. But for a company as big as Apple, that isn't really necessary. The debt is part of what makes it grow. Stakeholder incentives are not aligned since management benefits most from buybacks. The retail investors wouldn't see that much of a value or the company itself, but there will be a monetary immediate effect that could benefit the major stakeholders. At a price per earnings of 30, the repurchasing stocks risks overpaying since it's not the best price point. And then Apple's long run value depends on innovation, not financial engineering or moving the debt around basically. So with the help of the AI agent, we came up with a recommendation of diversifying the allocation of $90 billion. Since the results are pretty spread apart and similar, the most logical way to go about would be to allocate different levels of funds to different things. First of all, out of the five options, dividend is the least beneficial. So we cut that from the recommendation but then we would allocate 40 billion $40 billion to R&D $20 billion to strategic acquisitions 50 billion to debt reduction and then 50 billion to a targeted buyback. This leverages the risk of buying at the current price since it wouldn't allocate $90 billion just 15 billion. It would also do some of the debt reduction to strengthen the balance sheet and the financial health, but mostly focus on the research development and the strategic acquisition since these would turn into the most beneficial long-term net income growth and overall growth of the company. Thank you."
}