{
  "student_name": "Holden Higbie",
  "org_defined_id": "035882206",
  "username": "higbieh",
  "email": "",
  "transcript": "Hello, this is Holden Higby, and right now we're doing session 10, and this is the code that I had Jim and I create for me using the driver framework, and this assessment was over cost of capital analysis. So to start off, this is just the numpy that it installs for the financial analysis thing, And then here's the defined stage is setting the scene and the key parameters of the of the situation that's going on. So Starbucks has an initial investment, which is 12 million, and their working capital is 500,000. Their whack hurdle rate is 8.5 percent. Their tax rate is 25 percent and their project life is over 10 years. and the terminal value is $3 million. And annual depreciation equals initial investment divided by project life, so that's $12 million divided by 10 years is $1.2 million per year of depreciation per year. And then that is the array of the things, and then i believe we're good to go to stage two here uh so this is the represent stage and this is where we do all the formulas and uh so uh to start the net present value which is the total value of a cash flow stream today uh so it subtracts the initial cost from the discounted future cash flows. So except if NPV, the net present value, is above zero. So the formula for that is NPV equals the sum of project cash flow divided by one plus whack to the t for t equals zero to n so that's the time and the periods and then operating cash flow ocf this is the cash generated from the project's regular business activities and the formula is ocf equals notepad plus depreciation or ocf equals our earnings before tax times one minus tax rate plus depreciation. Or it could also equal revenue minus operating costs minus depreciation times one minus tax rate plus depreciation. And then depreciation tax shield, the tax savings generated because depreciation is a non-cash expense that reduces taxable income. And the formula is annual depreciation multiplied by tax rate. And the profitability index measures the benefit or the PV of the cash flows per unit of cost, the initial outlay. And the decision rule is accepted if the profitability index is above one. And the formula is PI equals present value of future cash flows divided by initial outlay. And then net present value, which we already looked at, takes the future cash flows excluding time zero and adds the time zero cash flow, which is already discounted to zero. The initial rate of return, the discount rate that makes the NPV of all cash flows equal to zero um and the exception is fallback if ir calculation fails if mock and npf is used and then present value of future cash flows pv fcs fcf uh used for the profitability index calculation. And the profitability index is calculated by the PVFCF divided by the initial outlay. And the discounted payback period, this is calculating the discounted cash flows first For year one onwards, discount factors equals one divided by one plus the rate to the power of the NP range. One lends cash flows. Or you could look at it as cash flows one multiplied by discount factors. And there's a few other ways that you can look at the formula. that it shows and then pre-calculate let's just go to the output here for stage two yeah so the mpv formula which is are all things that we've already looked at depreciation tax shield profitability index and then it moves on to stage three so let's go to stage three in my okay okay uh stage three is the implement stage and this is where we just combine the first two stages to create a cash flow schedule and the core metrics of what we're looking at here and so run i think it would be best if we just go down to the output here um yeah stage three uh the ir calculation is only approximate without a proper solver So, A, the base case, incremental cash flow schedule, and millions. Note the values are rounded for the display, but all calculations use full precision. So, here is the 0 through 10, all the years, and it goes over revenue, operating cost, depreciation, EBT, tax, NOPAT, OCF, WC change, salvage, and project CF. And then B, the base case capital budgeting metrics, so the WAC is 8.5%. And that's just what we need to do better than. And the initial outlay, present value of cash flows is 12.5 million. So the net present value is 4.342 million. and the internal rate of return is 15%, which is good because that is higher than the WAC here. So we'll get to that in the later section. Profitability index, 1.347%, which is also good because they said that except if above one. Simple payback period, 5.28 years. Discounted payback period is 8 .21 years. Now we can move on to section 4. This is the verifies, testing the numbers, and we should just go back down. Where is it? Oh, here it is. Okay. Cross-checking and validation. I asked it to compare with a peer that has done something similar. Verification method, the cash flow model is verified against a standard segregated OCF and non -operating cash flow approach. The peer model is the bottom-up OCF calculation. OCF equals revenue minus operating cost, no depreciation, times one minus T plus depreciation times T. This model is considered better because it explicitly calculates and shows ebt divided by nopat which increases transparency for tax liability so the year one verification check calculated ebt um is zero expected ebt zero so that's a match calculated ocf year one is 1.2 and expected ocf uh 1.2 so the verification conclusion NPV is positive the base case financial analysis is sound and the project is preliminary preliminarily recommended for acceptance now we can move on to stage 5 and here's the code for that and what we did here sensitivity analysis, so the IRR calculation is only approximate, is what it says, and then sensitivity analysis results impact on NPV and IRR. So the base case, WAC, is 8.5, NPV was 3 .42, or 4.342, and the IRR is 15%, and that's what we saw above. And so the revenue, so this is if the revenue was down 20%, um, WAC would stay the same, but the NPV would be negative 1.924, and the IRR would still be 15%. So, and then this is the WAC minus 2%, so if it was at 6.5, the NPV would be at 5.750. and this is if the WAC was at 10.5 % so plus 2 the NPV would be 3.111 and IRR would be the same for all of them but you can see how decreasing the WAC increases the NPV and increasing it decreases the NPV and that's just because of the moving hurdle rate and the changing net present value of the project. Also, with decreasing the revenue, there is less present value in the project, clearly. So, sensitivity interpretation, revenue risk, a 20% reduction in revenue causes the MPV to drop from 4.342 to negative 1.924 uh this is critical um this revenue drops makes the npv negative and results in a reject decision the project is highly sensitive to achieving revenue targets so yeah so any changes in revenue would um change the npv pretty drastically here and the cost of capital risk, so scenarios three and four, the changes in WAC primarily impact the NPV, so if the WAC drops it increases significantly, and if WAC rises the NPV decreases to 3.11, and both of those scenarios we would still accept but this one right here we would not accept it as quickly as scenario 3 where the WAC drops. Now we can go on to the final stage and I'll show you the code and we can just go down to the bottom and so the base case and we heat NPV, WAC, 8 .5%, 4.342 million, and the internal rate of return, 15% decision rule. Since NPV is greater than zero and IRR at 15% is greater than the WAC at 8 .5, the project is financially attractive, so it's already looking good here. And then recommendation, except with caution, the risk profile is high just because of what we looked at here. The revenue decreasing by 20% would drastically change our NPV. And the detailed rationale financial viability, the positive base case of NPV of $4.342 million, confirms that the project creates economic value for Starbucks. Returning more than the cost of capital, the IRR provides a substantial cushion over the 8.5% hurdle rate. And the sensitivity return, the most significant risk is the revenue generation. If it falls by 20%, the NPV becomes negative. This highlights the need for conservative revenue forecasting and a strong marketing strategy post year one and the strategic fit and brand implications a flagship roastery aligns perfectly with starbucks uh premiumized premiumization strategy enhancing brand equity and providing a halo effect for the entire product line this strategic value while unquantified in the model provides additional justification and the project risk primarily primary risk involve construction costs, overruns, increasing initial outlay, and failure to meet the two to five year revenue ramp -up targets, which is the critical sensitivity factor. And the project is financially attractive in the base case, but highly sensitive to revenue targets. The recommendation is to accept but implement robust contingency plans for revenue underperformance, and the management should proceed prioritizing measures to lock in revenue certainty in the early years. So the financial metrics at the end, just NPV equals 4.342 million, IRR 15%, and the PI is 1.347. Thank you.",
  "video_url": "https://youtu.be/VF6XAt6SwvE"
}