{
  "student_name": "Vincent Craw",
  "org_defined_id": "035627160",
  "username": "vcraw",
  "email": "",
  "transcript": "All right. Hello and welcome to my session 10 assignment. So pretty much our assignment is it's a grocery project for um it's like an evaluation of Starbucks. Um we're evaluating the proposed 10-year Starbucks flagship roaster project which requires an initial investment of $12 million. um use the firm's uh weighted average cost of capital as the financial hurdle rate to determine if the project creates value and to make a clear recommendation uh either to accept or deny. So our primary objective is to make a simple accept or reject decision. Um the project is accepted only if the net present value is greater than zero and the internal rate of return is greater than that uh 8.5% uh weighted average cost of capital hurdle rate. So the project's life is 10 years. Um, the total in initial outlay at year 0 is $12.5 million, which includes the $12 million investment and the $0.5 million in working capital. The initial cash flow is -12,500. Um, the annual depreciation is calculated using the straight line method over 10 years. So that's like 12,000 over 10, which is or it's 12 million over 10, which is uh 1.2 million. Um so then our financial model calculates the yearly unleveraged free cash flow or UFC. Um for any given year we first calculate earnings before interest and tax or EBIT uh by subtracting overall cost and depreciation from revenue and then we calculate the net operating profit after tax or NOAT by subtracting the 25% corporate tax from EBITS. The standard UFC is then the net operating profit after tax plus the depreciation. And then this is the adjusted this is adjusted in the final year to include the terminal value of the $3 million and the recovery of the working capital. So the model generates a stream of cash flows from year 0 to year 10. To illustrate, in year two, the project generates $11 million in revenue. Uh after subtracting operating cost and depreciation, the EBIT is $2 million. This results in half a million in tax and net operating profit after tax of 1.5 million. Um the unleveraged free cash flow for that year is 2.7 million and um that's just like the uh net operating profit after tax plus the depreciation that's at uh $2.7 million. So that's how we find that. Um and then going further to see like the entire cash flow stream. Um we calculated the primary capital budgeting metrics. So like the net present value. Um this is the sum of the present values of all future cash flows discounted at 8.5% which is the weighted average cost of capital. Again the hurdle rate that we need to be over with. Um the formula takes every single cash flow from the initial investment. So that's time at t equals 0 through the final year of like time at t= 10. Uh and then it discounts it back to the present. So the formula used is the net present value which is the reman sums of time of zero to time of 10 and this is the cash flows of t over 1 + the hurdle rate to the time the calculated net present value is a positive 3 million 673 and 788. Um and then we go to internal rate of return which is irr. The internal rate of return is a discount rate at which the net present value of the project is exactly zero. Um, so the the formula for this is the sums of the cash flows of of the 10 years all added together and then that's over 1 plus the rate um to the time and that has to equal zero. So the calculated internal rate of return is 11.96%. Um the profitability index uh this is what measures the value created per dollar invested. So the profitability index is formula is the present value of inflows divided by the present value of outflows and that equals 1.29. And then for the fourth thing we found is like the discounted payback period. So this is the time required for the present value of the inflows to recover the initial investment. Um and the calculated discounted payback period is 7.76 years. So we're going to validate all of this. So we have the metrics that are consistent and sound. Um the project passes the acceptable rule because the net present value is positive uh at 3.6 million. All right. Yeah. 3.6 million and the internal rate of return is at 11.96 which is a lot higher than the uh 8.5% weighted average cost capital which again that hurdle rate if it's above it then that's a good thing. Uh the profitability index of 1.29 29 confirms that the project returns $1.29 for every dollar invested today, which is also a good thing. You're making money off of money you're investing today. And then we look at like the sensitivity analysis going down our code. Um, so we tested the project's resilience and two major risks. So we see that the revenue reduced by 20%. So a 20% drop in expected sales is a major stress test. Uh under this scenario, the net present value plummets by but remains slightly positive at uh 0.21 million. Um and the internal rate of return remains at 8.84. Uh this means the project is viable but has very small safety margin if revenue targets are missed by this much. And then the weighted a average cost of capital change is uh plus or minus 2%. So if the financing cost increase to 10.5% that's just the 8.5% the weighted average cost capital that we had plus the 2% the net present value would be would still be a strong 1.73 million. So this shows the project is resilient to moderate fluctuations in the company's cost of capital. And then going back to reflecting on this and finally coming to a recommendation uh as we go down the code and um just seeing how this all comes together and what we're supposed to do uh as like Starbucks. So the project generates significant financial value and demonstrates strong returns. The internal rate of return um of 11.96 offers a comfortable buffer over the cost of capital. Furthermore, the flagship roaster aligns perfectly with Starbucks strategy to reinforce its premium brand experience and market leadership. So, our final um recommendation is to accept. The project is highly recommended because it delivers a positive net present value and an internal rate of return that significantly exceeds the weighted average cost of capital. Although the sensitivity analysis showed revenue vulnerability, the project still technically passes the most adverse financial stress test. uh we must now prioritize mitigating the execution risk and that's the risk of construction delays and cost overruns to ensure the forecasted value is fully captured in those calculations. So what I did basically to make sure all the calculations from the codes were correct is I ran through um the calculations on Excel and on my own and they were all the same. So that is it for my session 10 assignment. Thank you so much for listening and have a great Thanksgiving.",
  "video_url": "https://youtu.be/2IXeI6h8Vsc"
}