{
  "student_name": "Andrew Jacobs",
  "org_defined_id": "036214646",
  "username": "jacob269",
  "video_url": "https://youtu.be/7lm8I6-CQTM",
  "transcript": "Hello, my name is Andrew Jacobs and this is Session 11, Assignment. And in this video, I'm acting as an independent analyst evaluating Apple's proposed $90 billion share repurchase.\n0:14\nThe key decision I'm solving for is should Apple use $90 billion of capital for big buyback or alternatives like a special dividend, an AI or VR acquisition, debt reduction, or R&D, a better use of cash.\n0:29\nMy goal is to follow the driver framework, quantify the impact on earnings, leverage, and key stakeholders, and then recommend the mix that creates the most value rather than shifting value.\n0:40\n\nSo, here's the first cell running. And in the discover stage, I click the main fax, which is Apple has around $165 billion in cash and investments and roughly $100 billion a year in free cash flow.\n1:00\nSo, the stock price is about $185 with a P.E. of 30. a low dividend yield and a 15 and a half billion shares outstanding and the debt is around 110 billion so on the stakeholder side Berkley Shire owns about 6% and the CEO holds around 3 million shares and a typical retail investor has around 100 shares\n1:29\nand the employees hold options with a strike of 170. Conceptually, I'm drawing on capital structure, agency, and signaling theory. Buybacks boost EPS and signal confidence, but they can also concentrate ownership and reward insiders.\n1:47\nAnd acquisitions in R&D only create value if returns are above the cost of capital, and the debt reduction mainly helps bondholders and risk.\n1:55\nSo the overall structure for the risk portfolio represents is, uh, we first communicate a baseline snapshot implied by the market.\n2:05\nSo that's EPS, net income, market cap, net cash, and debt to equity. Second, we build, uh, separate functions for each capital, uh, allocation choice, which is buyback, special dividend acquisition, uh, debt reduction, and R&D.\n2:20\nUh, each function will spit out EPS, implied share price, assuming the PE stays the same, cash, debt, and leverage. Then I added a small stakeholder module to see how Berkshire, the CEO, retailer investors, employees, and bondholders are affected.\n2:40\nAnd finally, I visualize EPS across scenarios in one bar chart. All right. So next we move on to cell two and cell three, and here's the output.\n2:56\nUh, the baseline has a strong EPS and a very low debt to equity. So Apple starts from a position of financial strength, that 90 billion buyback shrinks the share count and gives a modest EPS and price boost.\n3:11\nAnd cash drops but leverage barely moves because equity value is so large. The special dividend uses cash but leaves EPS and share count unchanged.\n3:20\nIt mostly acts as a one-time cash transfer to exiting shareholders. A strategic acquisition that earns around 12% after tax increases net income, EPS, and the implied share price more than buyback while keeping low leverage.\n3:36\nSo the debt reduction uses the same 90 billion to pay down debt. EPS rises slightly from internet savings, interest savings, but the big benefit is a much lower debt to equity ratio, which is great for the bondholders and overall risk.\n3:52\nR&D with a high assumed return gives the largest EPS and price uplift in the model, again with the modest leverage.\n4:00\nSo from a validation standpoint, the model behaves the way finance theory suggests, which is buybacks help EPS mechanically, dividends don't charge EPS, and the high ROIC investments drive the strongest long-term earnings growth.\n4:13\nUhm, next we look at cell 4, so we run it. We look at the outcome. Uh, so if Berkshire and the CEO do not sell into the buyback, their ownership percent changes.\n4:29\ntick up because the overall share count falls. Their equity wealth also rises if the price moves higher and a small retail investor who holds also benefits.\n4:40\nEmployees with 170 strike options see those options become more available, valuable as the stock price rises above the level. Bondholders on the other hand are basically unchanged under the buyback because the debt balance doesn't move.\n4:54\nThey benefit much more in the debt reduction scenario when leverage falls. Next we look at cell 5 and we get our chart.\n5:04\nSo in the cell 5, I plot EPS across scenarios. The picture is simple. The buyback and debt reduction provide a modest EPS lift.\n5:12\nThe special dividend is flat, and the acquisition and R&D scenarios show the biggest EPS gains if Apple can actually buy.\n5:20\nSo in the evolve and reflect stages, I talk about sensitivity and then make a recommendation.\n5:35\nIf the real ROIC on acquisitions or R&D is weak, then those scenarios move down, and the buyback looks more attractive as a way to return excess cash and avoid low return projects.\n5:48\nBut if Apple has credible, high-return equities, and AI, VR, and R&D opportunities, those investments clearly create more long-term value than a pure 90 billion buyback while also supporting the bond holders.\n6:00\nFrom an agency and signaling perspective, a huge buyback rewards insiders, boosts EPS, and signals confidence, but it can also be a way to avoid making tough strategic bets.\n6:13\nMy recommendation is not at all, not an all or nothing buyback, uh, but Apple should return a moderate buyback to, uh, return surplus cash and signal confidence, but pair it with a meaningful investment in high ROIC acquisitions and R&D and consider some gradual debt reduction.\n6:31\n\nthat mixes balance that makes balances value creation and value transfer and better aligns the investments of shareholders employers and bond holders so that completes my driver walkthrough of Apple's 90 billion dollar capital allocation decision for the AI use I use AI to help me brainstorm and help\n6:50with the coding for the project thanks so much for watching"
}