{
  "student_name": "Jose Casiano Trujilo",
  "org_defined_id": "037715236",
  "username": "jcasian",
  "video_url": "https://youtu.be/gwnaHphqbbg",
  "transcript": "So hi, for the last video assignment for session 12, um we are going to evaluate Panera Bread in the context of a potential KR take over while also accounting for strategic biders like Starbucks or McDonald's who may be willing to pay even more because of things like synergies. Yeah. So to start, oh to start h let's move into the driver framework. As always, if we focus into define specifically, what I explained was how that deliverable is an executive ready recommendation as it has validation range, a winning bid strategy and a clear rationale for how the bid changes depending on whether the buyer is financial or strategic. For those reasons, uh this analysis has to be defensible using the three standard valuation approaches. Oh, approaches which are DCF, trading comps and president transactions. And also it must end with a bid range and walk away logic. Focusing now on the discover part. What I explained was how the given deal how the given deal information creates the first set of constraints and drivers. H first Panera is already large about 6 billion revenue growing at 8%. It also has 900 million EITBA at a 15% margin and 400 million of net income across roughly 2100 stores. Their digital sales are already 50% and management once 10% roll over which affects check size and incentives. Erh some other things to consider is how the market reference also tells that how the market might tolerate for example the industry PA around 22%\n\nthe president EV over EIT DA multiples around 12 and 15% and benchmarks pees like Chipotle at 35 McDonald's at 5. Overall, this basically means how the valuation is not just an internal DCF problem. It is also a triangulation issue where the DCF has to stay within a reasonable neighborhood of comparisons and precedents unless we can actually define how it diverges. And then moving into the represent. What I said here was how the valuation problem is a system that converts operating assumptions into cash flows and then enterprise value while using a cross checks that enterprise value against the marketbased methods. The DCF component is built around five-year revenue growth, margin trajectory, reinvestment intensity through the cake and working capital and also the terminal value. H the multiples additionally produce an enterprise value range using the EV over EVDA and separate cross check using the P translated into enterprise value. The buyer type overlay that adjust interpretation. It is how financial buyers are constrained by return requirements. Meanwhile, a strategic buyer can justify incremental value through synergies, but only and only if those synergies are risk adjusted and realistically captured. So here in implement it is my prompt because my last prompts that I did did not work at the first try for the last video assignment. I decided to start by asking my trustworthy AI to help me build a prompt and luckily it did run a like flawless in the first try. So we have this uh interesting code and to start explaining it we can see\n\nwe can see for example here the data class. It basically it grabbed all the specific values that the mission gave us. For example, the revenue, the FDA, the net income, store count, and all of those things. Then we have the capitalization which basically sets cash and depth and it also computes the net depth which later is going to be used when translating enterprise value into equity check size. uh the DCF input additional control D assumptions and terminal assumptions and we can move now into this new section which is the whack output and the section basically justifies that discount rate from fundamentals here it computes by using the cost of equity calculated by the KPM as key equals RF plus beta times the ERP and after the tax cost of death it is equal to the pre-tax KD times 1 minus tax rate which then wackies is the weighted average using W and W sorry and W D.\n\nSo moving to the this Yeah. So moving to the DCF engine. Uh here is how the EV is created. It is the core of the DCF. It contracts the five years of operating projection and free cash flow while also using the discounts and then adding the terminal value.\n\nYes. Oh, I don't know why I didn't found this. So, here we also can see the point to revenue, which is going to equal the snapshot revenue times the 1 + the imp revenue times the year, which is the revenue projected using compound growth over the explicit period. We also have the point margin equals the project linear and EIDA equaling the revenue times the margin which is the margin interpolated from today's margin to the target margin and then using the EIT DA revenue times the margin then we have the depreciation model as a percent of revenue and EIT is EDA minus depreciation creation.\n\nHere\n\nwe have the capeex equals revenue times the in capeex as it is a percent of revenue representing the reinvestment. Here we have the working capital modeled as a percent of revenue. However, in here the cash flow depends on the change in working capital year to year. Uh so this section right here is computed explicitly.\n\nThen we can move to the free cash flow as NO pay 80 plus depreciation minus the kex minus the change in working capital. Then after that it is those free cash flows again but now discounted using the scenario whack. And over here we have the terminal value computed using the cordon growth model uh which is the terminal FCF growth at G and is capitalized by whack at my negative G. Over here we have the enterprise values being the PV of explicit free cash flows plus the PV of terminal value. And this right here is a terminal multiple computed as a sanity check. The basics is the terminal value divided by the five the year five orda. So the DCF isn't hiding an unrealistic terminal assumption.\n\nThen we have this printed sections.\n\nand the\n\nOkay. So I think we can now move into the synergies which is this function which computes the present value of synergies as a finite horizon annuity. It applies the the capture and discounts at a higher rate to reflect integration risk.\n\nThen into this next section here, it is the core financial buyer discipline logic. It estimates the exit enterprise value based on assumed EVDA growth over the whole period and an exit multiple which is very important. It converts that into exit equity value by subtracting net depth and then it works and basically then it works backward. If KKR needs a 20% IR over five years, the equity invested today must be less than exit equity divided by the required equity multiple. This function also adjust for management rollover because management keeps 10% of equity. The sponsor then only funds only 90% of the entry equity check with changes that KKR can afford. while still hitting its return.\n\nIn this section right here, the trading the trading comes plus presidents plus the P over E cross check. Uh in here this specific function builds market base valuation ranges. It takes a pure set of EV over EIT DA multiples using the median and then it sets trading range as a median plus or minus one turn. It also produces the present range using the given 12 - 15 X multiples. And finally, it computes equity value using P over E and converts it to enterprise value by adding net depth. So all ranges are comparable on the football field which was something the assignment uh mentioned. And\n\nthen here is the whack times terminal growth sensitivity table. And the function runs the base scenario in a repeated manner across a grid of discount rates and terminal growth rates returning a table of enterprise values. Uh the reason why this exist is because the DCF is most sensitive to the whack and thermal growth and and we needed to do a sensitivity analysis. Each row is of consumption\n\nand over here we have the football field graph and this is plotting the function that it will take on the valuation ranges and plotting them into a single horizontal scale\n\nin the data also uh in addition to the data it has the DCF scenarios as points because each scenario produces a single EV number while comes and precedents are ranges\n\nand and\n\nthat's basically the code itself. then we would move into this part of the code. But this section it it is printed at the end. So I'll get back to it later. So I think we can move into the next section of the driver framework. After uh implementing the code and understanding it uh we move into validate and in here the logic is that no single method is trusted in isolation. The DCF needs to pass two basic checks. First the terminal value share should not be observed and the implied terminal multiple should be plaus plausible relative to president and trading ranges. Aside from that, the coms and presidents need to be internally consistent with the teal snapshot. We we do this by using the FBA base multiples given by the panera scale and profitability. Finally, the strategic overlay must be conservative because synergies get cut and discounted at high risk rate than the core business itself. And the financial buyer ceiling is defined by a rate by the return gate. So we don't accidentally recommend a bit that looks fair. But actually it will fail a PE investment committee.\n\nThen into evolve. If I were going to evolve this model for real deal use, I would replace the placeholder peer set with actual publicly traded comparations and fold their multiples automatically. After that, I will probably add this kind of leverage schedule with the basic intention of having the PE return gate reflecting the tapped payown and interest expense rather than only using a simplified approximation. I think something also interesting would be splitting synergies into buckets. for example cost revenue procurement and also stage the ramp over time instead of treating them as a flat annuities. The goal with these evolutions would be to keep the same structure but also make the impulse datadriven and the few financing mechanics closer to reality.\n\nI I think yeah I think we can keep on the driver framework and uh and the in the reflect and what I said was how as always the framework show its valuation not a single number rather it's a range bounded by assumptions specifically to this assignment the DCF is most sensitive to whack and the terminal value which is why sensitivity analysis is required and essential and it also means why implied terminal multiple is checked. The market methods anchor the DCF to reality by showing where similar assets trade and what buyers have paid historically. The buyer type comparison also matters a lot. A strategic buyers may rationally outbid a financial buyer and the right recommendation in that case is not to match the strategic bid but to set a discipline ceiling and complete uncertainty structure and speed. So this was the reflection uh of the entire process and I think we can move now into the last part of the code which was the\n\nwhich was the result of the a of the method.\n\nSo here it has the whack justification checkpoint.\n\nwe which it firstly it tells the KPM equation which we talked before the DCF summary with the specific values the downside scenario the base scenario and the upside scenario we have the base case cash flow bridge the defensible peer set by the trade incomes the multiple valuation range and the strategic synergies KKR discipline and sensitivity. All of this here is what we talked before of the code. What the code actually did was spread all these numbers and turn it into the solution that I will explain later. And this is that checkpoint to validate also in the validate section if this code if the code actually ran through the numbers correctly and the numbers that we basically wanted.\n\nSo\n\nwe could start with the football field.\n\nYeah, we could start with this which this is the graph and on the football field the DCF downside based and upside as you can see appears as individual points. The trading comps and presidents appear as horizontal bars and the two PE based methods also show where equity based valation would lend one translator into enterprise value. The practical purpose of this is a triangulation if because the DCF is widely outside the trading oppressor ranges. That's a signal to revisit assumptions.\n\nAnd here is the solution outputs.\n\nSo first the valuation range. This range was computed by intersecting the TCF scenario bent with the market anchors. Specifically,\n\nuh the low end is the maximum of downside DCF and the long low end of trading comes. The high end is the minimum and upside DCF and the high end of the president range that produces the printed recommended EV range of 10.62 billion to 1350 billion.\nThen into the buyer type conclusions. The code printed to buyer interpretations for KKR. The binding constraint is a return gated maximum entry EV which prints at $7.99 billion. And for a strategic buyer, the value anchors the base TCF enterprise value plus the PV of Sergis which is printed at 1150 billion. Then for the bid strategy of open and walk away here the section printed recommended open and walk away enterprise values. The open uses a partial control premium applied to the financial anchor of EV. The walk away is the minimum of the theoretical DCF plus premium number and return gate which is why it all way the walk away prints a 7.99 billion even though the theoretical EV plus premium is higher as demonstrated in these values. Then we have the management roll over check size which this part converts the enterprise value into equity value by subtracting the net depth then applying to a management rollover to show the cashex KR actually right today which is why we can see equity values and then cash pay today as the open bid walk away and strategic IC ceiling. Then we have the negotiation talking points which it is the exact logic that should be used in a negotiation. in anchor to trading and precedent ranges. Reference the inflator multiple from the DCF as a sanity check. And if the seller pushes above the financial buyer ceiling, shift the discussion toward structure, which would be things like rollover returns or restoring instead of simply raising the price. Then we have the financing considerations which this connects directly back to the sensitivity table and the return gate. Cheaper financing or higher leverage can increase what a sponsor can afford, but the model shows that the rec return requirement is still a hard constraint. And finally, the most important part of all the video, the bottom line decision. And this specific line is determined by comparing the KKR's walk away EV to the strategic open EV. In this run, the model concludes the strategics are likely to out if they believe synergies. So in conclusion to the mission and to the this video assignment, Kare should not chase beyond the return gated ceiling. And this was my video assignment. I hope you like it."
}