{
  "student_name": "Ronak Badam",
  "org_defined_id": "036108316",
  "username": "rbadam",
  "email": "",
  "transcript": "Hi, my name is Ronaksai and today I'm going to go over my session 9 content. Um, so utilizing Gemini, I created I utilize Gemini to have my uh Gemini create a real world example on the CFO's dilemma. So in this case um imagine you're the CFO of tech for or mega store. You have three major projects on your desk an AI lab, a manufacturing expansion and international rollout. They all promise returns, but which ones actually create value? So to answer that, we have to answer the CFO's develop dilemma. What is the specific hurdle rate we must clear to keep our investors happy? Today, we are breaking down the weighted average cost of capital, WACC. This is the bridge that connects Wall Street expectations to main street operations. Is not just a formula. It is the blended cost of every dollar we use to fund our business. We're going to look at three spec. So I utilize Gemini again to create three specific examples of how this actually works using our mega store case study. So our first example is is the mechanics and the tax shield. So let's look at our mega store example here and um um we have two main capital providers shareholders equity and lenders debt. Calculating the cost of equity is straightforward. Use CAPM to get 11.3%. But look closely at the code for the debt section. Our bond yields 5.5%. However, notice the calculation for after tax cost debt. We multiply by one minus tax rate. This is because government subsidizes our debt. Interest payments are taxdeductible with a 28% tax rate. Our true cost of debt isn't 5.5. It drops to roughly 3.96. This represents the tax shield. And this specific mechanic is why companies often prefer debt financing. It effectively it's it is effectively cheaper capital. However, as we blend these numbers, we must weigh them accurately. So, our example kind of shows that very clearly as since we have this um this debt shield that we are only having the true cost uh associated. So, let's run this and see what our output is. So our example shows that our pre-cost of debt is 5.5 and our true cost after debt is 3.96 as I said earlier and the the WACC of Megar is 8.81. Now moving on to our second example is the market versus book value. Um so the common trap for junior analysts is using book value from the balance sheet to determine how much debt and equity a company has. In our mega store case, the book value might say one thing, but we must use market value. So our equity, we take the too many million shares outstanding multiplied by the current trading price of 75. We take the bonds at 96% of par value, not the face value. So why do we do that? It's because WACC measures opportunity cost. If investors sold their stake today, they would get the market price, not the accounting book value. So in our Python model, we calculated the weights based on these market realities. 66.1% equity and 33.9% debt that we got from earlier. If we had used book value, we've had underestimated the weight of equity artificially lowering our WACC. This is because we didn't have the proper debt and potentially accepted bad projects. So we can see that here in our get market value. If we run this here, um, so our book debt value is 80 million. Our market debt value is 768,800,000. Our calculated equity weight is 66.1. And our calculated debt weight is 33.9 as I stated earlier. And lastly, we have our the decision. So when we ran our function the calculate basic WACCC of earlier and then we calculated our market weights right so our cost of equity is 11.3 our after tax cost of debt is 3.96 and our weights are 66% equity and 33.9% debt the result is that WACC for mega store is approximately 8.81%. This number is our hurl rate. Now look at the warehouse project. The engineering and sales teams project an 11% return. Because 11% is greater than our cost of capital at 8.81% the project generates a positive positive excess return. This means the project creates shareholder value. If the project return had be 7% even if that sounds like a decent project we reject it because it fails to cover the cost of the capital required to fund it. So to summarize this in we um actually let me go over our third example to evaluate the project. So here we can see that the CFO's decision engine corporate hurdle rate 10%. Project alpha the AI lab returned 15% project beta manufacturing return 12 and project gamma intel international expansion returned nine. See, we rejected international expansion because it it returns 9% which is lower than WACCC and it destroys value. So to summarize all this, we leverage the tax shield to lower our infective cost debt. We always use market values to reflect true investor expectations and WCC WACC is the objective floor for all investment decisions. We have now determined the discount rate and our we have now um we have now determined our discount rate. Thank you. All For you",
  "video_url": "https://youtu.be/Pe6_cZHalqk"
}