{
  "student_name": "Daran Ebadi",
  "org_defined_id": "036201910",
  "username": "debadi",
  "email": "",
  "transcript": "Hi, this is my market efficiency investigation of GameStop GME using the driver framework. I'm going to test weak form, semi- strong, and strong form EMH. I'm going to compute the abnormal returns using a CA PM event study and analyze volume and predictability and evaluate behavioral finance limits to arbitrage and market micro structure. And I'm also um just kind of build on those things. So first fact is verification the statement GameStop traded at. Okay. So here three app parameters and events. I'm going to define the analysis window for mid 2020 to today. the tickers GME and spy which is the market proxy and the event dates and then we're going to go over here to the CAPM event study. So, this is just going to lay out my event study, the expected return model, the CAPM, and for each event, I'm going to estimate a alpha and b beta over a 250day estimation window ending um 30 days before the event. And that's all detailed in number seven over here. Um, and so for reform efficiency, I'm going to test return predictability um and use the OS formula. And I'm also gonna evaluate volume standard by it 60-day average. Um so now I'm going to download GME and spy closes and spy closes and compute daily returns and create standardized volume. Um this is going to set up prices, returns and volume for the event study. And this function is going to fit CAPM um that outputs AR C series plus alpha beta R squar and a mean AR T statistic over that window. And then we're going to run the events. And here I'm going to loop over the four events 13D 13D/ A peak slash the restrictions and hearing. And so for each event, I'm going to plot the abnormal returns, cumulative abnormal returns, and a volume over 60-day average. And these visuals are going to kind of reveal information um incorporation and kind of hurting the um hurting and like attention spikes. And so now I'm going to run lung box at lags um May 10th 2020 to test serial correlation and the one lag OS for predictability and this table over here summary is going to print alpha beta r 2 it's t statistic and uh cir for quick vidation and so around giant so we're going to go through our AR and C plots here. And so around January 28th, 2021, um the peak restrictions um were large in magnitude and consistent with the short-term market um anomaly. And around coins 13D, 13D/A, there's this typically strong positive CIR consistent with semi- strong efficiency. Um so public information is rapidly incorporated. And the p values here from the lung box are here in the output. Um they don't show persistent correlation and the one lag regression slope is near zero which is insignificant. And that means we form efficiency largely holds very little predictability in daily returns almost zero actually. Um, and so now I'm showing the volume over 60-day charts around the January 28th window. So volume standard by 60-day average spikes to extreme levels. Um, which is textbook attention and hurting behavior. And so from an investor profitability perspective, um, profit opportunities were not reliable Xanti. Um you know riskadjusted returns are very poor for repeatable rules once you consider you know short sale constraints, borrow fees, hall risk and execution limits which are the classic limits to arbitrage and also market microstructure issues like clearing house, collateral demands and trading prescriptions. These are all why this locations um persisted briefly. And so here's the summary table. And weak form EMH um holds no return predictability from our test. Semi-strong EMH mostly holds it. Prices respond quickly to public information. And um temporary overshoots are consistent with behavioral finance and you know other frictions from micro structure, not a wholesale EMH failure. And strong foreign EMH does not hold. Um not all private information is reflected in prices and so behavioral biases were on display you know hurting uh overconfidence uh lottery preferences and different attention cascades. So policy implications and theoreticalations support that shorter settlement cycles and more transparency on maybe collateral mechanics for investing. The balance still favors passive management. Um, more conservative while active strategies may occasionally exploit dislocations and face capacity and risk restraints. So that completes my driver um with CAPM of normal returns event study, volume analysis, predictability tests and a balanced EMH versus behavioral finance assessment. Thank you so much for watching.",
  "video_url": "https://youtu.be/-226CD1Yv9Y"
}