{
  "student_name": "Jonathan Hinds",
  "org_defined_id": "037200739",
  "username": "hindsj",
  "email": "",
  "transcript": "Hello, my name is John and today we're going to be doing our um session 10's um video assignment on our cost of capital analysis. And so using the driver framework, we have to define and uh discover our problem. And so we have our um project parameters right here defined for us laid out right from the get- go. But um we have to discover what we're looking at and um we're going to be evaluating Starbucks proposed flagship roster that requires 12 million upfront outlay and is expected to operate for 10 years. We're going to use the firm's 8.5% WACC as a hurdle rate to determine whether the project creates value and to recommend an exception or rejection decision supported by driver documentation. And so, um, in Google Collab, um, we're evaluating the, uh, Starbucks rostery as it's, uh, uh, 10-year, um, $12 million capital investment, and the Google Collab has our, um, Python coding to be able to help us figure that out. and um discovering our goal for this is our goal is to see if our project beats the 8.5% WACC hurdle. Um yeah, so uh next step would uh on the driver framework is to represent it. So I did a couple loops with um Gemini on this. So I have a lot of um different loops to do the code on this um to plan it out and everything. And I implemented it um using AI to help me write the code. And now we have this code here to help us explain um if we're going to accept or reject the proposed um plan for Starbucks. So we have a couple different steps in the code. So we have our um our defined parameters all in here and then we go right into calculations. So our FCF calculations um more um more calculations here for the other financial metrics we're going to need. And then we're going to do a sensitivity analysis. couple different scenarios. So um we have those scenarios and then um we wanted to have a visualization of the chart um yeah we wanted to have a visualization um and recommendation and as well as um calculating MPV IRRa and discounted uh payback period simple payback period and profitability index using the WACCC and we're also going to build a 0 to 10 year incremental cash flow that includes revenue, operating cost, appreciation tax, shields, tax is working capital charges and terminal value. And so we're do all that and we're going to visualize um cash flows at least one output for the narrative. So knowing all that, we're going to get right into our output. So first thing we're looking at here is our um year 0 to 10 incremental cash flow schedule. And so we have our cash flow components right here. And so it's it's fairly simple. Um this is just uh calculating our annual free cash flow. And so it's going to take our inflows, which is our revenue here. And so it takes our revenue from all these years, and it's going to um subtract the expenses from the revenues to figure out the free cash flow. So, it's going to take our total operating expenses for that year and then the tax expense for that year, subtract them all out. Um, and that gets us our annual FCF and there's the tax shields in there which is accounted for in the codes up here. Um, yeah. So, we have all the um FCF codes that calculate our tax expense and our workound for them. um yeah, it it's going to correctly calculate our tax yields from depreciation and that's going to just save us our cash later on. So, going on to our um um I have an executive dashboard here that's going to um uh calculate the NPV, IRR, and uh discounted payback period. um and all those using Starbucks's debacc. And so we're going to have our net present value at $2.6 uh million and we are going to um also have the uh internal rate of return. So our IR at 12.84%. And we're going to have our discounted payback period at 8.21 years. simple payback period at 5.28 years and profitability index at 1.22. And so all that pretty much means is that in today's value, the project would have $2.6 um million in value today. And our internal rate of return is that um uh how much we're going to return from the project. Uh it's 12.8%. And that is a lot more profitable than our hurdle rate of 8.5%. Um and then lastly, we have our um payback period here. or our simple payback period we'll just use is the um about five or yeah 5.28 years. And so that means it's uh going to take five years to earn our um uh the $12 million um of the initial investment back. And now we are going to look at our sensitivity analysis. And um so the bad thing about this is it's very sensitive to our um revenue volume. Um yeah. So if if the revenue is going to drop um by um 20% then the net present value is going to drop by um like three and a half million a lot. Um yeah, you can you can see yeah right here three and a half million it drops by on um just that. So um our sensitivity analysis MPV results is um based on um our our base which is what we have going on. Um we have it generates 2.6 um it's it's worth um $2.6 million in today's value. Um, it'll if the WCC goes down by 2%, it's worth four 4.2 million, but if it goes up by 2%, it's worth 1.3 million. And Yep. And then we have our IRR um results as well. And so we have our return rate at 12.84 um on the base rate, but with minus 20% revenue, it drops all the way down to 2.4. 41%. Which is a lot lower than our 8.5 um WSDC hurdle. And um they're going to uh both stay the same for our uh 2% and um uh decrease and increase in our WCC. And yeah. Yeah. So basically I just have down that um changing the WACCC um especially on the MPV um changing it and if you have to increase it um it's fine. That's not going to hurt as much as losing 20% of your customers. That's going to hurt a lot because it's going to hurt. Um it's it's going to you're you're losing a ton of value there. Um yep. And then lastly uh to answer our um initial question of um what's the recommendation on what it is? Um yeah. So um our initial question is you know using the 8.5% WACCC hurdle rate uh we want to know if the project creates value and if I should accept or reject the decision. Now I have right in here that I should accept it. The financials are pretty positive. Um uh what does it say here? It says the strategic fit is is is high. um the the the the value the strategic value it brings to Starbucks is is high as well. So consider how this project aligns with Starbucks long-term goals and the market position um expansion into new markets enhanced customer experience sustainable initiatives. So it it aligns with Starbucks's strategic fit very well. But just on the financials alone, it's also a good decision as well. Um because we have the um our IRRa is going to be higher than our 8.5 um uh percent hurdle as well as it's only going to take five years to um pay it back when the um when it's expected to operate for 10 years. So everything after that 5.3 year is going to be profit for Starbucks. And if they stay true to their base case scenario, then they'll be generating profit um almost four a little over 4% more than their uh uh WACC. So um they'll be generating about 4% profit and their net present value is definitely higher than um what they would get from rejecting the um the case scenario. Yes, that's about it. Um I mean I have this chart here that shows the um free cash flows um over the project's life. And so um you can see that it's relatively stable and it takes a little jump at the end. Um yeah, so if if they if they stay true to their um their their expected results um at a 12.8% IRRa, especially with a um 5.3 year um simple payback period, um the project will be profitable. The only caveat I would say to this is that um they have this huge revenue risk. I mean, it's it's a bad big red block. You can't miss it. Um they they they got to um make sure that they they they really fund their their marketing right here in in year one to ensure that they that they they hit their um uh volume uh target for revenue. um because we know that it's highly volatile volatile com um compared to the uh revenue volume. So um the MPV will uh tank a lot if they do not generate a high revenue volume. So therefore, um Starbucks makes it uh needs to make sure that at least in year one they prioritize keeping um their um revenue volume out of this red zone and um keeping it up there so that they rest of the years can be smooth sailing and they don't have to worry about a potential um loss in value with the project. Thank you.",
  "video_url": "https://youtu.be/QNJt6UTSPVk"
}