{
  "student_name": "Juan Moreno Morales",
  "org_defined_id": "035730816",
  "username": "jmorenom",
  "email": "",
  "transcript": "Hey, professor, this is my cost of capital analyzed for Netflix using driver framework. In this presentation, I walk through the define and discover stages to present the financial structure and plan-mining the calculations of Google Collab, violate the results, evolve these strategies, emphasize, and reflect on what I have learned. So define and discover and the define stage, I define the main financial questions. netflix is considering a five billion content content investment and a company may issue three billion of additional debt to help fund that investment to determine whether this makes financial sense netflix needs to understand weighted average cost of capital or wacc wacc is important because it represents the minimum return netflix must earn to satisfy oil business investors, both shareholders and bondholders. If a Netflix project earns more than WACC, they create shareholder value. If they earn less than WACC, they destroy value. In the discover stage, I collect and confirm all the inputs needed for collecting WACC. This included Netflix's $200 billion market capitalization, $13 billion market value debt, an equity beta of 1.3, a bond yield of 5.8%, a corporate tax rate of 21%, the risk rate of 4.5%, and a market risk premium of 5.5. for capital structural weights i used to i used market value rather than book value because market values reflects what investors require today not historically accounting numbers netflix equity weight is much higher than its debt weight making an equal heavy high risk capital structural these inputs from the foundation for calculation the cost of equity using cmp the after tech tax cost of debt and the overall plan cost of capital so we present in the represent stage I build the capture of framework for how WACC is calculated in the VC combines two components the cost of equity calculate using the cost of asset principal model that the absolute tax cost of debt which captures the tax the benefits of borrowing the formula is wcc equals parentheses e over v parentheses x e x re times parentheses d over v times rd times parentheses one minus tax rate parentheses which e is the market value of equity uh d is the market value of debt v is the value value of the firm re is the cost of equity and rd is a cost of debt the framework also sets up later evaluating how wcc changes when netflix adds more debt wcc differs from u.s differs for u.s contact versus international contact and how netflix compares to rivals like disney and amazon implement in the implement stage I use Google Cloud to collect to calculate Netflix current WCC to run scenario analyze first I calculated the cost of equity using C&P race free rate of 4.5% plus better of 1.3 times a market risk premium on 5.5 this gives the cost of equity 11.16 uh 1 .65 because of equity uh next i calculate the aftertask cost netflix day yield is 4.5 4.8 after applying the tax year the effective cost becomes 4.58 using these components costing netflix market value capture capital structure of 93.9 equity and 61 60.6.1 that i calculate the current w acc 11.22 uh then i model what happens when netflix issues 3 billion additional debt this increases debt to 16 billion i assume the yield raises slightly to 6.2 due to the increased leverage after recalculating the weight and the after-tax cost of debt, Netflix's new WACC becomes 11.15. The slight decrease is due to the tax yield from additional debt, which lowers the overall financial cost up to point. I then calculated project -specific WACC. U .S. contact has lower operating risk, So I use a bet of 1.1 then gives a project that we ACC of around 10.10 for percent Internationally content has a higher strategy and political risk So I use a bit of 1.5. This gives a project W ACC of 12.12 12.3% um so to address the industrial compression requirement i compare netflix wcc to disney's 8.2 and amazon 9.5 netflix has us higher the wcc and is expected because because it's less diversified and has relevant high operating costs Finally, I created a WACC-sensitive chart showing how WACC represents changes in debt levels. The chart shows the modern leverage reduced WACC, but too much leverage starts pushing an ACC higher as a financial risk. So to validate the results, I compared my calculated WACC against an industrial range of 8 to 10 percent inflicts a wcc of around 11 percent is slightly higher which matches analyzed expectations giving the company's higher beta and risk profile i also perform sensitive tests and checking the framework to ensure that calculated costs make economic sense their relationship between leverage and wcc align with theory moderated debt lowers wcc while excessive date raises raises in the in the level stage i looked at the strategy implies netflix should consider gradually increasing leverage to capture more of the debt shield but not so much that it risks losing its investment grade rating wcc also informs decisions beyond this project it affects capital budgeting violation and ma decisions and performance measurements across business units using risk adjustment discount rates ensures capital is allocated effect efficiently across the company and then finally my reflection the most challenging part of the assignment was connecting in the numerical WACC calculations to the rest to the real strategy decision Netflix must make. The assignment show how show me how financial theory and corporate data strategy interact and how WACC anchors most every major investment decision a company makes.",
  "video_url": "https://www.youtube.com/watch?v=TsNR-r_qYF4"
}