{
  "student_name": "Abby Goldstein",
  "org_defined_id": "035857284",
  "username": "goldst13",
  "email": "",
  "transcript": "Hello everyone. Um, my name is Abby Goldstein and this is session 10 assignment for management 310. Um, and this assignment details the financial evaluation of Starbucks's proposed flagship roaster project um, using the firm's 8.5% uh, WACC as our hurdle rate. Our core task was to determine if this $12 million 10-year project creates value. Um, we needed to automate a transparent cash flow model. uh calculate the necessary capital budgeting metrics, run sensitivity tests and deliver a recommendation supported by the driver framework. The define and discover stage is the critical foundation. Uh we clearly established the inputs and dis decision criteria before writing any code. Um the major inputs uh were the $12 million uh capex, the $500,000 in working capital, um the 10year straight line depreciation, and the revenue forecasts. Our decision is accepting the project if the net present value or the NPV is greater than zero. Um and if the internal rate of return or the IRR is greater than our hurdle rate of 8.5%. So I have ran the code um and this chart um is the foundation of our valuation. Uh the large red bar at year zero uh shows the initial $12.5 million outlay. Uh the subsequent green bars show um show a strong operating cash flow accumulating in $4.55 million spike in year 10 um which includes the terminal sale value and the WC recovery. Then our numbers down here um confirm a strong financial performance. Um the NPV now at 2.6 69 million which is a highly positive result. Our irr at 12.84% which is um much higher than the 8.5 uh original WACC. Our PI at 1.32 um which means um you get returns of uh 1.32 for every dollar invested in present value. Um and then our SPBP um 5.28 28 years meaning the project pays itself back pretty quickly in simple cash terms. Uh the project is profitable and creates substantial value under current assumptions. Um the represent stage uh documented the model the model logic used um by our Python script. Um our cash flow calculations correctly accounted for all components revenue operating costs uh the depreciation tax shield working capital changes and the after tax terminal value. Um this transparency ensures that our results are audible. So now on to our sensitivity analysis summary. Um the evolve stage tested the robustness of the project by running two required scenarios. Um this WACC chart plots the change in NPV. Uh we found the project to be robust um to risk a 2% increase in WACCC to 10.5% from 8.5%. Um which still leaves the NPV positive at 1.35 million for the revenue sensitivity which was the key risk of discovery. um a 20% just calculated right here a 20% reduction in revenue across all um years causes a huge failure. The final NPV plunges to uh 3.48 million putting the project underwater. The IRRa collapses to um 2.4% which is far below the WACC. Um this sensitivity test proves that the project is critically dependent on achievings on achieving its ambitious um revenue uh targets. Um the reflective stage um combines our financial findings with strategic uh and risk considerations to form an executive recommendation and that was to conditionally accept. Um our financial results show the strong acceptance based on on the NPV greater than zero which is at 2.69. 69 million and then the IRRa being greater than 8.5%. Um there is an excellent alignment with Starbucks upscaling in their brand goals. Um and then the primary the primary risk um is market execution. The sensitivity analysis demonstrated that the project cannot withstand even a modest revenue shortfall. Um so we're recommending proceeding only if management can thoroughly validate the sales projections and put specific operational risk u mitigation strategies in place um to guarantee uh the forecasted traffic and spending. And this was my assignment. Thank you for watching.",
  "video_url": "https://www.youtube.com/watch?v=xnqyqIwxoPk"
}