{
  "student_name": "Aaron Gorokhovsky",
  "org_defined_id": "037134002",
  "username": "agorokho",
  "email": "",
  "transcript": "Hello, my name is Aaron Ghowsovski and this is my session 10 assignment um focusing on capital budgeting. In this video, I'm going to walk through my entire analysis of Starbucks proposed flagship grocery program using the full driver framework while also showing the corresponding pieces of code as I go. All the project assumptions and requirements came directly from the session 10 assignment document. So, everything I walk through will reflect those parameters precisely. To begin, the define and discover stage is all about laying out the project fully before building any code. The mission for this assignment is to evaluate whether Starbucks should move forward with a new flagship roaster that requires a $12 million upfront investment and is expected to operate over a 10-year life. The company uses 8.5% WACC, which serves as the hurdle rate for deciding whether the project should create shareholder value. Before I wrote any functions, I listed out every key um assumption provided in the PDF. the initial investment of $12 million, the depreciation straight line over 10 years, and the additional $500,000 in working capital that is deployed at launch and recovered a year 10. I also documented the revenue pattern, which begins at $8 million in year 1, increases to 11 for years 2 through 5, and then shifts back down to 9 million for years 6 through 10. Operating cost includes a cost of goods cost of goods sold percentage of 40% labor of 2.5 million rent and utilities of 800,000 and marketing cost of 300,000 in year 1 and 100,000 in every year afterwards. The project uses 25% corporate tax rate and includes a terminal value of $3 million at the end of year 10. The purpose of this early stage is ensure that every component of the project is understood and included before any modeling is written. And you can see all of that is written here where we have every single one of those assumptions listed their value clarified and even in our revenues we can clarify that each year has its own value separated out. We can also see the cost percent the cost assumptions and our straight line depreciation over the project life is clarified here as well. The next step is represent. So once the assumptions were gathered I moved into the represent stage where the structure of the financial model is mapped out. I created a full skeleton of the year 0 through year 10 cash flow schedule. I built a function that places all the major components and incremental cash flows cash flows into a data frame including revenue, cost of goods sold, labor, rent, utilities, yearly marketing spend, depreciation, EBIT, taxes, NP, NOPAT, operating cash flow, working capital changes, and the terminal value. The idea behind this stage is to create a clear blueprint of how each year flows into the next so that when I later implement the code, the logic remains consistent and easy to follow. When I show this part on screen and I'll show you I'll explain this in a moment. You'll see that each year is populated systematically with a year zero capturing the full investment plus the working capital outlay and year 10 capturing both the terminal value and recovery of the working capital exactly as is specified. And you can see that here we have our dates, our data recognized within the data flow and then we have the clarification between our year zero which is the initial investment and working capital outlay and then year 1 through 10 where we include our operating years which is autofilling our information for said data flow or data frame. Um with the model and structure ready I moved into the implementation stage. This is where I program every financial metric for the assignment. I created functions for NPV using Starbucks 8 and a half% WACCC IRR based on the project's cash flow, the simple payback period determined by cumulative undiscounted flows, the discounted payback period using discounted flows, and the profitability index based on the present value of all future inflows relative to the initial outlay. Once these functions were created, I ran the model using the base case revenue and cost assumptions. And we can see that this is the code that does this exactly and it calculates all of our necessary things. And using the calculated flows, rates, and everything, we can understand and properly determine how good of an investment this could be and how attractive this project could be for Starbucks. And the next step is to run the model. So when I run the model, the base case results showed a positive NPV of roughly 3.025 million. And you can see that this is the code that runs it. And here is our output for that in our base case. So you can see NPV 3.022 million, IRR of 13.25, simple payback period of 6 years, discounted payback of 9 years, and a profitability index of 1.24. So what this all means is that for every dollar spent, Starbucks will get 1.24. 2 for $124 back and that leaves room for uh shareholders value. It means that at first look there is possibility for this project being positive for for Starbucks. After the base case, the assignment requires a sensitivity analysis covering three scenarios. A 20% reduction in revenue, a 2% point decrease in WACC, and a 2 percentage point increase in WACCC. When I applied a 20% decrease in revenue, the model showcased that NPV turned negative. You can see right here um fall falling to roughly $3.25 million $3.15 million, I'm sorry, with an IR of 3.19. Now, with the WACC decreased by two points, the MPV went up to 4.636 million with an IR of 13.25. And when WACCC went up two points, it decreased down to 1.627 uh million million with an IR of 13.25 again. So what this showcase is showcases is that although discount rate does matter, revenue performance is by far the most influential variable in determining whether this project is successful. And the next step is the validation and visualization stage. So this is where I check all parts of the model behave as intended. I confirm that the depreciation remains consistent at $1.2 million per year since it's straight line straight line over the 10-ear period. I verified that year 5 revenue is exactly $11 million and the cost of goods sold for year 5 equals 40% of revenue or roughly $4.4 million. I as checked the working capital is only deployed in year zero and correctly recovered in year 10 and the terminal value is applied in the final year. And you can see all of that visualization done here in these charts. You can see the cash flows with the initial investment and then it increasing and then our recovery in year 10. You can see the NPV over WACC. As WACCC percentage increases, you can see our NPV decreases, which follows the same information that we saw earlier. And then we have our NPV comparison. We have our original, then we have our negative, then we have our decrease in points, and then we have our increase in points. So we can see all of this information showcases the AC the that our information and our calculations were accurate and valid and they clearly showcase and more easily make it visible those patterns that we were discussing a moment ago. Now the next step is to understand how this model could be made even more robust and how this could be used for for the future. So I think the future improvements could incorporate uh dynamic revenue growth assumptions and cost escalation for labor utilities or even additional sensitivity layers to test combinations of variables rather than examining each one independently. Implementing a scenario package or even running a Monte Carlo situation could provide a more complete picture of the project's risk profile and these types of enhancement enhancements would make the model even more useful for real world managerial decision-m. Finally, we must reflect on this whole project and I summarize that the overall conclusion based on both the model and sensitivity results under the base case assumptions of course that star that Starbucks's roaster clearly appears as a value creating project. It has a positive NPV an IRR that exceeds the turtle rate and a profitability index above one. However, the project is highly sensitive to the downside revenue performance. Even a 20% reduction in revenue is enough to turn the NPV negative. Because of that, my recommendation is to accept the project but but with clear guard rails. Management should monitor early revenue traction closely and ensure that strategic and marketing plans are aligned to mitigate the project's biggest risk, which is insufficient demand. This completes my session 10 assignment. Thank you for watching.",
  "video_url": "https://youtu.be/OKS5X8jgY5k"
}