{
  "student_name": "Trevor Squire",
  "org_defined_id": "035907999",
  "username": "tsquire",
  "email": "",
  "transcript": "Okay. Okay. There we go. Uh, hello. My name is Trevor Squire and this is my session 8 assignment on market efficiency investigation. So, a little bit of an overview. Um, I'm supposed to investigate market efficiency using GameStop um, short squeeze event of 2020 2021 as a case study. I am supposed to verify the accuracy of the facts, analyze price behavior relative to efficient market hypothesis predictions and evaluate whether market anomalies sorry excuse me and evaluate whether market anomaly anomal anomalies um constitute evidence against market efficiency or can be explained within existing frameworks. So I given my event timeline, key data points and required analysis and just some questions I have to answer. So I have everything organized. Um I have the assignment description tab, Gemini right here with the collab code, collab with the code, and then lastly the notes that I will be using to talk about. Um so yeah, I'm just going to get right into it cuz this is going to be a very long one. I'm going to be honest. I put a lot of um detail into this and I also have some notes on the collab I'm going to talk about. Um so first to find and discover. So my main goal is to look at the um 2020 2021 GameStop um short squeeze as a case study for the efficient market hypothesis. So main questions I have to answer um fast check um is the GameStop first like look in the statement um GameStop traded the 4 cents in August 2020 um or $04. I was supposed to see if that's true. Um, EMH violation. Which forms a market efficiency? Weak, semi-strong, strong seem to have been violated. Profitability. Could a rational investor by the EMH definition have actually made money from this? EMH versus reality. How do the predictions um from EMH stack up against what really happened with the GME price? Um, and then alternative explanations. do behavioral finance ideas um like her behavior or FOMO do a better job of explaining it. So discover um first thing I do was check if this was fact. Um so I just searched up Doomst stock price August 2020 and what I found multiple reliable financial sites like Yahoo um Finance, Bloomberg, etc. and even SEC filings all have confirmed that GME did not trade um that amount in August 2020. Back in August 2020, GME stock price was in the range of $4 to $6.50. So the statement gave stock trade at 4 cents is totally wrong by a factor of 100. So the huge error and changes the So this huge error and changes the nearby bankruptcy story. So the price was low. It's $4 650. Um it is low but not fractions of a penny low. Next represent um so I planned out how tackle the full analysis based on what I found. Um so my main plan part one how to handle the data error. So I'll state clearly um that the four cents is wrong. I'll give the correct price range and mention like my historical data to show it's accurate. How I tell the professor? Um, dear professor, while doing the um critical first step the assignment, I found a um error in the August 2020 price in the amount list at 4 cents, but historical data from uh sources like Yahoo Finance um and SEC's own report showed that um it was actually in the $4 to $5 price range. I just want to verify if I should proceed with the correct historical data or if the figure was intended to be hypothetical. So it's the reason why I say this it's not confrontational shows I did the work it just I just asked for clarification part two um which is literally answer the rest of the questions. So how was EMA violated versus weak form? I'll check if past um price or volume data which is public could have been used to predict the squeeze. Um, the Wall Street Bets community did use historical price and more importantly public short interest data to predict the squeeze. So, this looks like a yes. Um, the semi- strong form I'll check if the price reflected all public info. So, this looks like um the biggest violation the price which was $483 had nothing to do with the company's actual value like um like earnings. Um the 140% um wow 1440% short interest was public info and the market's reaction um first ignoring it then you're reacting shows the price wasn't efficient. Lastly strong form I'll check if private info was involved. This seems like less important because the whole thing was driven by public post and data not inside tips. Um next is could a rational investor have made money. First, I'll define a rational investor, which is someone who believes the price reflects the company's true value. This kind of investor would have thought GME was way overpriced at $50 or even $100 and definitely $400. They would not have bought. What about shorting it? Um, yes, this wasn't a systematic profit. Uh, shorting at $50 rational move um would have wiped them out before the price ever came back down. The profit was made by speculators betting on market mechanics and irrationality, not by rational investors. What EMH predicted versus what actually happened. So prediction price should um just randomly walk around its real value. Reality the price went crazy driven by social media feedback loop and market mechanics. short covering then using um behavioral finance to explain it. This framework seems way more useful here versus her behavior. The um Wall Street bets phenomenon overconfidence bias. Uh retail retail traders thinking they could beat the hedge funds. Prospect theory/fomo. People buying at $100 or $200 weren't buying on the value. They were just scared of missing out. And then finally, narrative economics. The David versus Goliath story was a powerful motivator that had nothing to do with financial data. Next is implement. Uh I'm going to do the analysis and writing the answers as they will be in the assignment. So analysis of the GameStop short squeeze verification stated facts. Again, critical step. Uh as required, I first checked the statement. GameStop traded at four 4 cents in August 2020. This is factually incorrect. After reviewing historical data from say Yah from Yahoo Finance and SEC reports, I can confirm GME split adjusted price in August 2020 was in the range of $4 to $6.50. The 4 cents figure is off by a factor of 100. I'll use the correct historical data for the rest of my analysis. Which parts are violated? Weak form efficiency violation likely. This one says you can't use past price and volume data to predict future prices. The GME event challenges this. The whole Wall Street Bets idea was based on public data. The low star price, the crazy high short interest 40% a float. They use this public data to predict a short squeeze and the price explosion um prove them right at least at first. Semi- strong form efficiency very clear violation. This is the clearest violation. It says prices um should reflect all public info instantly. The GME um price completely disconnected from any public facts. Fundamentals public um analyst estimates said G wow public analyst estimates said GME was worth $10 to $40. The price hitting $483 shows this info is being ignored. Short interest the 140% short interest was public. Inefficient market might have bumped the price up to fix this. Instead of the market ignored it then violently overreacted. Next is strong form efficiency which is not primary This like that all private info priced in wasn't the main issue. The squeeze was driven by a mass coordination of retail traders acting on public data and sentiment not inside information. Question. Could a rational investor have profited? A rational investor by EMH definition trust that prices reflect true value. Such an investor would have concluded GME was overvalued as it passed $40, $50 and $100. They would not have purchased the stock. Could they have profited by short selling? No. If they shorted the stock at $50, which would be the rational move, they would have gone bankrupt. Then the price has soared to $483. the price the timing was impossible to predict. So therefore systematic profit for a rational investor was impossible. The people who profited or speculators who correctly bet that irrationally would win out in the short term. This is or market mechanics. Fourth is EMH predictor pred. Okay, hello again. Um, so EMH prediction prices should reflect the um company's value. Uh, new info like Ryan Cohen buying in should should cause a price adjustment from like $6 $15 and then the price should go back into the random block. Observe behavior. The price became doubled from the value. It wasn't driven by new info about GameStop's business, but by info about other traders, the short interest. Um, this created a feedback loop where buying just created more buying a bubble, which is the opposite of EMH. So, explaining with behavior finance, honestly, behavioral finance explains this way better than EMH. Um, her herd behavior and social proof. Millions of investors coordining on uh Wall Street bets created a herd that felt safe in numbers. FOMO, fear of missing out. As prices shot up, people bought in just because they were afraid of missing the massive gains. Availability cascade. The D versus GL story was everywhere on social media and became a powerful narrative that drove buying regardless of the financial data. Uh short squeeze market mechanics. This is the technical uh spark. It's not a behavioral idea but it was a cataly catalyst. Yeah. And all the behavioral factors fanned into a fire. So next is verification checking my worst against original goals. Uh fact check for sense yes corrected. EMH violation yes analyze all three rational profit. Yes. Concluded it was not possible. AMH versus reality. Yes. Contrasted behavioral finance. Yes. assessed framework tech driver framework. Yes, I did um I did DNR before I um how strong my analysis I think is very strong. I correctly point to the semi- strong form as the main violation. It separated rational investors from speculators. So then a little bit of evolve and reflect. Um so things to fix or improve fix the four cents fact. This is the most important thing. The analysis is non uh nonsense without it. Um be clear about the squeeze versus the bubble. So I can improve the paper by separating the event in two phases. Phase one, the short squeeze. Um a mechanical event based on a somewhat rational high-risisk trade buying stock to for shorts with greater than 100% short interest to cover. Phase two, the FOMO bubble, which was late January 2021. a behavioral event where the price surged way beyond what squeeze required driven by her behavior in media type. So why does this matter? I could argue phase one was a risky efficient punishment for the market for the market or the market ignoring the 140% short interest while phase two was pure irrationality. And these are some extra extra ideas I want to throw in. There's the gamma squeeze. So the assignment didn't mention options but they were a huge deal. A gamma squeeze is when massive purchases or of call options the right to buy stock force the people who sell the options market makers to buy the actual stock to hedge their bet. This buying from market makers adds rocket fuel to the price creating a feedback loop. Prices rise more more call options are bought. Market makers buy more GME stock. Prices rise even faster. Adding this will make my analysis look much more thorough. There's the Robin Hood market uh structure mess. I could discuss the trading restrictions. Why did Robin Hood and others suddenly halt buying and not selling? Um this gets into the weeds of market structure, clear house collateral, T plus2 settlement, etc., etc., PFO. Um an argument. Some people argued this was rigged system violating strong uh form efficiency since powerful players acted on non-public decisions. The official reason was the brokers couldn't meet the cloud requirements from the volatility. This is a very high level point to add. Lastly, SEC report. Oh, sorry, not not lastly. Next is SEC report. To make this look really well researched, I should reference the official staff report on equity and options market structure conditions early 2021. Uh SEC said the volatality was not caused by a single issue, but rather a convergence of factors including a game of squeeze and high shot interest. They didn't find evidence of manipulation, but they did point out the risk of social media driven her behavior. Last conclusion about long-term versus short-term efficiency. A good concluding thought would be the GME event shows that while markets can be very inefficient in the short term like bubbles happen, they tend to be efficient in the long term. The GME price didn't stay at $483, it eventually crashed back down showing the fundamental value act like a center of gravity. Let me just double check my time so I can see if I can do two. Okay, perfect. Five minutes. So, next I'm going to go into the collab script walkthrough. I'm going to be very quick so I have enough time for it to be two videos. So I have my Gemini here with all the data which I then put into Collab here. I was going to do a quick run through of Collab. So first is the um PIP install Y Finance. Um first I have to install the Y Finance library. The exclamation point just tells Collabad to run this as a terminal command. I need this library because it's what lets me pull all the historical stock data directly from Yahoo Finance. Oh no, I didn't pause it, did I? Okay, sorry, I forgot this thing pops up. So, right here, the exclamation commands and the work to install packages. Um, pip install Y fin Finance. Next is import Y Finance as YF and import pandas as PD. Here I'm importing the libraries I'll need. I give Y fin Finance a nickname Y F and pandas a nickname PD uh pandas are pandas is great for organizing the into a table which Y finance gives me it makes it really easy to work with and that is right here next is the oh yeah next is the ticker um so this line where I tell script I'm interested in games using its official stock symbol GME which is right here to find the stock ticker equals GME ticker equals YF ticker ticker symbol. I really don't like saying that word, I'm not going to lie. Um, historical data. So, this is the main command. I'm telling the GMBB object to get its history for the specific dates, start date, end date. It grabs all the day, all the daily data, uh, open, high, low, etc. Uh, for August 2020, saves it in my historical data variable. The best part is the day is automatically split adjusted which is why I need for accurate historical comparison. So that is define the data range. Here are the dates and then it fetches the historical data. Um data was automatically split adjusted which is what we want for accurate historical comparison. And then next is the price data equals historical data low high um price data. So I make a smaller cleaner table called price data that only has the low and high columns since that's where all I care about this fact checked. I print this table so I can show the exact daily prices as my primary evidence. This table clearly shows the prices aren't anywhere near the 4 cents. So these this is step five display revival data and then the low and high prices to verify the range and then find the absolute minimum maximum for that month. So that's the next part. So I just find the single lowest, the minimum from the low column, and then the single highest from the maximum column for the whole month, which is right here. And then lastly is the lowest price min lowest price um minimum low print. So finally print my conclusion. I use an S string. Who's texting me? Okay. Finally, I put my conclusion. I use a string. Yeah. at the beginning to put my uh minimum, low, maximum, high variables right into the sentence. The 2F makes the makes sure the money wait the 2F just makes sure it looks like money um two decimal places. So, it gives me the final clear summary that proves that f the price was in the $4 to $6 range and that the 4 cents um was incorrect. So, that's the very end here. This is the conclusion and yeah um perfect. I got one minute left. That is pretty much it for this assignment. Um I wanted to again add more data for the collab because a lot of times I'm reading it, I don't understand it. So I asked Gemini to um give me the collab and then create give me this short description for each tab. So I helps me better understand it. But yeah, um Gemini was definitely a big help for this assignment. Um, I get as I found a lot easier since there were less numbers, not a lot of math to calculate. It was just more historical data and research, which I actually like doing. So, I got to say I really like this assignment. But yeah, that's pretty much it. And thank you for listening.",
  "video_url": "https://www.youtube.com/watch?v=yK9ABygdc3A\nPart 1\nhttps://www.youtube.com/watch?v=V_1jX4cqY_k\nPart 2"
}