{
  "student_name": "Heidi Chen",
  "org_defined_id": "037430730",
  "username": "chen5063",
  "email": "",
  "transcript": "record. Hi, I'm Heidi and this is my session 10 homework. So for define and discover, our goal is to determine if the proposed $12 million flagship roster creates shareholder value. Our hurdle rate is the Starbucks weighted average cost of capital which is 8.5%. Our core decision rule is to accept the project if net present value is greater than zero. So here's some givens. Our initial investment is $12 million with a timing of at year zero and it has a nature of outflow because of the initial investment and our working capital is 0.5 million is also at year zero and and has a nature of outflow because it is deployed. Um we also have an annual cash flow which varies and the timing is between is from years 1 to 10 and it has inflows or outflows the because of operating cash flows and we have a terminal value of 3 million in year 10 and it it it is an inflow due to asset sale. Uh we have a working capital recovery of $0.5 million and it is also in year 10 and it has an inflow because of working capital recovered. Our project life is 10 years and our depreci we're assuming we have a straight line over 10 years depreciation and to get our depreciation we just use our initial investment of $12 million divided by 10 years and we get $1.2 million per year. And to for the represent we're using the following formulas. So first we're using operating cash flow formula which is equal to earning before interest in tax multipli by 1 minus taxes plus depreciation. And in this case earning before initial earning before interest in tax is equal to revenue minus operating cost minus depreciation. We're also using initial cash flow which in this case is calculated by investment minus working capital. So we get a negative of 12 12,500,000 and our annual operating cash flow which is between year 1 to 10. These are being calculated in using our implement which will be calculated annually using the full incremental cash flow schedule which will be provided in the implement section which we are also using terminal cash flow which is in year 10. So that equals to the terminal value plus working capsule recovery. So it is 3 million and $500,000. Here is the code that I asked Google Gemini to provide for me which provides the um cash flow of between year 1 to year 10 and it also provides a core capital budgeting matrix which is the base case and some sensitivity analysis for scenario A which is the reduction of 20% in reduction of reduction of 20% in revenue sorry and our scenario scenario B which is the base revenue but with a decrease in 2% in weighted average cost of capital or scenario C is the same base revenue and but with an increase in 2% in weighted average cost of capital. So to validate we we're using different those three methods. So first it is the cash flow verification. So we're you assuming the model correctly includes the initial investment working capital deployment and recovery operating cash flows incorporating revenue operating cost depreciation and the terminal value. So we're assuming we all use those correctly and we have a discount rate appropriation appropriateness. So the analysis uses the company's weighted average cost of capital which is in this case is 8.5% as the discount rate which is is the correct hurdle rate to reflect the opportunity cost of capital and we can also use the net present value methodology to confirm our calculation. So to use the formula that is provided in section 10. So the net present value formula um we we're saying that it is correctly applied and it discounting all future cash flow back to the present. And here's some summary. Here's a summary of sensitivity analysis. So we have a base case which is 8.5% of weighted average cost of capital and $3 million in net present value and our internal rate of return is 13.25%. 25%. This is our strong value. This is a strong value creation. And scenario A is when we reduce 20% in revenue. So that leads to the same 8.5% weighted average cost of capital. But in this case that that leads to a negative $2.75 million in net present value. And it also decreases the internal rate of return which is 3.88 to to 3.88%. So that means that the project is highly sensitive to revenue estimates. So a 20% drop makes the net present value negative and the internal rate of return just below the weighted average cost of capital. Scenario B is when we minus 2% on the weighted average cost of capital. So that leads to 6.5% in weighted average cost of capital. So that leads to a $4.64 64 million in net present value with um the same percentage 13.25% in internal rate of return that shows that higher net present value indicates that lower cost of capital significantly increases values. Weighted average cost of capital in scenario C we have a weighted average cost of capital but we um add 2% to it. So that leads to a 10.5% of weighted average cost of capital. So that leads to $1.63 million in net present value but with the same 13.25% in internal rate of return. So the project remains acceptable even with a higher cost of capital but the value created is significantly reduced. So comparing scenario B and C, we see that even though they both have a positive net present value and the same percentage for internal rate of return, but scenario C with a increase in weighted average cost of capital, we have a decrease in net present value. So for we have we have successfully created a s sensitivity analysis and we are recommendation integration. It will be shown in the reflect section and that shows that our learning um application is is provided and we have what we needed. So moving on to reflect. So um the reflect phase provides the final recommendation by weighting the quantitative financial results against qualitative strategic factors and project risks. So our financial results summary we have that this is using our base case. So we have a net present value of $3 million that is larger that is greater than zero or internal rate of return of 13.25 25% is greater than the weighted average cost of capital which is 8.5%. Or profitability index is 1.35 which is greater than one or payback. The project is expected to recover its initial investment quickly which the simple payback of 5.28 years and a discounted payback of 8.21 years. So a recommendation is to accept the sorry the flagship roaster project. So as a further to explain the positive net present value and internal rate of return coupled with the profitability index being greater than one clearly indicates that the project is expected to recreate shareholder values by earning returns significantly above Starbucks cost of capital. So our financial results has an assessment of of strong which in this case we have a net present value greater than zero or internal rate of return greater than the weighted average cost of return that indicates that we have a clear signal to accept based on the objective value creation. So according to the calculations that we created it is good to accept the project. Um we also have a strategic fit of with the assessment of high. So our um flagship roastery aligned with premium brand strategy, brand building and experimental retail. A key project risks is high revenue sensit is high revenue sensitivity. So that because according to a sensitivity analysis it shows the project is highly vulnerable to a 3 20% revenue miss shifting the net present value to negative. This risk requires robust marketing and operational plans or brand implications are also positive. So that enhancing so that indicates that enhancing brand image and allowing for premium branding testing and launching and providing qual qualitative benefits not captured in the financial model. So the overall the project demonstrates a robust financial performance in the base case with the net present value of $3 million indicates significant value creation. While the high sensitivity to revenue is the critical risk, the strategic benefits of a flagship location branding building market presence and retail innovation likely justify the investment. Providing manageable management establishes a con contingency plan to ensure revenue targets are met. So overall it is a great idea to accept the flagship roaster project according to the sensitivity analysis provided. Thank you.",
  "video_url": "https://youtu.be/3Agx1FOL2-M"
}