{
  "student_name": "Priya Gaddam",
  "org_defined_id": "037145385",
  "username": "gaddam10",
  "video_url": "https://youtu.be/sqBrGmInlwA",
  "transcript": "0:00\nmy capstone project, I decided to make a\n0:02\ncapital project net present value\n0:04\nanalysis and decision memo. And to do\n0:06\nthis, I use Replet. So basically what\n0:09\nthis is, it's a tool for future CFOs and\n0:12\nanalysts to instantly evaluate\n0:14\ninvestment projects and draft clear\n0:17\nexecutive level memos. So we can use\n0:20\nthis to um communicate with people who\n0:23\ndo not work in the financial department\n0:26\nin our business. And this basically like\n0:29\ntranslate what we're trying to say in a\n0:31\nway that's understandable to people who\n0:33\nmay not have the same knowledge level as\n0:35\nus. And so\n0:38\nbasically we're going to show how we use\n0:41\nnet present value to determine if a\n0:44\nbusiness decision is valuable\n0:47\nand we can communicate in a way to\n0:50\npeople who are not in finance.\n0:52\nAnd so that's what my tool basically\n0:54\ndoes. It helps us communicate our\n0:58\nfinancial evaluations to other people.\n1:03\nAnd so basically um what we can do so we\n1:06\ncan give it a project name. So we can\n1:09\njust call it new capital project for\n1:11\nnow. We can put in our initial\n1:14\ninvestment. So right now we have\n1:17\n$100,000.\n1:19\nAnd then we can input our weighted\n1:21\naverage cost of capital discount rate.\n1:23\nSo we can put a high one right now of\n1:25\n10%.\n1:27\nAnd then we can also include future cash\n1:30\nflows from years 1 to five\n1:33\nand for year 1 we have 25,000 and we\n1:38\nhave that for years 1 2 3 and 4. But for\n1:41\nyear 30 we have 30,000.\n1:43\nAnd you'll also notice that by\n1:45\neverything we have little question\n1:47\nmarks. So you can click that and it'll\n1:49\nbasically just give you a small\n1:50\ndescription of what it is. So for the\n1:51\nproject name, enter a name to identify\n1:54\nthis project.\n1:56\nUm initial investment, enter the initial\n1:58\ninvestment amount as a positive value\n2:00\nand this represents an outflow. And then\n2:04\num enter the weighted average cost of\n2:05\ncapital as a percentage. So this really\n2:08\njust simplifies the process and um\n2:11\nremoves any unnecessary confusion. And\n2:15\nso we'll click analyze project.\n2:18\nAnd then we can scroll down and we can\n2:21\nsee our analysis results. So if we were\n2:24\nto um go into this decision with the\n2:28\ninputs that we provided,\n2:30\nwe would have a net present value of\n2:33\n-2,000 given our initial investment and\n2:36\nour discount rate. And our internal rate\n2:39\nof return would be um 9% which is a drop\n2:45\nin.82% versus our weighted average cost\n2:47\nof capital or discount rate.\n2:50\nAnd then we can see over here that the\n2:52\nrecommendation um is to reject the\n2:55\nproject since the project is value\n2:57\ndestructive and our IR is below WACC\n3:01\nwhich further confirms rejection. So we\n3:03\nalso have a backup approach to further\n3:06\num prove our decision.\n3:09\nAnd then we also have some graphs here.\n3:11\nSo this basically just shows a visual\n3:14\nrepresentation of what our calculations\n3:17\nshowed us. So we can see uh year zero\n3:21\nour first or not our first year but year\n3:24\nzero um our investment of negative or\n3:29\nour investment of $100,000. So that's\n3:31\nwhat this bar shows and then our cash\n3:34\nflows for each year after that up to 5\n3:37\nyears. And then this graph shows our NPV\n3:40\nsensitivity to discount rate. So we can\n3:43\nsee how um our discount rate decreases\n3:47\num as well as our net present value. So\n3:50\nthere's a ne so there's like um a\n3:53\ndowntrend for that. And this is also our\n3:56\ncash flow summary. So we can see our\n3:58\ncash flows, our discount factor, and our\n4:01\npresent value for each year starting\n4:03\nwith the year zero, which is our initial\n4:05\ninvestment.\n4:06\nAnd so down here is the AI executive\n4:09\nmemo. So that's the AI component of this\n4:10\nwebsite. So this basically just writes a\n4:13\nshort summary of what our calculation\n4:16\nshowed. So the net present value of this\n4:18\ncapital project is -2,000 and the WACC\n4:21\ndiscount rate used for this analysis is\n4:23\n10% and the IRRa is around 9%.\n4:27\nAnd so it was told to act as a senior\n4:30\nfinancial analyst drafting an executive\n4:32\nsummary for the board of directors based\n4:33\nonly on the provided MPV and write a\n4:37\nconcise memo. And if we want to download\n4:39\nthe memo, we can press this button to\n4:41\ndownload the PDF report or we can save\n4:44\nthis analysis to history if we want to\n4:46\ncompare multiple scenarios. So that's\n4:50\nwhy we have our scenario comparison over\n4:52\nhere.\n4:54\nSo scenario one and scenario two. Um\n4:57\nright now these are the same values but\n4:58\nwe can look at that in a second. And\n5:00\nthen we have our historical analysis. So\n5:02\nif we were to save our first um analysis\n5:06\nit would be here. And so we can just\n5:09\narchive um our different situations. And\n5:13\nthen we can also go back if we need to\n5:15\nto see if we want to revisit a scenario\n5:19\nor adjust a value. We can do that with\n5:22\nthis option.\n5:24\nSo now we can look at the scenario\n5:27\ncomparison comparison option. I'll just\n5:30\ninput some values real quick. So we can\n5:33\nchoose the amount of scenarios that we\n5:34\nwant to include. So from two to five\n5:37\nscenarios, but for now we'll just look\n5:38\nat two. So scenario one, we have the\n5:43\ninvestment of $100,000. And this is the\n5:45\nsame as scenario two, but our wage\n5:47\naverage cost of capital is 5% while\n5:49\nscenario 2 is 10%. And our cash flows\n5:52\nfrom year 1 to year five will be 40,000.\n5:55\nWhereas our year our cash flows for year\n5:57\n1 to year five for scenario two is\n6:00\naround 25,000 for each year. So we hit\n6:04\ncompare scenarios. We can scroll down\n6:07\nand we there's a little table that shows\n6:10\num our inputs and our calculations. So\n6:14\nwe can see that scenario one using these\n6:16\ninputs gives us a net present value of\n6:18\naround 70,000 and an IRRa of 28%. And\n6:23\nit'll also give the recommendation of\n6:25\naccept\n6:26\nand it'll also show you scenario 2 the\n6:30\nMPV for that and the IRR and the\n6:32\nrecommendation to reject. And then here\n6:35\nare the tables\n6:37\nuh our charts and this is similar to\n6:39\nwhat was on the first page.\n6:42\nSo you can see the MPV of scenary 1\n6:44\ncompared to scenario 2. And again, this\n6:46\nprovides a visual representation of\n6:47\nwhat's going on rather than just looking\n6:49\nat numbers.\n6:51\nAnd then the IRR versus WACC comparison.\n6:55\nUm we can see the IRR for scenario one\n6:58\nis much larger than WACC whereas\n7:01\nscenario 2 the IRR is less than WACCC.\n7:03\nAnd again it will give you the best\n7:04\nscenario by NPB. So in this case it\n7:07\nwould be scenario one. So, I believe\n7:09\nthat this is a useful tool because it\n7:10\nintegrates the concepts that we learned\n7:12\nin class and can be used to apply it to\n7:16\na real life scenario of having to\n7:19\nchoose the best financial decision based\n7:22\non given inputs. And it also provides a\n7:25\nshortcut for um calculating NPV because\n7:27\nall you have to do is input the values\n7:29\nand click a button and it'll calculate\n7:31\nNPV for you and compare weight average\n7:33\ncost of capital to the IRRa rate. It's\n7:36\nalso a useful tool to communicate with\n7:39\nnon- finance departments because it\n7:43\nshows a good visual representation of\n7:46\nwhat we're talking about and it also\n7:49\neasily shows if we should accept a\n7:52\nproject or reject it.\n7:54\nSo it's useful to all kinds of people\n7:58\nregardless of their financial knowledge.\n8:01\nAnd so because of that, I believe that\n8:04\nit can be a useful tool and the AI\n8:07\nintegration makes it more dynamic\n8:09\nbecause it can handle\n8:12\num everchanging concepts um changing\n8:15\nnumbers. So it's also very flexible in\n8:18\nits analysis.\n8:20\nAnd so this is my capital project and PV\n8:23\nanalysis and decision memo for my\n8:26\ncapsule project. Thank you."
}