{
  "student_name": "None None",
  "org_defined_id": "036288518",
  "username": "kwon273",
  "video_url": "",
  "transcript": "Hello, my name is Anthony Kwon, and this is my Mini-Project 3 AI Finance Tool.\nFor this project, I built an intelligent financial advisor using Make.com and Google Gemini.\nThe tool analyzes natural language input, brings in external financial data, and generates investment scenarios with clear explanations.\n\nThis tool doesn't just calculate numbers.\nIt understands user context, compares different investment strategies, explains the reasoning behind them, and returns everything in a clean structured format.\n\nHere is the workflow I created.\nFirst, a Webhook receives the user's question in plain English.\nNext, an HTTP module retrieves external financial data so the AI has something real to reference.\nThen the Google Gemini node processes both the user input and the external data, and generates a summary, multiple scenarios, expected returns, risks, and a final recommendation.\nFinally, the Webhook Response sends the result directly back to the user.\n\nNow I'll show a quick demo.I'll trigger the Webhook with an input like: \"I'm 28 and I have twenty thousand dollars. What's a moderate-risk investment plan?\"\nWhen I run the scenario, you can see the workflow activating from the Webhook, to the HTTP module, to Gemini, and then returning a structured JSON output.\nThe result includes several investment scenarios with clear reasoning and a recommendation.\n\nFor iteration, my first version used OpenAI, but it had unstable formatting and API credit issues.\nIn version two, I switched to Gemini, improved the prompt structure, added external data, and refined the output format to keep it consistent.\nThe tool became more reliable, more accurate, and more useful.\n\nIn terms of reflection, AI changes the user experience by making financial analysis conversational and approachable.\nThe hardest part was creating prompts that keep the output structured.\nI also made sure to include disclaimers, because financial advice must be handled responsibly.\nOverall, I would use this tool for educational exploration, but not for making real financial decisions yet.\n\nThis was my Mini-Project 3 AI Finance Tool.Thank you for watching."
}