{
  "student_name": "Om Janamanchi",
  "org_defined_id": "037320344",
  "username": "ojanaman",
  "email": "",
  "transcript": "Hello, my name is Ron Jermanshee. This is my management week 10, session 9, the cost of capital section assignment. So, our assignment here is calculate the weighted average cost of capital, so WACC, for Netflix in connection with a potential $5 billion content investment decision. Our analysis must determine the current WAC, the impact of additional debt financing, assess project-specific versus firm-wide discount rates, and compare Netflix's cost of capital to industry peers. So, let's go to our CoLab notebook, and for libraries, as usual, we're going to be using a driver framework to solve this problem. so d define and discover as part of the driver uh our company profile we're looking at netflix which uh they're trying to decide to invest in more content investment strategies uh right now their investment amount is five billion dollars our current market cap of netflix is 200 billion and the current stock price is trading at 450 dollars per share uh the current financial position for a little bit more context their market value is 200 billion the market value of their debt is 13 billion the book value of debt is actually 15 billion the equity beta so the risk of the equity is actually 1.3 their bond rating is nothing plus the bond yield is 5.8 percent and they're being corporate taxed at 21 percent with market conditions where risk -free rate is 4.5 percent market versus premium is 5.5 percent and media industry whack range is usually around 8 to 10 percent so we're probably going to have very similar amounts for netflix as well So here, I'm just breaking this down by three options or conditions that we're trying to compare to. So option one, maintaining the current capital sector that we have, 13 billion debt, 200 in equity, 200 billion equity, 6.1 debt ratio. And we're using the current cost of capital for our investment decisions and our risk level is pretty conservative. Option two is issuing $3 billion of additional debt, which makes our total debt into $16 billion, same amount of equity, 7.4% debt ratio. In this case, we'd be lowering our cost of capital through increased leverage. The risk level becomes moderate, and the tax yield is an additional $63 million per year. or we could go per the actual project specific discount rates being US content investment being adjusted beta of 1.15 and a lower risk and international content is 1 .55 adjusted beta and a higher risk so this case is when obviously we're putting in the full $5 billion into content investment of our competitive landscape Comparing our partners where Disney is 70% equity, 30 % debt, and has a cost of capital of 8 .2%. Amazon Prime Video is 9.5%, but it's also way broader and it has a larger reach throughout the entire Amazon ecosystem. And Netflix is currently 94% equity, 6% debt. so essentially it's a pure place streaming platform and in our questions here we're trying to look at what is uh netflix current weighted average cost of capital how does the additional depth impact the whack uh should netflix use different discount rates for us versus the international content investment why is netflix whack different from disney's what's the optimal capital structure for netflix and obviously our investment breakdown is five billion dollars that they're trying to put in three billion or sixty percent into u.s content and then two billion and four or forty percent into international content uh using the appropriate discount rates and where obviously our goal is to maximize shield shareholder value and uh returns on these investments now step d of driver now we have step r which is represent so we're going to represent the weighted average cost of capital calculations where we have functions cost of equity uh calculate the after tax cost of debt calculate weighted tax weighted average cost capital uh here unlever and relever uh beta so the equity data that we talked about before our problem those are just the functions that we wrote up to have those calculated now if we see in our represent uh we're going to be comparing everything to the three scenarios like three scenarios we had so scenario one obviously current market uh capital structure so nothing changes at all well uh obviously market value 200 billion market value of debt 13.1 the total capital being 213 billion dollars um 93.9 percent equity and that's 6.1 percent and of debt and the cost of capital components uh we obviously have the formula and if we calculate it all out with taking each part cost of equity for so our cap m our pre-tax cost of debt after tax cost of debt debt yield as well we get our weighted average uh cost of capital as 11.22 percent uh scenario two say we put in three billion dollars of debt issuance which will take our total capital to 16 billion our equity is 92.59 percent so obviously our equity went down as our debt increased to 7.41 percent uh beta adjustments in this um our unlevered beta is 1.2365 our current leveled levered beta is 1.3 the new beta is 1.314 so the beta increased by 0.04 due to the increased financial risks in this case And our new cost of capital being calculated is 11.73% in new cost of equity. And because of that, our new weighted average cost of capital is 11 .2% with a change of minus 0.0176%. The third scenario is obviously the actual $5 billion investment of either U.S. versus international content, where we have just U.S. content since it's a lower risk. Our beta is 1.15, cost of equity is 0.83, and the projected back is 10.44%. So you can see in higher risk, the cost of equity is greater. And because of that, the way the average cost of capital is also greater. But overall, the corporate combined just averages out to a midpoint between the U.S. content and international content of low risk, high risk, respectively. And the $5 billion investment allocation would be $3 billion in U.S. content at 10.44% WAC, and international content would be $2 billion, or 40%, at 12.51 % WAC, with our blended WAC being at 11 .27%. So if we compare that in terms of our competition, such as the current Netflix, Netflix after the added debt, Disney and Amazon Prime, we can see that Netflix has a weighted average cost of capital that's 11.2, Disney's 8.2, and Amazon is 9.5. So we can see here that Netflix is obviously greater than both Disney and Amazon Prime. So it costs us more as our cost of capital. So we spend more on trying to make a profit, trying to drum up business and keep going in this case. Which just gives us the key insights that since Netflix's weighted average cost of capital is above the media range of 8 to 10 percent, and which is due to our high equity weighting and elevated um beta value which is a little greater than 1.3 currently uh the debt insurance minimally uh reduces the rate average cost of capital and the competitive gap that netflix just in general has is um that is 3.02 % higher than Disney. So meaning lower leverage, higher beta, less diversification is what we end up in. So next we have I implement. So we're going to implement the actual wage average cost of capital. We're going to calculate it in each of these four cases, I guess. So, with maintaining the current structure with 11.22% WAC and a five-year dollar investment, our annual capital cost is $560 billion. A five-year total cost would be, sorry, our annual capital cost is $560 million, and making sure nothing changes in the business. Five years down the line, it's $2.8 billion of cost, and the tax yield being $158 million. In strategy two, with a $3 billion new debt, we would return with an annual capital cost of still $560 million, $2.8 billion in five-year terms, and the annual tax yield being a little higher, closer to $200 million per year. So this strategy two benefit versus strategy one, we can see that the differences are annual cost savings being $877,000, the five -year cost savings being $4.3 million, the tax yield being $36.5 million, and the benefit of this tax yield being $182.7 million. in the long and then strategy two which is aggressive uh leverage being a target of 25 percent death ratio which gives us a new lack of 11.04 percent and and putting this into our five billion dollar investment we're going to get 552 million cost of capital in a year and the tax shield raised up to $693 million a year. So taking all these calculations by our functions and values, we just have a very simple table comparing strategy one, two, three, which I've already ran through the numbers and what happens if we put in, obviously, $5 billion, $3 billion in U.S., $2 billion in international content. So the recommended approach in this case would be using strategy two, issuing the debt plus the project -specific weighted average cost of capital, where our capital structure is issuing $3 billion of debt, moving our debt ratio, reducing our cost of capital from 11.22 to 11.2, which is a good plus for us. In terms of investment, we're going to use the 10.44% discount rates for U.S., 12 .5% for international content with an average blended of 11.27%. And five-year financial impact is, yeah, it costs us $560 million with a tax yield of $36 million. Well, our savings in this strategy compared to the current structure is around $877,000 a year, which is very close to a million dollars a year that we save as part of our business in Netflix. So that's a pretty good bet to take. And as we go, we'll obviously try to reduce our cost of capital as we go, to try to save as much money as possible in the daily operations of Netflix. Next, we have V, Validate. And with that, I just ran a very simple comparison of metrics on the strategy. So comprehensively, it does show that strategy two of $3 billion in debt is all green lights, all go, since it reduces our cost of capital, it's flexible, we have a great tax yield, it's low risk, and everything works out with this. and a little bit of strategy three, some of the strong points we can take from that and implement into our final recommendation. As per the quantitative metrics, which is just comparing, one, industry benchmarks and competitors and tax benefits, we can see that strategy three of 25% into a debt target, that gives us pretty strong values on comparisons against our competitors, Disney, Amazon, and still remaining within the industry benchmark. Risk validation is more or less the same across the food strategy since it's the same investment. It won't make much of a difference since we're still risking it on Netflix and we know what the service is going to provide us and it's pretty guaranteed that it's going to stay the same as credibility will hold. And then we try to break down the project-specific weighted average cost where we're seeing that the U .S. content improvement with a higher acceptance rate of 10.44, international is 12 .51 that we discovered, Third, and this actual product specification, what it does in the long term is avoid overinvestment in high -risk international markets and avoids underinvestment in stable and profitable U.S. markets that we have. so all of this analysis together tells us that uh financing 3 billion new depth 2 billion existing capacity is good our discount rates for us and international are solid for the terms of our investment and it's the best way to um excite investors create short shareholder value and exceed all the hurdle of rates and market conditions that we are probably going to face in the near future. For E, evolve, I just ran a few sensitivity tests on some of the situations. So let's just say scenario one, interest rate sensitivity. So say interest rates fall below 1.5%, which is the current rate, then our risk-free rate will go down, our debt yield will go down, our cost of equity will go down, our weighted average cost of capital will go down, our annual cost would also go down, but our five-year total cost will also go down. So we can see that as rates drop, our cost will also follow by going down. Well, if our rates increase, then our cost of capital will also increase. This is where we found that each 1% increase in the rates will raise our rated average cost of capital by 98.44 BPS. So we just see that in an environment of rising rates, our annual cost just increases by $73.8 million. So we understand the relationship. Rates go up, our cost goes up. Rates go down, our costs will go down. Second scenario is beta sensitivity. So say we have reduced competition or a favorable environment and that also impacts us in our costs going up or down. So if we have less competition then obviously our costs will be going down and staying within the industry benchmark which is good good for us but if we have a lot of competitors and we're really in like an economic war against our peers then obviously our cost of capital will go up because we want to produce more and sell more of our product senior three is like multi-year leverage evolution so year one through five of how much debt debt ratio leverage beta and how everything changes and it's very it makes sense it's common that each year that goes by our cost of capital continues to increase and add on to each other and our cost of capital as a percent does go down in this case uh scenario four and five is just okay um what's our return on investment and then uh the competitive dynamics compared to our competitors which is very similar to what we've gone over already before uh so concluding it's just showing that the optimal strategy for us in this decision it's not always static but it's evolutionary well we will start with three billion dollars of debt if it will validate like all the content investment that we put in and will get us uh pretty good returns so it's not static like you put it in months and we're gonna get a return it's gonna take some time things are gonna evolve the market is going to evolve because of our investment and we will like try to get the best return so finally r for reflect we have um just to answer your questions netflix current uh weighted average cost of capital um is going to be 11 .22 percent that we have right now so uh how does this $3 billion debt issuance impact weighted average cost of capital? Well, it actually creates a new weighted average cost of capital being 11.2% from the previous 11 .22%. So it actually reduced our cost of capital, which is a very good thing for us because we're spending less money on um the capital that we're trying to invest in but here we have a very minimal impact since uh netflix is already 94 equity finance so there's not like putting changing debt when we have a majority equity business putting in a little more debt does not really make second impact to our average cost of capital um should netflix use the project specific or the firm ride uh discount rates which our recommendation is to use the project wide because um it sets a clear guideline between u.s content investment international content investment And then what we can see is the baseline. And since the U.S. has lower risk, international markets has higher risk, so we're trying to mediate and balance between the two. Why is Netflix's whack different from Disney's? Well, there's three key reasons of that, how we differ for our way to average cost of capital. One is the capital structure difference, where Netflix is purely an equity -based business, while Disney is 30 % debt, 70% equity. So Disney gets five times more of a tax shield benefit than obviously Netflix does, just because we're more heavy emphasis on an equity-based business. second is the business risk where our betas are different netflix has 1.3 meaning that we have more risks with us as an investment but we'll probably get a better return while disney is 0.96 so it's below one it's pretty stable and a better choice in terms of a safer investment third is the cash flow stability where disney has multiple stable revenue streams it has a theme park it has a platform and stuff there's a lot of like different like avenues of business and operations that disney is doing so they have a way better hold on their cash flow while netflix is a very single resume uh revenue stream it's just netflix the streaming service as like it's one platform itself the optimal uh capital structure for um netflix would obviously be one issuing the three billion debt and as part of uh strategy two and then the long term actually putting down the 20 to 25 percent debt ratio in strategy three e and like a little bit of combination of this would give us like the expected uh weighted average cost of capital to go down to 11.04 percent combining both these strategies over five years so that is probably like the best decision in this case on this investment and the overall all takeaway that since the current rate of average cost of capital is 11 .22%, which is above the industry standard and is a high business risk. So that's why issuing $3 billion in debt and $5 billion in content investment will lower the cost of capital and make Netflix be a better business to invest in and help operate in terms from its cost of capital. overall netflix has been like very conservative with its leverage and adding this depth and uh increased investment just helps them out oh as on an operations and investability perspective so that's the end of my management uh 310 assignment for cost of capital analysis thank you",
  "video_url": "https://983291-6.kaf.kaltura.com/media/t/1_eefosh2a"
}