{
  "student_name": "Sri Pinnamaraju",
  "org_defined_id": "036238865",
  "username": "spinnam",
  "email": "",
  "transcript": "Hi everyone, my name is Shri and today I'm going to be going over my management 310 assignment. Um, and this is assignment number 10, the Starbucks uh, assignment. And um, what we're going to be looking at is we're going to be looking at the capital budgeting analysis for the Starbucks flagship roaster project. And today we are going to be using the driver method. So that means I will be going over the define and discover, represent, implement and validate, evolve and reflect. And we're going to start off with our define and discover. So in our define and discover, I first framed the decision problem, which is Starbucks is considering a $12 million flagship roastery that's going to be operating for 10 years. So my job is whether to decide this project creates shareholder value using a 8.5% whack as the hurdle rate. So these are our project parameters right over here. And our project parameters are is that we have a 12 million initial investment in the building equipment training and it's depreciated um straight line over the 10 years. And we have 500,000 in working capital invested and is uh fully um invested at the launch time and is fully recovered in year 10. And then our revenues are 8 million in a year in year 1, 11 million in years 2 to 5 and 9 million in years 6 through eight. Our operating costs, we have COGS at 40% revenue. Plus, we have a fixed cost labor at 2.5 million. We have rent and utilities at 0.8 million. And we have marketing of 0.3 million. And in year 1, and we have 0.1 million after we have a 20 25% corporate tax and a 3 million um like value, terminal value at the end of the year. And the question is using these assumptions and at 8.5 whack should Starbucks accept or reject this investment. So moving on to our other define and discover is our financial analysis requirements. So, we need to build a uh a year 0 to 10 0 to 10 incremental cash flow schedule that's going to be capturing our revenues, our operating cost, depreciation, taxes, working capital, and our terminal value. So that means we're going to have to calculate our NPV, our IR r, our simple payback, discounted payback, a profitability index, all using Starbucks 8.5 whack. And we're going to have to run sensitivity um test uh for a 20% revenue reduction and a whack for um plus or minus like 2%. And we're going to have to summarize how that affects the um NPV and our IR. And one other thing that we have to do is we have to recommend um different combinations of financial like uh results, strategic fit, maybe some brand implications and key risks um with this project. So moving on to our represent. In our represent phase, I translated all of those key um like requirements into a clear capital budgeting timeline. So in year zero, Starbucks spends 12 million in um expenses. All right. And 0.5 million in working capital for a total of cash outflow of 12.5 million. The operating cash flows then are going to be following these three revenue phases. And um so year one we have 8 million in revenue launch phase and year 2 to five there's like the peak performance at um 11 million of revenue per year. In year 6 through 10 are mature operation phases and we're having 9 million of revenue per year. And then all of our operating cash flows are going to be incorporating labor, rent, marketing, depreci depreciation, and taxes. So it's not just revenue. And finally, in year 10, we're going to see that Starbucks is going to receive 3 million in terminal value plus 0.5 of working capital recovery. And that basically means that we're going to have 3.5 million of additional final year inflow. So that's going to be our full cash flow structure from year 0 through year 10. Here I'm going to be using the NPV equation. And as you can see, the NPV equals the 12.5 million initial outlay plus the sum of the discounted operating cash flow from year 1 to year 10 plus the 3.5 million terminal and working capital recovery also discounted back at 8.5. All right. Our OCF is our um annual operating cash flow and our OCF is each year's operating cash flow and our 0.085 is Starbucks's whack. So, this is going to be the appropriate discount rate for this project. And this is um you know how we're going to be calculating our MPV structure for the Starbucks brew roastery. Now we're moving on to our implement section. And over here I'm going to be showing you my collab notebook that has my Python code to answer all of the questions in this assignment. We have our import numpy as np and these are libraries that we're going to be importing just so Python can do all of the equations that we need to. So right over here we have our parameters. We have our revenue schedule. We have our costs. We have our income statement and OCF um equation. Then we have our total cash flows. Then we have an NPV function. Then we have our irr function as well. And then we have our base case metrics uh Python code as well. And then we have our profitability index and that's going to be um helping us understand like if we should be you know going on with this project or not. And then we have our validate section of the code and this is here to basically go and help us understand if um our math all makes sense because we'll be using logic to understand if our outputs are correct. So right over here we have our results. And going back to the slides, we can see that lines one through seven. We're going to look at our core assumptions and um or like our core parameters. So that's going to be like looking at our um cap x working capital, our tax rate, our whack, our terminal value, and like the 10-year timeline, right? So that's pretty exciting. And then the next um few lines are going to be like the revenue schedule. So you know like the script is going to be assigning 8 million in year 1 and then 11 million in years 2 to five and then um 9 million in years 6 through 10. And then next I'm going to be looking at the cost structure. And um well looking in the cost structure we are going to be looking at the full cost structure and straight line depreciation. We have COGS at 40% of revenue. We have fixed labor working in there. We have rent. We have marketing. And we have a straight line depreciation of 1.2 per year. And then um lines 43 to 59, we are um making a loop. And I computed the EBIT, the taxes, uh we have net income, we have our operating cash flow for each year, and we also have um the OCF equals the net income plus depreciation. uh happening over there. Then I basically uh made a total cash flow array and that includes year zero cap x plus working capital as a negative cash flow and years 1 through nine are annual OCFs and year 10 adds the 3 million terminal value and the 0.5 million working capital recovery on top of the OCF. So after that I basically defined the usable functions to calculate net present value at any discount rate and to solve for irr numerically um using a bisection method. I also added logic to basically um compute like the payback the discounted payback and the profit uh index or also known as the pi. So that is where all of the other lines go that I mentioned before. These are some um other code snippets where you know we rebuilt the cash flow and we also include a validation step just to understand if our values do make sense. So after all of that code we get an output. So this is one of our outputs and as you can see um this slide shows that the base metrics with a 8.5 whack are going to be a net present value of 3 million and $222,000 $500. We have our IR we have a IRR of 13.25. We have a simple payback of 5.28 years. We have a discounted payback of 8.21 years. And we have a profitability index of 1.2. So these results basically show that the roaster gen generates a positive net present value which is um a return well above 8.5% hurdle rate right and we have a profitability index that is greater than one and this all basically means that we are going to be creating value um in the base case. So this is a good sign. So next we're going to be moving on to our validate portion. And so right over here I check that the total depreciation over 10 years equals the 12 million cap X and that the year zero cash flows equal 12.5. So that's cap X plus working capital. So this basically confirms that all of our major outflows are included correctly. So the IR consistency check I basically recomputed the NPV at the model's IRR and we confirmed that it's approximately zero and um so that's good. Then we verify that the IRR solver is working and is consistent with the NPV function. So that is a good thing over here that happens. Then as we can see we have our discount rate and our discount rate appropriateness is the whack plus or minus 2%. So I tested the NPVs at 6.5% and 8.5% and um a 10.5% whack and NPV remains positive across all of these different whack ranges but it shrinks as the whack increases which is um which makes sense economically. So, so one other thing I wanted to talk about was our sensitivity robustness. So I rebuilt the cash flows with all revenues 20% lower and recomputed the NVP and IRR. Um this basically shows that the NPV turns negative and the IR drops below whack highlighting that the project is going to be sensitive to the demand and risk. So we're going to look at our depreciation sanity check which is 1.2* 2 * 10 which matches the 12 million uh initial cap x. Then we have our year 0 which equals our cap x plus working cash flow. And then we're looking at all the other years and then we see that our outflow uh our outflow is negative at year zero and our inflow is positive after. So that makes sense. And as we can see that the project is remaining positive at our NPV between the whack ranges of 6.5 and 10.5. So that'll be good. As we can see um we are highly sensitive to revenue. So a 20% drop flips the NVP to a negative which is a key of it being a little bit risky. So I basically checked that the gibbreation sums up to the original cap x uh value and then I verified all of the relevant cash flows including working capital and terminal value and captured and tested how sensitive um the decision is to both of the whack and revenue values. And we can see that the project is robust to reasonable changes in whack but kind of fragile to big like demands. So moving on to our evolve, I want to talk about how I can kind of improve or generalize this model. we can kind of change the Python script to um you know look at other flagship locations maybe like see a different revenue um map or like see how the values change if costs were different. So we could do like scenario sets and then um some other things that we could do is maybe like I could make a different visualization like a bar chart instead of like um my other visualization and some other things that we could do is relate how this project is related to session 10. So uh evaluating the flagship roaster is basically using capital budgeting to determine whether a single project is going to create shareholder value. This aligns with you know project evaluation and individual investment analysis. Now we're going to be moving on to how this can relate to session 11. So using the NPV model can be adopted to evaluate new reserve roies or different story remodels. And um this analysis is going to help us form a single project to a portfolio of potential store investments where you can see how Starbucks is going to compare to um compares its NPVs or IRRs and their different like profitability indexes. So that's going to relate to session 11 strategic finance and portfolio investing and um financing decisions. Next, to relate it to session 12, Starbucks can operate in multiple different markets, the US, um, China or other areas. And this framework uh, can help Starbucks rank projects by NPV, optimize capex budgets, balance growth versus mature markets, and coordinate financing choices. And that aligns with session 7, business valuation, and viewing the firm as a collection of different projects. So evolve um session 13 integration which is comprehensive strategic and financial analysis. Once Starbucks can evaluate like its individual projects and portfolios, capitaling uh capital budgeting becomes a foundation for you know corporate valuation maybe a long-term strategic planning ESG investment decisions and capital structure choices and NVP is going to be that value and tool that's going to connect the finance operations and strategy across all of the different um companies. So that's how this project relates to session 13. Moving on to our results, as you can see that our NPV is going to be around 3 million and the project creates a positive shareholder value after covering Starbucks at our 8.5 cost of capital. Our IRR is 13.3 and this is going to be returning um this return exceeds the required 8.5 hurdle rate indicating that it's a really good investment to do. We have a simple payback of 5.3 years and that's going to be basically showing that Starbucks recover its its initial investment slightly after the midpoint of the project. And then we have our discounted payback which is when adjusting for time value of money. Our discounted payback is going to be 8.2 years and the project pays back uh just before the end of year 9. And our profitability index is above one. It is 1.24. So that means for every $1 invested, Starbucks receives 1.2 of present value benefits. So that'll be pretty cool. thing here I wanted to mention is that so we have a working capital and terminal value that is going to be meaningful and it's going to impact our year 10. So adding the $3 million in terminal value and 500k working capital uh recovery significantly boots our year 10 cash flows. So that means that the terminal year adjustments have to be modified carefully because they are going to affect our net present value. One thing I wanted to say about capital budgeting is that it's going to enforce discipline in our strategic decisions. So the rotisserie carries brand value and um different benefits that Starbucks has to carry out. But the NPV forces us to quantify our value creation objectively. So what I learned is capital budgeting helps separate the emotional strategic arguments from the financial evidence which is good to see to make a well-informed opinion. So these are our results and I want to talk about our sensitivity analysis. I mentioned this a little bit beforehand but at the wax sensitivity of 6.5 and 10.5 the NPV does remain positive across the entire range. So that means it's not that highly to discount rate risk, but our results are going to be a little bit more um different based on if we had a 20% uh less revenue scenario. Our NPV does become negative and our IR drops below the whack. So that basically means that our project is highly sensitive to demand and demand risk and revenue fluctuations. So the most important insight I gained from this is that a positive accounting profits are not just enough to justify a strategic project. So we have to look at the rotisserie if it looks profitable but also we have to make sure that we are only doing that by discounting all of the cash flows at 8.5% whack. And when we do that, we do see that it creates about 3 million in present value. And so at the same time, we have to look at the sensitivity analysis and it shows how the project is going to be a little bit vulnerable due to revenue underperformance. So that is basically highlighting why capital budgeting decisions must combine quantitative um analysis along with brand strategy because demand risk and execution can really change a product um and a development. So here are our results. As you can see we have a net present value of 3.02 02 million and it creates value. We have a IRRa of 13.25, a whack that is going to be accepted. We have initial outlay of2.5 million and then we have a whack of uh 8.5% and then we have a terminal value of 3 million and we have a working capital recovery at 0.5. So NP value is positive. Great. The IRRa is really significant compared to the whack. So that's pretty good. we have our final year terminal value and that pushes the investment firmly into um a section where it's going to create value and um in conclusion uh this is fully aligned with our capital budgeting theory and corporate finance. So it's basically creating a best scenario where we are going to be um getting a good return. So, kind of to reflect on my process, I kind of learned that positive accounting profits aren't just enough. Uh, we need to see how things are when like you discount all of the cash flows at the specific value of like 8.5 whack. And then that's when we're going to see the true economic value of Starbucks's rotisserie. One thing that I also learned is our biggest risk can be demand uncertainty. So not the discount rate but the 20% revenue downside because that actually completely flipped our net present value and our IRRa. So that basically reminds me that strategic projects have to be backed up by strong and realistic um expectations. So one thing that I want to mention is that my final recommendation is to accept the project um because in the best case the rotisserie has a positive NPV of about 3 million the IR is above 13% and it has a profitably index above one which is all um going to be supporting the investment. So one other thing that I would say is I would advise Starbucks to management uh to basically see and treat this as a strategic flagship. So closely monitor demand and manage the execution risk because the major shortfall in revenue would cause this to be a value destroying project. So as long as you have all of the demand and manage execution risk under cover, this project will give you value. And overall, this assignment basically showed me how to use capital budgeting and Python and corporate finance to make decisions and how net present value can become a really big indicator of if you should be getting returns or investing properly. Thank you. Bye.",
  "video_url": "https://www.youtube.com/watch?v=WiYjjLkQYdQ"
}