{
  "student_name": "Caden David",
  "org_defined_id": "035815616",
  "username": "david54",
  "email": "",
  "transcript": "Hi, my name is Caden and this is my assignment 10 for management 310. this is my analysis of the proposed Starbucks flagship roastery project. The goal of this assignment is to evaluate a $12 million capital investment and provide a clear accepts reject decision. To do this, I have built a 10-year cash flow model in Python, calculated a core capital budgeting metrics, and tested the project sensitivity to key assumptions. My entire process was followed by the driver framework which I will use to structure the presentation as required by the assignment. I began with a clear define and discover stage before any implications to ensure that my model was built on a solid foundation. So the first stage the define and discover is where I define the core problem. Should Starbucks accept this project? The decision rule is clear. We will accept if the project's net present value is positive and if the internal rate of return is greater than the firm's 8.5% WACC in the section of my code access my defined and discover documentation I identified and listed all key project parameters. there's a 10-year project life, a $12 million in initial investment, which gives us a 1.2 2 million annual depreciation expense. a 500,000 working capital outlay which will be recovered in year 10. A $3 million terminals salvage value and most importantly a specific 10-year schedules for revenue and marketing along with variable and fixed operating costs. documenting these assumptions first was critical for building an accurate model. Next this next stage was represent where I planned the project the model's architect. My plan was to create a single reusable function called run analysis. You can see the plan outlined in the comments here. The reason for the structure is simple. It adheres to the don't repeat yourself principle. Instead of building separate models for the base case and sensitivity analysis, I can build one engine and pass it through different sets of assumptions. This makes the evolve stage, which we'll see later, incredibly simple and error-free. The plan was to have this function take in all of our assumptions and return the final cash flow metrics. So we have the revenue schedule represented and the a marketing schedule represented for years 1 through 10. Next for the next stage we'll write a clear plan and move to the implement stage where we run the analysis function. so I'll walk you through its logic. One is the pro-forma calculations. The calculation first loops from year 1 to 10 and each year it calculates a mini-pro-forma income statement. It takes revenue subtract the cost of goods sold, marketing, labor, rent, and depreciation for the finding for the to find the earnings before interest in taxes or EBIT. And second is taxes in OFC. It then calculates taxes on the EBIT to get net operating profit after tax or NOPAT. By adding back the non-cash depreciation charge, we get our annual operating cash flow. Third is our zero year 0 to year 10. this model then handles our nonoperating cash flow. In year zero, it sets the cash flow to a neg to negative 12.5 million, which is the 12 million dollar investment plus the 500,000 for working capital. And number four is terminal value. In year 10, it adds the $500,000 dollar working capital recovery and critically the after tax salvage value. Since the 3 million salvage value is fully taxed at 25% the after tax proceeds is precedes our 2.25 million. And another the fifth one is to calculate the final metrics. Finally, we use this to complete our 11-year stream of cash free flow. The function uses the numpy financial library to calculate the projects MPV, RR and profitability index. Now for the fourth stage is validate. here to run the analysis function using our base case assumption to get the primary answer. As you can see from the terminal output, our base case results are Well, as you can see, our terminal output for the base case results are the MPV is 3 million, a little over 3 million and the IRR is 11.99% and the profitability index is 1.4. this this decision rule is met. The MPV is positive and the 11.99% IRR is comfortably above the 8.5% WACC. This section also calculates the payback periods. The simple pay payback is 2.6 years. More importantly, the discounted payback period is 3.02 years. Meaning the project pays back its initial investment in today's dollar is just over three years. Now for the evolve stage where we use our model to answer the what if questions. we tested our decision first. I tested a 20% reduction in revenue. The output for the scenario is very concerning. The NPV drops to a negative 1.85 million and the IRR falls to 6.55% which is below our 8.5 hurdle rate. This tells us the project is highly sensitive to its revenue forecast. second I tested the WACCC itself. At a lower WACCC of 6.5% the MPV improves to 4.3 million and at a higher WACCC of 10.5% the MPV is still positive at 1.97 million. This analysis shows that the project is far more sensitive to achieving its sales target rather than the small changes of its cost capital. And then finally for the reflect stage where I complete my recommendation, my final decision is to accept the project. the base case financial analysis is strong. It creates over three million in value for the firm and offers a return of nearly 3.5% above the cost of capital. However, this acceptance must be qualified as the evolve stage demonstrated the project's success is critically dependent on achieving its revenue target. at a 20% shortfall would make the value destroy value destroying project. Therefore, my final recommendation is to accept the project contingent on management's high confidence in the revenue and growth forecast. the driver process was essential. It provided not only a single number but a disciplined workflow for planning to implement and most importantly to risk analysis which gave a more complete respon and responsible managerial answer. Thank you.",
  "video_url": "https://youtu.be/h7WeBbHhreM"
}