{
  "student_name": "Alexandra Garland",
  "org_defined_id": "035848624",
  "username": "garlana",
  "email": "",
  "transcript": "Hello, I'm Alexandra and I'm investigating market efficiency using the GameStop um GME short squeeze of 2020 through 2021. Our goal is to test the weak form efficient market hypothesis which is also known as EMH and quantify the I mean quantify its failure using the driver framework. So starting with um define and discover. So under the EMH, the price should equal the present value of future cash flows discounted at a riskadjusted rate. And the jump from approximately um $4.50 to now $483 implies an impossible present value increase um suggesting a massive mispricing. So just for a critical first step, we um did I did some data verification and the assignment 0.04 or 4 cents claim for August 2020 is incorrect. My um code and the um validation that I did looking up and um using historic data confirmed that the true range was um approximately $4 to around $6. and we wanted to use these values and proceed using the verified data. So starting um on the represent as well as implement um I'm going to do go to the collab to show this. So our analytical plan is so starting with represent our analytical plan is an event study and we'll use the CAPM um to predict the normal return um which is just ERI and then compare it to the observed return and the difference um is the abnormal return which is also known as um ART and the core formula we are testing is the calculation of the abnormal return um which is ART equals the R observed minus E um RAR I and then going to the collab. So here is just defining parameters and the imports and parameter setup. So um we begin this implementation by implementation phase by executing the calculate beta and expected return. So this sh is shown under block two which is the functions for EMH testing in the um represent and implementation stage. So here's the calculated calculate beta and expected return and there's that there and then um this the calculate beta and expected return function. This is the EMH prediction model. And then scrolling down a little bit. So we have step one the OS regression. Um and we can see that shown at after we ran the code. Um it gave us this um table as well as this graph. But for the um OS regression, the code executes OS regression on the pre-event returns. And this um statistical output shown here um is crucial because it validates our EMH prediction model. And um we interested in the beta coefficient which is found here in the coefficient column right here and next to the market return um RM. So shown right here. And then my code estimates GME's pre-event beta at 1.1375. And this means GME was 1.1375 times more volatile than the market confirming its high systematic risk. And um furthermore, the t statistic shown here right here of 5.001 001 confirms this beta is statistically significant. And this beta is the financial foundation of our EMH test. And then um for step two, I wanted to do an abnormal return calculation. So with beta, the code moves to the event window to calculate the daily abnormal returns. So this is shown in the event study analysis up here. So we have our event study analysis shown here and then um what is calculating? So the code first determines the expected return which is just ERRI using the calculated beta and then it subtracts it it then it subtracts this predicted return from the observed return to get the daily ART. Um and then for step three we um had the cumulative abnormal return which is also C. So finally the code compounds these daily ART values into the cumul cumulative abnormal return also known as CAR or C which quantifies the total profit opportunity that existed outside of the EMH model. So for um the validate and as well as the reflect step. So I wanted to show the final output it had for um the car graph or the cumulative abnormal return graph. So we have the graph here as well as this is just validating market efficiency. So the implementation yields the critical output which is the C during the squeeze being um 188.53% and shown there this um massive s sustained positive C is direct quantifiable proof of an EMH violation. So from a weak form efficiency which is just historical prices this is violated and the massive C shows that historical data for an example a high short interest was predictive of future abnormal profits and then we also have um looking at semi-rong form efficiency which is just public information. This has also been violated. The price of $483 was irrational compared to the fundamental present value which is a range from $10 to $40 and public information was not accurately priced and then um getting more um into the evolve as well and as well as more of into the reflection. Um so this is shown here as well. But going back to the Google Docs. So we worked through our implement in our Google Collab and showed those calculations as well as those formulas. And then we also went through our um validation and showed which were violated being the semi- strong um form as well as the weak form and um an explanation for those and just getting into the evolve as well as the reflection here. So could a rational profit s profit systematically? The answer is no. The extreme risk means the profits weren't risk-free. So we turned to behavioral finance to explain the anomalies persistence and the C persisted due to um hurting behavior which is coordinating um coordinated buying and as well as limit to arbitrage. So rational investors couldn't short the stock to force the price back to present value because the risk of the squeeze worsening was too high and the trade-off was uneconomical. So in reflection um going into the reflect stage as well um the GME event was a spectacular short-term failure of the weak and semi- strong EMH and our analysis used the um CAPM to quantify this failure with the C while the statistical output um from the OS regression shown in the collab validated that risk level and then I also wanted to mention that ultimately while behavioral finance explains this short-term craziness, the price eventually collapsed back toward its fundamental range. Um, and this confirms that time value of money, um, principles and fundamentals govern asset prices in the long run. So, thank you so much and that will be all.",
  "video_url": "https://youtu.be/BEiLMaRu2vI"
}