{
  "student_name": "Jon Parrett",
  "org_defined_id": "037141383",
  "username": "parrettj",
  "video_url": "https://youtu.be/MMfqRDqP7rA",
  "transcript": "So today we'll be covering a hypothetical $90 billion buyback from Apple and we're going to um evaluate um kind of what comes from this. Um there are a lot of scenarios to cover from this but initially I just want to say that to define our the problem is to see what the 90 billion dollar buyback would do for um and the changes that would come from um for Apple. So to research this problem what I did was um it used um Yahoo Finance to pull all this information. So, and these are just the proportions we were given, but um numbers wise, it used the numbers that we were given in our scenario and um filled in the rest of the gaps with real um information from Yahoo Finance to pull the real um debt to equity ratio and so on. Um so, first to just define more of what these um numbers mean. So, um, Apple did a buyback. A buyback is basically um a company buying their own shares to raise the value of their shares because if they're buying more, that means um um people there's less shares for other people to buy. And because there's less shares for people to buy, it raises the value of their stocks. And so with that, these are just some numbers that aren't too important, but it's just saying where the buyback is going for app. So it's going to retail shareholder shareholders, international shareholders, do CEOs, direct shareholders. So these are all just the percentages. Um it's not too important to see though. Um so to go over this for the bond holders a or to identify the options um let's see how it impacts the bond holders. So um first it increases financial leverage. A significant share buyback usually means the company's reducing their equity um because they're using their own money to buy their bonds. So they have less money because they're using it to buy or to buy their stocks. Um and if funded by debt, it also raises their debt. But um assuming not this the place the data we got for the debt to equity ratio is 1.33. So um I mean which isn't excessive but that also means they're in debt. But um\n\nso because they like right here it says they're reducing their equity through buybacks because they're spending their money. Um no and this generally generally increases financial leverage. Higher leverage means a greater proportion of a company's aspis\n\nfor bond holders. meaning so financial leverage is how they're leveraging their debt and um because they're spending more money on their own stocks, they are going to be in higher debt. Um this also reduces liquidity because they have less money like less cash and so it's going to be harder to um pull that cash as immediate as it would have been prior to the buyback. um this can hurt their this also look at credit rating. I mean um this could hurt your credit rating just because you're in debt. Basically in the simplest terms I can put that um claims wise for bond holders. Um seniors have claim a company's assets compared to a shareholders even in the event of bankruptcy or liquidation. A buyback by reducing equity effectively means there's a smaller equity cushion absorbing losses before bond holders are impacted. Um so what this means is that if they were to go under there'd be less available cash to go to the bond holders in the case of um them going bankrupt but this is unlikely for a company like Apple because of their strong cash flows. Um and that's kind of the risk that comes from that. Now looking at another option to identify this option um and that's also verifying too just looking at the pros and cons. So, the pros being um the pros being that they're leveraging their debt um to raise the value for their stocks and the downfall being that they have less cash and in the event of a bankruptcy there'd be less cash for the bond holders. Now, looking at the shareholders, um a large buyback for a company stock. So this what they're saying here is that the reason someone would do a buyback would typically because they think their stock is undervalued. So they would have make less stocks available by buying up some so that it raises the price. So in this example from $6 to 625. Um and this is generally viewed as positive in the market because um something's getting more expensive it's because it's more valuable. Um so for shareholders it's just making their um or sorry for the company's perspective they're they would do this in the scenario that they think they're undervalued. Um another thing of this would be so if a company is confident enough to um is confident enough to um have a buyback meaning they have less less physical cash and less um and they're kind of driving up their stock value. This would this usually indicates that they're they're very comfort they're very confident in their company. um they wouldn't just do this just to raise their value if they knew like they couldn't uphold of what if word this better they wouldn't they wouldn't drive up their prices if they didn't think it was worth it if they didn't think that their um their products were worth it um and this increases value like I've said before and alignment of interest so what this basically means is that um like the they're they're making the they're kind of their cushion less because they have less money to spend. And so um for the company's perspective, they're going to be wanting to work harder and to be more profitable because they have a less of a cushion. And so that could be good in the stockholder stockholders perspective because the company they're investing in is working harder to get that money back. And so a pro would be that they're working harder and they're have higher confidence in their um they have higher confidence in their stock or in their company. And a con would be that um the prices go up and there's less cash or less cash available to the company. We already went over bond holders.\n\nSo look at future growth prospects. lack of internal opportunities. While a buyback signals financial strength, some critics argue that a large buyback might signal a lack of attractive internal interest. So, what this means is that um a company might be doing a buyback just because they don't think people are interested enough in their product. So, they could be doing this because um their customers or not their customers, but the the general public isn't as interested in their um products. But a positive but yeah conversely like it says here it can signal that the management is optimizing its capital structure ensuring the the capital is efficiently allocated which can free up resources for future strategic growth if underlining business remains strong. So, um, looking in the future, the reason someone might be doing a buyback might be, um, seen as negative to some because it could mean that, um, the general public doesn't see their product as valuable as the company does. But for the conversely um if the capital is effectively allocated and they have a strong like strong core then it shouldn't be a problem.\n\nAlready went over this.\n\nOkay. So more refer evaluation and identifying um options we look at more of the shareholders. So a direct cash payout most immediate and clear sign is a direct direct cash payout to the shareholders. This is often appealing to income focused investors um seeking liquidity it's tangible return. So they get literal like checks of money instead of like waiting for a a stock to increase in its value and then selling it. then they just get a check instead. U a reason a dividend like this might come out is because a company is confident in their um a company is confident in their company and they're sitting and they have a surplus of cash like here\n\num\n\nI'm just messed this up. This is about dividends. So, a dividend would be a direct cash payout. Like I said, it um initiate or it shows that they're confident in their performances and there's no ownership dilution, meaning there's not um more or less people owning shares. And then tax implications, they're um they're usually taxes income. So, that's kind of a con that it's less tax effective, but the pro is that you're getting an immediate cash. And um this is a less of a benefit for the employees because while a healthy company is good for everyone, a special dividend does not directly increase the value or ownership percentage of stock. So the company doesn't get more valuable because they give out dividends. Um and a focus on immediate returns might not always be good. It's always better to look longterm. So they're kind of the pros and the cons of that. And then for bond holders, similar concerns. they're they're going to have less cash if they're giving out um dividends which hurts the bond holders because they don't get dividends.\n\nUm I mean just more signals that can come from this is that um we're evaluating this we can see more signals are coming that this is a sign of a mature business if they're giving out special dividends. A baby company wouldn't be giving out dividends like this.\n\nSo the impact of strategic AI and VR acquisitions. So meaning that the company the company's getting more um tech technologically um um inclined. So technological in advancements. So the potential um impact on ROIC or return on investment capital. So this be an init initial delution because AI or integrating technology is not cheap. You have to buy the technology and integrating itself is also expensive. But for the long term um long term things are going to be things are going to be more um um effective and um there's going to be less waste cuz the technology kind of takes fills in the gaps that need to be filled in. And another thing is that people are interested in AR and AI and VR. So this is a this is good for um just like for the customer's perspective. They're seeing that the companies that they like are getting more techn technologically advanced and for the long-term fit. Um companies that aren't growing or aren't advancing technological are going to die out. And so it's a good sign that they're integrating AI and VR to keep up with um today's times in today's uh world. And this creates start stronger engines a competitive advantage because um their their technology would be stronger in this scenario and long-term value creation if successful. such actu such acquisitions could unlock substantial long-term value um by fostering innovation and then from the markets perspective um growth through innovation so acquiring AI and VR are going to make the company more profitable and so because of the innovation and the risk of this would be like a pro would be that they're getting smarter a con would be that like not all technology they use is going to be right or it's not always going to be helpful. So, it's kind of something you kind of have to see play out. And then from the bond holders perspective, um a long cash funded acquisition would reduce Apple's liquidity. So, because they have less cash because they're spending on the um they have less cash because they're spending it on the technology. But in the long term, the bond holders might be getting more money if this turns out to be successful.\n\nSo signaling effects in market perception of debt reduction. So for the bond holders, this is awesome because their whole thing is just having more cash. Um and this increases their safety and security in their bonds. It helps their credit ratings. But for shareholders that means they are investing less cash and um kind of letting more money just sit there and not letting it um kind of make money for them.\n\nSo sorry um impact and in and incremental um research and development investments. So this would also kind of go go with the long-term impacts and also growing technology because if you're researching and developing then you're coming up with new innovation and new technology that can help. And this is good for long term because it fuels innovation allowing Apple to develop and grow. And um growth is survival. And then it diversifies their revenue streams, meaning that they're not just making money from just a phone now. They're making money from phones, laptops, iPads, a bunch of different fields.\n\nUm and it's just making the company smarter in general. And a smarter company is going to have more ways to make money. So their effect on return on invested capital initial dilution because they're spending money on research and developing but long-term benefits of their research and development paying out. So another risk versus reward scenario.\n\nSo all this is repeated.\nOkay. Now comparing them all. So the $90 billion buyback and other implications. So first the shareholders buyback strategic fit just to sum this is summarizing everything um for the um just want to make sure we went everything. So we went over the define we researched our topics. We identified our options. We verified by showing the pros and cons. evaluated um the areas by saying how or not they would make money and lastly we're just going to review and reflect our information by summarizing it. So share buybacks um share buybacks work because they increase value for a company or they increase the value of the stocks and they um and they show confidence from a company saying that they have confident they're confident in their uh product. But this has some cons such as for um for bond for spec specifically for um people with bonds because they're reducing their cash by spending it on the buyback. Next is a special dividends. Another also hurts the bonds because they're spending money on the stockholders to give them dividends. But at the same time, this helps the stock the shareholders because they're getting a direct cash payout. And then for the um acquiring new technologies such as AI and VR, this kind of helps everybody because um well it could hurt initially because they're reducing their liquidity um again hurting the bond bowlers the bond holders um because they have less cash on hand now. But for the long term, this is growth because they're acquiring new technology that will help them in the future and make their company more effective and more profitable. And then debt reduction. This this helps the bond holders because um they have more cash on hand and their credit scores be better. But this would also potentially hurt the company just because of time value of money. Their their money is just sitting there. It's not making more money for them if that makes sense. And then um having incremental research and development also helps everybody but hurts the bond holders cuz they're spending money on research and development. but in the long term is helping them grow and growth is survival. Like I've said before, that is all repeating. All right, thank you so much. I'm sorry this video was long."
}