{
  "student_name": "Kyle Sandwell",
  "org_defined_id": "035947102",
  "username": "ksandwel",
  "email": "",
  "transcript": "Hi, my name is Kyle Sandwell. This is the session uh eight assignment for man management 310. So what we have to do is that we're investigating the market efficiency using the GameStop short speed event from 2020 to 2021 as a case study. We're going to verify the accuracy of the stated fast analyze the price behavior of efficient market hypothesis predictions. evaluate whether market anomalies constitute ev evidence against market efficiency or can be explained with existing frameworks. So starting off the first thing we got to do get the define the objective is to investigate market efficiency of the short squeeze and we want to the core task we have are the to verify all factual data points from the prompt analyze gametop price behavior relative to the effective marketing hypothesis or EHM EMH. We want to test uh which form of EMH were violated, evaluate behavioral finance explanations for the anomaly and assess if rational systematic profits was possible. Some research um the question was was the GameStop short squeeze a complete failure of the effective market hypothesis or can be explained by modern financial theory. This is the primary objective is to test which forms of the EMH were weak, semi- strong and strong. These are the three types. which one were violated by the GM by the GameStop event. And some secondary objectives would be uh quantify how abnormal the event was. Using the abnormal returns calculations, I defined the specific behavioral biases that drove the price hurting or overconfidence, evaluate the market self-correct, and determine if rational investors could have systematically profited before the event. So, some known information, the peak price of GameStop was $483 at January in January 2021. the true value. Um, analyst fundamental estimates were $10 to $40. Like that's what it was actually should have been worth instead of this inflated peak price of $483. The spark um the short interest peaked at a mathematically impossible 140% of float. So it was 140% over what it was actually worth. And some key players in the event, Ryan Cohen, he was supporting it. Uh the Reddit page r/wall bets, they really made it explode to this level. they talked about it and planned this whole thing. Basically, Melon Capital, they lost 53% and then Robin Hood restricted trading. Some unknowns is what GameStop's normal risk profile before the squeeze began. Uh what were the exact dates of key public announcements needed for our event study? What was the daily abnormal return during the squeeze? And can we statistically prove that these returns were not just random luck? So, some verified data. The urgent claim was that GameStop was traded at 4 cents in August 2020. And this is fashion incorrect. GameStop executed a 4 for one stock split in July 2022. Um, historical data must be just for the split. The split adjusted low for GameStop in August 2020 was $1.67. The pre-split real low price was $6.68. This was fact checked by just simply googling what the GameStop stock price was in August 2020 and reading the Yahoo Finance results. Uh, this is noted for the future project. So basically what that means is that the this number we were given is not true. It's almost $2 off which is a huge discrepancy and it could have affected it if we didn't figure that out and fact check it. So information we downloaded GameStop daily stock prices and volume the S&P 500 daily price and the US T bill rate. We use the S&P 500 as our market benchmark and the T bills are risk-free rate. Um, we use the normal time from August 2020 to October 2020 to calculate the GameStop's normal behavior. Then we use the crazy time of December 2020 to March 2021 to capture the events the entire squeeze event. So test one uh the question, can you use past prices to predict future prices? EMH says no. Our test will check if GameStop's return on one day predicted its return on the next. Calculation we made would be return today equals alpha plus beta times the return yesterday. What we'll find is that during the squeeze beta will be positive and significant. This shows momentum and hurting order driving prices and was not random chance. Conclusion the weak form was violated. Test two semi- strong form. The question was do price reflect all public information accuracy? M EMH says yes it does. Um this is the easy way. It says there's two ways. The easy way is that public info like the anal report says that GameStop was worth $10 to $40 but the market price hit $483. So therefore the price was not correct. Then the event study way would be that we calculated the abnormal returns or AR. This is the surprise profit that can be explained by the market movement. So basically uh we calculate it first. We calculate the expected return using expected return equals risk-free rate plus beta time market return minus risk-free rate. Then we find the AR which is AR equals actual GameStop return minus the expected return. Then we find the cumulative abnormal return rate or car which is car equals um actual return day one plus actual day actual return day two and so on so forth. We then will plot the car in efficient market the line should be flat at zero. So y axis x axis it should be just straight across on the x axis no going up or down. Um ours will look like a giant mountain peak. So it will just go up and down and up and down visually proving the market was not efficient. So therefore the semi-strong test was also violated. Test three, the question was can anyone even sus beat the market? EMH says no. Our test we looked at Melvin Capital and they had a private sophisticated analysis that GameStop was overvalued. They shorted it and lost 53% of their money. We're crying a bailout. Their smart info was not was useless and uh the strong form was violated because they weren't able to beat the market. So the results of this would be uh there's some behavioral biases will show the data was driven by human psychology and not mathematics. Uh the car plots a picture of a digital stampede from Wall Street Bets. And then overconfidence both retail traders thinking they'd all get rich and hedge funds thinking their short positions were foolproof or overconfident. Some moves to arbitrate. Sorry, I don't know what that was. some wins to arbit trade which is the most important part would be uh the question if GameStop was obviously overpriced at $483. Why didn't rational investors just short it to bet on it being fall to bet on it falling and bring the price back to reality? The answer was they couldn't. The arbitrage the correction was blocked. Um reason one was that the short interest was 140%. There were no shares left to borrow for shorting and the fees were way too high to make it rational. Risk two would be the risk the noise trader risk the Reddit crowd noise traders stayed irrational longer than Melvin Capital the rational arbitrator could stay solvent. Then reason three would be the rules. Robin Hood restricted buying this Robin Hood restricted buying. This was a literal physical rule that stopped the market from working. So you literally could not buy GameStop at this point. So to implement we ran uh some Python code to find to prove test one and two one and three I wasn't able to put it onto the slide so I'll show you in a little bit but for uh this is for test two so the expected return beta equals 1.85 made five. This is assumed the uh return of GameStop would or the actual return is up 92.7%. So it's up almost 100% of what it actually should be. S&P 500 return was negative.015%. Which is not that bad. And the receive rate is zero. So the actual return rate is RF plus beta times uh the sorry return today and then return tomorrow and this all equals to 0.275%. And based on this it should have only lost 28% that day. So it should not have lost as much as it really did. Then the abnormal or actual return is the actual return minus the expected return and the AR equals 93%. And his stock price had a 93% surprise return in a single day. In general, 25% is very high. So this shows it was a very high risk gamble instead of investment. So people weren't actually investing. They were more like going to the casino and hoping it worked out and just throwing money at it and not actually using their brains to actually invest smartly. Then to validate this, we were able to confidently say that our findings show the GameStop event did produce a massive normal return that can't be explained by chance. Then the issue um cap soon is a stable beta. GameStop's beta risk profile was not stable. It was going up and down, up and down. It changed widely during the during the squeeze. And in conclusion, the fact our model's core assumption breaks down is not a failure of our analysis. It is further proof of the anomaly. It confirms the market was behavioral rational outside the bounds of normal risk models to evolve. Um we got some action versus passive. This event strongly supports passive investing. A passive index fund would have minimal or no exposure protecting investors from this idioscentric volatality. Active managers who shorted GameStop like Melbourne Capital were destroyed while those who chased the high price bought at the peak. Risk management. Uh the key lesson is not about fundamentals but about risk management. The event demonstrates the danger of overleveraged short positions and introduced a new risk factor. Social media has driven her behavior. So really all that's saying is that uh it was overleveraged for short positions. So people betting on it fall had the advantage. So it wasn't really worth buying and the herd of the social media Reddit page drove the price up even more. This new framework for hedge fund managers. This event proves the fundamental analysis alone is insufficient. You must now also monitor the limits to arbitrary factors like short interaction interest at percent of float borrow cost and social media sentiment as a key factor. So basically for hedge manager they have more stuff to pay attention to and more potential factors that could affect their investments. Then to reflect um the EMH versus behavioral the GameStop event does not disprove the EMH. said it serves as the ultimate real world example of limits to arbitrage, a key component of modern financial theory. Synthesis, the market is not efficient in the perfect theoretical sense is a competitive environment where behavioral biases like hurting or overconfidence can create a massive temporary dislocation or bubbles. These dislocations can persist precisely because the risk and cost of rational arbitrage like shorting this bubble are way too high. Then final answer, the GameStop event is a clear violation of weak form and semi-strong form efficiency is not evidence against the market efficiency theory, but rather a powerful validation of the behavioral finance framework and the limits to arbitration concept, which together explained why such anomalies can exist. So we're going to move over here. Um, this is my Gemini stuff. It took me a while. Honestly, it's the most it's taken me to get to say multiple prompts and get the actual answers I wanted. Like you can see uh my represent was not very good. So I had to get more information. My it was making too many words or it's not concise. Uh wanted it to be organized some more stuff. Then all the way down here I had a lot of issues with my code honestly. So I had to ask it over and over again on how to fix it. But eventually it gave me this code. This is just uh the stuff it needs to see. And over here you can see the returns the S&P 500 and the daily returns. The GameStop returns is extremely volatile. It's like super high positive then kind of then drops negative then even more negative then shoots back up. While these are both extremely steady compared to that. Then over here the calculated beta of normal time would be 1.6 and the calculated alpha would be 017. Then all the way over here you can see again GameStop was super volatile compared to the other thing items. Um this calculated the example or this calculated the actual return which is extremely high compared to everything else. Again proving its fluctuation. Then uh this just proves that the p value is too big and we can't reject the hypothesis. That's some more status stuff. Then these graphs show the huge mountain peak I I mentioned earlier in the data. You can see it's relatively on zero. Then it shoots up then back down and shoots up again. Shoots up then back down then up and then back up and then up and then. So really that just shows the volatility of it. Thank you for your",
  "video_url": "youtube.com/watch?v=eIeBJknrHxI&feature=youtu.be"
}