{
  "student_name": "Sean Wu",
  "org_defined_id": "035909269",
  "username": "wu2053",
  "email": "",
  "transcript": "Everyone, my name is Sean and today this is my uh driver walkth through for session 9's assignment which we compute um for a session uh which we we compute Netflix cost of capital and testing a 3 billion extra depth scenario setting project specific hurdles comparing to peers and recommending cap capital structure using the market values and capm. Now uh starting with the uh D uh D of driver define and discover. So my goal for this assignment is to compute Netflix walk today and recomputee walk after issuing $3 billion of additional depth and derive divisional or project specific walks for US versus international content and run a pure comparison against Disney and Amazon and finish with sensitivity plus a capital structure recommendation. And here's my required analysis checklist. So first of all also I generated my code with chat GBT and so the first of uh the first required analysis is walk using CAPM equity after tax depth market value weights. The second is walk after the 3 billion depth added and releveraging beta and considering spread changes. The third required analysis is project specific walk US versus international within equity risk add-on internationally. And the fourth check uh fourth require analysis is period comparison versus Disney at 8.2%age and Amazon corporate at 9.5%. And plus the industry's 8 to 10% range. And the last one, fifth one is sensitivity across beta and the market risk premium and dep and depth levels. Then a strategic recommendation and the inputs are the assignments hypotheticals which is given u from the assignment which is this part and I put and including them in the code. So first equity market value 200 billion debt market value 13 billion equity beta 1.3 and risk-free rate 4.5% I'm I'm using this section and Netflix step yield to maturity 5.8% 8% tax rate 21%. And the scenarios um use plus 3 million of new depth and model I modeled a modest marginal yield step up to 6.1%. And going to repres represent um before calculating here's the framework I'm implementing. So the formulas I used first is cost of equity which is RE equals RF plus beta * MRP after tax step cost is RD after um equals RD * um bracket 1 - T walk is we * R + WD * RD after which is a weights by market value and Hamada is um beta U equals beta L over a bracket 1 + bracket 1 - t * d over e and these uh formulas makes the link between the market prices risk and the blended corporate hurdle explicit. Now going to the implementation section I'll walk I'll walk you through the results the first uh the so first of all current Netflix the debt to equity is about 0.065 065 and the Hamadada unlevered beta comes out to roughly 1.237. A relevered equity cost is about 11.65%. And after tax step cost is about 4 58% and market value weights um equity 93.9% and depth 6.1%. And the walk is 112 11.22%. And after issuing the 3 billion more depth um depth to equity rises to about 0.08 8 uh 0.080% here 3 billion when um that adapt to equity equals 0.08 08 and relever bait out nudges up to about 1.315. Um and equity cost rises to about 11.73%. And I tested also I also tested two micro scenarios. So scenario A is holding the uh pre-issue depth deal constant for a clean decomposition and scenario B is blending in small spread increase. So the blended pre-tax on RD is 5.86%. 5.86%. And under the both is the postisssue walk is essentially unchanged at um 11.2 2% 11.2% 2% and the tax shield and small way change offset the slight rise in equity and debt cost and divisional hurdles for US content and use the firm walk 11.2% 2% for in uh for international content. I add a 100 basis point equity risk premium for country and FX risk and that lifts the divisional walk to uh 12 uh3%. And for peers compet peer comparison uh Netflix current walk is 11.22% post issue walk is 11.2% Disney 8.2% 2%. Um, Amazon Amazon corporate is 9.5% and industry range is about like 8 to 10% which I mentioned before and so Netflix greens above peer and industry hurdles implying like a stricter bar for green lighting projects. Now going to the validation validation section first against uh against the media of 8 to 10% benchmark Netflix at roughly low 11s is outside the range which is um which is plausible given its growth profile and a systematic risk and secondly the methodology checks um I'm using market value weights and CAP PM for equity and the after tax debt cost consistent with corporate finance practice and use the Hamada adjustment adjustment to keep beta internally consistent as leverage changes for third uh sensitivity. Um you can see how the walk uh responds as I vary beta and the market risk premium and the depth level. So in these um first scenarios walk spans roughly um the high nines to low tens and when I drop equity side assumptions our base case sits around 11.2% with a beta of 1.3 and an MRP of 5.5%. And the headline inside is that equity side inputs dominate walk uncertainty and while the modest moves and that barely budge it at uh today's mix today's mix and here's a walk uh curve versus here's a walk versus dep curve and at low leverage it's basically flat to slightly down Because uh the tax showed offsets um offsets offsets small spread changes and if um the rating spreads widenly um materially widened materially in this curve would bend up a little which aligns the trade-off theory. Now if for evolve uh next steps to make this um to make this board ready to refresh refresh the race with like live market data and turn match the risk-f free rate to the project horizon u model rate maybe model rating migration if um leverage rises and let the depth spread be indogenous to the capital structure or we could do we could replace a simple 100 DPS international potentially add on with the bottom up country risk premium from sovereign spreads and FX volatility institutionalize a portfolio of divisional walks so each business has the right hurdle these are all evolves we can do and for reflection what I take out from this um assignment first of all Netflix current walk is low 11 amount is three billion of additionally that barely moves it because the tax offsets the small increases in R in RT and um in RT and RD in RE and RD at this leverage and use the firm's walk for US content sets a high uh sets a higher divisional hurdle about 12.1% for international projects and versus the peers Netflix higher walk means a stricter investment bar that argues for um prior prioritizing content slates with returns comfortably above these hurdles and watching leverage so ratings risk doesn't erase the tax benefits and that is my assignment nine with driver's method. Thank you.",
  "video_url": "https://youtu.be/AxvjumDBc28?si=K-GXTGUMJdVF76op"
}