{
  "student_name": "Trevor Squire",
  "org_defined_id": "035907999",
  "username": "tsquire",
  "email": "",
  "transcript": "Okay, there we go. Hello, my name is Trevor Squire and this is my session 9 assignment. Um, so for this one, I decided to do something a little bit differently cuz I did notice my grade slowly starting to go down a bit. So, I'm like, okay, I need to try something different. So this time instead of relying on notes um on Google Docs I decide to implement both the notes and the code into collab and use it as one um use it as one combined notes. Let's just say that. So first um I have again everything um is in a group tab. I have the assignment um the collab right here and then the Gemini prompt. I asked Gemini to create a prompt that I could plug into Collab and have Collab create both the code and explanation with it. Okay, so first the assignment itself. I'm supposed to calculate the weighted average cost of capital WACC for Netflix in connection with hypothetical $5 billion content investment decision. Um your analysis must determine current WACC. Evaluate the impact of additional debt financing. assess project specific versus firmwide discount rates and compared Netflix's um cost of capital to industry peers. Um it gives me the Netflix financial parameters, the market conditions, strategic context, and then obviously the required analysis. I'm supposed to calculate Netflix's um current WACC, determine WACC after $3 billion debt issu issuance, evaluate project specific WACC, compare Netflix WACC to Disney, explain differences, and they recommend optimal capital structure strategy. So, this one is definitely a lot, but I definitely relied on Gemini and Collab to help me with this assignment. Um, so that's the assignment overview. I'm going to go into Google Gemini and quickly explain what I did. Um, it took a very long time cuz I like I've done the prompt stuff before, but this one took a little bit because I was trying to put both the explanation and the code next to it and it just kept fighting me. It kept giving me these long explanations. Um, it would give me long code and just can bounce either or. But after working with it, after um spending time figuring it out, I was finally able to get the prompt that I wanted and plug into collab and it came out perfect like the way I wanted it. So this is the prompt that I used. It gives under the driver framework. It defines the parameters um the market industry context and then the action um relate and implement, verify and evaluate um and then revise. So this is the prompt that I gave collab and again I had to plug it into Gemini many different times to get the um right prompt. So that's the prompt. I close all this so it make easier and then this is the actual um session assignment where I'll be using the notes also all in collab. Um I want to try something different. actually looked at one of the old videos um that was provided as reference to help um like one of the examples that student did and I decided to go off of that and implement the notes into the collab um data. So I'm going to get started cuz I've been napping a lot. Um so first is define discover. This is the input data. So this section defines all the financial parameters and market conditions provided for Netflix which will be used in the subsequent WACC calculations. So um it gives the hype that parameters the market capitalization which was 2 billion, the total debt book value 14 billion. Um debt market value 13 billion. I can go on and on but all of this clean market conditions and strategic context all this is straight from the assignment rubric. Um I just had to outline it so it's organized and this is pretty much the define part of the assignment. Um and and yeah all financial parameters and market conditions have been defined. Um defining the parameters. So this code um defines all the given financial parameters and market conditions as var variables. These values serve as the inputs for calculating cost of equity and weighted cost of average cost of capital. um all of its hypothetical data um parameters not directly used in the WACC formula are included as per problem description for completeness. So that was the define and discover. Now we're in the relate and the implement or go over relate first. So the session um performed the necessary calculations to determine Netflix's cost of equity, current WACC and the new WACC after the additional $3 billion um debt insurance issuance. Wow. Um so these calculations based on parameters defined previously. So first calculate of calculate cost of equity um using the CAPM. So it will be cost of equity equals risk-free rate plus in parentheses equity beta times the market risk premium. So this is the formula that it used to calculate the cost of equity. And after plugging in the numbers it gave me 0.1165. Um so explanation the cost of equity is calculated using the capital asset pricing CAPM. This formula gives you a formula defines the expected return required by equity investors reflecting the systematic risk of Netflix Netflix's stock. So then it calculates the current WACC uh first this is overall the um current WACC like solving. So first is cost of debt after tax. Um the cost of after tax equals pre-tax cost of debt times 1 minus corporate tax rate total firm value for current WACC um equity plus debt. So that is market capitalization plus your debt market value. Again it gives sorry I should have explained this earlier. Um it gives me the numbers when I hover over it. So the 2 billion and then the 13 billion uh market value uh weights for current WACC um that is market capitalization which is 2 billion divided by the total um firt um the weight of debt um okay that was the weighted equity current this is the weight of debt so this is 13 divide by the 213 so then to solve the current WACCC Um you do the weight of equity current which solved it and gave me um.94 um times cost of equity which we solved earlier divided by the weight of debt currently which was 0.061 times the cost of debt after tax which was 0.45 46 or 0.05. Um after doing the calculation for WCC it gives me 0.1122. So um that calculates Netflix's current WACC. Um it considers the proportional weight waiting of equity and debt in the company's capital structure along with their respective costs um cost of equity and after tax cost of debt. WCC represents the average rate of return a company expects to pay to finance its assets. So next is calculating the new WACC with a $3 billion debt issuance. So new de after additional issuance is your debt market value plus your additional debt issuance. Um new total firm value is your market capitalization plus the new debt market value. Um the new weights for WCC um which is market capitalization divided by the total new firm value. um and then the weight weights of the new debt um the new debt market value divided by the new total firm value. So after um solving that you find you figure out your new WACC which is the way of equity new times the cost of equity plus the weight of the debt the new and then cost of debt after the tax. So after doing that all the calculations it gives you 0.1113 0.11 yeah3 um so that calculates the new WACCC factoring the hypothetical $3 billion um uh debt issuance. So reevaluates the total firm value and the weights of cost and weight of equity the weights of equity and debt demonstrating how changes in capital structure um can impact the overall cost of capital. A low new WC a lower low new WCC suggests that the additional debt at the given cost makes financing slightly cheaper for the economy. Now in under the verify and evaluate um part of this presentation. So um first is project specific WACC. So the limitations of firmware WACC a firmline WACCC represents the average cost of capital for a company's overall operations. While useful for general corporate valuation, it has significant limitations for project specific investments, especially those with different risk profiles than the other than the company average. for a $5 million content investment using a firm YWACCC can lead to incorrect decisions versus overdisounting low-risk projects potentially uh profitable projects with lower risk than the firm average might be incorrectly rejected if evaluated with a higher firm YWACC under discounting the high-risisk projects. So higher projects might appear more attractive than they are if evaluated with a lower firm YWACC. which leads to value destruction. Um then there's the US versus international content risk. Um US and international content investments carry inherently different risks ne necessitating project specific discount rates. So first there's the market maturity and completion compet sorry market maturity and competition. US content markets are mature and highly competitive. International markets, especially emerging ones, may offer higher growth, but also face greater uncertainties in market acceptance and local competition. Uh regulatory and political risk. International content is exposed to diverse regulatory environments, censorship and geopolitical instability which are less pre prevalent in the US. currency uh fluctuations. International investments carry foreign exchange risk uh impacting profitability when earnings are um re repetr repetrated. Wow. Uh cultural and consumer preferences. Uh success internationally um often depends on understanding local cultural nuances which can be difficult to predict compared to the more familiar US audience. And then distribution and infrastructure um access to reliable internet and payment systems um varies globally affecting content delivery and revenue collection. So to accurately evaluate the $5 billion content investment, Netflix should use project specific discount rates that reflect the unique risk profile of each content project. So for example, US drama versus international documentary. Um so comparison. So this is the um so Netflix's calculated WACCC 11.22% the new with the $13 billion is 11.13%. Compare that to Disney's WACC is 8.2% and the broader media industry range is 8 to 10% which was given. So we're going to explain the differences. So Netflix's um WACCC which was 11.13% to 11.22% is higher than Disney's 8.2% 2% and above the general media industry range. Um so there are different uh factors that contribute to the difference versus higher equity beta. So Netflix's equity beta of 1.3 indicates greater systematic risk. It stock price tends to be more volatile relative to the overall market compared to a more diversified amature company like Disney. Um the high risk demands a greater return from equity investors leading to a higher cost of equity and consequently a higher WCC. Next is the growth oriented business model. Uh Netflix operates in a highly dynamic and competitive streaming market. Um necessitating uh the significant investments in content and global expansion. This growth centric business model is perceived as riskier than Disney's diversified revenue streams like theme parks, traditional media, movies, etc. which translate to a higher equity beta WCC. Lastly is the capital structure. So, while Netflix has increased it debt over time, its capital structure may still exhibit a relatively higher reliance on equity financing compared to a more established company like Disney, which often utilizes higher leverage at potentially lower costs. So, the impact of the additional $3 billion debt while reducing WCC slightly doesn't close the gap with peers suggesting that the fundamental business risk captured by beta is dominant factor. Um, so this is the optimal capital structure. And when it plugged into the collab, it kind of um messed up the text, so I had to manually like um like type it so I could read it. Um, so recommendation on the $3 billion debt issuance. Um, based on calculations, issuing an additional 3 billion in debt reduces Netflix's WACC from 11.22% to 11.13%. This reduction of 0.9 suggests u a slight improvement in the cost of capital. Therefore, proceeding with the $3 billion debt issuance appears to be more um like a financially sound decision. Um it enhances the shareholder value by lowering the company's weighted average cost of capital and assumes the cost of debt doesn't significantly increase with the additional issuance and the market receives the debt as manageable. Um, so optimal long-term capital structure strategy for Netflix. An optimal long-term capital structure should aim to minimize WACCC while balancing the benefits of debt or tax shield with the associated financial risk. Um, so given Netflix's evolving business model, moving towards a strategic incorporation of more debt could be beneficial. So some key considerations targeted leverage. Uh Netflix should identify a debt to equity ratio that maximizes tax shield benefits without unduly increasing its cost of equity or drawing negative attention from credit rating agencies. Um financial flexibility is crucial to maintain sufficient financial flexibility in order to fund ongoing content investments and global expansion which is definitely um critical for competitive edge and growth. uh cost of capital monitoring. Um continuously monitor the cost of both debt and equity. As Netflix matures and its cash flows stabilize, its credit risk may decrease, allowing for lower borrowing cost. Um but excessive debt could counterproductively raise the cost of equity. Lastly is the market perception. So the market's due Netflix financial health and growth prospects will influence its optimal capital structure. A stronger business model can support higher leverage without significant penalties. So this is the summary. Um so this summarizes Netflix WCC with the driver um um framework. So define discover I identify Netflix's financial parameters and then the market conditions as inputs for the WCC analysis. The problem focused on calculating WCC and its implications. I just want to double check my time. Okay, perfect. I just want to make sure it's not going to go over uh relate and implement. So, calculated Netflix cost of equity using the CAPM method and then determine its current WCC and then the new WCC um with the $3 billion debt in like thrown in there. Verifying and evaluating everything. So project specific WCC um highlighted the in inadequacy of a firmwide WCC for project specific investment by content um especially given the distinct risk profiles of US versus international content. Um peer comparison this is the comparison between Netflix and Disney. Um so Netflix had a higher WACCC compared to Disney and the industry average which um means it has a higher equity beta and growth oriented business model and then optimal capital structure I recommended proceeding with the debt issuance due to the reducing effect on the WACC and revised long-term strategy balancing tax shield benefits with financial risk emphasizing targeted leverage and financial flexibility. So, in the end, I would say I learned a lot about what WCC is, um, how to calculate it, um, how to use CAPM, and then kind of going more deep into Netflix versus Disney as a whole, um, and then also comparing both of those to the overall um, where is it, the industry average. So, this is definitely a very different way of what I usually do, but uh I I saw my grade and I wasn't happy. So, I decided I wanted to go a little bit of a different route. Um I looked into past um um assignments, what people did, see like what I'm like, \"Oh, I can do that, see what works.\" And that's what I did. Um, it took me a little bit to um, figure out the right prompt, but now that I was able to fiddle with it, I have a better um, feeling of doing this next time, how to make the prompt using Gemini and putting that into Collab. Um, but I'm going to say I think this is a lot better than I usually did cuz I'll just be reading off of the notes um, with no calculations. So, at least in this case, I have both the calculations and the notes in the same thing. But yeah, that's pretty much it. I hope you enjoyed. Um, and I hope to, if this works, I hope to continue using this method instead of what I usually do. But yeah, that's it. Thanks so much.",
  "video_url": "https://www.youtube.com/watch?v=ZM2FIL84Khs\nPart 1\nhttps://www.youtube.com/watch?v=TvH5MgydFio\nPart 2"
}