{
  "student_name": "Carter Perez",
  "org_defined_id": "034075354",
  "username": "perezcj",
  "email": "",
  "transcript": "All right, good morning. My name is Carter Perez and today I'll be presenting a financial analysis of the 2021 GameStop short squeeze. And our goal here isn't just to retell the story. It's to systematically test the foundations of efficient market hypothesis using this event as kind of a case study. And we're going to be following the driver analytical framework to structure this investigation moving from the initial problem definition and data verification through a analysis and then a final reflection on what this means for theory. So a little the first stage is define discover. Our objective is to test whether the game stop event represents a true market anomaly that actually violates the efficient market hypothesis. And the first critical step in this assignment was to verify the stated fact that GME traded at 4 cents in August 2020. And I looked it up and this is factual. History shows that GME traded in a range of roughly $4 to $7 during that month. The 4 cents figure is off by a factor of 100. This is a critical distinction as it establishes the correct pre-event baseline. So my analysis from this point forward uses the verified corrected data. Next in the represent stage we design our analytical plan. We can't just look at the chart. We need to we need a formal test and we'll use a standard event study methodology. First we'll use a clean estimation window from the year 2019 to build a market model and find GM's normal historical uh alpha and beta. Second, we'll apply the model to the event window, January and February 21st. And this will tell us what GM's price should have been on any any given day. The difference between what the price actually did and what our model expected it to do is the abnormal return. If the market is efficient, the number should be randomly scattered around zero. We now move on to the implement stage. And I'll kind of show you where that comes into play here in my collab right here. Um here define um we're kind of defining the Windows and download price for and download the price for GameStop uh GME. So that's right down in here. Uh next going to calculate the daily logs for both of the tickers. And this is kind of the core of the rep representation slide. There's a regression of the 2019 estimation data. Um, and now we're going to use the parameters of the on the 2021 event data. Calculate the expected return for each day and then subtract it from actual run. Finally, you use the cumulative abnormal return and then that's in the code here as well right here. And this is going to plot those results. So the code's output gives us these two charts as shown here. Um the first chart is one that everyone kind of recognizes the price and volume spike in late January 2021. And the second chart is kind of abnormal here. This is a cumulative abnormal return. And as I said in an efficient market, this line should hover randomly above around zero. Instead, it kind of explodes right up through here. and shows a systematic positive abnormal return of about uh 300 here in just a few weeks. So this is concrete data driven proof that GM's price behavior was completely detached from its fundamental risk and market movements. In the validate stage, we're going to interpret these findings and the verdict is um unequivocal. The efficient market hypothesis was violated. So we saw a weak form violation. So the past price action or movement was a clear predictor of the future returns which shouldn't happen. More importantly we saw a massive semi strong form violation. So all the information driving this the 140% short interest all these red discussions and then uh the m the invol involvement of Ryan Cohen was publicly available. So the market failed to instantly price this in. And this abnormal return that we calculated proves that any investor who acted on this information could have earned returns far beyond what was justified by the risk. So since the EMH model failed, we kind of need to evolve our own framework here. The GME event is textbook case for behavioral finance. Price wasn't driven by fundamentals, but it was a behavioral bias. And they kind of did this by hurting people on social media. And this event is also the ultimate example of limits to arbitrary. So the EM EMH assumes that RA rational investors would short the bubble and correct the price and this failed for two reasons. There's a lot of noise about this uh trade here. So as the saying goes, the market can remain irrational longer the more you remain silent. Number two, implementation costs. Eventually it became impossible to short this stock because the borrowing fees were astronomical. And the final takeaway is that this event does not prove active management. It demonstrates the extreme nature of risk. And the primary lesson for most investors is the value of diversification.",
  "video_url": "https://youtu.be/YrG5D2sPQV0"
}