{
  "student_name": "Vanessa Prodafikas",
  "org_defined_id": "035822663",
  "username": "vprodafi",
  "email": "",
  "transcript": "Hi — I'm Vanessa Prodafikas. This presentation applies the DRIVER framework to determine Netflix's WACC for a $5 billion content decision, evaluates the impact of issuing $3 billion of debt, compares Netflix to peers, and recommends an optimal capital-structure strategy Define — the decision is: what discount rate should Netflix use as the hurdle rate for a proposed $5 billion content investment? Secondary decisions: should Netflix issue $3 billion of debt to finance part of this, and should we apply the same WACC to U.S. and international content projects? Deliverables: compute current WACC, compute new WACC after $3B debt issuance, provide project-specific rates, compare to Disney and Amazon, and recommend a capital-structure strategy. Important constraints: we must document define & discover before implementation — that's this stage and next Discover — collect inputs and assumptions. From the assignment: equity market cap $200 billion, debt market value $13 billion, proposed new debt $3 billion, equity beta 1.3, risk-free 4.5%, market risk premium 5.5%, bond yield 5.8% (BBB+), corporate tax rate 21%. I use market values, not book values, to compute capital-structure weights because WACC should reflect investor market claims. Key accounting decision: use CAPM (Re = Rf + β * MRP) for cost of equity; use bond yield as pre-tax cost of debt; apply tax shield via Rd*(1-T). Also note that project-level risks (country risk premia, FX) may require adjustments above corporate WACC. Infer — I computed the core numbers (and they're in the notebook): Cost of equity, CAPM: Re = 4.5% + 1.3 * 5.5% = 11.65%. This is the required return by equity investors under CAPM. After-tax cost of debt: Rd*(1-T) = 5.8% * (1 − 0.21) = 4.582%. Current capital structure (market values): Equity = $200B, Debt = $13B, so weights are w_e ≈ 93.90%, w_d ≈ 6.10%. Using the WACC formula: WACC_current = w_e * Re + w_d * Rd*(1-T) = 11.22% (rounded). After issuing $3B debt, debt becomes $16B, total value $216B → w_d ≈ 7.41%, w_e ≈ 92.59%, producing WACC_after_3B ≈ 11.13%. Interpretation: the WACC declines only slightly because current leverage is low; a small debt issuance provides a tax shield but does not dramatically change the capital mix Validate — I ran a sensitivity analysis of WACC across debt levels. The visualization shows WACC initially falls as debt increases, thanks to the tax shield (lowering the weighted average), but past a certain debt percentage credit risk pushes the cost of debt higher and WACC starts to rise. Key takeaways from the graph in the Colab notebook: At current low leverage (≈6%), WACC is ~11.2%, After $3B issuance it moves to ~11.13%, At moderate leverage (20–30% debt), WACC could move materially lower (closer to industry medians), At high leverage (>40%), rising Rd and potential rating downgrades cause WACC to rise. This visualization addresses the integration of finance and technology (20 points): the chart demonstrates the tradeoff between tax shield benefits and increased debt costs Execute — recommend actionable strategy: Target leverage range ~20–25% (market-value debt) gradually, not at once. This increases the tax shield and lowers WACC materially while avoiding rating shocks. Use debt for stable U.S. content where cash flows are predictable — debt financing is best for low-volatility cash flows. Use equity or retained earnings for higher-risk international expansion and experimental content to avoid raising the company's fixed obligations during volatile periods. Monitor credit metrics and investor signaling — increase debt only while maintaining investment-grade credit metrics; avoid a sudden issuance that could trigger rating upgrades/downgrades. Long term: diversify revenue and product lines to reduce equity beta (e.g., ad tiers, licensing, gaming) which would lower Re and thereby lower WACC further. Implementation steps: model the company's coverage ratios with the new debt, run scenario analysis for subscriber and content ROI, and stage debt issuance over multiple quarters Reflect — checklist against the assignment rubric: Financial Concepts Accuracy (50 pts): I showed the WACC formula and all components; calculated Re via CAPM; computed after-tax debt and tax-shield; explained capital-structure effects; used WACC as the investment hurdle. Technical Implementation (10 pts): code and numeric outputs are correct and available in the Colab notebook. Integration of Finance and Technology (20 pts): the notebook produces a WACC sensitivity visualization showing the leverage tradeoff. DRIVER Framework (10 pts): I documented Define & Discover before calculation (critical gate). Communication (10 pts): this presentation follows DRIVER and explains each step in professional language. Netflix's current WACC is about 11.22%; issuing $3B of debt reduces it slightly to ~11.13%. The company can materially lower WACC by moving to moderate leverage (20–25%) while using debt selectively for stable content projects. Thank you — I'm ready to answer questions.",
  "video_url": "https://youtu.be/Us2R4J5c9Ss"
}