{
  "student_name": "Carter Perez",
  "org_defined_id": "034075354",
  "username": "perezcj",
  "email": "",
  "transcript": "Hello, I'm presenting the cost of capital analysis for the proposed uh Starbucks flagship roaster. And to ensure a disciplined and transparent result, I followed the driver framework define, discover uh represent, implement, verify, evolve and reflect. And this is how that process unfolded. So the initial step define kind of the setup. So we begin with this phase. The objective was clear. was to determine if in the $12 million investment in a new rest roaster creates shareholder value using Starbucks 8.5 WACCC as a hurdle rate. Moving to the discover, I kind of isolated the variables from the project briefing. I identified the critical constraints, a 10-year horizon, a straight line depreciation schedule, and specific operating costs like 2.5 million labor expenses and variable costs at 40% revenue. Going into some of the logic, the represent. So before writing any code, I move to the represent phase. Uh I defined free cash flow using the core formula after tax operating earnings plus the depreciation tax shield adjusted for capital. um expedentials and working capital changes. So I kind of plan this to model the tax shield separately and handle the $300 terminal value assuming a $0 book value as a taxable event in year town. So this structural planning kind of ensured that I don't miss uh any critical non-cash adjustments implement. So next was the code. I used Python uh first kind of stored all the assumptions in a dictionary right here. That was everything that was given. I used the member py arrays to uh vectorize each cash flow for year zero to to 10. It's right here. And then I built the the calculate cash flows function to automatically handle the operations including the z year year zero initial investment and the year 10 working capital terminal value um verify phase I ran the base check for accuracy against our required metrics. The model produced a positive MPV of 3.36 million and an IL of 13.5%. Since the MPV is positive and the IR exceeds the 8.5 in WACC, the math validates the investment decision under base assumptions. The project breaks even in year six, confirming a reasonable liquidity. Five E um a single base is uh kind of insufficient for robust capital budgeting. So I evolve the analysis by running sensitivity tests. uh the two biggest risks which were WACC and revenue volume. The project successfully absorbed a 2% increase in WACCC returning a positive MPV. But when I introduced a 20% drop in revenue, the MPV collapsed to a negative 2.4 million. Moving on to the reflect, I recommend accepting this project. The uh strong base case results suggest a significant value. However, the evolve phase uh kind of highlighted a severe volume asking for my acceptance is conditional on securing a robust contingency plan, specifically ensuring the marketing budget is strictly applied to uh lock in the projected revenue jump from year two to five. Thank you.",
  "video_url": "https://youtu.be/NEWmFLKXoyA"
}