{
  "student_name": "Gillian Johnson",
  "org_defined_id": "038893789",
  "username": "john3952",
  "video_url": "https://youtu.be/30xShw2xMIQ",
  "transcript": "Hi everyone, I'm Jillian and today I'm\npresenting my capstone project for\nfinancial management. So, the problem\nthat I wanted to solve here, as you can\ntell by the title of my app, is\ncongressional stock trades are public\ninformation, but they're sort of\nscattered across different websites and\nthey're hard to interpret into the\ncontext of what's actually going on in\nthe news um and how it affects your own\nportfolio and what you should do with\nyour own portfolio and with your\nfinancial resources given this\ninformation. So most people don't know\nhow to evaluate whether these trades\nalign with their own investment\nstrategy. So I wanted to build an app\nand that's why I built the Capital\nTrades tracking app. Um and it's an AI\npowered tool that not only shows you\nwhat politicians are trading, but it\nanalyzes whether those trades make sense\nfor your portfolio and how they fit into\nit. It also analyzes the trade itself.\nSo, we'll get into a little bit more of\nthat during the um integrate section,\nbut let's dive into the tool and the\ndriver framework starting first with\ndefining the problem. So, as I\nmentioned, investors want transparency\ninto congressional trading, but the raw\ndata doesn't really give the context\nthat is necessary to make investment\ndecisions. And so, what committees do\nthey serve on? why would they choose\nthis stock or should I follow this trade\nare all questions that investors are\ngoing to have when they look at\ncongressional stock and security\nactivity. So the research uh research I\nresearched this approach. I gathered um\n36 to 40 of the most recent trades from\ncapitalrades.com.\nI covered politicians that are more\nhigher ranking and are in the public\nspotlight more often and so therefore\nthey have um more capital to leverage\nbut also more political power. So Nancy\nPelosi, for example, is a very um\naffluent politician that's always in the\nnews and she's been under scrutiny for\nstock trading in the past. So I did want\nto have her on the website for sure. Ted\nCruz, another big Republican candidate\nout of Texas, who was a former ex\npresident or a former presidential\ncandidate. and Tommy Tumbber Tomerville,\na senator from Alabama. Marjorie Taylor\nGreen, another um representative,\nRepublican representative from Georgia\nthat's typically in the news a lot.\nSo then I integrated quad AI to provide\na real-time analysis of each of these\npoliticians behaviors. So,\num, this is important to note that I\ntook the knowledge that we learned from\nthis course on, you know, setting up an\nAI power tool, how to fully use it\ncorrectly. Um, for example, needing an\nAPI key. I ran into a lot of different\nissues. first off with my different\nversions of this app. I had about 12\nversions and on the 12th version I\nfinally landed with this product that\nwas fully functioning um because I was\ntrying to use a cloud or not a cloud a\nopen AI API key and that wasn't working\nto integrate within cloud code. So I\ndecided to switch to a cloud API key. So\nlots of complications with that but good\nthings to know that I've learned from\nthis course.\nSo, I built a React web app with a clean\ninterface that anyone can use. And I'd\nlike to get into the demonstration now.\nSo, as you can tell, here is the main\ninterface. You can see you can see 36\nmost regional congressional trades. Um,\nso for example, if I wanted a specific\nuh candidate, I'll look for Pelosi.\nThere she is. There it shows her most\nrecent trades.\nUm so it also provides the stock ticker\nname and the company name, her position,\num from what state she hails from and\nthen the range. So whether she bought or\nsold that security, it'll say here the\nrange. So, it looks like here she bought\num 1 million to 5 million shares in\nBroadcom. And so, I'm going to click on\nthis and it'll do an AI analysis down\nhere and it'll analyze my trade\nand this one was back in July. So this\nis the interesting thing as well work\nworking with AI is that typically all of\nthe most current models that we're using\non a day-to-day basis are only updated\nas to you know for example January 2025\nand this is the case for Claude and so\nthey can't provide information about\nthings that have happened in the future.\nHowever, they can't infer different\nthings based on their prior knowledge\nand what they know about other traits.\nUm and so it says that as well as like a\ndisclaimer. And so\nhere it'll show you a trade overview. So\na large position which is in Broadcom,\nwhich is a major semiconductor. In fact,\nsemiconductor company. And if you've\nbeen paying attention at all to the\nnews, semiconductors are the uh the\nhottest thing on the market, so to\nspeak. They're extremely essential to\nthe booming AI industry and there's a\nvery small market share for\nsemiconductors that can meet the demands\nin terms of quantity and quality and GPU\nprocessing abilities as um the standard\ntop-of-the-line\nGPU uh semiconductors can. So um this is\nvery interesting.\nSo, and there's a lot of strategic uh\ngovernment policy positions that come\nalong with the semiconductor industry.\nSo,\nkey analytical considerations. This is\nanother section that the AI provides\ninformation about. So,\num and she typically right now she\ndoesn't have any committee assignments\num because she is resigning. Um however\num if there was a different senator for\nexample um Tommy Tubberville is on the\nforeign affairs committee um they'd\nexamine the implications of a foreign\naffairs top ranking member buying a huge\nchunk in a competing um semiconductor\ncompany to Taiwan semiconductor\nmanufacturing company which is the top\nof the line\num premium semiconductor manufacturer at\nthe moment and so semiconductors are\ncritical for defense and there's a lot\nof involvement with China here\nspecifically related to TSMC as I\npreviously mentioned and so this will go\ninto a bit of these semiconductor sector\ndynamics and different policy uh\npolicies that are related to\nsemiconductors in the past five years\nand then time is timing is significant\nwhen it comes to\ntrades and the disclosure of trades. And\nso, um, earning announcement, earnings\nannouncements, quarterly due dates,\npolicy announcements, things like that\nare extremely important to consider. And\nthen risk factors. So, regular\nregulatory scrutiny of congressional\ntrading and potential conflicts of\ninterest that may happen. So, it's very\ninteresting. And so the very next part\nof demo I want to show you is the\ncompare with my portfolio. So as I\nmentioned, you know, there's information\nthat's really helpful on this, but\nactually applying it to your own life is\nanother question. So you can describe a\ncustom portfolio here or you can choose\na preset portfolio. So I included a\nconservative portfolio, a balanced\nportfolio, your typical 6040 growth\noriented portfolio that's mainly focused\non tech and um younger stocks, more of a\nrisk volatile comfortable investor. So\n8020 with a longer time horizon. So\ntypically younger investors and a core\nsatellite portfolio. So, your core, your\n70% or 80% is mostly focused on um\nstrong ETFs and securities or I'm sorry,\nand stocks. And then your satellite is\nmostly focused on either thematic based\ninvesting or a couple individual stocks\num and individual companies that you\nhave um shares in. And then a factor\nbased portfolio is mostly used in the\nquant space, but it is very data driven.\nIt's focused on um considering a variety\nof factors and having a math-based\napproach to making investment decisions.\nSo if we saw this choice that Nancy\nPelosi made, let's say we have a\nfactor-based portfolio,\nvalue momentum is quality. Those are the\nkey factors of the value based\nportfolio. and so low volatility factors\netc etc and so the analysis would\nsuggest to buy um and that is the I\nguess demo part of this uh project um\nand so\nthis is extremely interesting to look at\nall the factors that come into um you\nknow stock trading decisions and the\nanalysis of investment decisions made by\ncongressional leaders elected to office.\nSo let's say, you know, I'm a\nconservative investor or um\nyou know, I I have, you know, a\nportfolio that's mainly um invested in\nbonds and um not I'm not very risk\nadverse. However, having a more\ninformed, educated investment um perview\non certain things by taking into account\nwhat our elected leaders are doing will\nhelp strengthen your own portfolio as\nwell.\nSo, does this solve the problem? Moving\non to validate. Um yes.\nUsers can now understand really how\ncongressional trades in the context of\ntheir own portfolio strategy, but also\nin the context of um the the\ncongressional members committee\nassignments, current news, and what the\nimpact of this trade might suggest about\ncongressional happenings or the US's\nstrategic position in these either\nindustries or companies. So, expanding\nthis and potentially looking at how I\ncould scale this project up is I would\nlove to have a real time live and active\num database. So instead of having a\nshorter database of these 40 trades and\nbeing able to um select which one you\nwant to analyze,\nI would love to have real-time alerts\nand live updating data for when\npoliticians trade. And\nI'd love to have historical performance\ntracking. So did Pelosy's Broadcom\ndecision and did her bet really pay off?\nyou know, does she end up reversing her\ndecision or selling off some of her\nshares three years later? Something like\nthat. And then I'd love to have more\npoliticians in a section on the website\nand the app where you can look at\nhistorical trends and really take a look\nback into the history books of how\nCongress people and elected officials\ntraded um you know 10 20 30 years ago\nand and then an integration with the\nuser's actual brokerage account\nbrokerage accounts would be the end goal\nof this right if they could have real\ntime information that they're receiving\nright now and right away make a\npurchasing decision after analyzing all\nof this data. That would be amazing. Um,\nand so really what I learned from this\nproject and how to integrate AI APIs\ninto financial applications and how to\nwork with real financial data that\nactually impacts outcomes of millions of\nAmericans worldwide. And most\nimportantly that there are a lot of\ntools and options to solve actual\nproblems that people have. And so the\nkey insight here is that AI transforms\nraw data into real insights. And this\nthese insights can power actions that\nyou would not have normally been able to\nsee without that AI. And so\ncongressional trades are public, but\nwithout the context they're just noise,\nright? Um, and so that this noise that\nhappens, this app is really trying to\nturn that noise into a signal, into a\ndirection to point you where you need to\ngo. And this isn't just really a class\nproject. I mean, obviously it is, but\num, it's just a kind of tool that could\nactually exist in the market. And I\ncould very well see these kind of AI\nfeatures being integrated into those\nexisting websites and apps like Capital\nTrades um if it's relative to them,\nwhich it definitely is. Um and so this\nkind of transparency, accessibility, and\ninsight is what people really want and\nwhat I think will be provided to them in\nthe near future as well. So that is the\nCapital Trades tracking app. Thank you\nfor watching. Um, I'm happy to answerany questions about it."
}