{
  "student_name": "Nick Sikorski",
  "org_defined_id": "037205859",
  "username": "nsikorsk",
  "email": "",
  "transcript": "In today's assignment, we're going to go through the driver framework as we look to dive into the assignment. The goal is to calculate Netflix WACC and use it to evaluate a $5 billion content investment considering different changes in the capital structure and project risk. So for our WACC formula, we have WACC equals E divided by V, E being market capital value of equity, V being total firm value. We multiply that by our R, E value, and then we add that to our D value which is our market value of debt, divided by our total firm value, and then we multiply that by the cost of debt, which is pre-debt minus tax, and then we multiply that by 1 minus T of C, which is corporate tax rate. Then we come down here to represent. We go to step 1, calculate our current cost of equity, so our CAPM again, and we know that R, E equals R, F plus beta times our MRP. So then we go down to step 2 where we calculate current capital structure weights, which is E divided by V and D divided by V. V is our total firm value, and we can go back up here for our market equity and our market debt. So then back to our WACC value that we want. We have WACC, we use our value from before, and we calculate our WACC after 3 billion debt issuance. We have our values here, 13 plus 3 billion, 16 billion. 200 billion plus 16 billion equals 260 billion for our new firm value and our new debt market value. So let me evaluate. We compare and see that Netflix's WACC, if we go back here, which is our weighted average cost of capital, which is basically our cost average for the year of the capital that we have on hand. So then we go back to our driver principles, and we have implement. So current cost of equity, our R, E, so we use the CAPM again, and we have R, F, which is 4.5 plus 7.15, which is just a result of the beta, which is 1.3, and then the MRP, which is 5.5 percent. Brings us to 11.65 percent for our cost of capital. There's current cost of equity, sorry. And then we go down, we find our total firm value is 213 billion for Netflix. Our equity weight, which is 93.9 percent. Our debt weight, which is 6 percent. And then we have our after cost of debt, which when we punch it into the calculation from before the same equation, we come up with 4.582 percent roughly. So then we're going to calculate the weighted average cost of capital. When we use our equation from before, we have all our values now. 9.3 percent from here, the 11.6 from up here, our rate of the debt rate right here, and then we have our after tax cost of debt right here. That brings us out for weighted average current cost of 11.214 percent. So after we calculate this weighted average cost, 3 billion dollar issuance, we have different WACC values than before. Those are our original values. So now we come here, we see these different values being calculated. E is different. Our new debt is calculated different. Excuse me, instead of 13, it's 16. So it's just upping everything and changing these values slightly. So then the same values go down. 92 here, 11.6 from before, 65 from before, the same new debt weight, and then our percentage from before, which will stay the same. So values don't really shift or change. So then we have a new weighted average cost of 11.12 percent as before. 124 and 11.214. So the one before was higher, higher percentage slightly. So you see it decreases slightly with our new issuance due to the greater use of cheaper debt. So when we evaluate this project, we see that our firm-wide discount rate is about 11.2 percent. This is like the average risk in between the two around. It's damn near. Our project-specific rate, which is a project's risk, which is our beta value, should determine its discount rate. Beta should reflect about what our discount rate is. It's a good piece of information. Then with the U.S., we say that content targeting the mature U.S. market is likely lower risk, lower beta. And using the firm-wide WACC would understate the MPV of this project, potentially leading to its rejection. So the discount rate should actually be less than 11.2 percent. Well, internationally, discount rate for targeting emerging markets or highly experimental genres is normally higher risk beta, so more volatile. Beta is basically volatility. We use the firm-wide WACC to overstate this. You want to be more volatile. So the discount rate should be greater than the 11.2 percent originally stated. And then in conclusion, we know that Netflix should use a project-specific discount rate, so adjust it for beta to avoid accepting negative MPVs. So just change the beta depending on what your project is. So then we're comparing our Netflix value to Disney and industry. We see our weighted average current costs, or costs of capital, sorry, are greater than Disney and the industry. So then we see their equities are split up different as well. We have a lot in equity, not a lot in debt. They have a little more debt. Interesting stuff. So let me come down. So the explanation is we have a higher equity risk. Netflix equity's beta is 1.3, so it's an aggressive growth. And it's an aggressive market that can go higher, lower, and it's more volatile. That's why our weighted average cost of capital is higher. We have higher reliance on equity, like we stated before. We have minimal debt, and that can increase dramatically. Disney's greater use of debt dramatically lowers WACC, so the Netflix makes it WACC higher. So we go down current optimal. Actually, we'll go to the validate portion, the V of our driver. So the analysis is validated by ensuring the calculated WACC falls logically within the financial context. So it's 11.214, which is dominated by high cost of equity due to low debt to equity ratio, meaning there's probably a strong reliance on expensive equity. So our WACC is higher than the industry, which means that reflecting on Netflix's higher risk profile and underleveraged structure, we probably want to diversify. We probably want to do something more diversified like Disney, which has way less WACC. And then the slight decrease in WACC after the debt issuance confirms the immediate, though minor, value of the debt-to-exchange. Even though it's minor, it can just make immediate difference when there's things that happen, especially within a company with a WACC like Netflix, is essentially what it's saying. So then we go to evolve. So we have underlevering and relevering beta. So a more sophisticated analysis, probably use the Hamada equation to unlever the beta value to find the asset and then relever it using the new debt-to-equity ratio to find a higher beta subscript value for RE. This would increase it because it's partially offsetting the tax shield benefit, so it kind of provides a more accurate issuance of the WACC. So then our credit rating impact. The analysis kind of should evolve to model the risk that the $3 billion debt issuance could downgrade Netflix's bond rating. So it would probably increase the cost of debt or R&D. So let me reflect at the end. So the key takeaway is that Netflix WACC is currently inflated 11.214% compared to peers like Disney at about 8.2%, primarily because it's underleveraged capital structure and high equity risk. And while the $3 billion debt issuance is a step toward optimal, Netflix should strategically increase its debt ratio to maximize the tax shield benefit and lower its overall cost of capital. So lower its WACC, so use more debt like we saw before, thereby improving the attractiveness of major content investments like a proposed $5 billion spend. Because yeah, you want the lowest WACC if you're going to put that much money in. You want as low risk as possible. And then the use of the project-specific WACC is crucial for accurate capital budgeting given the diverse risk profiles of U.S. versus international content. So WACC is more base to base, like we said, change the beta base to base. So that's all I got. I hope this was educational.",
  "video_url": "Youtube was not uploading my video and working with MP4 connectors for some technical reason.  Refer to other link"
}