{
  "student_name": "Matthew Baratian",
  "org_defined_id": "034214748",
  "username": "mbaratia",
  "video_url": "https://youtu.be/QF03i8Q7hAc",
  "transcript": "Hi, this I am Matthew B and this is my management 310 session 12 assignment. Uh the mission overview for this assignment is for us to de deliver a full value evaluation of pan Panera's uh bread for perspective K takeover using our driver framework. Uh we got to combine the DCF trading comps and precedent transactions provide an informed bid range while contrasting the financial buyer discipline with the strategic buyer synergies. So an ideal snapshot of our uh or an overview snapshot of this deal uh is represented here in our define you know portion of our defined discover uh you know stage where we have the original you know initial revenue original IBIDA our net income original uh as well as the amount of stores our IBIDA margin original EBO margin as well as our industry PE Chipotle E our PE and our McDonald's PE as well as our president Ibid low being 12 and our present ebida high being 15. Our industry WACCC sitting at 0.09 with our digital mix original digital mix sitting at uh 0.5 with our target digital mix sitting at 7 and the plan store edition synergy at 500. So our overall goal here is to create an executive ready recommendation that would state our value range as well as a winning bid strategy and a rationale for choosing financial versus strategic positioning. Uh moving on here you can see we define the value and we can discover our mis common misconceptions which I listed the values earlier. Um so our defining objective here like at least stated was uh to value panera bread potential KR takeover combining all the things I mentioned and contrasting the KR financial buyer versus a strategic biders. Um so in the discover portion of this stage uh our common misconceptions would be that the DCF provides our true value of an investment. However DCF is sensitive when it comes to growth WACC as well as margins and terminal growth. You know these kind of small changes in terminal growth or the WACCC can actually alter Panera's value by billions of dollars. Um this basically you know lets us know that the a DCF output needs to be treated as a range rather than exact estimation. Uh in addition to that the second common misconception found was that financial and strategic buyers will seal the deal will see the deal in the same light or the same way. Uh financial buyers will typically focus on the the cash flows and leverage capacity while studio buyers will typically focus on justifying a higher price if these synergies create a incremental value. From there we can move on to a represent stage where we model uh our design and our assumptions. Um here we have our global DCF modeling assumptions listed here uh you know with our down scenarios you know for a standalone panera uh panera being our downside base and upside all of these we have our revenue growth ebid margin start ebid margin end as our wacc and our terminal growth rate uh so here this is all printed out below to be seen with our global assumptions of five years of forecasting the tax rate of 0.25 25 our DA percentage revenue sitting at 0.04 as well as um capacity percentage revenue uh sitting at 0.05 and our NWC percentage revenue sitting at 0.1 the net debt sitting at I believe that is 15 billion. Um so with the scenarios it's printed out here which I just stated and our strategic synergy scenario is also you know listed here with the different uh revenue growth evid margin start um the downside we decided to go a little bit lower with the revenue growth at 0.06 the the base revenue growth sits at 008 and uh go with the more aggressive strategy of revenue growth at 0.1 with the upside um in addition that you know for the revenue growth of the syn strategic synergy scenario we have our revenue growth sitting at 0.09 09. From here we can go into our implementate implement uh stage where we look at our functions and actually build the uh the thing and implement the model uh with numbers and the data provided. So the first function here would be our build projection function which builds us a 5-year operating projections and an FCF uh for a single scenario in which it grows the original $6 billion revenue using our scenarios assume revenue growth. Along that it will apply a path for our EBID margins to compute an EBID for every year. In addition to that, it calculates EBIT taxes, NOAT and the EBIT after tax which is operating profit available to all capital providers as well as calculating the free cash flow to the firm and which is NOPAT plus uh DNA minus capex and the change in W uh NWC. Moving on, we can look at the next function in the implementation stage being the DCF valuation in which it calculates the DCF valuation given the FC FCF projections WAC and terminal growth and it discounts the FCFS at a scenario at the scenario WACC and adds a terminal value using the golden growth uh formula. From here we have our other function being the uh print DCF summary prints us a detailed DCF bridge that shows our year-over-year cash flows and present values. And last or next we lastly we have the DCF sensitivity table which provides a sensitivity table of the EV and WACC and terminal growth. From here we can actually run the scenarios through here what I just stated. And if you look here, like I said, it shows us our cash flows year in and year out from year 0 to year five as well as the cash flows again for the for each different scenario being downside 1 0 through 5 has a projected a professor value of projected FCF from years 1 to five of 1.6 billion with a terminal value at the end of year five being uh or 6.07 07 billion uh with our PV terminal value sitting at 3.77 billion along with our enterprise value and our equity value and this is done again for the base where again we have our year in year out cash cash flows uh with our PV uh sitting at point or 2.03 billion the terminal value at in year five being 10.09 09 billion with the PV at the terminal value sitting at 6.56 billion. Again, this is done for upside like I said again with the cash flows with our present value projected from years 1 to five being 2 54 billion, our terminal value at the end of year five being 17.1 billion and our PV terminal value is 11.64 billion along listed with the enterprise value and our equity value. Um and again this is done for our strategic synergy thing as well where it has a PV value PV projected SCFF of years 1 to 5 being 2.51 billion the terminal value at the end of year 5 being 13.16 billion as well as the PV of the terminal value sitting at 8.56 billion listed with our enterprise value and our equity value. So in this this energy MPV our strategic versus our base standalone EV sits at 2.48 48 billion. U through here we can do our validation stage uh where we you know do our checks u on the trading account the present multiples where we check uh if the DCF results are actually realistic relative to our market data that was provided to us as well as equity values being calculated from the DCF results or unaffected equity values being calculated using the industry P/E current net income as well as the base DCF enterprise values being divided by the current uh EIDA they get implied uh EV/ / EBIDA multiple and this implied EV/ EBIDA multiple should be between the ranges of 10 to or 12 to 15 range of president Ebida transaction range and the PE base values uh which has all been listed down here where you see on the low equity value and our high equity value all list in billions for the different uh you know valuations uh and here unpl from the base ECF sits at 9.54%. Our unaffected equity uh sits at 8.8 uh billion uh at 9.54 times 9%. Um next we can move on to our adult stage where we have our sensitive analysis and football fields where our key assumptions are changed uh being the WACC and our terminal growth. Uh take away here from our table actually let me just list it down here because it's already down here. Um we have a WACC on our X- axis with our terminal growth sitting on the G- axis. The takeaway here is that our small changes or small changes in the WAC or terminal growth will affect valuation billions like previously stated. So DCF points again should be treated as a range rather than exact answer which have been stated at the beginning. Um so here we have our football field data listed with our methods are the low equity value in the billions and the high equity value in the billions. uh in our Panera valuation football field here in which each bar actually just represents an equity uh value range listed in the billions of our you know low ball uh opening bid and our max ceiling bid that we would like. Um so this helps us uh visualize these data extremes uh and where you know most methods c um clusters you know are using our equity values from all those three DCF scenarios being downside base and upside with strategic synergy and DCF and also the values from the P/E and EVA comps and precedences being industry Chipotle and McDonald's. So after taking a look at all that we can finally come to our reflection stage uh in which uh when we take a look at this our standalone uh DCF equity values are listed below uh being the financial buyer view of the downside being 3.87 uh billion the base being 7.09 billion and our upside being 12.68 billion our strategic synergy equity value is 9.57 billion with incremental values from those synergies sitting at 2.4 48 billion. Uh so a control premium framework versus on trading value has an opening bid being 20 about 20% uh premium being 10.56 billion with that walkway walkway price sitting at 30% premium at 11.44 billion and our theoretical max equity value for this for strategic say we paid all the synergies that would be including that be 9.57 billion. So through this uh my final recommendation would be an estimation of Panera's equity value sitting between 7 and 11 billion with that decision range sitting a 4K KR sitting at approximately 8 to10 billion. So because of this KR should be flexible uh outside that opening bid range uh bid range minus or like between the bid range and the walkway price range uh which would be 10.5 to 11.5 billion and K should maintain as a financial buyer in which I participate in bidding up to that ceiling of 11.45 billion. Um a few takeaways here is as a financial buyer K would anchors on standalone DCF plus trading comps and targets and control premium range uh over unaffected value. Uh and strategic buyers like McDonald's and Starbucks might justify paying more due to synergies quantified by the model uh as they wouldn't logically pay uh the full synergy uh net present value. uh a few you know takeaways here in addition as a reflection of this assignment that the creation and valuation of censy tables did show how strongly WACC and terminal growth uh drive the valuation as well as comparing the financial versus strategic buyer cases demonstrated that you know the companies can have uh different values resulting from who actually owns it and which synergies they personally align with."
}