{
  "student_name": "Andrea Typaldos",
  "org_defined_id": "036748997",
  "username": "atypaldo",
  "video_url": "https://youtu.be/dH1SK3xki5Q",
  "transcript": "Hi, this is Andrea Tipalos and this is my session 12 assignment. Today I'm building a complete financial story for a real acquisition decision. My private equity firm is evaluating Cloudtech Solutions, a high growth SASS company. The seller wants 500 million and my managing partner asks, \"Is Cloud Tech worth 500 million today?\" The key phrase is today because we're paying cash now for future with uncertain cash flows. First, I define and discover. At first glance, it sounds like a simple yes or no. Buy your past. But the real decision is, do we believe the story that today's losses are temporary growth investments that turn into durable free cash flow later at a level that justifies $500 million. So I'm defining the valuation problem around three biggest around the three biggest drivers which are growth trajectory, profitability transition and terminal value exit. Before I quote anything, I anchor on the fundamentals. The most comprehensive valuation method is the PV of the future free cash flows. Free cash flow is not the net income. It's what the business generates in cash after reinvestment. Terminal value usually drives the majority of the valuation and the assumptions with the biggest impact are the WACC and terminal growth. That's the mindset I'm using for this case. I'm not chasing a single number and building a model that produces a range that shows what moves the answer. Next, in the driver method I represent. So now I'll explain the structure you are seeing on the screen right now. The model is a standard DCF engine built around this logic. First step one uh project free cash flow with the FCF um formula. The step two was to discount the FCFs with the P value the PV of the FCFT. Then in the step three I added the terminal value which is the TV and in the step four I put the enterprise value which is seen as the EV. So that EV is what we compute to the 500 million asking price to the MVP. On screen, you'll see the code organized into functions like project financials, DF, DCF valuations, and scenario sensitivity functions to test uncertainty. Here it's a very um large code. But here you can see here is the project financials I was talking about and um here is the D DCF valuation I was talking about. So to implement I run the base model. Now I'm going to run the base model and walk through what the code is doing. First revenue growth paid. We start with cloud tech at 80 million revenue go grow growing 40% now the model applies a declining growth rate each year until it reaches a mature floor that reflects reality growth slows as the company skills and the market saturates. Second the margin expansion. So EBIT margin starts at minus 12.5% and ramps up linearly to a 25% mature margin by year five. That's the thesis. Early losses are an unintentional unintentional investment period. Third, I convert profits to free cash flows. Then the model applies a tax rate, depreciation, capeex, and NWC. At the end of each year, the model prints a table showing revenue growth, margin, FCF, and PV of FCF. So this is where the code becomes the financial story. You can literally see the cloudtech move from loss making growth to cash generating maturity. Fourth, the valuation output. The model calculates the PV of explicit 10 years FCFs, the terminal value at year 10, the PV of terminal value, the total enterprise value, the NPV versus 500 million, and it recommends if you should buy or pass, and you should buy if the NPV is bigger than zero. and otherwise pass. When I present this, I'm not just reading the final EV. I'm reading the composition, which is well, which I see as when does the FCF turn positive? How much of the EV is terminal value? Does the rampid margins look believable? Because if the story is unrealistic, the EV is then meaningless. The next step in my driver method, I'm going to evaluate. So this is the most important part because in real investing the base case is never enough. First I built in sananity checks. First the code checks basic integrity WACC must be greater than terminal growth or the model breaks assumptions like years to margin maturity must be valid. Then second the WACC um sensitivity table cuz I run the WAC sensitivity table. So you'll see enterprise value recalculated at multiple WACC's like for example 8% 10% 11.8 or whatever percentage you want. This tells me inly in instantly evaluation collapses with a slight higher WACC the deal it means the deal is fragile and if it stays strong across reasonable WACC ranges we have a conviction. Third, I added a 2D sensitivity grid, which is WACC times terminal growth. Um, this is where you really see valuation uncertainty. Higher WACC pushes EV down. Higher terminal growth pushes EV up. And because terminal value is huge, some small changes here can mean hundreds of millions in EV swing. So instead of pretending we have one correct Eevee, we produce a credible range for the barebase scenarios. Finally, I run those three scenarios. Bare case means faster growth slowdown, slower margin improvement, and higher WACC. Base case is the core plan and bull case is a stronger growth durability, better margins, and lower WACC. This gives me a decision framework. If we only win in bull, we shouldn't pay full price. And if base clears price with the cushion and bear doesn't destroy us, it's investable. This is exactly how professional valuation works with ranges, not just point estimates. Then I evolve and I turn the model into a real bid strategy. I step beyond is it worth it into how do we act? In real PE process, I would evolve this into a walkway price, a bid range, negotiation logic, tight assumptions like for example, we'll pay X if retention and CAC efficiency prove out or let's say if risk is higher, price must come down or terms must change. And I would triangulate with other valuation methods like trading compositions, preceding transactions and implied multiple uh multiples from my terminal value as a sanity check. That's how I would personally avoid being trapped by one model. Then I reflect is my last as my last uh driver method step. And this final session um combines everything. TVM machines for discounting risk and WACC price uncertainty, cash flow modeling to translate strategy into numbers and judgment to defend assumptions. My key function is valuation is both art and science. The science is the model and the art is choosing assumptions that a real business can actually leave through and communicating uncertainty honestly. So my final deliverable isn't just a number. It's a coherent financial story that supports an investment decision. And with that I can answer my managing partner. Here's what cloudtech is worth under base. What assumptions drive the range and the price I'm willing to pay. plus the conditions under which I would walk away. Well, thank you. That was my assignment 12 um and my last assignment where we can clearly see how all of the topics we've seen the entire semester come together."
}