{
  "student_name": "Anne Pumphrey",
  "org_defined_id": "037166275",
  "username": "apumphre",
  "video_url": "https://youtu.be/Afo-zaIdZC8",
  "transcript": "Hello everyone. I'm Ann Pumphrey and my mandate was to deliver a full valuation and bid strategy for the potential acquisition of Panera Bread, a $6 million revenue asset. My analysis confirms uh this is a high quality generational asset that fits KKR's investment profile. Panera is digitally mature platform with 50% of sales online in significant white space growth. 500 new stores and margin expansion opportunities through scale and dinner service. I will take Panera private, expand its footprint, solidify its digital pro dominance and ex and exit at a premium multiple in five years. My valuation required triangle triangulation across three methods DCF trading comps and precedent trait transactions. So for trading comps, uh, peers like Chipotle and McDonald's placed the enterprise value in the 13.5 billion to 17.1 billion range recognizing Panera scale and high margins for precedent trans transactions. Um based on recent control transactions, we used a premium multiple of 14 times to 17 times um yielding a 12.6 billion to $15.3 billion. And then for the DCF analysis, uh this is one of the most critical analysis for KKR. Our base case using a 9% WACC and 10% re revenue growth pointed to an intrinsic value of approximately 14 billion dollars. By synthesizing these models, we established a defensible core valuation range from 14 billion to 15.5 billion. To ensure speed and accuracy, we didn't use a static spreadsheet, but I had Gemini build a simple Python model. This code serves as an engine for evaluation, allowing us to test hundreds of scenarios in seconds. So to explain the um Python code I have pulled up as you can see um the Python script automatically calculates all three valuation methods. So for multiple analysis um it takes the $900 million and instantly converts it to enterprise value range using the high and low multiples from the public markets and past deal data. This sets our comparative benchmark for the DCF scenario. This is the most crucial part. The code projects Panera's cash flow for 5 years by automating the core drives. um our assumed 10% revenue growth, the target 16.5% EBIT TDA margin and the 9% WACC. Crucially, it runs um a downside base and upside scenario by automatically adjusting the growth in WACCC parameters. So the result that you can see down here um the scripts output shown in the table here provides a triangulated consensus demonstrating the intrinsic value of the business based on its expected cash generation not just what similar companies trade for. We are operating in a competitive environment with strategic biders like Starbucks and McDonald's cir circling. Our strategy must address the competitive threat posed by their synergies. A strategic buyer can likely capture $200 million to $300 million in annual synergies through store overlap in platform consolidation. This enables them to justify a price up to 15 to 20% higher than the standalone valuation. KKR cannot win a bidding award purely on price. Our competitive advantage lies in two areas. Uh the first area is financial discipline. We will not overpay for synergies we cannot realize. Our bid will be tied to our DCF's upside case. And then the second area is management alignment. We must leverage the requested 10% management rollover. This aligns the incumbent leadership with KKR's exit goals, ensures continue continuity, and makes our deal more appealing to the board than a disruptive strategic integration. Our recommended bid is designed to be aggressive but financially disciplined. Um so recommended enterprise value is 14.5 billion to 16.5 billion. Implied LTM um is 16.1 times to 18.3 times. And our walkway price would be 17.5 billion. Our winning strategy is uh that we recommend opening the bid at 15.5 billion and immediately emphasizing the certainty of close and the management alignment through the rollover agreement. We are selling the concept of partnership and preservation of the Panera brand rather than the disruptive in integration. This entry multiple of 16.1 times is high, but we project Panera's EBITDA will grow by 75% over 5 years. This allows us to sell the company in 5 years at a normalized multiple rate of 14 to 15 times generating the required 20% plus IRRa for our fund. Perred represents a prime asset that is ready for our financial response financials sponsor to realize its full growth potential. Our recommended bid of 14.5 billion to6.5 billion is competitive discipline and structured to win by prior prioritizing management partnerships."
}